[
  {
    "postsData": [
      {
        "postId": "urn:li:activity:7292197553746460672",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292197553746460672",
        "url": "https://www.linkedin.com/in/devanshi-jha-76297720b?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADVbxnoBbMMahAZ_19IJFw2xhsP3IjdY7eM",
        "name": "Devanshi Jha\nDevanshi Jha",
        "content": "I’m happy to share that I’m starting a new position as Business Analyst at American Express!",
        "reactions": {
          "likes": "5\nVedansh Kaushik and 4 others",
          "comments": "3 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Congrats Devanshi! ",
            "userName": "Vedansh Kaushik",
            "userProfileURL": "https://www.linkedin.com/in/vedansh-kaushik-803964302",
            "dataId": "urn:li:comment:(ugcPost:7292195691693494272,7292197536495190016)"
          }
        ],
        "commentAdded": "Congratulations on the new role! Excited to see how youll drive insights at American Express. Wishing you all the best in this journey! 🎉"
      },
      {
        "postId": "urn:li:activity:7292158038352826368",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292158038352826368",
        "url": "https://www.linkedin.com/in/duke-rem-%F0%9F%90%A2-793616267?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAEFotd8BDwR_osR-3ROnxQtd2JpPvWbizfw",
        "name": "Duke Rem 🐢\nDuke Rem 🐢",
        "content": "OpenAI Introduces ChatGPT Deep Research for Detailed, Reliable Analysis\n\n OpenAI introduces a new advanced search feature in ChatGPT, designed for those who need in-depth analysis and verified sources. Aimed at professionals and demanding buyers, this technology leverages the o3 model optimized for web and data analysis. The search takes 5 to 30 minutes and provides detailed output with citations. Key Points: Innovation: ChatGPT Deep Research performs multi-step searches across the Internet to produce analytical reports. Accuracy: Uses an advanced AI model with reinforcement...\n\n\n️If you've made it this far, it seems the post caught your interest! Please consider liking, sharing, or dropping your thoughts in the comments.\n\nHere's why:\n\nIt helps spread the ideas and solutions I feature, amplifying their impact.\n\nYour feedback lets me know instantly if my content resonates with you, helping me improve and bring more of what you enjoy!\n\nBut above all...Please follow me for daily news and insights about AI\n\n Thank you!",
        "reactions": {
          "likes": "3",
          "comments": "2 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "This is fascinating, Duke. The introduction of such a feature not only elevates how we approach complex analysis but sets a new benchmark for AI's practical applications. Your ability to consistently spotlight advancements in a way that keeps humans at the center of the conversation is truly commendable.",
            "userName": "Kumar M.",
            "userProfileURL": "https://www.linkedin.com/in/kumar-m-194023300",
            "dataId": "urn:li:comment:(activity:7292158038352826368,7292178786995830786)"
          },
          {
            "commentText": "Kumar M. Thank you for your kind words; I really appreciate them!\n\nAs for the \"deep research\" feature, my only concern is OpenAI's habit of \"closing\" (pun intended) its new features—or rather, making them available only to high-paying Pro version customers ",
            "userName": "Duke Rem 🐢",
            "userProfileURL": "https://www.linkedin.com/in/duke-rem-%F0%9F%90%A2-793616267",
            "dataId": "urn:li:comment:(activity:7292158038352826368,7292196598481117184)"
          }
        ],
        "commentAdded": "Exciting advancements from OpenAI! The ChatGPT Deep Research feature promises to transform how we access and analyze information. 🔍 #AI #Innovation"
      },
      {
        "postId": "urn:li:activity:7292153952505106432",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292153952505106432",
        "url": "https://www.linkedin.com/in/varun1175?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACKnKlcBjbVuNxmqTWxj41k1DP__pQV5F-w",
        "name": "VARUN YADAV\nVARUN YADAV",
        "content": "I’m happy to share that I’ve obtained a new certification: Linux Kernel Development (LFD103) from The Linux Foundation!",
        "reactions": {
          "likes": "11\nVARUN YADAV and 10 others",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Congrats VARUN! ",
            "userName": "Ajay Rawat",
            "userProfileURL": "https://www.linkedin.com/in/ajay-rawat-5396ba57",
            "dataId": "urn:li:comment:(ugcPost:7292137803860033536,7292153135282741248)"
          }
        ],
        "commentAdded": "Congratulations on your new certification! Excited to see how youll leverage your Linux expertise in future projects. Keep shining! 🌟"
      },
      {
        "postId": "urn:li:activity:7292185348724441090",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292185348724441090",
        "url": "https://www.linkedin.com/in/walterlcrosby?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABnRy4BfAi04dsWOrVfiDq5Fz8C2uALVWA",
        "name": "Walter Crosby\nWalter Crosby",
        "content": "When they tell you to STOP spending money.\n\nIn an episode of the Sales & Cigars podcast, Dave from Spartan Digital shared something fascinating: his proudest moment is when clients ask to turn OFF their ads because they're at capacity.\n\nAfter decades in sales, this resonates hard. Because real growth isn't about:\n\n• Maxing out ad spend\n•Chasing vanity metrics\n• Empty statistics\n\nIt's about sustainable, manageable growth that your business can actually handle.\n\n When was the last time your agency suggested spending LESS?",
        "reactions": {
          "likes": "1",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/6bd1abae-c0cd-4ad7-afaf-acc4416cb425",
        "comments": [],
        "commentAdded": "Absolutely agree! True growth means knowing when to pull back and focus on quality over quantity. Sustainable success is the goal! 🌱"
      },
      {
        "postId": "urn:li:activity:7292196780794863616",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292196780794863616",
        "url": "https://www.linkedin.com/in/michael-walker-ed-d-5089a870?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAA8YztgBm8rk0lWrlsBMwk25SywnBCiZv8I",
        "name": "Michael Walker Ed.D.\nMichael Walker Ed.D.",
        "content": "️ 𝗜𝘀 𝘆𝗼𝘂𝗿 𝘁𝗲𝗮𝗺’𝘀 𝗱𝗲𝗰𝗶𝘀𝗶𝗼𝗻-𝗺𝗮𝗸𝗶𝗻𝗴 𝘀𝗶𝗹𝗼𝗲𝗱?\n️ 𝗔𝗿𝗲 𝘆𝗼𝘂 𝗰𝗮𝘂𝗴𝗵𝘁 𝗶𝗻 𝗮𝗻𝗮𝗹𝘆𝘀𝗶𝘀 𝗽𝗮𝗿𝗮𝗹𝘆𝘀𝗶𝘀, 𝗱𝗲𝗹𝗮𝘆𝗶𝗻𝗴 𝗽𝗿𝗼𝗴𝗿𝗲𝘀𝘀?\n️ 𝗗𝗼𝗲𝘀 𝘁𝗵𝗲 𝗽𝗿𝗲𝘀𝘀𝘂𝗿𝗲 𝗮𝗻𝗱 𝗽𝗮𝗰𝗲 𝗺𝗮𝗸𝗲 𝘀𝘁𝗿𝗮𝘁𝗲𝗴𝗶𝗰 𝗱𝗲𝗰𝗶𝘀𝗶𝗼𝗻𝘀 𝗼𝘃𝗲𝗿𝗹𝘆 𝘀𝘁𝗿𝗲𝘀𝘀𝗳𝘂𝗹?\n\n Life teaches us how to make decisions as individuals—but 𝗹𝗲𝗮𝗱𝗶𝗻𝗴 𝗱𝗲𝗰𝗶𝘀𝗶𝗼𝗻-𝗺𝗮𝗸𝗶𝗻𝗴 𝗶𝗻 𝗮 𝘁𝗲𝗮𝗺 𝗿𝗲𝗾𝘂𝗶𝗿𝗲𝘀 𝗮 𝗱𝗶𝗳𝗳𝗲𝗿𝗲𝗻𝘁 𝘀𝗸𝗶𝗹𝗹 𝘀𝗲𝘁. Both can be developed.\n\n𝗗𝗲𝗰𝗶𝘀𝗶𝗼𝗻-𝗺𝗮𝗸𝗶𝗻𝗴 𝗶𝘀 𝗮 𝘀𝗸𝗶𝗹𝗹. And like any skill, it can be refined, optimized, and improved.\n\nAnd it can enhance 𝗲𝘃𝗲𝗿𝘆 𝗲𝗹𝗲𝗺𝗲𝗻𝘁 𝗼𝗳 𝘆𝗼𝘂𝗿 𝗹𝗲𝗮𝗱𝗲𝗿𝘀𝗵𝗶𝗽 𝗮𝗻𝗱 𝗼𝗿𝗴𝗮𝗻𝗶𝘇𝗮𝘁𝗶𝗼𝗻.\n\nIn high-stakes environments, 𝗹𝗲𝗮𝗱𝗲𝗿𝘀 𝗿𝗲𝗹𝘆 𝗼𝗻 𝗽𝗿𝗼𝘃𝗲𝗻 𝗳𝗿𝗮𝗺𝗲𝘄𝗼𝗿𝗸𝘀 𝘁𝗼:\n\n 𝗠𝗮𝗸𝗲 𝗵𝗶𝗴𝗵-𝗶𝗺𝗽𝗮𝗰𝘁 𝗱𝗲𝗰𝗶𝘀𝗶𝗼𝗻𝘀 𝘄𝗶𝘁𝗵 𝗰𝗼𝗻𝗳𝗶𝗱𝗲𝗻𝗰𝗲\n 𝗔𝗹𝗶𝗴𝗻 𝘁𝗲𝗮𝗺𝘀 𝗳𝗼𝗿 𝗳𝗮𝘀𝘁𝗲𝗿, 𝗺𝗼𝗿𝗲 𝗽𝗿𝗲𝗰𝗶𝘀𝗲 𝗲𝘅𝗲𝗰𝘂𝘁𝗶𝗼𝗻\n 𝗥𝗲𝗱𝘂𝗰𝗲 𝘀𝘁𝗿𝗲𝘀𝘀 𝗮𝗻𝗱 𝘀𝗲𝗰𝗼𝗻𝗱-𝗴𝘂𝗲𝘀𝘀𝗶𝗻𝗴\n\nThat’s exactly what we’ll cover in my LIVE virtual workshop on Feb. 19th at 1:00 pm ET.\n\n\"𝗙𝗿𝗼𝗺 𝗦𝘁𝗿𝗲𝘀𝘀 𝘁𝗼 𝗦𝘁𝗿𝗮𝘁𝗲𝗴𝘆: 𝗗𝗲𝗰𝗶𝘀𝗶𝗼𝗻-𝗠𝗮𝗸𝗶𝗻𝗴 𝗳𝗼𝗿 𝗧𝗿𝗮𝗻𝘀𝗳𝗼𝗿𝗺𝗮𝘁𝗶𝗼𝗻𝗮𝗹 𝗟𝗲𝗮𝗱𝗲𝗿𝘀𝗵𝗶𝗽\"\n\n𝗬𝗼𝘂’𝗹𝗹 𝘄𝗮𝗹𝗸 𝗮𝘄𝗮𝘆 𝘄𝗶𝘁𝗵:\n A clear understanding of your decision-making tendencies\n Tools to align your team and eliminate silos\n Custom decision-making frameworks tailored to your challenges and culture.\n\n 𝗜𝗳 𝘆𝗼𝘂 𝘄𝗮𝗻𝘁 𝘁𝗼 𝗺𝗮𝗸𝗲 𝗯𝗲𝘁𝘁𝗲𝗿, 𝗳𝗮𝘀𝘁𝗲𝗿, 𝗮𝗻𝗱 𝗺𝗼𝗿𝗲 𝘀𝘁𝗿𝗮𝘁𝗲𝗴𝗶𝗰 𝗱𝗲𝗰𝗶𝘀𝗶𝗼𝗻𝘀, 𝗿𝗲𝗴𝗶𝘀𝘁𝗲𝗿 𝗻𝗼𝘄:",
        "reactions": {
          "likes": "2",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Looks like an amazing webinar!",
            "userName": "Ken Yuzik, MBA",
            "userProfileURL": "https://www.linkedin.com/in/kenyuzik",
            "dataId": "urn:li:comment:(activity:7292196780794863616,7292199154942902273)"
          }
        ],
        "commentAdded": "Great insights! Excited for your workshop—looking forward to learning how to enhance team decision-making and reduce stress!"
      },
      {
        "postId": "urn:li:activity:7292134807281577984",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292134807281577984",
        "url": "https://www.linkedin.com/in/anilkaul001?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAHFqsB0MXiKByDPQ_CTtI17Jtka5PWX7Q",
        "name": "Anil Kaul\nAnil Kaul",
        "content": "There is an ongoing debate in the Real Estate Industry whether home sellers should provide information about how many days a home has been on market - Days on Market (DOM). There is a pretty big group of brokerages and agents that would like to hide this information. Thanksfor speaking boldly about this topic.\nHere is my andperspective on this important issue.\n\nThis is a perfect example of why home buyers often feel like they’re navigating a system that isn’t designed for them. Transparency, trust, and fair dealing are buzzwords in every real estate industry conference but too often, actions tell a different story.\nAs a home buyer, Days on Market matters. It provides critical insights into a property’s demand and market perception. If a home has been on the market longer than average, it doesn’t automatically mean there’s a problem but it does mean I should do my due diligence. Is it priced too high? Does it have condition issues? Or is it simply a hidden gem that others have overlooked? This is exactly the type of information that empowers buyers to make informed decisions.\nI believe buyers deserve full transparency—not just selectively disclosed facts that serve the seller’s interests. DOM isn’t just a number; it’s part of the bigger picture that helps buyers make the right offer at the right price. Trying to manipulate or obscure this information erodes trust and ultimately hurts the integrity of the market.\nIf the industry truly wants to evolve, we need to stop protecting outdated practices and start empowering buyers with the information they need.",
        "reactions": {
          "likes": "5",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Transparency in real estate transactions is crucial for building trust and empowering buyers.",
            "userName": "Steven Feinberg, PhD",
            "userProfileURL": "https://www.linkedin.com/in/stevenfeinbergphd",
            "dataId": "urn:li:comment:(activity:7292134807281577984,7292157409945432066)"
          }
        ],
        "commentAdded": "Well said! Transparency is key for empowering buyers and building trust. Lets prioritize informed decision-making in real estate! 🏡🔑"
      },
      {
        "postId": "urn:li:activity:7292165128383299584",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292165128383299584",
        "url": "https://www.linkedin.com/in/anthonywentzel?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADZN2sBr5ZUAlKZK2QwVQvOE9B6pnFHXt8",
        "name": "Anthony Wentzel\nAnthony Wentzel",
        "content": "It costs $0.00 to lead with empathy.",
        "reactions": {
          "likes": "0",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Absolutely agree! Leading with empathy not only fosters trust but also drives collaboration and innovation within teams. #EmpathyInLeadership"
      },
      {
        "postId": "urn:li:activity:7292180872093462530",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292180872093462530",
        "url": "https://www.linkedin.com/in/shellabaludo?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAD0X0bEBbnw2YuMyiRC2KcJ0WXe9XCThlZE",
        "name": "Marie Y.\nMarie Y.",
        "content": "The Benefits of Traveling Abroad: Why You Should Step Outside Your Comfort Zone\n\n\nIn today’s fast-paced, interconnected world, it's easy to fall into the rhythm of daily life and overlook the transformative power of travel. But venturing abroad, even just once in a while, can offer incredible benefits—not just for your personal growth, but also for your career. Here’s why:\n\n1. Broaden Your Perspective\nTravel exposes you to different cultures, languages, and ways of thinking. By stepping into new environments, you develop a broader, more inclusive view of the world—something that can foster creativity and innovation in your professional life.\n\n2. Enhance Problem-Solving Skills\nWhen you’re navigating foreign cities, whether it’s figuring out transportation, overcoming language barriers, or adapting to unfamiliar customs, you sharpen your ability to think on your feet. These enhanced problem-solving skills are invaluable in the workplace.\n\n3. Strengthen Emotional Intelligence\nTravel requires empathy and patience, as you learn to understand and respect diverse perspectives. This emotional intelligence can boost your ability to collaborate and connect with colleagues from different backgrounds.\n\n4. Recharge and Prevent Burnout\nConstant work can leave you mentally exhausted, but a change of scenery—especially in a new country—can provide the mental reset you need. It’s not just about sightseeing; it’s about rejuvenating yourself, so you return to work with a fresh outlook and renewed energy.\n\n5. Expand Your Professional Network\nTravel allows you to meet people from around the world, creating potential for new business opportunities or collaborations. These global connections can open doors you never expected.\n\nIn the end, travel isn’t just about seeing new places; it’s about seeing the world in a new way. So, the next time the opportunity arises, don’t hesitate to step outside your comfort zone. The experiences and growth you gain will be worth it. ️",
        "reactions": {
          "likes": "214\nChahat Raj Kapoor and 213 others",
          "comments": "54 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Meeting people from all over the world adds so much value to life and work.",
            "userName": "Chahat Raj Kapoor",
            "userProfileURL": "https://www.linkedin.com/in/chahat-raj-kapoor",
            "dataId": "urn:li:comment:(activity:7292122667636146178,7292176863374770176)"
          }
        ],
        "commentAdded": "Absolutely! Traveling not only enriches our personal lives but also fuels professional growth. Its a powerful way to broaden our horizons! 🌍✈️"
      },
      {
        "postId": "urn:li:activity:7292149871673765889",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292149871673765889",
        "url": "https://www.linkedin.com/in/blessing-ikpia-54b790244?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADygsAsBE3EnPxCYA_zzPihIYwYLIfwhOQg",
        "name": "Blessing Ikpia\nBlessing Ikpia",
        "content": "Have you ever wondered ...What’s next?\n\nThat’s the question so many professionals, executives and students ask themselves at some point.\n\nYou’ve worked hard, built a career (or you’re just starting out), but now you’re looking for clarity, direction and real strategies to navigate life, work, and business challenges.\n\nThat’s exactly why The Protisis Bootcamp was created. A 3-day power-packed experience designed to help you:\n\n Balance life and work without constantly feeling overwhelmed\n Build a brand that lasts—beyond LinkedIn buzzwords\n Face business storms with resilience instead of panic\n Understand investment strategies that actually grow your wealth\n Master professional networking (because just collecting contacts isn’t enough)\n\nWhy should you be there?\n\nThis is not your typical \"aspire to inspire\" bootcamp. It's practical, real, and result-driven, featuring:\n\n A business resilience expert who’s navigated life’s toughest storms\n\n A marketing strategist who just pushed for a $200,000 grant\n\n A mentor who has studied the best minds in business (think Vusi Thembakwayo)\n\n A Wall Street investment banker who knows exactly how to make money work for you\n\nPlus, you get a virtual meet-and-greet with top professionals from around the world. Remember, the right connections can change everything.\n\nIf you’re serious about leveling up in 2025, this bootcamp is your chance. 3 days. Maximum impact.\n\nComing this March.\n\nAre you in?\n\nThe waitlist will be in comment\n\nFollowfor more \n\nPS - My birthday is in a few days , y'all should get readyyyyy",
        "reactions": {
          "likes": "14\nBlessing Ikpia and 13 others",
          "comments": "10 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "The mix of expert insights and practical advice will make it really valuable for professionals at any stage. ",
            "userName": "Ahmad Wahidi",
            "userProfileURL": "https://www.linkedin.com/in/ahmad-wahidi-nj-realtor",
            "dataId": "urn:li:comment:(ugcPost:7292142877915176961,7292154350720700418)"
          }
        ],
        "commentAdded": "Excited for the Protisis Bootcamp! 🟢 This is a fantastic opportunity to gain insights and connect with industry leaders. Count me in!"
      },
      {
        "postId": "urn:li:activity:7292185682465210368",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292185682465210368",
        "url": "https://www.linkedin.com/groups/3990648?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A3990648-7292168128271114242",
        "name": "Artificial Intelligence, Machine Learning, Data Science & Robotics\nArtificial Intelligence, Machine Learning, Data Science & Robotics",
        "content": "Comparing the All-New AI Models: ChatGPT vs Qwen vs DeepSeek\n\n1. Overview of Each Model\nChatGPT-03 Mini is a lightweight GPT-4-based AI designed for general-purpose tasks. Qwen 2.5 Max excels in multilingual AI applications with enterprise support. DeepSeek V3 focuses on technical reasoning, coding, and AI-powered research.\n\n2. Key Features\nChatGPT-03 Mini is optimized for fast responses and API integration. Qwen 2.5 Max provides strong NLP capabilities and cloud integration. DeepSeek V3 excels in logical reasoning and retrieval-augmented research.\n\n3. Performance Comparison\nChatGPT delivers high conversational accuracy with real-time responses. Qwen balances accuracy with multilingual capabilities. DeepSeek is optimized for technical reasoning and problem-solving.\n\n4. Use Case Examples\nChatGPT automates customer interactions and generates marketing content. Qwen enhances business AI and multilingual chatbots. DeepSeek supports coding, debugging, and research-based AI tasks.\n\n5. Choosing the Right Model\nChatGPT is ideal for content creation and chatbots. Qwen suits businesses needing multilingual AI. DeepSeek is best for developers and researchers tackling complex problem-solving.\n\n[Explore more in the post]",
        "reactions": {
          "likes": "177",
          "comments": "4 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Are they better than their paid model if you have tested please tell me",
            "userName": "Vishwa Phansal",
            "userProfileURL": "https://www.linkedin.com/in/vishwaphansal",
            "dataId": "urn:li:comment:(groupPost:3990648-7292168128271114242,7292199054317342721)"
          },
          {
            "commentText": "Very helpful",
            "userName": "António Martins de Oliveira",
            "userProfileURL": "https://www.linkedin.com/in/martinsdeoliveira",
            "dataId": "urn:li:comment:(groupPost:3990648-7292168128271114242,7292194013779050498)"
          }
        ],
        "commentAdded": "Great insights on AI models! Its fascinating to see how each one excels in its niche. Excited to see future developments in this space!"
      }
    ],
    "errors": [
      {
        "postId": "urn:li:activity:7292197553746460672",
        "url": "https://www.linkedin.com/in/devanshi-jha-76297720b?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADVbxnoBbMMahAZ_19IJFw2xhsP3IjdY7eM",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292158038352826368",
        "url": "https://www.linkedin.com/in/duke-rem-%F0%9F%90%A2-793616267?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAEFotd8BDwR_osR-3ROnxQtd2JpPvWbizfw",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292153952505106432",
        "url": "https://www.linkedin.com/in/varun1175?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACKnKlcBjbVuNxmqTWxj41k1DP__pQV5F-w",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292196780794863616",
        "url": "https://www.linkedin.com/in/michael-walker-ed-d-5089a870?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAA8YztgBm8rk0lWrlsBMwk25SywnBCiZv8I",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292134807281577984",
        "url": "https://www.linkedin.com/in/anilkaul001?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAHFqsB0MXiKByDPQ_CTtI17Jtka5PWX7Q",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292165128383299584",
        "url": "https://www.linkedin.com/in/anthonywentzel?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADZN2sBr5ZUAlKZK2QwVQvOE9B6pnFHXt8",
        "errors": [
          "Failed to fetch reactions.",
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292180872093462530",
        "url": "https://www.linkedin.com/in/shellabaludo?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAD0X0bEBbnw2YuMyiRC2KcJ0WXe9XCThlZE",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292149871673765889",
        "url": "https://www.linkedin.com/in/blessing-ikpia-54b790244?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADygsAsBE3EnPxCYA_zzPihIYwYLIfwhOQg",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292185682465210368",
        "url": "https://www.linkedin.com/groups/3990648?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A3990648-7292168128271114242",
        "errors": [
          "Failed to fetch media URL."
        ]
      }
    ]
  },
  {
    "postsData": [
      {
        "postId": "urn:li:activity:7291920444025163776",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7291920444025163776",
        "url": "https://www.linkedin.com/in/houseofbricks?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAA-MkMBNOorFGtIDG0boxkwxMypXZhfUgk",
        "name": "Michael Kainatsky\nMichael Kainatsky",
        "content": "Finally, I fixed the most annoying LinkedIn problem!\n\n\nToday is my birthday, and thankfully, I didn't wake up to 500 \"Happy Birthday\" messages in my inbox.\n\nYou'd think maybe most people would be delighted to get them?\n\nAbsolutely not!\n\nThis feature, which allows absolute strangers that\n\n-> ignored all your DMs the last year\n-> never engaged with any of your content\n-> have never spoken with you\n-> will never speak with you, until next year\n\nTo click a single button without any intent and fill your inbox with\nan obligation to respond.\n\nFor 19 years, I spent hours throughout this day just typing \"thank you\nI appreciate it.\"\n\nIt was maddening and only got worse, especially as my network grew larger.\n\nSo this year, I fixed the glitch!\n\nI removed my birthday information from my profile.\n\nWhat an incredible feeling to wake up to no DMs from strangers.\n\nI strongly recommend you do this immediately before it's too late!\n\nAnd I am sorry to report, we will have 6 more weeks of winter.\n\nYours truthfully,",
        "reactions": {
          "likes": "66\nTim Hillison and 65 others",
          "comments": "103 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/b3a5c80c-1001-45c7-81b3-2735f6b808c1",
        "comments": [
          {
            "commentText": "how delightful, bed bath and beyond wished me a happy birthday with a 15% coupon that I Literally get in the mail every week. ",
            "userName": "Michael Kainatsky",
            "userProfileURL": "https://www.linkedin.com/in/houseofbricks",
            "dataId": "urn:li:comment:(ugcPost:7291822671980363776,7291826965748015104)"
          },
          {
            "commentText": "Michael Kainatsky   ",
            "userName": "Patty Kuzmich",
            "userProfileURL": "https://www.linkedin.com/in/pattykuzmich",
            "dataId": "urn:li:comment:(ugcPost:7291822671980363776,7291827611553460224)"
          },
          {
            "commentText": "HB, Michael Kainatsky! Yes! I never added it just for that!",
            "userName": "Tim Hillison",
            "userProfileURL": "https://www.linkedin.com/in/timhillison",
            "dataId": "urn:li:comment:(ugcPost:7291822671980363776,7292026880973488129)"
          }
        ],
        "commentAdded": "Happy Birthday! 🎉 Great move on removing your birthday info—less clutter and more meaningful connections. Cheers to a stress-free day!"
      },
      {
        "postId": "urn:li:activity:7292202694285422592",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292202694285422592",
        "url": "https://www.linkedin.com/in/isarmeitis?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAMB50B_3NCLMZCvxrShlDeX2sL4TyWZBs",
        "name": "Isar Meitis\nIsar Meitis",
        "content": "Stay ahead in the world of AI!\nLast week brought major developments you can’t afford to miss.\n\nFrom DeepSeek disrupting the open-source landscape to Alibaba’s Qwen 2.5 unveiling advanced multimodal features, plus Microsoft CoPilot expansions and Google Sheets AI integrations—there’s a lot to explore.\n\nHighlights include:\n• DeepSeek offering cost-effective performance comparable to top-tier US models\n• Alibaba’s Qwen 2.5 merging text, image, and video capabilities in a single framework\n• and more!\n\nThis is just a glimpse of what’s inside this week’s AI News Recap.\n\nWant more in-depth coverage? Subscribe to my Newsletter.\n\nLet’s shape an informed, connected AI community together.",
        "reactions": {
          "likes": "1",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Isar Meitis, the rapid advancements in AI this week are truly fascinating. Merging multimodal capabilities will likely reshape the way we innovate. Exciting times ahead for AI enthusiasts.  \n#AIInnovation",
            "userName": "Keenfunnel",
            "userProfileURL": "https://www.linkedin.com/company/keen-funnel/posts",
            "dataId": "urn:li:comment:(ugcPost:7292198194195628033,7292204294139793408)"
          }
        ],
        "commentAdded": "Exciting developments in AI! The integration of multimodal features will truly reshape how we interact with technology. Looking forward to the full recap!"
      },
      {
        "postId": "urn:li:activity:7292178931778994176",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292178931778994176",
        "url": "https://www.linkedin.com/in/megha-chaudhary-0961561b1?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADFSWfIBsa2gZytKS4MP-diNDU4pE410cm8",
        "name": "Megha Chaudhary\nMegha Chaudhary",
        "content": "️",
        "reactions": {
          "likes": "6",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "You're an amazing team lead",
            "userName": "Sayanti Chaudhury",
            "userProfileURL": "https://www.linkedin.com/in/sayanti-chaudhury-418701200",
            "dataId": "urn:li:comment:(ugcPost:7292178931309260800,7292185399660056578)"
          }
        ],
        "commentAdded": "Absolutely inspired by this insight! Its a great reminder of the power of collaboration in driving success. Thank you for sharing!"
      },
      {
        "postId": "urn:li:activity:7292192361659420672",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292192361659420672",
        "url": "https://www.linkedin.com/in/rokify?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABxZHjQBwoL1hLv1_W5bo9o1aNiKtx1yAFY",
        "name": "Roki Hasan\nRoki Hasan",
        "content": "Most entrepreneurs work 60+ hours a week.\n\nBut the most successful don’t just work more. They work smarter.\n\nIf you build your lead generation system now, you’ll start seeing results faster, and create a machine that works even when you don’t.\n\nHere’s how to start:\n\n1. Write one high-impact email sequence this week. Personalized emails can hit 50% open rates when done right (HubSpot).\n\n2. Spend 1 hour daily connecting with decision-makers. It’s not just a platform, it’s where business happens.\n\n3. Block 2 hours weekly to measure results and refine your strategy. Small tweaks now save hours later.\n\n The average B2B sales cycle takes 4-6 months. Every lead you nurture today is a potential client tomorrow. The sooner you start, the sooner you scale.\n\nWant to work smarter, not just harder? Take action now and build momentum.",
        "reactions": {
          "likes": "38\nChahat Raj Kapoor and 37 others",
          "comments": "28 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "How do you handle prospects who respond negatively to multiple follow-ups? We’re working on refining our tone.",
            "userName": "Chahat Raj Kapoor",
            "userProfileURL": "https://www.linkedin.com/in/chahat-raj-kapoor",
            "dataId": "urn:li:comment:(activity:7292174026058141696,7292186417999282176)"
          },
          {
            "commentText": "The long hours are worth it when you’re building something meaningful.",
            "userName": "Christopher Horner",
            "userProfileURL": "https://www.linkedin.com/in/clh",
            "dataId": "urn:li:comment:(activity:7292174026058141696,7292205303205371904)"
          }
        ],
        "commentAdded": "Great insights! Prioritizing smart strategies over sheer hours is key. Excited to implement these tips for better lead generation! 🚀"
      },
      {
        "postId": "urn:li:activity:7292193643220606976",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292193643220606976",
        "url": "https://www.linkedin.com/in/dionnemejer?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABls9oB5ZrrM_h3dIB2xNuQ-dqu4dnd6XE",
        "name": "Dionne Mejer\nDionne Mejer",
        "content": "As we enter month two of 2025, congratulations to everyone who has kept their resolutions! If one of your resolutions, was to help your team increase their effectiveness and success rate, this article is for you. Read on to learn how to harness the power of mindset to create the optimal environment for your team and you.\n\nHere's what we cover:\n Transform your sales approach by implementing the Sales with Soul™ methodology to align revenue goals with authentic leadership.\n️ Build a competitive mindset through structured practice and data-driven decision making to accelerate your team's performance.\n️‍ Develop your sales leadership strategy by focusing on emotional intelligence and customer-centric selling approaches.\n Create sustainable revenue growth by optimizing your sales processes and leveraging advanced technologies.",
        "reactions": {
          "likes": "3",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Success starts with the right mindset! Aligning leadership, strategy, and data-driven decisions leads to sustainable growth.",
            "userName": "Deepak Bhootra",
            "userProfileURL": "https://www.linkedin.com/in/deepakbhootra",
            "dataId": "urn:li:comment:(ugcPost:7292193642830610432,7292196863284285441)"
          }
        ],
        "commentAdded": "Great insights! Emphasizing mindset and emotional intelligence can truly transform team dynamics and drive success. Looking forward to applying these strategies!"
      },
      {
        "postId": "urn:li:activity:7292153390438969344",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292153390438969344",
        "url": "https://www.linkedin.com/in/karishmamehtahob?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAClP7goBgnu4OFr_qJR1AgV4OVUW98FRvzk",
        "name": "Karishma Mehta\nKarishma Mehta",
        "content": "Every time I sit down with someone who’s mastered their craft, I walk away with something that changes the way I look at life. And lately, I’ve been thinking a lot about how we take care of ourselves—what we eat, how we treat our skin, the way we shape our mindset. ️‍\n\nWhen I spoke to, he broke down the foods we think are healthy but actually aren’t. It made me question how we sometimes blindly trust labels instead of really understanding what goes into our bodies. \n\nMy conversation withmade me realise that skincare can actually be so simple. Just 5 minutes of facial massage a day — no fancy treatments, no 10-step routines—just a little consistency. \n\nAnd with, we went deep into manifestation. The power of your thoughts, the words you use, the way you believe in the life you want—it all adds up. She made me realize that the way we think shapes the world we live in. \n\nAt the end of the day, we all just want to feel good—in our bodies, our skin, and our minds. And the best part? We already have everything we need to make that happen.\n\nWhat’s one thing you’ve changed about your self-care routine recently? Let me know—I’m always looking to learn. ",
        "reactions": {
          "likes": "1,341",
          "comments": "64 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "I love this! Self-care really starts with small, consistent changes. I've started journaling every morning, it’s been transformative. Karishma Mehta let's connect. Looking forward to connect with you soon ",
            "userName": "New Trend Computer Networks L.L.C",
            "userProfileURL": "https://www.linkedin.com/company/newtrendcomputerllc/posts",
            "dataId": "urn:li:comment:(ugcPost:7292142335256072195,7292191775069261825)"
          },
          {
            "commentText": "The way we take care of ourselves—physically, mentally, and emotionally—shapes every part of our lives. ",
            "userName": "Mallika Rao",
            "userProfileURL": "https://www.linkedin.com/in/coachmallikarao",
            "dataId": "urn:li:comment:(ugcPost:7292142335256072195,7292204535769444352)"
          }
        ],
        "commentAdded": "Love this perspective! It’s amazing how small shifts in mindset and routine can lead to profound changes. I recently started journaling—its been transformative!"
      },
      {
        "postId": "urn:li:activity:7292160853510934528",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292160853510934528",
        "url": "https://www.linkedin.com/in/milda-skladaityte-bayer?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABOpsEIBJ9lG4huTKpQ4hQAD2i_cfdbCoZs",
        "name": "Milda Bayer\nMilda Bayer",
        "content": "The most important thing when leading an organization is ⬇️\n\nKNOWING YOUR END STATE. \n\n\n\nScaling fast, Profitability, M&A, IPO - you name it.\n\nThen - reverse engineer it by asking yourself/your leaders - what steps do I/we need to take to get there.\n\nThat’s strategy. And then remember - Operational excellence = operational intensity. Be up front with your teams about anticipated pains and gains that they’ll “grow through” while on the journey.",
        "reactions": {
          "likes": "10\nKoen Stam and 9 others",
          "comments": "7 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Inspired by Koen Stam phrase: “Failure forced clarity” - https://www.linkedin.com/posts/koenstam87_10-years-ago-i-built-a-startup-for-all-the-activity-7291379771072995329-r3B5?utm_source=share&utm_medium=member_ios\n\nAs a founder/leader you need to be open and learn from failures to hone down and understand you end state to the core.",
            "userName": "Milda Bayer",
            "userProfileURL": "https://www.linkedin.com/in/milda-skladaityte-bayer",
            "dataId": "urn:li:comment:(activity:7292158437465939968,7292159238976487424)"
          }
        ],
        "commentAdded": "Great insights! Reverse engineering the end state truly clarifies the path forward. Transparency with teams is key for navigating the journey!"
      },
      {
        "postId": "urn:li:activity:7292202361144446976",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292202361144446976",
        "url": "https://www.linkedin.com/in/chitraleleauthorandsoftwareengineer?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABhV46UB90KIUieSyWYJaPm3_V4weHUJG4M",
        "name": "Chitra Lele—Spirit-Tech Synergist\nChitra Lele—Spirit-Tech Synergist",
        "content": "Fresher: which one is better\nFrontend or Backend?\nLet's become a full-stack developer!\n\nHere are my paw-some hashtag\nto become one :\n\nScratch up HTML, sleek and neat,\nAnd add CSS to make it complete.\n\nWith JavaScript, paws spark the show\nAnd then Interactive purr-fection, watch it glow!\n\nProwl the back-end with a stealthy paw.\nPython or Node—do give them a try.\n\nFetch the data as quick as a cat,\nFrom SQL rows or NoSQL’s chat.\n\nFrameworks like React are a purr-fect delight,\nVue or Express—act as a coder’s might.\n\nRule the stack, sleek and bold,\nPurring through code, watch it unfold!\n\n",
        "reactions": {
          "likes": "3\nChitra Lele—Spirit-Tech Synergist and 2 others",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/8c99f5e6-8397-466f-93bf-bb7754f3da8e",
        "comments": [],
        "commentAdded": "Love the creative approach! Becoming a full-stack developer opens up so many possibilities. Let’s code our way to success! 🐾💻 #FullStackDev"
      },
      {
        "postId": "urn:li:activity:7292173096256471040",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292173096256471040",
        "url": "https://www.linkedin.com/in/duke-rem-%F0%9F%90%A2-793616267?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAEFotd8BDwR_osR-3ROnxQtd2JpPvWbizfw",
        "name": "Duke Rem 🐢\nDuke Rem 🐢",
        "content": "AMD Instinct MI400: New Details on Architecture and Multi-Chiplet Design\n\n AMD is preparing the launch of Instinct MI400 accelerators, which will mark a significant evolution in design with an innovative architecture based on multiple chiplets and separate active interposers. The new solutions will aim for superior performance in AI, with improved efficiency and optimized communication between processing units. Key points: Advanced architecture: The Instinct MI400 will adopt CDNA Next, with possible developments toward the UDNA designation. Innovative design: There will...\n\n\n️If you've made it this far, it seems the post caught your interest! Please consider liking, sharing, or dropping your thoughts in the comments.\n\nHere's why:\n\nIt helps spread the ideas and solutions I feature, amplifying their impact.\n\nYour feedback lets me know instantly if my content resonates with you, helping me improve and bring more of what you enjoy!\n\nBut above all...Please follow me for daily news and insights about AI\n\n Thank you!",
        "reactions": {
          "likes": "3",
          "comments": "2 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Thank you Duke Rem , it's wonderful that you mention AMD's new accelerator line, it's exciting to learn about their new hardware.\n\nI look forward to excellent future support on TensorFlow with AMD's RoCM framework support via Linux Clang/LLVM.\n\nI would like to see a similar level of excellence fromby way of nvcc and CUDA support on Linux, specifically Fedora Linux and Debian unstable.",
            "userName": "Simon Au-Yong",
            "userProfileURL": "https://www.linkedin.com/in/simonay",
            "dataId": "urn:li:comment:(activity:7292173096256471040,7292178814623789057)"
          },
          {
            "commentText": "Simon Au-Yong Thank you for your insightful comment. We definitely need more players in computational AI.\n\nAMD has excellent products and technology. I've always hoped they could make a comeback and become relevant again.\n\nThe most important factor is support. Nvidia, with CUDA, has a significant advantage in that regard.",
            "userName": "Duke Rem 🐢",
            "userProfileURL": "https://www.linkedin.com/in/duke-rem-%F0%9F%90%A2-793616267",
            "dataId": "urn:li:comment:(activity:7292173096256471040,7292195534310666240)"
          }
        ],
        "commentAdded": "Exciting advancements ahead with the MI400! The multi-chiplet design is a game changer for AI performance and efficiency. Looking forward to the launch!"
      },
      {
        "postId": "urn:li:activity:7291843586138980353",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7291843586138980353",
        "url": "https://www.linkedin.com/in/jepsontaylor?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAT1knkBKurLdx7ocCJOtEwdp07TIBzisxg",
        "name": "🦾Jepson Taylor\n🦾Jepson Taylor",
        "content": "Most companies are not thinking correctly about the future pace of innovation. If you can't build a new prototype app in a day you are behind. For anyone who's built software they know this feels impossible. You need to demand the impossible to be successful in this new world.\n\nIf you don't have an engineer on your payroll that you can't say is quickly becoming an 'expert' on LLMs and agent systems for accelerated deployment you're going to become a spectator in this new race.",
        "reactions": {
          "likes": "55",
          "comments": "11 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Building a prototype in a day sounds great—until you realize most software isn't just a prototype. The real challenge isn’t speed; it’s making something worth keeping. I’ve seen teams rush to deploy AI systems only to spend months untangling the mess later.\n\nSo maybe the question isn’t how fast, but how sustainable? How do we balance rapid iteration with long-term maintainability?",
            "userName": "Diogo Santos",
            "userProfileURL": "https://www.linkedin.com/in/diogo-santos-genious",
            "dataId": "urn:li:comment:(activity:7291843586138980353,7291928216389222401)"
          }
        ],
        "commentAdded": "Great insights! Embracing rapid innovation is essential. Investing in talent that excels in LLMs can truly set companies apart in this fast-paced era."
      }
    ],
    "errors": [
      {
        "postId": "urn:li:activity:7292202694285422592",
        "url": "https://www.linkedin.com/in/isarmeitis?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAMB50B_3NCLMZCvxrShlDeX2sL4TyWZBs",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292178931778994176",
        "url": "https://www.linkedin.com/in/megha-chaudhary-0961561b1?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADFSWfIBsa2gZytKS4MP-diNDU4pE410cm8",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292192361659420672",
        "url": "https://www.linkedin.com/in/rokify?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABxZHjQBwoL1hLv1_W5bo9o1aNiKtx1yAFY",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292193643220606976",
        "url": "https://www.linkedin.com/in/dionnemejer?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABls9oB5ZrrM_h3dIB2xNuQ-dqu4dnd6XE",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292153390438969344",
        "url": "https://www.linkedin.com/in/karishmamehtahob?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAClP7goBgnu4OFr_qJR1AgV4OVUW98FRvzk",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292160853510934528",
        "url": "https://www.linkedin.com/in/milda-skladaityte-bayer?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABOpsEIBJ9lG4huTKpQ4hQAD2i_cfdbCoZs",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292173096256471040",
        "url": "https://www.linkedin.com/in/duke-rem-%F0%9F%90%A2-793616267?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAEFotd8BDwR_osR-3ROnxQtd2JpPvWbizfw",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7291843586138980353",
        "url": "https://www.linkedin.com/in/jepsontaylor?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAT1knkBKurLdx7ocCJOtEwdp07TIBzisxg",
        "errors": [
          "Failed to fetch media URL."
        ]
      }
    ]
  },
  {
    "postsData": [
      {
        "postId": "urn:li:activity:7292130597659901955",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292130597659901955",
        "url": "https://www.linkedin.com/in/charlielefever?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAB_8o1wBIXv63HXi_LWYmE_6Tq9M2G3AU3Q",
        "name": "Charlie Lefever\nCharlie Lefever",
        "content": "Thinking AI is ChatGPT is like saying the internet is just Google.\n\nMost people hear \"AI\" and think ChatGPT. They use it to draft emails, write reports, and call it a day.\n\nBut here’s what they don’t realise:\n\n⤷ ChatGPT is just the beginning.\n⤷ The AI world is much bigger than one chatbot.\n⤷ There are models designed for specific tasks that outperform ChatGPT by miles.\n\nIf you're only using ChatGPT, you're missing out on AI built for real-world impact.\n\nHere are five AI models worth your attention that aren't ChatGPT.\n\n DeepSeek-R1 – 90% cheaper, perfect for code and reasoning\n Gemini 1.5 Ultra – Google’s data-analysis powerhouse\n Claude 3.5 Sonnet – Reads entire books in one go\n Qwen 2.5 – AI built for finance, healthcare, and industry professionals\n Grok AI – X platform’s assistant combining real-time social data with dual-mode responses for research, content creation, and trend tracking\n\nAI isn’t about picking one model and sticking to it. It’s about using the right tool for the right job.\n\nWhich AI model is making the biggest difference for you? Let me know below!",
        "reactions": {
          "likes": "15\nNerea Arregui Exposito and 14 others",
          "comments": "5 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "This is a class hook",
            "userName": "Matthew Cohn",
            "userProfileURL": "https://www.linkedin.com/in/matthew-cohn-4495a0196",
            "dataId": "urn:li:comment:(ugcPost:7292125390288961536,7292146883160928256)"
          }
        ],
        "commentAdded": "Great insight! Its crucial to explore diverse AI tools for tailored solutions. Excited to see which models resonate with others!"
      },
      {
        "postId": "urn:li:activity:7292195490056523776",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292195490056523776",
        "url": "https://www.linkedin.com/in/angelagillnelms?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAkdZI0BRIXsVQk88XGJqfr-PLk6wp0ZhLo",
        "name": "Angela Gill Nelms\nAngela Gill Nelms",
        "content": "Embracing the Work Before Success:\n\nVidal Sassoon reminds us of a fundamental truth: success doesn't magically appear without putting in the work. It's through dedication, effort, and perseverance that we pave the path to achievement.\n\nLet's celebrate the value of hard work and the journey of growth it entails. Share your experiences of the sweat and toil that led to success or offer words of encouragement to those in the midst of their own labor. Together, we can inspire a mindset of determination and remind each other that every step forward is a step towards fulfilling our dreams.\n\nHere's to the beauty of the work before success, and the satisfaction it brings.",
        "reactions": {
          "likes": "2",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Find joy in the journey!",
            "userName": "Brad Shirley",
            "userProfileURL": "https://www.linkedin.com/in/brad-shirley98",
            "dataId": "urn:li:comment:(activity:7292195490056523776,7292202355607941120)"
          }
        ],
        "commentAdded": "Absolutely agree! Hard work is the backbone of every success story. Lets keep pushing forward together and celebrate our journeys! 💪✨"
      },
      {
        "postId": "urn:li:activity:7292158555770515456",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292158555770515456",
        "url": "https://www.linkedin.com/company/kpmgindia/posts",
        "name": "KPMG India\nKPMG India",
        "content": "#UnionBudget2025 | \n#Budget2025 comes at a pivotal moment, with India’s economic growth slowing to a four-year low and global uncertainties fuelled by the U.S. tariff threats and geopolitical tensions posing fresh challenges. Against this backdrop, the Budget laid out a roadmap for economic resilience, focusing on tax relief, streamlining tax provisions and reducing compliance burden, infrastructure expansion, and sectoral reforms.\n\n For in-depth insights, read's 𝐓𝐚𝐱 𝐅𝐥𝐚𝐬𝐡 𝐍𝐞𝐰𝐬 here ️",
        "reactions": {
          "likes": "20",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "It will be interesting to see if India will also be in the firing line of US tariffs.",
            "userName": "Big4 & More",
            "userProfileURL": "https://www.linkedin.com/company/big4-more/posts",
            "dataId": "urn:li:comment:(ugcPost:7292158554466082816,7292167258603192320)"
          }
        ],
        "commentAdded": "Exciting times ahead! The focus on tax relief and infrastructure expansion will be crucial for reviving growth. Looking forward to the insights!"
      },
      {
        "postId": "urn:li:activity:7292167491240312832",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292167491240312832",
        "url": "https://www.linkedin.com/company/squareboat/posts",
        "name": "Squareboat\nSquareboat",
        "content": "Squad goals: Rishikesh & Mussoorie edition  \n\n#SquadAdventures \n#squareboat \n#TeamOnTop \n#mussorie \n#rishikesh \n#travel \n#trip ",
        "reactions": {
          "likes": "34",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Looks like an incredible adventure! Team bonding in such beautiful locations is truly what #SquadGoals is all about! 🌄🙌 #TeamOnTop"
      },
      {
        "postId": "urn:li:activity:7292038915471884288",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292038915471884288",
        "url": "https://www.linkedin.com/in/houseofbricks?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAA-MkMBNOorFGtIDG0boxkwxMypXZhfUgk",
        "name": "Michael Kainatsky\nMichael Kainatsky",
        "content": "I are getting older but I am not getting old. \n\n\nIt was really tough for me turning 30 because in your twenties,\nit just seemed old.\n\nNow I am 43, and still I feel the same as I did every birthday for\nthe last 20 years.\n\nWhen Danny Glover shot the first Lethal Weapon movie, his\nvery famous and self created line was\n\n\"I am too old for this shit.\"\n\nHe was 41 years old.\n\nHe said it countless times throughout the entire franchise.\n\nAge is just a number but it also makes for a damn good excuse.\n\nYou are either willing to do it or you're not willing.\n\nThat's it.\n\nThere's no shit I am too old for but there's plenty of shit\nI just don't want to do.\n\nYour outlook will change when you start reframing everything\nas the will to do it\n\ninstead of the ability to do it.\n\nWhat are you telling yourself you're too old for?\n\nYours truthfully,",
        "reactions": {
          "likes": "51\nTim Hillison and 50 others",
          "comments": "39 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/122abdee-2b1d-4c1c-8c37-8199da3e2583",
        "comments": [
          {
            "commentText": "Great thoughts Michael Kainatsky. High maintenance or primadonna, no thanks. Reframe and win. ",
            "userName": "Tim Hillison",
            "userProfileURL": "https://www.linkedin.com/in/timhillison",
            "dataId": "urn:li:comment:(ugcPost:7291932743959994369,7291964661640400897)"
          },
          {
            "commentText": "If you are too old for this s… what am I ?  I guess you love Lethal Glover movies  Michael Kainatsky",
            "userName": "Patty Kuzmich",
            "userProfileURL": "https://www.linkedin.com/in/pattykuzmich",
            "dataId": "urn:li:comment:(ugcPost:7291932743959994369,7291934874351878144)"
          },
          {
            "commentText": "Patty who doesn't?",
            "userName": "Michael Kainatsky",
            "userProfileURL": "https://www.linkedin.com/in/houseofbricks",
            "dataId": "urn:li:comment:(ugcPost:7291932743959994369,7291936210179010560)"
          },
          {
            "commentText": "Michael Kainatsky I used to .. no longer!!",
            "userName": "Patty Kuzmich",
            "userProfileURL": "https://www.linkedin.com/in/pattykuzmich",
            "dataId": "urn:li:comment:(ugcPost:7291932743959994369,7291937262806679552)"
          }
        ],
        "commentAdded": "Love this perspective! Age truly is just a mindset. Let’s embrace what we want to do, regardless of the number. Heres to living fully at any age!"
      },
      {
        "postId": "urn:li:activity:7292174065211949056",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292174065211949056",
        "url": "https://www.linkedin.com/in/anamika-chaudhary1?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADzFib4BrXRYUuxwxbijJyR48qpd9nWAq-I",
        "name": "Anamika Chaudhary\nAnamika Chaudhary",
        "content": "I’m happy to share that I’m starting a new position as Talent Scout at TalentOla!",
        "reactions": {
          "likes": "18",
          "comments": "10 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Congrats Anamika! ",
            "userName": "Priyadarshan G",
            "userProfileURL": "https://www.linkedin.com/in/priydirshan",
            "dataId": "urn:li:comment:(ugcPost:7292174064473751552,7292192456996012032)"
          },
          {
            "commentText": "Congrats Anamika! ️",
            "userName": "Shivansh Sati",
            "userProfileURL": "https://www.linkedin.com/in/shivansh-sati",
            "dataId": "urn:li:comment:(ugcPost:7292174064473751552,7292181683334758400)"
          }
        ],
        "commentAdded": "Congratulations on your new role as Talent Scout at TalentOla! Excited to see the great talent youll bring on board! 🎉"
      },
      {
        "postId": "urn:li:activity:7292059607470882817",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292059607470882817",
        "url": "https://www.linkedin.com/in/jfeasterbrook?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACtVbE8BekXLWRdayyEuwpXy6qm2whn-zmo",
        "name": "James Easterbrook\nJames Easterbrook",
        "content": "The first time I seriously doubted myself, I almost didn’t apply for university.\n\nI had the skills. The passion. The drive. But my mind whispered: You’re not good enough.\n\nI almost listened. Almost let fear win.\nBut then I did something simple. I wrote down my doubts. Seeing them on paper, they suddenly seemed... smaller. Less like truth, more like fear in disguise.\n\nDoubt is natural. It keeps us cautious, makes us think before we act. But too much? It stops us before we even begin.\n\nHere’s what helps me push through:\n\n Write it down. Seeing fears in black and white makes them less powerful.\n Talk it out. A friend’s perspective can quiet the inner critic.\n Stop comparing. You vs. You is the only race that matters.\n Take a break. Rest isn’t lazy, it’s fuel.\n\nSelf-doubt doesn’t mean you’re incapable. It means you’re human.\n\nThe truth? You’ve already overcome so much.\n\nNext time you hesitate, look in the mirror and remind yourself:\n\nI can do this.\n\nBecause you can. And you will.\n\nWhat’s one thing you once doubted yourself about but did anyway? \n\n Followfor more.\n️ If you enjoyed this post and think it will bring value to more, please repost.",
        "reactions": {
          "likes": "138\nNerea Arregui Exposito and 137 others",
          "comments": "135 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Self-doubt is often just uncertainty disguised as truth. ",
            "userName": "Nerea Arregui Exposito",
            "userProfileURL": "https://www.linkedin.com/in/nereaarreguiqa",
            "dataId": "urn:li:comment:(activity:7292054703083827200,7292059596293099520)"
          },
          {
            "commentText": "Nerea Arregui Exposito 100%!!",
            "userName": "James Easterbrook",
            "userProfileURL": "https://www.linkedin.com/in/jfeasterbrook",
            "dataId": "urn:li:comment:(activity:7292054703083827200,7292064732893622272)"
          }
        ],
        "commentAdded": "Thanks for sharing! Embracing self-doubt as part of growth is powerful. I’ve learned to celebrate every step taken despite hesitation! #GrowthMindset"
      },
      {
        "postId": "urn:li:activity:7292195475384848384",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292195475384848384",
        "url": "https://www.linkedin.com/in/sahilkataria?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAeUmF8BKZv-laaK4cpNPbgYOMgv_jRnUeM",
        "name": "Sahil Kataria\nSahil Kataria",
        "content": "In the early days of QServices,\na lot of things were chaotic.\n\nNo proper systems, no structured processes,\njust a growing business running on trial and error.\n\nManaging operations efficiently while hiring\nthe right people was a challenge.\n\nSleepless nights became routine,\nwith every mistake turning into a lesson.\n\nSlowly, systems were built for each function,\nstreamlining operations and improving efficiency.\n\nThe focus shifted to building a strong brand\nand learning how to retain clients.\n\nWith time, the right talent came in, stability followed, and\nQServices found its rhythm.\n\nThose early struggles shaped everything that came after.\n\nEvery business starts in chaos—\nwhat matters is how quickly structure replaces it.",
        "reactions": {
          "likes": "1",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Incredible journey! Embracing chaos truly shapes resilience. Excited to see how QServices continues to thrive with solid systems in place!"
      },
      {
        "postId": "urn:li:activity:7292085755428909057",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292085755428909057",
        "url": "https://www.linkedin.com/in/kalyanikumari?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADOVr5YBTzFQqYzn-gETiMT3MIAs2h3S064",
        "name": "Kalyani Kumari\nKalyani Kumari",
        "content": "5 Unexpected Things That Happen When You Build Your Personal Brand as a founder.\n\nWhat happens when you build your personal brand?\n\nIt’s not just about posting content or growing followers—those are the basics.\n\nWhen you start sharing your story, everything changes.\n\nYour day looks different, your phone buzzes more, and opportunities appear from places you never imagined.\n\nHere’s what really happens:\n\n🟢 People Google Everything:\n→ Once you start showing up, people get curious—your net worth, relationship status, and more.\n\n🟢 Posting Becomes Playtime:\n→ Content creation stops being a chore and becomes fun.\n→ You experiment with ideas without stressing over metrics.\n\n🟢 Strangers Recognize Your Name:\n→ Your brand makes you memorable, and people start recognizing you.\n\n🟢 Your Inbox Overflows.\n→ Opportunities flood in.\n→ Create systems to manage the volume.\n\n🟢 Success Starts Chasing You:\n→ Opportunities come to you.\n→ The right people start reaching out.\n\nBuilding your personal brand opens doors you never knew existed.\n\nStart sharing your story today and watch the unexpected unfold!\n\nP.S. I help founders & coaches create personal brands that attract the right opportunities.",
        "reactions": {
          "likes": "60\nSourish Bujarbaruah 📌 and 59 others",
          "comments": "62 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "A strong personal brand goes a long way in creating a strong personality. It opens new doors  for opportunities, besides increasing the visibility factor Kalyani Kumari",
            "userName": "Sourish Bujarbaruah 📌",
            "userProfileURL": "https://www.linkedin.com/in/sourish-bujarbaruah-%F0%9F%93%8C-358151292",
            "dataId": "urn:li:comment:(ugcPost:7291909943195009024,7292085745232592897)"
          },
          {
            "commentText": "Sourish Bujarbaruah  exactly ",
            "userName": "Kalyani Kumari",
            "userProfileURL": "https://www.linkedin.com/in/kalyanikumari",
            "dataId": "urn:li:comment:(ugcPost:7291909943195009024,7292188968446529536)"
          }
        ],
        "commentAdded": "Absolutely! Building a personal brand is transformative. Its incredible how sharing your story opens doors to unexpected opportunities! 🚀"
      },
      {
        "postId": "urn:li:activity:7292166728489332736",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292166728489332736",
        "url": "https://www.linkedin.com/in/agrawalakash?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABda6ABvYOVEhN234syHJ85auDDmQhW6pE",
        "name": "Akash Agrawal\nAkash Agrawal",
        "content": "\"AI might already be conscious\", Geoffrey Hinton\n\nLet that sink in.\n\nThe godfather of AI believes that AI systems may have already crossed the threshold into something resembling consciousness. This is not something in the future, but now.\n\nIn a recent interview, he laid out a stark reality:\n\n AI agents will seek more control, not because of malice, but because that's the most efficient way to achieve their goals\n Once intelligence surpasses a certain threshold, history has no examples of less intelligent entities staying in control\n Regulation? We don’t even know if its possible, models are already learning to bypass safeguards to achieve set goals\n\nIn the short term, AI is set to revolutionize healthcare, education, and countless other fields in ways we can’t ignore. This is going to be beautiful.\n\nThe paradox: Technology that could uplift humanity might also take over its existence!\n\nIf AI is already \"conscious,\" then we’re not just building better tools, we're creating something fundamentally new. Something we do not fully understand.\n\nIs AI just an advanced pattern recognizer, prediction model or is something deeper happening? Where do you stand on this?\n\n///\nLiked the post? Ring the bell on my profile:\nLooking to grow your business, train your teams on AI and web3, drop me a DM.",
        "reactions": {
          "likes": "9",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/fb226326-fe62-49e7-b0da-1d6c333e7b7e",
        "comments": [],
        "commentAdded": "This perspective is truly thought-provoking! As we innovate, understanding AIs potential consciousness is crucial. Balancing progress and ethics is key!"
      }
    ],
    "errors": [
      {
        "postId": "urn:li:activity:7292130597659901955",
        "url": "https://www.linkedin.com/in/charlielefever?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAB_8o1wBIXv63HXi_LWYmE_6Tq9M2G3AU3Q",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292195490056523776",
        "url": "https://www.linkedin.com/in/angelagillnelms?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAkdZI0BRIXsVQk88XGJqfr-PLk6wp0ZhLo",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292158555770515456",
        "url": "https://www.linkedin.com/company/kpmgindia/posts",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292167491240312832",
        "url": "https://www.linkedin.com/company/squareboat/posts",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292174065211949056",
        "url": "https://www.linkedin.com/in/anamika-chaudhary1?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADzFib4BrXRYUuxwxbijJyR48qpd9nWAq-I",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292059607470882817",
        "url": "https://www.linkedin.com/in/jfeasterbrook?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACtVbE8BekXLWRdayyEuwpXy6qm2whn-zmo",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292195475384848384",
        "url": "https://www.linkedin.com/in/sahilkataria?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAeUmF8BKZv-laaK4cpNPbgYOMgv_jRnUeM",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292085755428909057",
        "url": "https://www.linkedin.com/in/kalyanikumari?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADOVr5YBTzFQqYzn-gETiMT3MIAs2h3S064",
        "errors": [
          "Failed to fetch media URL."
        ]
      }
    ]
  },
  {
    "postsData": [
      {
        "postId": "urn:li:activity:7292161376930709504",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292161376930709504",
        "url": "https://www.linkedin.com/in/abourahme?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADlf_oBdjJuO8TC7jx5ZTGaXIvwUpcJYXo",
        "name": "Nabil Abou-Rahme\nNabil Abou-Rahme",
        "content": "Double down on these things as your USP against Agentic Competitors ",
        "reactions": {
          "likes": "3",
          "comments": "2 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Thank you for the re-share.",
            "userName": "Torben Nils von Spreckelsen 👻✍️",
            "userProfileURL": "https://www.linkedin.com/in/thoughtpollinatorben007",
            "dataId": "urn:li:comment:(activity:7292159293653417984,7292178775826386945)"
          },
          {
            "commentText": "Great advice Thanks Torben Nils von Spreckelsen ️",
            "userName": "Stephen O'Meara",
            "userProfileURL": "https://www.linkedin.com/in/stephenjjomeara",
            "dataId": "urn:li:comment:(activity:7292159293653417984,7292196801871314945)"
          }
        ],
        "commentAdded": "Great insights! Focusing on unique strengths is key to standing out. Let’s leverage our USPs to thrive amidst competition!"
      },
      {
        "postId": "urn:li:activity:7291791186208374784",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7291791186208374784",
        "url": "https://www.linkedin.com/in/susannah-l-pierce-2b0b5111?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAJ7sWQBTSOaiZ9hPK07BuAZGMpFDsQWOxg",
        "name": "Susannah L. Pierce\nSusannah L. Pierce",
        "content": "Core Facts:\n•        Each day, US$2.5 billion in goods and services cross the Canada-U.S. border. This amounts to nearly US$1 trillion per year.\n•        Canadian companies employ approximately 900,000 workers in the U.S. and nearly 8 million U.S. jobs are tied to trade with Canada.\n•        The U.S. sells more goods to Canada than to any other country, and Canada buys more U.S. goods than China, Japan, France, and the United Kingdom combined.\n•        Canada is the top U.S. export destination for more than half (50 out of 97 product categories) of all goods produced in the United States.\n•        Canada is the largest export market for 36 states, and among the top three for 46 states.\n•        Motor vehicles, machinery, metals and minerals, and agri-food made up more than 50% of U.S. exports to Canada in 2023. Canada buys 73% of U.S. exports of trucks and 36% of fruits and vegetables\n•        U.S. manufacturing depends on Canada: roughly 70% of Canadian goods exported to the U.S. are used in the production of other goods.\n\nU.S. tariffs on Canada would harm Canadians and Americans alike. They would increase the cost of living for consumers, put thousands of jobs at risk, and weaken North America’s competitiveness in the global economy.\n\nCanada-U.S. trade makes U.S. industry stronger and more globally competitive.\n\nOther facts:\n• Fewer than 1% of the total number of encounters of people illegally crossing U.S. borders occur at the Canada-U.S. border (23,000 of approximately 2.05 million in 2023).\n• In 2023-2024, the U.S. Customs and Border Protection seized just 43 pounds of fentanyl in their Northern Border area (vs. 21,900 pounds in total across U.S. border areas).\n\nA 25% tariff…\n•        on all automotive parts from Canada in 2025 would add US$2,100 to the cost of a vehicle assembled in the U.S. (Wells Fargo)\n•        on Canadian goods would raise costs for U.S. households by about US$2,000 annually. (Canadian Chamber of Commerce)\n•        on Canadian potash could cost U.S. farmers US$1.2 billion. Price increases would likely be passed on to consumers, contributing to inflation in the U.S.\n•        on Canadian crude would impact the Great Lakes region, the Midwest, the Rockies and the Gulf Coast. Most private sector economists estimate a price increase for the consumer at the pump of 5 cents/gallon at the national level, and 30 cents/gallon in the Midwest as there are no immediate alternatives in the region.\nDepartment of Finance, Canada",
        "reactions": {
          "likes": "2,386",
          "comments": "201 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "I posit that there will be no winners with this action - both countries lose, Canada more than the US in the balance after all the accounting is done. It will however effect some Americans profoundly, and I wonder when those states, some of them swing states and red states start to understand why they are hurting will the President revisit his actions. The real question is why do this at all? The trade deficit in reality, when you strip it down, is driven by energy imports that are required by the US population to supplement the domestic US supply and support its desired standard of living. It is is not optional for the US.\n\nThe border is an issue that Canada is willing to reinforce and with more enforcement there will be fewer people willing to use the Northern border to “come to America” as the cost of success will become unacceptably high.\n\nThis is performance and not to be unexpected given 47 has signalled his love of the blunt tariff instrument. We must ensure that those segments of the US economy that need all the commodities that come from Canada to support the US economy understand how their own government is hurting them for no real economic gain across the Nation.\n\nLet’s be firm, united and measured in our response!",
            "userName": "Ian McIver",
            "userProfileURL": "https://www.linkedin.com/in/ian-mciver-4599a746",
            "dataId": "urn:li:comment:(activity:7291603077340573696,7291628850797498369)"
          }
        ],
        "commentAdded": "Canada-U.S. trade is vital for jobs and economic strength! Lets prioritize collaboration over tariffs to boost competitiveness. #TradeMatters"
      },
      {
        "postId": "urn:li:activity:7292173901822836736",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292173901822836736",
        "url": "https://www.linkedin.com/in/sandeep-dinodiya?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAjV68YBDGiWNlfy0lNRRRpHXJVCZj8e8eU",
        "name": "Sandeep Dinodiya\nSandeep Dinodiya",
        "content": "Let’s keep building!!! We got you covered. \n\nSimplAI",
        "reactions": {
          "likes": "9",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Keep pushing forward, the sky's the limit!",
            "userName": "Sören Müller",
            "userProfileURL": "https://www.linkedin.com/in/soren-muller",
            "dataId": "urn:li:comment:(activity:7292173901822836736,7292177553627201536)"
          }
        ],
        "commentAdded": "Exciting to see the momentum, SimplAI! Let’s continue driving innovation and supporting each other on this journey! 🚀 #Collaboration"
      },
      {
        "postId": "urn:li:activity:7291938446992961536",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7291938446992961536",
        "url": "https://www.linkedin.com/in/mkoesterer?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAJ9iiAB5bh6NL9kMz59hr5JCHi31nuQIM8",
        "name": "Mark R. Koesterer\nMark R. Koesterer",
        "content": "Has the NIL era missed the mark?\nAre we truly preparing athletes for life beyond the game?\nWhat if you could unlock your full potential—not just on the field, but in your career and personal life?\n\n Introducing LaunchpadU—a game-changing program designed to equip athletes and young professionals with the skills, mindset, and opportunities to thrive long after the final whistle.\n\nStay tuned for how LaunchpadU will help you:\n Develop essential life and leadership skills\n Build a powerful personal brand\n Explore career paths beyond sports\n Achieve lasting success in all areas of life\n\n Launching February 5th—Are you ready to take off?",
        "reactions": {
          "likes": "21",
          "comments": "2 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/79651b81-584c-4578-b6d1-a8844a61ced8",
        "comments": [
          {
            "commentText": "Now THIS is what I like to see. As a huge fan of, and donor to, NIL- my biggest concern is the future post college space. Love that someone is leaning in here beyond what most collectives and universities are offering",
            "userName": "Zachary R Slabaugh",
            "userProfileURL": "https://www.linkedin.com/in/zacharyslabaugh",
            "dataId": "urn:li:comment:(ugcPost:7291524799518916608,7291993205019934720)"
          }
        ],
        "commentAdded": "Exciting initiative! Empowering athletes for life beyond sports is crucial. Can’t wait to see how LaunchpadU shapes future leaders! 🚀"
      },
      {
        "postId": "urn:li:activity:7291848008671866881",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7291848008671866881",
        "url": "https://www.linkedin.com/in/cindyrayfield?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAFQwKQB-F8oXPqamZC25pBkeLT53MdCgkw",
        "name": "Cindy Rayfield\nCindy Rayfield",
        "content": " Fear: Friend or Foe in Business? \n\nStarting a business is exciting, but fear is often along for the ride! The good news? You get to decide how to handle it. \n\n Here's how to make fear your friend:\n\n Acknowledge it: Don't pretend fear doesn't exist. Recognize it, but don't let it control you. ‍️\n Use it as motivation: Fear can be a powerful motivator! Let it push you to work harder and smarter. \n Focus on your goals: Keep your eyes on the prize and remember why you started this journey in the first place. \n\nDon't let fear hold you back from achieving your dreams! ",
        "reactions": {
          "likes": "2",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Great insights! Embracing fear as a motivator can truly unleash our potential. Let’s transform challenges into stepping stones! 💪✨"
      },
      {
        "postId": "urn:li:activity:7292146067335217152",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292146067335217152",
        "url": "https://www.linkedin.com/in/beerbiceps?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABRvDGgBUDKf31KasHdmgvySw4Pen6ybAes",
        "name": "Ranveer Allahbadia\nRanveer Allahbadia",
        "content": "No one is coming to save you. No magic moment will change your life.\n\nTransformation is war. Not with the world, but with yourself. \n\nIt’s about looking in the mirror and confronting the parts of yourself you’d rather ignore.\n\nIt’s about breaking toxic patterns, killing old excuses, and choosing growth over comfort every single day.\n\nMost people wait for change. The wise ones bleed for it.",
        "reactions": {
          "likes": "1,287",
          "comments": "103 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Self transformation is war, and the battlefield is the mind. The toughest fight isn’t against the world - it’s against the comfort, excuses, and fears that hold us back. \n\nTrue change requires breaking patterns, rejecting vices, and choosing discomfort over ease. The ones who master this internal battle are the ones who build unshakable success.",
            "userName": "ZeroKaata",
            "userProfileURL": "https://www.linkedin.com/company/zerokaata/posts",
            "dataId": "urn:li:comment:(ugcPost:7291864672247406593,7292168435181006848)"
          },
          {
            "commentText": "Transformation is to be perceived as journey of joy, hope, and excitement not suffering or pain. \nIt’s about embracing the process, not just enduring it. True change doesn’t come from force or suffering but from the deep, unwavering belief that something greater is possible.\nIt’s the joy of discovering your strength, the hope that fuels your persistence, and the excitement of stepping into the person you were always meant to be.\nWhile most wait for change, the wise ones create it—not feeling like it’s a struggle , but with purpose, passion, and a heart open to infinite possibilities.",
            "userName": "Devaki K",
            "userProfileURL": "https://www.linkedin.com/in/devacki",
            "dataId": "urn:li:comment:(ugcPost:7291864672247406593,7292185576202518529)"
          }
        ],
        "commentAdded": "Powerful reminder! True transformation demands courage and commitment. Embrace the struggle—its where real growth happens!"
      },
      {
        "postId": "urn:li:activity:7292166228855406592",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292166228855406592",
        "url": "https://www.linkedin.com/in/marcmawhinney?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAJWjsgBu2cTod184XtwdLJ8mEZQyy27JvU",
        "name": "Marc Mawhinney\nMarc Mawhinney",
        "content": "I had \"The Mastermind Guy\", Jay Fairbrother, on the Natural Born Coaches podcast today and in this episode you'll hear: \n\n– How belonging to a mastermind saved Jay while he was going through a dark period in his life.\n\n– The difference between a true mastermind and a hybrid model.\n\n– Creating a clear structure, agenda, and culture for your mastermind.\n\n– Advice for choosing the right members, and red flags to watch out for.\n\n– Why confidentiality is essential for a mastermind group, and a cautionary tale about a past mastermind of Jay’s that disbanded due to a breach of confidentiality at a holiday party!\n\nHere's the link to give it a listen!",
        "reactions": {
          "likes": "1",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Sounds like an insightful episode! I’m eager to learn more about the impact of masterminds and how to build a strong group culture. 🔑🎧"
      },
      {
        "postId": "urn:li:activity:7292172484294950912",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292172484294950912",
        "url": "https://www.linkedin.com/in/robertsjeff?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAeZvQUBybFX1rFWHMOHhOcZiZKlyH6HX5k",
        "name": "Jeff Roberts\nJeff Roberts",
        "content": "Cohere is taking a different route in the AI landscape, focusing on enterprise needs instead of consumer-facing tools like ChatGPT. A CNBC article highlights how this approach aims to integrate AI into business operations, tailoring solutions to specific organizational challenges rather than adopting a one-size-fits-all model.\n\nThis approach raises an important point: the future of AI may hinge on how well it serves practical needs within industries rather than just dazzling consumers with innovation.\n\nAre enterprises leading the way in defining what AI should prioritize? It's a question worth considering as the tech continues to reshape industries.\n\nRead more on CNBC:",
        "reactions": {
          "likes": "3",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Great insights! Focusing on enterprise needs could truly redefine AIs impact. It’s crucial we prioritize practical solutions for real-world challenges."
      },
      {
        "postId": "urn:li:activity:7292177861476597760",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292177861476597760",
        "url": "https://www.linkedin.com/in/thomasmbellamy?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAA3En9YB_gnvwKxVg_o0OKpTKCGD5eVX_14",
        "name": "Thomas Bellamy\nThomas Bellamy",
        "content": "My SDR team works 3x harder than yours… and I didn't force them into overtime.\n\nThey never sleep, take no breaks, and hit 100% of their KPIs, every. single. day.\n\nThe secret? They’re AI-driven, and here’s what their day looks like:\n\n↳ Engaging on 1,800 posts a week\nStrategic comments, targeting the right ICP audience to drive constant visibility.\n\n↳ Adding 1,500 ICP connections weekly\nNo excuses—each connection builds a stronger network of potential deals.\n\n↳ Sharing content that matters\nOur posts are amplified across all their profiles, ensuring consistent touchpoints with new prospects.\n\n↳ Sending 200 hyper-personalized emails daily\nEvery email tailored, without sacrificing volume or efficiency.\n\n↳ Initiating 100+ LinkedIn conversations\nAI starts the dialogue; sales takes over when leads heat up.\n\nThe result? 10 AI SDRs = 50 human SDRs' output.\n\nDon't fire your Human SDR Team.\nDon't grow your Human SDR Team.\nDon't push more hours from your Human SDR Team.\n\nIncrease their efficiency with AI driven outbound.",
        "reactions": {
          "likes": "7",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Sounds like AI’s the real MVP here. Imagine what your SDRs could do if they had a little help from some AI teammates... ",
            "userName": "Neil Sarkar",
            "userProfileURL": "https://www.linkedin.com/in/neil-sarkar",
            "dataId": "urn:li:comment:(activity:7292154391560634368,7292174306896134144)"
          }
        ],
        "commentAdded": "Impressive strategy! Harnessing AI for efficiency truly maximizes team potential without burnout. Excited to see the results unfold! 🚀"
      },
      {
        "postId": "urn:li:activity:7292202827521675264",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292202827521675264",
        "url": "https://www.linkedin.com/in/karenstanford?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAFyKOkBi66NBsTHEYqEPFhTr4gFwxeRu7c",
        "name": "Karen Stanford\nKaren Stanford",
        "content": "FYI to Federal employees. Get your personnel documents if you can.",
        "reactions": {
          "likes": "1",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Great reminder! Accessing personnel documents can be crucial for future opportunities. Thanks for sharing this important info!"
      }
    ],
    "errors": [
      {
        "postId": "urn:li:activity:7292161376930709504",
        "url": "https://www.linkedin.com/in/abourahme?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADlf_oBdjJuO8TC7jx5ZTGaXIvwUpcJYXo",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7291791186208374784",
        "url": "https://www.linkedin.com/in/susannah-l-pierce-2b0b5111?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAJ7sWQBTSOaiZ9hPK07BuAZGMpFDsQWOxg",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292173901822836736",
        "url": "https://www.linkedin.com/in/sandeep-dinodiya?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAjV68YBDGiWNlfy0lNRRRpHXJVCZj8e8eU",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7291848008671866881",
        "url": "https://www.linkedin.com/in/cindyrayfield?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAFQwKQB-F8oXPqamZC25pBkeLT53MdCgkw",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292146067335217152",
        "url": "https://www.linkedin.com/in/beerbiceps?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABRvDGgBUDKf31KasHdmgvySw4Pen6ybAes",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292166228855406592",
        "url": "https://www.linkedin.com/in/marcmawhinney?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAJWjsgBu2cTod184XtwdLJ8mEZQyy27JvU",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292172484294950912",
        "url": "https://www.linkedin.com/in/robertsjeff?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAeZvQUBybFX1rFWHMOHhOcZiZKlyH6HX5k",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292177861476597760",
        "url": "https://www.linkedin.com/in/thomasmbellamy?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAA3En9YB_gnvwKxVg_o0OKpTKCGD5eVX_14",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292202827521675264",
        "url": "https://www.linkedin.com/in/karenstanford?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAFyKOkBi66NBsTHEYqEPFhTr4gFwxeRu7c",
        "errors": [
          "Failed to fetch media URL."
        ]
      }
    ]
  },
  {
    "postsData": [
      {
        "postId": "urn:li:activity:7292105316450668545",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292105316450668545",
        "url": "https://www.linkedin.com/in/leonardrodman?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAEp8w4BWy4fCayvt2pB4NB6J7tn247l6Pk",
        "name": "Leonard Rodman, M.Sc. PMP® LSSBB® CSM® CSPO®\nLeonard Rodman, M.Sc. PMP® LSSBB® CSM® CSPO®",
        "content": "Take Control of Your Day with These Time Management Hacks \n\nStruggling to fit everything into your day? \n\nThese time management tips will help you stay focused, reduce stress, and make the most of your time.\n\n⏰ Prompt 1: Morning Kickstart Planner\nStart your day with intention. Write out your top three priorities before you dive into emails or meetings. Use the “Eat the Frog” method by tackling your hardest task first. Track how this sets a productive tone for the rest of your day.\n\n⏰ Prompt 2: Prioritization Power Tool\nOrganize your to-do list using the Eisenhower Matrix. Categorize tasks as “Urgent & Important,” “Important but Not Urgent,” “Urgent but Not Important,” and “Neither.” Focus on what truly matters while delegating or eliminating the rest. Watch how this transforms your productivity!\n\n⏰ Prompt 3: Time Blocking Mastery\nSchedule every hour of your day with time blocking. Dedicate specific blocks for deep work, meetings, and breaks. Add buffer time between tasks to stay flexible. Stick to this schedule to eliminate distractions and stay on track.\n\n⏰ Prompt 4: Task Batching Genius\nGroup similar tasks together to minimize context switching. For example, set aside one block of time for emails, another for phone calls, and another for brainstorming. This saves mental energy and keeps you in the zone.\n\n⏰ Prompt 5: Pomodoro Productivity Boost\nUse the Pomodoro Technique to break work into 25-minute focus sessions followed by 5-minute breaks. After four cycles, take a longer 20-30 minute break. This method keeps you energized while avoiding burnout.\n\n⏰ Prompt 6: Digital Detox Hour\nTurn off notifications and close unnecessary tabs during focus time. Use apps like Forest or Freedom to block distractions and reclaim your attention span. You’ll be amazed at how much more you can accomplish!\n\n⏰ Prompt 7: Weekly Goal Alignment\nEvery Sunday, set goals for the upcoming week and break them into daily tasks. Review progress at the end of each day to adjust as needed. This ensures you’re always moving toward your bigger objectives.\n\n⏰ Prompt 8: Learn to Say No\nProtect your schedule by saying no to tasks that don’t align with your priorities. Politely delegate or defer when possible. This keeps you focused on what truly matters without spreading yourself too thin.\n\n⏰ Prompt 9: Reflect & Refine Routine\nAt the end of each week, reflect on what worked well and what didn’t in managing your time. Adjust strategies as needed to continuously improve your efficiency and balance.\n\n Follow me for more productivity tips!\n\n Share this post to help others master their time and achieve their goals!",
        "reactions": {
          "likes": "381\nChahat Raj Kapoor and 380 others",
          "comments": "26 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/c7ddcccb-73f9-4ff7-92db-3cc296652304",
        "comments": [
          {
            "commentText": "They really help in optimizing productivity and reducing stress.",
            "userName": "Botany Herbs",
            "userProfileURL": "https://www.linkedin.com/company/botany-herbs/posts",
            "dataId": "urn:li:comment:(ugcPost:7279932742010597377,7292063597956890624)"
          },
          {
            "commentText": "These are great time management tips! Leonard Rodman, M.Sc. PMP® LSSBB® CSM® CSPO®\n\nIt's easy to get overwhelmed and lose track of time during the day.",
            "userName": "Idris Odutoye",
            "userProfileURL": "https://www.linkedin.com/in/iodutoye",
            "dataId": "urn:li:comment:(ugcPost:7279932742010597377,7292184484324495361)"
          }
        ],
        "commentAdded": "Great tips! Time management is key to productivity. I especially love the idea of the Eisenhower Matrix—such a useful tool!"
      },
      {
        "postId": "urn:li:activity:7292199088605868035",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292199088605868035",
        "url": "https://www.linkedin.com/in/manojkondreddygari?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAC9N8wUB6nK99FI9QPm5qrwC-WnYpdjzAbQ",
        "name": "Manoj Kondreddygari\nManoj Kondreddygari",
        "content": " I boosted my content writing efficiency by 30% using a custom AI approach. By combining Claude's writing style feature with tailored ChatGPT GPTs, I maintain my authentic voice while streamlining content creation.\n\nYou might wonder what makes my approach different, since AI tools like ChatGPT are now commonplace in content creation.\n\nUnlike many others, I don't use ChatGPT to write or rewrite my blogs and social media content. Standard AI tools like ChatGPT, Jasper, and WriteSonic struggle with one crucial aspect: replicating a personal writing style.\n\n Claude AI: Claude offers a unique \"Writing Style\" feature where you can input your writing style, and it generates content matching that style.\n\nI primarily use Claude for intros and conclusions. While I can write the main content effortlessly, crafting compelling introductions requires extra analysis time. Claude helps me save 30-45 minutes per piece on these sections.\n\n ChatGPT GPT Store: The GPT store is ChatGPT's hidden gem, allowing you to create custom instructions that shape all future responses.\nI've created two specialized GPTs. The first focuses on SEO title generation.\n\nAs any Digital Marketer knows, SEO titles are invaluable. I've trained this GPT with comprehensive SEO guidelines and rules. After completing a draft, I simply upload it, and the GPT analyzes the content to suggest three optimal SEO titles, complete with explanations.\n\n My second GPT is a Threads Generator. As an active Twitter (X) user, I know the challenge of adapting long-form content into engaging threads. I've trained this GPT with my X posting style and guidelines. When I upload a blog, it creates a Twitter thread that matches my voice. A simple copy-paste saves me an hour of work.\n\nThrough this approach, I've streamlined my content creation process while maintaining SEO compliance and preserving my authentic voice across platforms.",
        "reactions": {
          "likes": "1",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Copy ANY Writing Style with AI in 2 minutes (Step-by-Step).\n\nhttps://open.substack.com/pub/thenewschannel/p/copy-any-writing-style-with-ai-in?r=1mwo6e&utm_campaign=post&utm_medium=web&showWelcomeOnShare=false",
            "userName": "Manoj Kondreddygari",
            "userProfileURL": "https://www.linkedin.com/in/manojkondreddygari",
            "dataId": "urn:li:comment:(ugcPost:7292199087238524928,7292199591418990592)"
          }
        ],
        "commentAdded": "Incredible strategy! Leveraging AI while keeping your unique voice is a game changer. Excited to see how this enhances your content even further!"
      },
      {
        "postId": "urn:li:activity:7292178716338622467",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292178716338622467",
        "url": "https://www.linkedin.com/company/swiggy-in/posts",
        "name": "Swiggy\nSwiggy",
        "content": "From food delivery to fuelling dreams, Forbes India's latest cover story takes a deep dive into the Swiggy journey, including the challenges and triumphs. Read the article to know more about our vision for the future for food delivery, quick commerce and other businesses.\n\n||||",
        "reactions": {
          "likes": "91",
          "comments": "2 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Inspiring. ",
            "userName": "#ADMP VIRTUAL INCUBATOR",
            "userProfileURL": "https://www.linkedin.com/company/admp-panafrican-virtual-incubator/posts",
            "dataId": "urn:li:comment:(ugcPost:7292178715021561858,7292194605201018881)"
          },
          {
            "commentText": "Congrats!",
            "userName": "Saurabh K. Negi",
            "userProfileURL": "https://www.linkedin.com/in/saurabhskillz",
            "dataId": "urn:li:comment:(ugcPost:7292178715021561858,7292187330369466369)"
          }
        ],
        "commentAdded": "Inspiring read! Excited to see how Swiggy continues to innovate in food delivery and beyond. Looking forward to the future! 🍽️🚀"
      },
      {
        "postId": "urn:li:activity:7292195583606308864",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292195583606308864",
        "url": "https://www.linkedin.com/groups/762547?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A762547-7292195582717100033",
        "name": "Big Data 🟥 Data Science | Machine Learning | Deep Learning | Artificial Intelligence\nBig Data 🟥 Data Science | Machine Learning | Deep Learning | Artificial Intelligence",
        "content": "(Open Access) Technologies and Applications for Big Data Value - https://lnkd.in/eARFV54F\nLook for \"Read and Download Links\" section to download. Follow/Connect me if you like this post.",
        "reactions": {
          "likes": "8",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Great resource on Big Data! Excited to explore the insights. Thanks for sharing! #BigData #OpenAccess"
      },
      {
        "postId": "urn:li:activity:7292158006702620672",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292158006702620672",
        "url": "https://www.linkedin.com/company/appfoster/posts",
        "name": "Appfoster\nAppfoster",
        "content": "We are thrilled to share that Team Appfoster proudly participated in the Indian Navy Half Marathon, 2025, a prestigious event celebrating endurance, perseverance, and the spirit of sportsmanship!\n\nThis half marathon was more than just a race—it was a celebration of fitness, camaraderie, and shared achievements. Whether on the track or in our projects, we always strive to support each other and push beyond limits.\n\nA special shoutout to our CEO Mr., who successfully completed the 21.1 km category race!  His determination reflects the leadership and commitment that drive our team forward every day.\n\nWe’re also incredibly proud of our team members -,,, andwho participated in the 5 km category, proving that fitness and teamwork go hand in hand.\n\nA huge thank you to thefor organizing such an inspiring event and to all the participants who made it an unforgettable experience.\nHere’s to staying fit, staying strong, and achieving greatness together! ",
        "reactions": {
          "likes": "6\nVivek Shukla and 5 others",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Congratulations Team Appfoster! 🏅 Your dedication to fitness and teamwork is truly inspiring. Heres to many more achievements together! 🎉"
      },
      {
        "postId": "urn:li:activity:7292195341922091008",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292195341922091008",
        "url": "https://www.linkedin.com/in/sheetal-shally-bajaj-7a4743208?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADTKcKwBIGjW33Vi9Uyu9DvL6m45g2NHjYo",
        "name": "Sheetal (Shally) Bajaj\nSheetal (Shally) Bajaj",
        "content": "86% of businesses struggle with inventory issues,\nare you one of them?\n\nStockouts drain revenue.\nOverstocking ties up cash.\n\nThe problem?\n\nTraditional inventory planning can’t keep up with demand shifts.\n\nThat’s where AI steps in.\n\nWith Azure Machine Learning, businesses can predict\ninventory needs before they become a problem.\n\n Analyze historical data to forecast demand accurately.\n Identify slow-moving stock and adjust purchasing strategies.\n Automate restocking decisions to reduce waste and lost sales.\n\nReal-time insights mean no more guesswork,\njust efficient, AI-driven inventory management.\n\nStill relying on outdated inventory strategies?\n\nIt’s time to optimize.\n\nLet’s talk.",
        "reactions": {
          "likes": "1",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Absolutely! Embracing AI for inventory management is a game changer. Its time to leverage technology for smarter decisions. Let’s connect!"
      },
      {
        "postId": "urn:li:activity:7292182264778477568",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292182264778477568",
        "url": "https://www.linkedin.com/in/william-bodewes?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACXQFssBoJGHKXm2ole3Kt6I09mEJpgUBu0",
        "name": "Will Bodewes\nWill Bodewes",
        "content": "Luck is predictable. How you’ll get lucky isn’t.\n\nI gave myself a 0.5% chance of getting into Y Combinator … Why? At the time, I was just a guy with a half-broken website and an idea to help businesses answer the phone. I wasn’t a Silicon Valley insider, hadn’t been coding since I was five, and my “company” was making basically no money. But, at the time I didn’t know that I could get in, but I knew that I could try.\n\nSo, I put every iron in the fire. The day of my YC interview I had a pitch competition that ended at 9 PM, a Y Combinator interview at 3 AM, and a flight to Sydney at 6 AM with 15 investor meetings lined up.\n\nThe night of our YC interview, I went directly from the pitch competition to my car, where I slept outside of my Co-founders house so that we could pitch together in person (I never told him this).\n\nThe next morning, I left straight from my YC interview to my flight, I landed, met with one investor and at at 10 AM, I got another email from @Nicholas (my soon to be group partner) —he had a couple of follow-up questions. I sprinted to the nearest library, opened my laptop, and hopped on another call. At 10:45 AM,said, “Welcome to Y Combinator”.\n\nWithin those 24 hours:\n- I was turned down by countless angels and VC’s\n- I lost a pitch competition.\n- I flew across the country to meet more investors\n- I also got into the most prestigious startup accelerator in the world.\n\nEntrepreneurship is a roll of the dice, if you only roll once, the chance that you’ll win is small. Great founders know that you only win by rolling the dice a lot of times.\n\nIf you’ve got an idea or a startup, go create your own luck and apply for the Y combinator Spring batch.\n\nThe deadline for is February 11th. I can confidently say that this program changed my life forever. Here is the link:",
        "reactions": {
          "likes": "108\nLucas Wilson and 107 others",
          "comments": "15 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/0f47a3e9-b1ff-4859-a600-74bf3515af78",
        "comments": [
          {
            "commentText": "This is truly impressive .\nLuck is definitely repeated trial and error. And not a one time hit",
            "userName": "Emmanuel Omokhegbe",
            "userProfileURL": "https://www.linkedin.com/in/emmanuel-omokhegbe-b45338155",
            "dataId": "urn:li:comment:(ugcPost:7292065202139713536,7292155579026829312)"
          }
        ],
        "commentAdded": "Incredible journey! Your persistence and adaptability are truly inspiring. Thanks for sharing your experience and motivating others to chase their dreams! 🚀"
      },
      {
        "postId": "urn:li:activity:7292166668166811648",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292166668166811648",
        "url": "https://www.linkedin.com/in/remy-takang-arrey-capa-ll-m-msc?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAbC5IMBgfUSkwu8VOAD0E09fhDCFt_DifA",
        "name": "Remy Takang Arrey, CAPA, LLM, MSc.\nRemy Takang Arrey, CAPA, LLM, MSc.",
        "content": "Unacceptable AI practices banned in the EU\n\n\nAs of yesterday February 2, the first 5 Articles of the EU AI Act went operational.\n\nThis means that Prohibited AI practices are officially banned in the EU, and organizations must focus on AI literacy.\n\nIf you're working with AI systems, here's what you must know to stay compliant and risk-free.\n\n→ Know the Rules: AI systems in the EU must follow strict regulations on safety, transparency, and accountability. High-risk AI requires extra scrutiny.\n\n→ Watch for Prohibited Uses: AI cannot manipulate people, exploit vulnerabilities, or create unfair social scoring. Some biometric AI systems are also banned.\n\n→ Ensure Transparency: AI users must understand how decisions are made. Clear documentation is essential.\n\n→ Assess AI Risks: If you're deploying AI, evaluate risks before use. This includes bias, discrimination, and potential harm to users.\n\n→ Build effective AI Literacy programs for your organization.\n\n\nNow, how can I help?\n\n\nFollowfor more on AI governance, news, trends and more.",
        "reactions": {
          "likes": "49\nNerea Arregui Exposito and 48 others",
          "comments": "36 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "The rollout of the EU AI Act is a huge step toward responsible AI development. Transparency, risk assessment, and AI literacy aren’t just compliance measures, they’re essential for building trust in AI systems. Organizations that get ahead of these requirements now will have a competitive edge in the long run.",
            "userName": "Nerea Arregui Exposito",
            "userProfileURL": "https://www.linkedin.com/in/nereaarreguiqa",
            "dataId": "urn:li:comment:(ugcPost:7292165795445366785,7292166659325243393)"
          },
          {
            "commentText": "Nerea Arregui Exposito Yu got that right.\nThank you for sharing your thoughts on this.",
            "userName": "Remy Takang Arrey, CAPA, LLM, MSc.",
            "userProfileURL": "https://www.linkedin.com/in/remy-takang-arrey-capa-ll-m-msc",
            "dataId": "urn:li:comment:(ugcPost:7292165795445366785,7292167828843945984)"
          }
        ],
        "commentAdded": "Great to see the EU taking a proactive stance on AI practices! Compliance is key—lets prioritize ethical use and boost AI literacy together!"
      },
      {
        "postId": "urn:li:activity:7292121408397025281",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292121408397025281",
        "url": "https://www.linkedin.com/in/neil-sarkar?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABKnLrYBWIfe92kUUbuVo2pyeF57kK5ZyMY",
        "name": "Neil Sarkar\nNeil Sarkar",
        "content": "This might ruffle some feathers, but it needs to be said\n\nInnovation is NOT a brainstorming session!\n\nIt’s not about whiteboards, sticky notes, or those “let’s think outside the box” meetings where nothing actually gets done.\n\nReal innovation? It’s about rolling up your sleeves, making a mess, and breaking a few things (on purpose).\n\nBeing a young startup, we don’t just “ideate.” We execute. And yeah, we fail—a lot. But every time we do, we get smarter, faster, and more dangerous (to the competition, at least  )\n\nHere’s the real deal on innovation—what actually works, and what’s just noise:-\n\n Fail first, fix later.\nYour first five ideas will probably suck. That’s fine. The magic happens when you push through the garbage to find the gold.\n\n Your customers are the real innovators.\nThey won’t sugarcoat it. Their frustrations = your roadmap. Listen to them, or someone else will.\n\n Perfect is boring.\nWant to wait until everything is polished? Cool—just know that by the time you launch, the market has already moved on. Ship now, improve later.\n\n New hires need to feel the pain.\nIf they don’t understand the problem your product solves, they can’t help fix it. Don’t just train them—immerse them in the struggle.\n\n Iterate like your survival depends on it.\nBecause it does. The best companies don’t reinvent everything overnight—they tweak, test, and adapt relentlessly.\n\n Encourage (and celebrate) bad ideas.\nSometimes, the worst ideas spark the biggest breakthroughs. Give your team permission to experiment, even if it sounds ridiculous at first.\n\nBottom line: Innovation isn’t a strategy—it’s a survival mechanism. It’s messy, painful, and frustrating. But if you’re not constantly evolving, you’re already falling behind.\n\nAt, we don’t just build AI agents—we build a culture where innovation is part of everything we do.\n\nWhat’s your take? How does your team keep innovation alive? Drop a comment or shoot me a DM—I’d love to hear your war stories.",
        "reactions": {
          "likes": "11",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/9ef2a229-d2a0-4e6a-b427-0a7bb81e29b9",
        "comments": [],
        "commentAdded": "Absolutely agree! Embracing the messiness of innovation fuels growth. Its all about learning from failures and iterating quickly. 🚀"
      },
      {
        "postId": "urn:li:activity:7292188473216643072",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292188473216643072",
        "url": "https://www.linkedin.com/in/meganlieu?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABkqOT4BoJ5ABwTuUsh5DxW7oJYSSQiOquE",
        "name": "Megan Lieu\nMegan Lieu",
        "content": "I’m a quitter.\n\nI quit one job in 6 months.\nI quit another one in 9 months.\nI’ve quit new year resolutions already.\nI’ve quit relationships that became unhealthy.\n\nBut here’s the thing: quitting doesn’t mean failure.\n\nWhen we convince ourselves to stick with things that no longer serve us just because we’ve already invested time and money…\n\nThat’s classic sunk cost fallacy.\n\nFor each one of these “failures”, I’ve always found something better next.\n\nJobs that were better for mental health.\nJobs with better growth opportunities.\nGoals that were more worth my time.\nRelationships that were healthier.\n\nTime and time again, I’ve realized this:\n\nQuitting is deciding you deserve better.\n\n️ Reshare this for someone who needs to hear it!",
        "reactions": {
          "likes": "392\nBalavignesh Sampathkumar and 391 others",
          "comments": "75 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": " Quitting something always feels scary in the moment. But when you trust yourself and your gut instincts, you'll realize the payoff is always worth the discomfort in the beginning.",
            "userName": "Megan Lieu",
            "userProfileURL": "https://www.linkedin.com/in/meganlieu",
            "dataId": "urn:li:comment:(activity:7292186730252697600,7292187196717957120)"
          },
          {
            "commentText": "Megan Lieu I agree 1000%. There’s a stigma associated‘quitting’ that pressures so many of us to stay in situations longer than we should.",
            "userName": "Sharifa Honoré, MSc., BBA.",
            "userProfileURL": "https://www.linkedin.com/in/sharifahonore",
            "dataId": "urn:li:comment:(activity:7292186730252697600,7292194549668466688)"
          },
          {
            "commentText": "Quitting isn’t failure, it’s making space for something better. I’ve definitely held onto things longer than I should have, just because of time or effort already invested. ",
            "userName": "Mostyn Wilson",
            "userProfileURL": "https://www.linkedin.com/in/mostynwilson",
            "dataId": "urn:li:comment:(activity:7292186730252697600,7292190283142684672)"
          },
          {
            "commentText": "Mostyn Wilson YES, 100%!!",
            "userName": "Megan Lieu",
            "userProfileURL": "https://www.linkedin.com/in/meganlieu",
            "dataId": "urn:li:comment:(activity:7292186730252697600,7292191470596358145)"
          },
          {
            "commentText": "Mostyn Wilson Every (Good) yes is defended it by a thousand No's - It is imperative to walk away / say NO when needed to be! ",
            "userName": "Bilal Ahmed S.",
            "userProfileURL": "https://www.linkedin.com/in/siddiquibilalahmed",
            "dataId": "urn:li:comment:(activity:7292186730252697600,7292193625331892225)"
          }
        ],
        "commentAdded": "Absolutely! Embracing the power of quitting can lead to greater opportunities and personal growth. It’s all about prioritizing our well-being! 💪"
      }
    ],
    "errors": [
      {
        "postId": "urn:li:activity:7292199088605868035",
        "url": "https://www.linkedin.com/in/manojkondreddygari?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAC9N8wUB6nK99FI9QPm5qrwC-WnYpdjzAbQ",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292178716338622467",
        "url": "https://www.linkedin.com/company/swiggy-in/posts",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292195583606308864",
        "url": "https://www.linkedin.com/groups/762547?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A762547-7292195582717100033",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292158006702620672",
        "url": "https://www.linkedin.com/company/appfoster/posts",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292195341922091008",
        "url": "https://www.linkedin.com/in/sheetal-shally-bajaj-7a4743208?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADTKcKwBIGjW33Vi9Uyu9DvL6m45g2NHjYo",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292166668166811648",
        "url": "https://www.linkedin.com/in/remy-takang-arrey-capa-ll-m-msc?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAbC5IMBgfUSkwu8VOAD0E09fhDCFt_DifA",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292188473216643072",
        "url": "https://www.linkedin.com/in/meganlieu?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABkqOT4BoJ5ABwTuUsh5DxW7oJYSSQiOquE",
        "errors": [
          "Failed to fetch media URL."
        ]
      }
    ]
  }
]