{
  "posts": [
    {
      "postId": "urn:li:activity:7285611772084920320",
      "url": "https://www.linkedin.com/in/garettm?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAxhx8oBrMrQ4Rb6q9ZLv7KibK_ydWLFZCE",
      "name": "Garett Moreau 🇺🇸\nGarett Moreau 🇺🇸",
      "content": "DIGITAL LOOTERS: Cybersecurity experts at Veriti have identified numerous newly registered domains closely linked to the LA fires. \n\nThese domains, such as “malibu-firecom” and “fire-reliefcom,” mimic legitimate services.\n\nThey entice unsuspecting victims with promises of fire evacuation assistance, recovery permits, and even fire coverage.",
      "reactions": {
        "likes": "2",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": []
    },
    {
      "postId": "urn:li:activity:7285650801224466432",
      "url": "https://www.linkedin.com/in/gbrentbarkin?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAI5v54B8OquVDdHfjnHpuC9Ga3eD6YsXtk",
      "name": "G. Brent Barkin\nG. Brent Barkin",
      "content": "Continuing the 2025 post series with post number 6.\n\nTypically, my posts are about marketing or retail. After all, I have been in the retail industry off and on for over 30 years, with marketing as my main focus during that period and I run a firm that brings together companies and athletes to effectively market their products and services.\n\nBut today I am going to post about food safety. I know, right? What does this guy know about food safety? Admittedly much less than I should as a parent. What limited amounts I know mostly comes from being a parent to a child with Celiac's disease, which will affect her entire life, especially if untreated. When she was not treated (because we didn't know) she was in the 10th percentile height and even lower in weight relative to her peers. Today, treated, she is nearly at the 50th percentile in height, still below average in weight but certainly in the healthy weight range for her age.\n\nOne of the things I love about my daughter is how, at 8 years old, she is hyper-involved in her eating choices. Even this morning she insisted I show her the milk carton to prove to her that there was no gluten in milk. I laughed when I showed it to her of course, but stopped laughing later when I searched and found this: \"Plain cow's milk is naturally gluten-free, but flavored milks and other dairy products may contain gluten. It's important to read the label to check for gluten.\" My daughter is on to something.\n\nAnd so yesterday I heard that the FDA was banning red dye #3 from all foods and that by January 2027- that's right, two years from now, it has to be gone. Drug makers, including those making ADD medicine for children, have another year to comply.\n\nThe part that stunned me about this announcement was that the same FDA which oversees the food industry prohibited the cosmetic industry from using red dye #3--not making this part up--30 years ago. No one has been allowed to put this on their face since the 90's, but today children eating up to 100mg of synthetic food dyes A DAY is not unheard of.\n\nMany of the food companies have argued the risk is very small. But those risks are underplayed because the statement has always been that the doses would have to be massive, sustained over years and present in nearly all foods to put someone at risk.\n\nBut synthetic food dyes are in nearly every children's cereal, candy, and medicine. And the FDA has known that at least one of them was proven to cause cancer in laboratory mice, and has known this since 1990. And has failed to act. Glad they finally chose to do so.\n\nGoing to start being even more careful about what we buy for the kids.",
      "reactions": {
        "likes": "11\nG. Brent Barkin and 10 others",
        "comments": "2 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "If it sells from a shelf in a box or bag, it likely has ingredients that aren’t good for you. So 90% of the grocery store.",
          "userName": "Jarrett McCraw",
          "userProfileURL": "https://www.linkedin.com/in/jarrettmccraw",
          "dataId": "urn:li:comment:(activity:7285650801224466432,7285672839427362817)"
        },
        {
          "commentText": "It is really amazing how much of our food has dye and unnecessary additives. Hopefully we will see changes soon in what is allowed in our food.",
          "userName": "Aaron Hudgins",
          "userProfileURL": "https://www.linkedin.com/in/aaronhudgins",
          "dataId": "urn:li:comment:(activity:7285650801224466432,7285660414036570112)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7285719425255723008",
      "url": "https://www.linkedin.com/in/kendraberner?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAA0uq8kBmqn0noW3h_TjY0frHau90VJjYa4",
      "name": "Kendra Berner\nKendra Berner",
      "content": "It’s around 60 days since joining Nooks, and while I’m still drinking from the fire hose, I'm so happy to share that several experiences have already reaffirmed that joining Nooks was a fantastic decision...\n\n-Ran one of our first team meetings last week, and at the end of the call, a rep spoke up to say “can we all just hang on for a little longer to catch up? It feels so nice to have a true team.” Cue everyone popcorning an answer to their favorite celebratory cocktail/mocktail \n\n-We had a mix up on an account (we all know duplicate records happen) and instead of having to diffuse a situation between two reps on the same team over an active opportunity, the AEs had already slacked each other, handled the situation assuming positive intent, and traded accounts.\n\n\n-During a leadership meeting, a gap in our current process came to light. I received an invite to brainstorm a solution with supporting documentation within a day turnaround. The pace here of problem solving is truly rocketship level!\n\nWhat a dream team we have at @Nooks.I'm feeling really lucky!\n\nPs. Our Enterprise team is hiring, alongside plenty of other roles at Nooks. Would love to connect!",
      "reactions": {
        "likes": "76",
        "comments": "7 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "couldn't be more excited to be apart of this team and for what's ahead!",
          "userName": "Ryan Tettemer",
          "userProfileURL": "https://www.linkedin.com/in/ryan-tettemer-3b02a4b4",
          "dataId": "urn:li:comment:(activity:7285705577349922816,7285718417884499969)"
        },
        {
          "commentText": " ",
          "userName": "Elizabeth Jortberg",
          "userProfileURL": "https://www.linkedin.com/in/elizabeth-jortberg-124129134",
          "dataId": "urn:li:comment:(activity:7285705577349922816,7285719573763444738)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7285647735951667200",
      "url": "https://www.linkedin.com/in/daniel-goodman2001?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAeS6L0BdHsGXRto-nWwwPVPt8hNYJ4niZI",
      "name": "Dan Goodman\nDan Goodman",
      "content": "VP of Engineering wrongly put on PIP and terminated after 10 years of employment. Increases severance from $24k to $126k or 423%.\n\nI consulted with a truly impressive and highly intelligent engineering leader named Shaun. He was targeted with a wrongful termination by a new leader who recently joined the company. This after the departing leader recommended Shaun for the role.\n\nShaun was put on a ridiculous and underserved PIP after having received nothing but the highest possible performance reviews during his entire 10-year tenure.\n\nOf course, Shaun beat every measurable metric in the PIP as the PIP was designed to embarrass and demean him so that he would leave, not to improve or retain. Shaun was terminated within a few weeks of beating the PIP based on subjective, immeasurable untruths.\n\nCan you imagine putting this guy on a PIP.  Just disgusting, but a tool used by tools to manage older workers out of the business and to justify their termination if they don’t leave on their own.\n\nTo make matters worse, if possible, they pressured him to sign the severance by offering only 5 days to do so. Despite being over 40 years old and entitled to 21 days to review the agreement by federal law.\n\nLuckily Shaun came across my LinkedIn profile before his 5 days was up and was relieved to hear that he would get 21 days and that my services existed to help him.\n\nShaun did a great job working with us in putting together a very compelling, shameful and frankly therapeutic document allowing him to state his truthful narrative and show the employer why it was in their best interest to resolve his separation amicably.\n\nThey agreed and we had one of the smoothest negotiations to date.\n\nRound 1: $24k ️ $68k\nRound 2: $68k ️ $102k\nRound 3: $102k ️ $126k\n\nShaun was satisfied and accepted the offer without ever hearing no. He was grateful for our support and amazed at our service, having received an ROI of 9623% on his initial investment with us.\n\nShaun can put the situation behind him and look back on the positive things that he is proud of during his tenure and not how he was discarded.",
      "reactions": {
        "likes": "137",
        "comments": "30 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "PIPs should be eliminated. They are often used to intimidate whistleblowers and employees who report bad behavior by management, instead of helping employees improve.\n\nHuman Resources should also be required to stay neutral. They should only interact with leadership or management when a third party is involved to prevent favoritism or bias.\n\nA family member who worked in HR for many years until she decided to move over to Recruitment instead, has always advised not to trust everyone at work especially Human Resources as their job is to protect the company and not the employer. I now share the same message to my Gen Z nieces and nephews.",
          "userName": "Xiomara N.",
          "userProfileURL": "https://www.linkedin.com/in/xycnolasco",
          "dataId": "urn:li:comment:(activity:7285647735951667200,7285712733969252352)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7285603113447673856",
      "url": "https://www.linkedin.com/in/komal-porwal?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAEMd5TQBtMmDwgvpXe73zG592aFYpIGIEbs",
      "name": "Komal Porwal\nKomal Porwal",
      "content": "According to research, AI will remove banking jobs in the coming years.\n\nThe drawbacks are that many people will lose their jobs.\n\nBut at least AI wouldn’t take long lunch breaks at SBI, which is the only reason for happiness. ",
      "reactions": {
        "likes": "394",
        "comments": "31 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "The rise of AI in banking is undeniable. From fraud detection to loan approvals, AI-powered systems are delivering speed and precision that humans struggle to match. But here’s the flip side—these advancements may come at the cost of traditional banking jobs.\n\nRoles in data entry, credit analysis, and even customer service are being automated at a rapid pace. Does this mean AI will replace bankers? Not entirely. While automation will likely eliminate repetitive tasks, it also creates demand for roles requiring critical thinking, ethical judgment, and strategic decision-making—skills that AI can’t replicate (yet).\n\nThe shift is inevitable, but it’s not all doom and gloom. Upskilling and adapting to this new reality will be the key to staying relevant in the banking industry.",
          "userName": "Dhananjay Agarwal",
          "userProfileURL": "https://www.linkedin.com/in/idhananjayagarwal",
          "dataId": "urn:li:comment:(activity:7285599026584899586,7285718781354487808)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7285677293564272640",
      "url": "https://www.linkedin.com/in/ezxpo?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAIjGYB6b_NDVVPDgshQzRZBv-z3gmsaT0",
      "name": "Matt Fok\nMatt Fok",
      "content": "Why Join AI Digital Health Network Now?\n\nThe AI Digital Health Network is revolutionizing the healthcare industry by connecting professionals, innovators, and patients globally. It’s your gateway to cutting-edge tools, ongoing collaboration, and unprecedented cost savings—all designed to transform care delivery.\n\n3 Key Benefits of Joining Today\n1️⃣ Global Connections, Anytime, Anywhere\n\n Engage with a worldwide community of healthcare leaders, innovators, and stakeholders through 24/7 virtual expos, summits, and Smart Communities.\n Collaborate in real-time to drive innovation and partnerships that change lives.\n\n\n2️⃣ Save Big While Scaling Fast\n Save 80% or more compared to traditional marketing, expos, and operational costs with our all-in-one platform.\n Accelerate ROI with AI-powered tools like AI-SEO, AI-Social, and AI-Chatbot for greater visibility and impact.\n\n\n3️⃣ Innovation Without Limits\n Tap into AI-powered analytics and tools to deliver personalized care, optimize workflows, and make data-driven decisions.\n Experience a 24/7 Virtual CES for Digital Health, breaking barriers of time, space, and accessibility.\n\n\n Join the Movement Now and become part of the healthcare revolution! ",
      "reactions": {
        "likes": "3",
        "comments": "1 comment",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Great opportunity.",
          "userName": "CHESTER SWANSON SR.",
          "userProfileURL": "https://www.linkedin.com/in/chester-swanson-sr-087a1514",
          "dataId": "urn:li:comment:(ugcPost:7285677293136474114,7285681193847599104)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7285658880070594560",
      "url": "https://www.linkedin.com/in/bobobrien4?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAEzlOcBPrVNISBmIQReiy0L6otkZq_Ni-0",
      "name": "Bob O'Brien\nBob O'Brien",
      "content": "Congratulations to all selected on the Army principal and alternate command and key billet lists today. Thank you Joe Byerly (From The Green Notebook ) for this article to help the Army better understand the.\n\nCongratulations and thank you also to all who opted-in to compete for these jobs. Be on the lookout for your executive coaching invitations later this month. You will receive your Detailed Feedback Reports by March.",
      "reactions": {
        "likes": "23",
        "comments": "2 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Appreciate all the hard work you, Mike Yates, and the CAP team put into this invaluable program.",
          "userName": "Bobby Sidell, Psy.D., ACC",
          "userProfileURL": "https://www.linkedin.com/in/bobby-sidell-psy-d-acc-875b56228",
          "dataId": "urn:li:comment:(activity:7285658880070594560,7285714887287144450)"
        },
        {
          "commentText": " ",
          "userName": "Katherine Kuzminski",
          "userProfileURL": "https://www.linkedin.com/in/katherine-kuzminski-426b8214",
          "dataId": "urn:li:comment:(activity:7285658880070594560,7285662109688819712)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7285687474842988547",
      "url": "https://www.linkedin.com/in/anthonywentzel?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADZN2sBr5ZUAlKZK2QwVQvOE9B6pnFHXt8",
      "name": "Anthony Wentzel\nAnthony Wentzel",
      "content": "Be passionate about what you do.\n\nOur brick was installed over the past weekend and has been placed in the 2000-2009 section.\n\nI have attached a photo of it.\n\nGraduated University of Kentucky Magda cum Laude in 2004.\n\nWe continue to support the Pathway of Innovation as it supports our UKEAA Scholarship Fund!\n\nGo Cats!",
      "reactions": {
        "likes": "2",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": []
    },
    {
      "postId": "urn:li:activity:7285227285341712384",
      "url": "https://www.linkedin.com/company/appfoster/posts",
      "name": "Appfoster\nAppfoster",
      "content": "Join us in welcoming Troy Hipolito as the new President of Appfoster. With his exceptional leadership skills and innovative vision, we’re set to chart new territories and reach greater heights together.\n\nWe’re thrilled to have such a dynamic leader on board and look forward to an inspiring journey ahead and making\na beacon of innovation. Welcome, Troy!!",
      "reactions": {
        "likes": "23",
        "comments": "4 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Wow, a new president! Huge congrats to Troy Hipolito and Appfoster! Excited to see what innovative wonders you create! ",
          "userName": "Anu Sharma",
          "userProfileURL": "https://www.linkedin.com/in/anusharmagrowth",
          "dataId": "urn:li:comment:(activity:7285227285341712384,7285317923252903940)"
        },
        {
          "commentText": "Thank you so much for the warm welcome. I’ve been working with you guys for the past year or two. \n\nWe’ve done some phenomenal work and will continue to make things happen.\n\nI appreciate the opportunity to grow with you.",
          "userName": "Troy Hipolito",
          "userProfileURL": "https://www.linkedin.com/in/troyhipolito",
          "dataId": "urn:li:comment:(activity:7285227285341712384,7285640479046553601)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7284711395609231360",
      "url": "https://www.linkedin.com/in/jordanwilson04?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAF2EO0BaXka5PmlTSX3i8IwsUXlKIDb8ik",
      "name": "Jordan Wilson\nJordan Wilson",
      "content": "Which version of ChatGPT do you use? ",
      "reactions": {
        "likes": "18",
        "comments": "31 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "I use the free version cuz so far everything I need is included.",
          "userName": "Scott Marker",
          "userProfileURL": "https://www.linkedin.com/in/scottmarker1",
          "dataId": "urn:li:comment:(ugcPost:7284711394770395136,7284729163872194561)"
        },
        {
          "commentText": "Scott the free version has DEFINITELY improved tenfold the past 6 months.",
          "userName": "Jordan Wilson",
          "userProfileURL": "https://www.linkedin.com/in/jordanwilson04",
          "dataId": "urn:li:comment:(ugcPost:7284711394770395136,7284740132509831169)"
        },
        {
          "commentText": "I am one of the $200 users and after using it I am dropping that subscription after just a month. the unlimited tokens was great but outside of that i had to go to Claude to get the accurate responses I wanted. if you don't need endless tokens its just not going to be worth it imo.",
          "userName": "Derrek Chilson",
          "userProfileURL": "https://www.linkedin.com/in/derrekchilson",
          "dataId": "urn:li:comment:(ugcPost:7284711394770395136,7284730704624517121)"
        },
        {
          "commentText": "Derrek makes sense. I usually shuffle between o1 mini and o1 pro. Haven't had many issue w/ struggling to remember anything from previous chats. especially w/ the longer context ",
          "userName": "Jordan Wilson",
          "userProfileURL": "https://www.linkedin.com/in/jordanwilson04",
          "dataId": "urn:li:comment:(ugcPost:7284711394770395136,7284748128337936384)"
        },
        {
          "commentText": "Jordan Wilson you are making the right move with the 20 a month. Maybe in a couple of months when the agents are available and they got that new 03 model out it will be worth it but I'm thankful all the good stuff is available at an affordable rate.",
          "userName": "Derrek Chilson",
          "userProfileURL": "https://www.linkedin.com/in/derrekchilson",
          "dataId": "urn:li:comment:(ugcPost:7284711394770395136,7284753200417505280)"
        }
      ]
    }
  ],
  "errors": [
    {
      "postId": "urn:li:activity:7285611772084920320",
      "url": "https://www.linkedin.com/in/garettm?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAxhx8oBrMrQ4Rb6q9ZLv7KibK_ydWLFZCE",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285650801224466432",
      "url": "https://www.linkedin.com/in/gbrentbarkin?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAI5v54B8OquVDdHfjnHpuC9Ga3eD6YsXtk",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285719425255723008",
      "url": "https://www.linkedin.com/in/kendraberner?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAA0uq8kBmqn0noW3h_TjY0frHau90VJjYa4",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285647735951667200",
      "url": "https://www.linkedin.com/in/daniel-goodman2001?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAeS6L0BdHsGXRto-nWwwPVPt8hNYJ4niZI",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285603113447673856",
      "url": "https://www.linkedin.com/in/komal-porwal?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAEMd5TQBtMmDwgvpXe73zG592aFYpIGIEbs",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285677293564272640",
      "url": "https://www.linkedin.com/in/ezxpo?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAIjGYB6b_NDVVPDgshQzRZBv-z3gmsaT0",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285658880070594560",
      "url": "https://www.linkedin.com/in/bobobrien4?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAEzlOcBPrVNISBmIQReiy0L6otkZq_Ni-0",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285687474842988547",
      "url": "https://www.linkedin.com/in/anthonywentzel?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADZN2sBr5ZUAlKZK2QwVQvOE9B6pnFHXt8",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285227285341712384",
      "url": "https://www.linkedin.com/company/appfoster/posts",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7284711395609231360",
      "url": "https://www.linkedin.com/in/jordanwilson04?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAF2EO0BaXka5PmlTSX3i8IwsUXlKIDb8ik",
      "errors": [
        "Failed to fetch media URL."
      ]
    }
  ]
}