{
  "posts": [
    {
      "postId": "urn:li:activity:7287882912018890752",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287882912018890752",
      "url": "https://www.linkedin.com/in/dansalcius?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAQQRB0BhGf-sWGwq5X51yh5oxj2OWiVIkU",
      "name": "Dan Salcius\nDan Salcius",
      "content": "Remote work unlocks potential.\n\nJust a few examples:\n\n—> What gives expecting moms a chance to maintain their career?\n\nRemote work.\n\n—> What helps a family member work alongside their ailing parent?\n\nRemote work.\n\n—> What allows professionals in a small towns across America secure life-changing jobs?\n\nRemote work.\n\n—> What gives working professionals time to to exercise?\n\nRemote work.\n\n—> What allows families to save BIG money on monthly auto expenses?\n\nRemote work.\n\n—> What helps people with disabilities have equal access to high-paying careers?\n\nRemote work.\n\n—> What does all of these things while not harming productivity, innovation, or the bottom line?\n\nRemote work.\n\nWhat gives humans… Ok—I think you get the point.\n\nTHE POINT: There is no substitute for remote work in a modern society.\n\nAgree?",
      "reactions": {
        "likes": "4\nJon Leslie 🔵 and 3 others",
        "comments": "1 comment",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Louder for the people in the back.  ",
          "userName": "Catherine Boyd (Stamper)",
          "userProfileURL": "https://www.linkedin.com/in/catherinesboyd",
          "dataId": "urn:li:comment:(activity:7287882089889251328,7287883119645343744)"
        },
        {
          "commentText": "Well said Dan",
          "userName": "Kristin Rosado",
          "userProfileURL": "https://www.linkedin.com/in/kristinrosado",
          "dataId": "urn:li:comment:(activity:7287882089889251328,7287882566794129408)"
        }
      ],
      "commentAdded": "Absolutely agree! Remote work not only enhances flexibility but also fosters inclusivity and innovation in todays workforce. 🌍💼"
    },
    {
      "postId": "urn:li:activity:7287882247448248321",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287882247448248321",
      "url": "https://www.linkedin.com/in/joepanettieri?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAB09SIBUvVVuA1fFixlK9O6AI9P00Q8eyo",
      "name": "Joe Panettieri\nJoe Panettieri",
      "content": "Good Wednesday morning. Here is today's \nhashtag\n#sustainableIT and \nhashtag\n#ClimateTech news for technology partners. Updates from Sustainable Tech Partner for January 22, 2025 include:\n\n1. Sustainable IT Services at Davos 2025:, a non-profit organization, is hosting multiple initiatives at\n. A delegation of 35 CIOs, CTOs, CDOs, and Chief AI Officers will promote sustainable and responsible\npractices at the event. Special thanks tofor continued updates from the organization.\n\n2. Talent: Former\nhas joined theboard of directors. UNCAGED is the \"first biomaterial company creating sustainable leather from grains,\" the company asserts.\n\n3. Expansion - CSRD Consulting Services:, a developer of\nand Environmental Health and Safety (\n) compliance software, has doubled its European headcount -- though actual headcount figures were not disclosed. Among the key priorities: Assisting customers with Corporate Sustainability Reporting Directive (\n) compliance solutions, the company said.\n\n4. Honor:has namedas the World’s Most Sustainable Corporation for 2025.\n, the only two-time honoree, previously topped this annual list in 2021.\n\n5. EV Charger Technology:has launched Schneider Charge Pro in Europe, a \"robust, energy-efficient electric vehicle (EV) charging solution to accelerate\nadoption among owners of commercial fleets and multifamily residences,\" the company said.\n\n6. Startup Funding - Carbon Accounting Software:, a provider of enterprise\nand energy management software, has raised $13 million in\n.led the round, with participation from existing investors,\n, and, along with new investors,, and\nVenture Capital.\n\n7. Investment - AI Software:is investing another $1 billion in\nrival, thereported.\n\n8. M&A - IT Services and Quantum Computing:has acquired, a security company that claims to offer solutions that mitigate emerging\nrisks. Quantum computing, still in its infancy, may allow researchers to tackle complex problems to cure diseases, improve energy efficiency and far more.\n\n9. M&A - Asset Leasing:has acquired, an asset leasing business. The deal is part of KKR's Global Climate strategy -- which focuses on\nsolutions.\n\nGet deeper details and links to source materials in our complete daily report:",
      "reactions": {
        "likes": "9",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Great insights on the sustainable tech landscape! Exciting developments, especially in EV solutions and corporate sustainability! #sustainableIT #ClimateTech"
    },
    {
      "postId": "urn:li:activity:7287604898160877568",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287604898160877568",
      "url": "https://www.linkedin.com/in/ezxpo?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAIjGYB6b_NDVVPDgshQzRZBv-z3gmsaT0",
      "name": "Matt Fok\nMatt Fok",
      "content": "From Pledges to Progress: How AI Bridges Davos’ Execution Gap \n\n Davos 2025’s promises need more than goodwill—they need AI-driven ecosystems.\nVirtual 'DAVOS' accelerates impact by:\n\n AI Crowdfunding: Dynamically route funds to high-impact projects (e.g., drought-resistant crops, vaccine equity) using predictive need models.\n Language-Agnostic Collaboration: AI-Chatbot breaks barriers, letting farmers in Kenya debate policy with CEOs in Zurich—in real time.\n Ecosystem Learning: AI analyzes 10,000+ NGO reports to identify best practices, scaling what works globally.\n\nWhen Davos’ vision meets AI’s precision, breakthroughs follow.",
      "reactions": {
        "likes": "3",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Exciting insights! Harnessing AI for real-time collaboration and impactful funding is a game changer for global challenges. Lets drive progress together!"
    },
    {
      "postId": "urn:li:activity:7287851859472531459",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287851859472531459",
      "url": "https://www.linkedin.com/in/courtneyturich1?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAALzytwB7yaYdzNaRJ5DfBf2Nakbrc4djDw",
      "name": "Courtney Turich✨\nCourtney Turich✨",
      "content": "Traveling isn’t easy these days…\n.\n.\nBut a necessary for many of us…\n\nEspecially for us in medical sales\nUnpredictable long days\nTime away from family\nPhysical exhaustion\nLack of routine\nFood on the go\nBasic hotels\n\nThe glamour does not exist\n\nOn the flipside it shakes things 🆙\nNew customer opportunities\nSeeing is believing (ex: Amma)\nBreak from routine\nProfessoonal wins\nPersonal growth\nCompany perks\n\nWhile I’m on the road, I’m fortunate\nTo have the BEST travel buddy\n\nAmma\n\nAtwe HELP\nCancer patients minimize chemo Hairloss during a difficult time\n\nThis isn’t VANITY, it’s about…\n\nMAINTAINING A SENSE OF SELF\nIDENTITY\nPRIVACY\n\nSo if YOU see Amma and myself\nWalking through your airport\nGive us a quick HELLO\nWe are on a mission\n\nDo you know about scalp cooling?\n\nWe’re growing like crazy,\nCome check us out!\n\nBe Bold. Be Confident. Be You\n\nCourtney\n\n—————\nFor more ways to be with fun, follow",
      "reactions": {
        "likes": "60",
        "comments": "31 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "That's one tidy package there, Courtney Turich",
          "userName": "✒️Claire M. Davis🖋️",
          "userProfileURL": "https://www.linkedin.com/in/clairemdavis",
          "dataId": "urn:li:comment:(activity:7287848399188471808,7287851848269500417)"
        },
        {
          "commentText": "️Claire M. Davis️ YES! She is small and MIGHTY! Different than anything on the market!!!",
          "userName": "Courtney Turich✨",
          "userProfileURL": "https://www.linkedin.com/in/courtneyturich1",
          "dataId": "urn:li:comment:(activity:7287848399188471808,7287852827144540160)"
        }
      ],
      "commentAdded": "Inspiring journey, Courtney! 🌟 Love how you’re turning challenges into growth. Here’s to making a difference—keep shining with Amma! 💪✨"
    },
    {
      "postId": "urn:li:activity:7287851005818388481",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287851005818388481",
      "url": "https://www.linkedin.com/in/douglas-brown-b3740825a?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAD_GzFsBd73zYL6XkWMw1-EiqRJ_mhF7J18",
      "name": "Douglas Brown\nDouglas Brown",
      "content": "HR Executive wrote an article recently titled \"Hiring and retention in 2025: What is the secret ingredient?\" Available On Line\n\nSo -How do we build trust and relationships. I would suggest there are many ways- improving communication through regular 1:1 s, understanding and supporting employee personal needs, recognizing and appreciating employee efforts and achievements, ensuring psychological safety so employees can speak openly and honestly about what's on their mind and share their opinions ....\n\nRemember the direct manager has a critical role to play in cultivating strong relationships and building strong relationships.",
      "reactions": {
        "likes": "0",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Great insights! Trust and communication are vital. Investing in direct manager relationships can truly enhance employee satisfaction and retention."
    },
    {
      "postId": "urn:li:activity:7287878242949115904",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287878242949115904",
      "url": "https://www.linkedin.com/in/manujaggarwal?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAMY_wBiA538UlzNcv3ls30NXdjZZ2cT2c",
      "name": "Manuj Aggarwal\nManuj Aggarwal",
      "content": "Tomorrow, I’m hosting a LinkedIn Live Ask Me Anything to help you cut through the confusion and find real opportunities with AI.\n\n Date: 23 January\n⏰ Time: 2 PM PST\n\nBring your questions and let’s get straight to the solutions you need.\n\nDon’t miss it!\n\nOne day to go!\n\nMark your calendar now!\n\nRegistration link in first comment.",
      "reactions": {
        "likes": "1 comment",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Register here- https://www.linkedin.com/events/askmeanything-literally-openfor7285359846923628544/theater/ ",
          "userName": "Manuj Aggarwal",
          "userProfileURL": "https://www.linkedin.com/in/manujaggarwal",
          "dataId": "urn:li:comment:(activity:7287878242949115904,7287878293675032576)"
        }
      ],
      "commentAdded": "Excited for this! AI is transforming our landscape—can’t wait to hear your insights. Let’s unlock those opportunities together! 🚀"
    },
    {
      "postId": "urn:li:activity:7287874156623265793",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287874156623265793",
      "url": "https://www.linkedin.com/in/isarmeitis?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAMB50B_3NCLMZCvxrShlDeX2sL4TyWZBs",
      "name": "Isar Meitis\nIsar Meitis",
      "content": "Too much data, not enough time? \nTurn hours of research into minutes with AI. Here’s how: \n\nFor years, Google was my go-to tool—but then I discovered something better.\nAI tools like,, and Gemini Deep Search have completely changed how I find, analyze, and use information.\n\nHere’s how they’ve redefined my approach to research and synthesis:\n→ The basic tasks? I still use tools like ChatGPT to keep things conversational and context-aware. It understands what I’m working on and helps refine my queries in real-time.\n\n→ For deeper dives, I lean on Perplexity—my most-used tool. It’s fast, intuitive, and delivers concise answers to even the most complex questions. When I need something more detailed, I turn to, which breaks queries into multiple research angles, scans up to 150 sources, and compiles a thorough report. It takes a little longer but provides unmatched depth.\n\n→ Then there’s Gemini Deep Search—perfect for massive data uploads. With its 2-million-token capacity (equivalent to about 1.5 million words!), I can summarize entire datasets or documents and format the output however I need.\n\nOnce I’ve found what I’m looking for, AI helps me share insights effortlessly:\n→ Notebook LM summarizes information, generates Q&A documents, and even turns content into podcasts for on-the-go learning.\n→ Perplexity Pages lets me transform search results into shareable webpages.\n\nSo, What’s the Takeaway?\n\nAI has made research faster, smarter, and more actionable.\nWhether it’s digging into RFPs, summarizing market trends, or making data-driven decisions, these tools are more than just helpful—they’re transformational.\n\nIf you want to start learning how to harness AI for your business\nJoin Cohort #10 of the AI Business Transformation Course starting February 17:\n️ 4 Mondays, 12-2 PM ET\n Learn how to use tools like Perplexity, Gemini, and more to transform data into strategy and more!\n\nJoin hundreds of professionals who’ve already revolutionized their businesses with this course.\nLet’s make 2025 the year AI becomes your competitive edge.",
      "reactions": {
        "likes": "3",
        "comments": "1 comment",
        "shares": "0"
      },
      "mediaUrl": "blob:https://www.linkedin.com/d7d8bb08-8425-46a4-8722-69b7d3f7c87d",
      "comments": [
        {
          "commentText": "Learn more about the AI Business Transformation Course here: https://multiplai.ai/ai-course/ ",
          "userName": "Isar Meitis",
          "userProfileURL": "https://www.linkedin.com/in/isarmeitis",
          "dataId": "urn:li:comment:(ugcPost:7287871053706493954,7287878223726608384)"
        }
      ],
      "commentAdded": "Exciting insights! AI truly is a game-changer for research. Cant wait to see how it transforms our strategies in 2025! 🚀"
    },
    {
      "postId": "urn:li:activity:7287882996236304385",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287882996236304385",
      "url": "https://www.linkedin.com/in/vonda-george?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAACZKNIBOsESvjGHIoDMi4UleigUWi74z8c",
      "name": "Vonda George\nVonda George",
      "content": "Rethinking Creditworthiness: The Challenge of Modern Risk Assessment\n\nAssessing creditworthiness has always been at the heart of a loan officer’s role—but in today’s financial landscape, this task is becoming increasingly complex.\n\nFor clients with limited credit histories or inconsistent income streams, traditional methods of evaluation often fall short. These gaps can leave deserving individuals underserved while increasing risk for financial institutions.\n\nThe Challenge:\n️ Limited credit histories make it hard to rely on conventional scoring models.\n️ Gig economy workers, freelancers, and others with fluctuating incomes don’t fit neatly into traditional lending criteria.\n️ The pressure to maintain loan portfolio quality while expanding access means balancing risk and opportunity.\n\nThe Opportunity:\nInnovative tools like risk rating systems and alternative scoring models are helping institutions make smarter, more inclusive lending decisions. These solutions incorporate data beyond traditional credit scores, such as cash flow analysis, payment behaviors, and even AI-driven predictive analytics.\n\nHow is your institution leveraging these tools?\n️ Are you exploring new risk models to expand access responsibly?\n️ What strategies have worked to balance innovation and regulatory compliance in this space?\nLet’s share insights and ideas—together, we can pave the way for smarter, more inclusive lending practices.",
      "reactions": {
        "likes": "12",
        "comments": "9 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "This is such an interesting topic, Vonda.  I’ve seen how traditional models often fall short, especially for freelancers and gig workers with inconsistent incomes. I love how you highlighted the opportunity for smarter, more inclusive lending through tools like cash flow analysis and AI-driven models.",
          "userName": "Ed Kang (RODC)",
          "userProfileURL": "https://www.linkedin.com/in/edkang99",
          "dataId": "urn:li:comment:(activity:7287875414738305024,7287883000854261762)"
        },
        {
          "commentText": "This is a crucial conversation! As the financial landscape shifts, integrating alternative data sources and AI-driven models is becoming essential for expanding access while managing risk responsibly.",
          "userName": "Steven Ferguson",
          "userProfileURL": "https://www.linkedin.com/in/sferguson0352",
          "dataId": "urn:li:comment:(activity:7287875414738305024,7287881927930392579)"
        }
      ],
      "commentAdded": "Great insights! Embracing alternative scoring models is key. Lets continue sharing strategies to enhance inclusivity in lending. #FinancialInnovation"
    },
    {
      "postId": "urn:li:activity:7287818325152157696",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287818325152157696",
      "url": "https://www.linkedin.com/in/sara-simmonds-38691612?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAKgh5YBVCEtOJl9bSwm2687-JWJxhxgi7U",
      "name": "Sara Simmonds\nSara Simmonds",
      "content": "My No 1 rule? Don't do it alone...\n\nAnd ... don't hire people without a system\n\nHere is what I mean: For more than 10 years I tried to do it alone, without investing in mentorship from experts with a system.\n\nThe result: I hired cheap people who knew less than me, and wasted my energy training them rather than being supported by them, sound familiar?\n\nAs a Founder I realised you have to become the all-round expert\n\notherwise, you make costly mistakes\n\nI know I did\n\nI hired sales teams, social media teams product teams, marketing teams lead funnel teams\n\nBut I didn't understand how these systems work.\n\nBecause as founders we are not born allrounders, we have to become allrounders.\n\nAnd as my Dad, my number 1 mentor shared with me\n\n\"Sara you don't know, until you realise you don't know.\"\n\nAnd sadly it was an expensive mistake to make\n\nI lost 100K \"investing\" in either staff I had to teach myself\n\nOr investing in agencies that made soulless promises and didn't deliver\n\nAnd the awful truth is I then ran out of money myself\n\nAll my capital is gone ...\n\nWhich I don't want to happen to you,\n\nMy mistake happened\n\nDue to not hiring expert mentors with a proven system\n\nI wasted 10 years\n\nAnd I then spent the next 3 years teaching myself the systems to be an expert in all areas:-\n\nPositioning\nProduct Offer\nSales\nMarketing\nBranding\nThought Leadership\n\nWhy?\n\nToday business is interconnected\n\nPurpose is interconnected\n\nSales are interconnected\n\nIf you want to sell and scale fast, all of the jigsaw puzzle of your business\n\nNeeds to be aligned\n\nAnd all of your team need to be aligned sharing your unique value with the world.\n\nHiring agencies just caused confusion.\n\nBecoming a mentor with a proven system\n\nAnd hiring mentors with a proven system\n\nHas been a game changer for my growth and the growth of my clients\n\nTo thrive today is about collaboration, and most importantly not being alone.\n\nIf you are ready to take the leap to build sustainable growth for your business, your team and your Impact.\n\nBook your 1-1 founder clarity call with me here -\n\nTogether we will transform our world\n\nLove Sara",
      "reactions": {
        "likes": "116",
        "comments": "58 comments",
        "shares": "0"
      },
      "mediaUrl": "blob:https://www.linkedin.com/a7f69444-cf30-406f-9080-f7cb2e92d75a",
      "comments": [
        {
          "commentText": "This is so relatable! Positioning, Offer, Systems and Sales are paramount. ",
          "userName": "Yash Kumar",
          "userProfileURL": "https://www.linkedin.com/in/yash-kumar-b9348b1a5",
          "dataId": "urn:li:comment:(ugcPost:7287805549344137216,7287818316755161090)"
        }
      ],
      "commentAdded": "Great insight, Sara! Collaboration and expert guidance are key to avoiding costly mistakes and driving sustainable growth. Lets connect!"
    },
    {
      "postId": "urn:li:activity:7287817832879296512",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287817832879296512",
      "url": "https://www.linkedin.com/in/hstorchak?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACkrGScB4K_wYNVVe2xY9KjEDaMzzSqPenI",
      "name": "Hlib Storchak\nHlib Storchak",
      "content": "Want a more efficient business?\nStart by letting go of battles that drain your focus.\n\nSome objections aren't worth fighting.\n\nLet me tell you why.\n\n Not every client is a fit.\nUnderstanding this saves time and energy.\n\n Focus on the willing.\nSpend your resources on those who see your value.\n\n Maintain your integrity.\nDon't compromise just to win an argument.\n\n Streamline your process.\nIdentify objections that are deal-breakers early on.\n\n Build stronger relationships.\nFocus on clients who align with your vision.\n\nIn business, efficiency matters most.\n\nThat's because:\n\n→ Without clarity, you lose direction.\n→ Without integrity, you lose respect.\n→ Without the right clients, you can't grow.\n→ Without focus, you spread yourself too thin.\n→ Without alignment, you face constant friction.\n\nGreat leaders know when to move on.\n\nThey recognize the value of their time.\n\nThey build a culture of mutual respect and understanding.\n\nSo, if you want to lead effectively,\nChoose your battles wisely.\n\nBecause when you do, everyone wins.\n\nAnd that, my friends, is the mark of a smart leader.\n\nWhat objections have you decided aren’t worth fighting?",
      "reactions": {
        "likes": "67",
        "comments": "59 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Spot on! Picking your battles saves time and energy for what truly matters. What's your 'not worth it' line in business?",
          "userName": "Neil Sarkar",
          "userProfileURL": "https://www.linkedin.com/in/neil-sarkar",
          "dataId": "urn:li:comment:(activity:7287757534659055617,7287817809366028289)"
        }
      ],
      "commentAdded": "Absolutely agree! Knowing when to let go is a sign of true leadership. Focused energy leads to stronger relationships and growth! 🌟"
    }
  ],
  "errors": [
    {
      "postId": "urn:li:activity:7287882912018890752",
      "url": "https://www.linkedin.com/in/dansalcius?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAQQRB0BhGf-sWGwq5X51yh5oxj2OWiVIkU",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287882247448248321",
      "url": "https://www.linkedin.com/in/joepanettieri?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAB09SIBUvVVuA1fFixlK9O6AI9P00Q8eyo",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287604898160877568",
      "url": "https://www.linkedin.com/in/ezxpo?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAIjGYB6b_NDVVPDgshQzRZBv-z3gmsaT0",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287851859472531459",
      "url": "https://www.linkedin.com/in/courtneyturich1?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAALzytwB7yaYdzNaRJ5DfBf2Nakbrc4djDw",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287851005818388481",
      "url": "https://www.linkedin.com/in/douglas-brown-b3740825a?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAD_GzFsBd73zYL6XkWMw1-EiqRJ_mhF7J18",
      "errors": [
        "Failed to fetch reactions.",
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287878242949115904",
      "url": "https://www.linkedin.com/in/manujaggarwal?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAMY_wBiA538UlzNcv3ls30NXdjZZ2cT2c",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287882996236304385",
      "url": "https://www.linkedin.com/in/vonda-george?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAACZKNIBOsESvjGHIoDMi4UleigUWi74z8c",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287817832879296512",
      "url": "https://www.linkedin.com/in/hstorchak?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACkrGScB4K_wYNVVe2xY9KjEDaMzzSqPenI",
      "errors": [
        "Failed to fetch media URL."
      ]
    }
  ]
}