{
  "posts": [
    {
      "postId": "urn:li:activity:7287155684201181184",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287155684201181184",
      "url": "https://www.linkedin.com/in/walterlcrosby?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABnRy4BfAi04dsWOrVfiDq5Fz8C2uALVWA",
      "name": "Walter Crosby\nWalter Crosby",
      "content": "As we head into the crucial final months of Q4, it's time to address a common challenge that may be holding your business back. Is your sales team living up to the expectations you set? \n\nFor many CEOs, accountability and sales team performance have been sources of frustration. Missed targets, unrealized potential, and revenue slipping through the cracks—it's a recipe for dissatisfaction.\n\nBut here's the game-changer: Fractional Sales Management.  This isn't just a solution; it's a transformation. It's the missing link you've been searching for, the key to creating a culture of accountability, delivering targeted sales coaching, and mastering pipeline management.\n\nThe power of transformation is within reach. Discover how Fractional Sales Management can elevate your sales team's performance. Watch this short but impactful video for insights that will reshape your Q4 and beyond. ",
      "reactions": {
        "likes": "1 comment",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Sales Teams of 7 or fewer are great candidates for Fractional Sales Management. We have programs to support a sales manager who might be struggling.",
          "userName": "Walter Crosby",
          "userProfileURL": "https://www.linkedin.com/in/walterlcrosby",
          "dataId": "urn:li:comment:(activity:7287155684201181184,7287155686784880641)"
        }
      ],
      "commentAdded": "Great insights! Fractional Sales Management could truly be the catalyst for raising accountability and performance in sales teams. Looking forward to the video!"
    },
    {
      "postId": "urn:li:activity:7287106668981583872",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287106668981583872",
      "url": "https://www.linkedin.com/in/alex-turnbull-1ab9992?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAACAYtMB_ahNSSaY_yym6KikVRWc-UeBn6s",
      "name": "Alex Turnbull\nAlex Turnbull",
      "content": "Last week, I wired $2.7M to buy back control of my companies. Not from investors, not from an agency–from a partner who'd joined just last year. \n\nThose 8 digits hitting their account marked the final chapter of my 10-year, $5.2M journey to 92% ownership of Groove and Helply.\n\nIt started with the classic partnership playbook.\n\nFirst the vision: \"We'll scale this together, take it to new heights.\"\n\nThen reality: Our paths just weren't aligned.\n\nNo hard feelings–just a $2.7M reminder that sometimes the best partner is yourself.\n\nIt was a heavy wire to send.\n\nBut, it made me reflect on what really matters: shared control and true ownership.\n\nBecause here's something partners don't seem to understand:\n\nI've spent 10 years buying back $5.2M in equity because I believe in running this my way.\n\nI'm not building for exits. I'm building for my family.\n\nWe're wildly profitable (50%+ EBITDA), growing steadily (without the unicorn chase), and delivering exactly what I want ($5M ARR, complete control, zero pressure). That's the whole point.\n\nIf you're running a profitable bootstrapped SaaS business in 2025, you can choose your path.\n\nIn today's world, if you can grow sustainably–you don't need anyone's permission to build it your way.\n\nWhen your timeline is generational, you can either chase other people's dreams or buy back every single percentage point until it's truly yours. I choose ownership. I choose family.\n\nI choose the long game.\n\nIn this market, partnership offers mean nothing if you're building for your children's children.\n\nHere's to another 10, 20, 30 years of grinding–my way, at 92% ownership and counting.",
      "reactions": {
        "likes": "61",
        "comments": "25 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "This really resonates. I’ve had a similar experience where paths diverged, and it became clear that the best way forward was to take full ownership. It’s not easy—financially or emotionally—but doing the right thing with zero resentment is essential to staying focused on what truly matters.\n\nLike you, I’ve learned that shared vision and alignment are everything in small organizations and shareholders. When they’re not there, it’s better to part ways and double down on your own path. Building with clarity and purpose—without external pressures—is what leads to real, sustainable success.\n\nHere’s to choosing the long game!",
          "userName": "Daniel Gertrudes",
          "userProfileURL": "https://www.linkedin.com/in/danielgertrudes",
          "dataId": "urn:li:comment:(activity:7287106668981583872,7287152385326514177)"
        },
        {
          "commentText": "Daniel Gertrudes Here is to choosing the long game! Definitely not an easy decision but the weight you feel lifted from your shoulders is an incredible feeling. ",
          "userName": "Alex Turnbull",
          "userProfileURL": "https://www.linkedin.com/in/alex-turnbull-1ab9992",
          "dataId": "urn:li:comment:(activity:7287106668981583872,7287154248465674242)"
        },
        {
          "commentText": "there is absolutely nothing wrong with having a successful business that you control and builds generational wealth for your family...I absolutely love it and wish more people would stop chasing and build business that makes money. \n\nwell done sir\n\nI applaud you",
          "userName": "✔️William Goddard",
          "userProfileURL": "https://www.linkedin.com/in/wlgoddard",
          "dataId": "urn:li:comment:(activity:7287106668981583872,7287121097789976576)"
        },
        {
          "commentText": "️William Goddard Thank you WIlliam!",
          "userName": "Alex Turnbull",
          "userProfileURL": "https://www.linkedin.com/in/alex-turnbull-1ab9992",
          "dataId": "urn:li:comment:(activity:7287106668981583872,7287155369368256514)"
        }
      ],
      "commentAdded": "Incredible journey! Your commitment to ownership and family-first values truly inspires. Cheers to many more years of success on your terms! 🚀👏"
    },
    {
      "postId": "urn:li:activity:7287155452008697856",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287155452008697856",
      "url": "https://www.linkedin.com/in/itssimranjeetkaur?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABzof5cBcqmpq9ERC5GDhaNxBdY7ahtT_NM",
      "name": "Simranjeet Kaur\nSimranjeet Kaur",
      "content": "Struggling to Speak Up? Let’s Talk About It.\n\nEver stayed silent in a meeting because you weren’t *100% sure* your idea was good enough?\n\nOr stopped yourself from asking a question because you thought you should already know the answer?\n\nIt’s not just fear of judgment—it’s the high expectations we set for ourselves.\n\nYou think, If I don’t say something perfect, it’s better to say nothing at all.\nSound familiar?\n\nThis is how imposter syndrome keeps us quiet.\n\nWe convince ourselves that if we can’t meet an impossible standard, we shouldn’t even try.\n\nHere’s what I’ve learned—and what I tell my clients:\n\n1️⃣ **You’re not expected to be perfect.**\nMost of the time, people don’t remember how “flawless” your input was—they remember that you contributed.\n\n2️⃣ **Your high standards are holding you back.**\nTrying to get everything right before you speak up often means you miss the chance altogether. Remember, *progress beats perfection.*\n\n3️⃣ **Focus on learning, not proving.**\nAsk yourself, *“What can I gain by sharing this?”* instead of worrying about what others might think.\n\n4️⃣ **Practice speaking up, even in small ways.**\nStart with one idea or question in a casual setting. The more you do it, the easier it gets.\n\nYour voice matters—not because it’s perfect, but because it’s *yours.*\n\nHave you ever felt this way? How do you push through it? Share your thoughts below—I’d love to hear them.",
      "reactions": {
        "likes": "38",
        "comments": "2 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Love your content",
          "userName": "Nilesh Kataria",
          "userProfileURL": "https://www.linkedin.com/in/nilesh-kataria",
          "dataId": "urn:li:comment:(activity:7287148477396959232,7287149394980679680)"
        },
        {
          "commentText": "Thank you ",
          "userName": "Simranjeet Kaur",
          "userProfileURL": "https://www.linkedin.com/in/itssimranjeetkaur",
          "dataId": "urn:li:comment:(activity:7287148477396959232,7287153112082010113)"
        }
      ],
      "commentAdded": "Great insights! Its so true that progress trumps perfection. Fostering open dialogue can empower us all. Lets keep speaking up!"
    },
    {
      "postId": "urn:li:activity:7287154406687485952",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287154406687485952",
      "url": "https://www.linkedin.com/in/adam-bidd?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAEM4AwgBaYcWlSZiRY8l23S87DWTouU2VeA",
      "name": "Adam Biddlecombe\nAdam Biddlecombe",
      "content": "Most people do 10+ interviews to get a job. \n(But they're not using AI for interview prep).\n\nYou can customise ChatGPT for role-specific guidance, practicing mock interviews, and refining your communication style.\n\nWhether you’re aiming to land that dream job or pivot into a new industry, this guide has got you covered.\n\nHere’s what you’ll learn:\n\nCustom Instructions\n↳ Tailor ChatGPT’s behavior to your unique interview needs.\nCustom GPTs\n↳ Build a specialized ChatGPT model that simulates real interview questions and scenarios.\nWeb Search\n↳ Gather real-time insights on companies, roles, and trends to stay one step ahead.\nProjects\n↳ Organize your prompts for a streamlined interview prep journey.\n\nReady to elevate your interview game and secure your next big opportunity?\n\nWant 30+ FREE AI resources and guides?\nEnter your email here \n\n Share this with your network and help them level up their interview skills!",
      "reactions": {
        "likes": "60",
        "comments": "28 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Fabulous use of AI, especially if you train it in your skills and background to make it relevant to you and your experience. Nice ",
          "userName": "Lorraine Hunt 🤖",
          "userProfileURL": "https://www.linkedin.com/in/lorrainehunt",
          "dataId": "urn:li:comment:(activity:7287151909373685760,7287155789830471682)"
        }
      ],
      "commentAdded": "Great insights! Leveraging AI for interview prep can truly set candidates apart. Excited to see how this transforms job hunting! 🚀"
    },
    {
      "postId": "urn:li:activity:7286804636097789953",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7286804636097789953",
      "url": "https://www.linkedin.com/in/ezxpo?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAIjGYB6b_NDVVPDgshQzRZBv-z3gmsaT0",
      "name": "Matt Fok\nMatt Fok",
      "content": "Educating Partners & Investors Through Collaboration \n \n Knowledge shared is innovation amplified. \n\nAI X Network’s Smart Community empowers healthcare organizations to:\n Share insights that matter with targeted AI-powered content.\n Educate partners and investors on your mission and value.\n Build trust through consistent, meaningful engagement.\n\n Turn education into action. Drive collaboration that fuels breakthroughs.\n\n Join the Smart Community:",
      "reactions": {
        "likes": "0",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Absolutely agree! Collaboration is key to innovation in healthcare. Excited to see how the Smart Community drives impactful change!"
    },
    {
      "postId": "urn:li:activity:7286046708982075392",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7286046708982075392",
      "url": "https://www.linkedin.com/in/ychowdhury?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACaawXcBYYg0wn5Vr6gmk98Pheyl7k_znN8",
      "name": "Yash Chowdhury\nYash Chowdhury",
      "content": "First Full Week of Tracking Metrics: A SalesUP Insider Sneak Peak \n\nAs Salesup prepares to cross the 100 SDR milestone, we knew it was time to start tracking something beyond the usual metrics:\n\nThe mood and input metrics of every SDR on our team. \n\nHere’s how we approached it:\n1️⃣ Being a remote-first team, we needed a way to ensure everyone was putting in the effort.\n2️⃣ We focused on keeping our team mentally equipped to perform at their best. \n3️⃣ We encouraged proactive communication around any issues or concerns throughout the day. \n\nHere’s what this looked like in action:\n\nWe noticed one of our SDRs feeling disappointed during the day. Instead of waiting, we reached out immediately to identify the issue.\n\nBy the next morning, the bottleneck was resolved. And by the end of the week?\n\nThat SDR wrapped up the week feeling genuinely happy. \n\n(Shoutout to tools likeand other workspace apps that made this process seamless! )\n\nCheck out the graph below  to see the before and after. A tangible reminder that when we prioritize our people, results follow.\n\nAtit’s always about creating an environment where every SDR thrives. ",
      "reactions": {
        "likes": "1",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Great approach! Fostering open communication truly enhances team morale and productivity. Excited to see how SalesUP continues to evolve! 🚀"
    },
    {
      "postId": "urn:li:activity:7285778071524143104",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7285778071524143104",
      "url": "https://www.linkedin.com/in/walterlcrosby?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABnRy4BfAi04dsWOrVfiDq5Fz8C2uALVWA",
      "name": "Walter Crosby\nWalter Crosby",
      "content": " Exciting news, everyone!  I just wrapped up recording FOUR amazing episodes of *Sales and Cigars* focused on the vital topics of sales coaching and sales development.\n\nI'm thrilled to announce that the final episode in this series features the incredible Jeremy Huckaby!  Jeremy brings a wealth of experience from his extensive career in sales and sales management. In this episode, we dive deep into the art of effective sales coaching, exploring how to truly elevate your skills and what it feels like to receive top-notch coaching—a rare gem in the sales world! \n\nCheck out this sneak peek of the episode that drops on **September 24th**. Trust me, you won’t want to miss it!\n\n\n\n Let's gear up for some powerful insights!",
      "reactions": {
        "likes": "9",
        "comments": "2 comments",
        "shares": "0"
      },
      "mediaUrl": "blob:https://www.linkedin.com/d2d86d4d-3a84-49c5-a556-e822c58856d1",
      "comments": [
        {
          "commentText": "Sounds like a great episode!",
          "userName": "Dave Kurlan",
          "userProfileURL": "https://www.linkedin.com/in/davekurlan",
          "dataId": "urn:li:comment:(ugcPost:7285778019401584641,7286089095431217152)"
        },
        {
          "commentText": "An insightful post on best practices for driving sales team success.\nWalter Crosby",
          "userName": "Steve Litzow",
          "userProfileURL": "https://www.linkedin.com/in/stevelitzow",
          "dataId": "urn:li:comment:(ugcPost:7285778019401584641,7286096193275809793)"
        }
      ],
      "commentAdded": "Cant wait for the episode! Jeremys expertise will surely bring invaluable insights to sales coaching. Excited to tune in! 🎧 #SalesAndCigars"
    },
    {
      "postId": "urn:li:activity:7286600770005659648",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7286600770005659648",
      "url": "https://www.linkedin.com/in/alex-turnbull-1ab9992?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAACAYtMB_ahNSSaY_yym6KikVRWc-UeBn6s",
      "name": "Alex Turnbull\nAlex Turnbull",
      "content": "Does less engineers = more productivity?\n\nOld Engineering Motion:\n\n- Hiring targets are standard so we can grow every quarter without thinking\n- Build massive teams - we'll get efficient eventually\n- The VP ran Engineering at BigTech, they're perfect for our growing business\n- Of course they need 7,000+ people to get things off the ground\n- The growth model says we'll hit unicorn status\n- Teams send over forecasts, Finance chases them, productivity drops a year later\n- We have a planning meeting every month but neither Product or AI joins\n- We need to pay engineers massive compensation in every region\n- Our efficiency metrics are upside down, let's hire more engineers!\n- \"Just build a bigger team!\"\n\nNew AI-First Motion (The Salesforce way, apparently…):\n\n- We're building an Agentforce-led business\n- Cut engineering hires by 100% in 2025\n- Productivity increased by 30% with AI\n- We have an \"AI-first\" engineering team that Benioff says \"has incredible velocity\"\n- They don't want more engineers. Together they're proving AI can boost productivity, not just assist\n- Engineering, Product, AI and Sales meet regularly to identify more automation opportunities\n- The success of the business is built around AI not headcount\n- Every role is measured against one metric: can AI do it better?\n\nIn a world where Salesforce's productivity jumps 30% while cutting engineering hires completely, is aligning your team around AI-first development smart, or is it just survival?\n\nOr beyond survival, does it mean thriving?\n\nThe math is pretty clear:\n• 2023: 7,000 layoffs to increase efficiency\n• 2024: 700 more cuts with AI integration\n• 2025: No more engineering hires, +2,000 salespeople\n\nMy feelings are mixed as it was with the Klarna news last month (interesting these press releases were made within a week of each other…).\n\nBut I like to consider myself a realist.\n\nHow do you all feel about this? Would love to hear from engineers and founders alike...",
      "reactions": {
        "likes": "13",
        "comments": "5 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Time will tell if all of this is hot air or not.\n\nIn my experience, writing the code was never the bottleneck.\n\nDiscussing what to build, how to build it, rebuilding because of misunderstanding or change in priorities, having to adapt to ongoing architecture changes or update something old because of a new security requirement... These were all timesinks that LLMs can't help much in.\n\n\"We doubled the number of engineers but our rate of output hasn't doubled\" was a phrase I heard far too often. Like duhhhh at some point something else becomes more important than headcount.",
          "userName": "Simon Agius Muscat",
          "userProfileURL": "https://www.linkedin.com/in/simon-agius-muscat",
          "dataId": "urn:li:comment:(activity:7286600770005659648,7286659457307009024)"
        }
      ],
      "commentAdded": "Fascinating shift! Embracing AI-first development could redefine productivity norms. Excited to see how this impacts engineering roles moving forward!"
    },
    {
      "postId": "urn:li:activity:7287128206824886272",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287128206824886272",
      "url": "https://www.linkedin.com/in/isarmeitis?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAMB50B_3NCLMZCvxrShlDeX2sL4TyWZBs",
      "name": "Isar Meitis\nIsar Meitis",
      "content": "Stay ahead in the world of AI!\nLast week was packed with groundbreaking developments in AI that you can’t afford to miss.\n\nFrom AI reshaping the job market, to advancements in autonomous agents, to billion-dollar investments in AI infrastructure – it's all happening now.\n\nHighlights include:\n- Meta and Microsoft job cuts amid AI-driven efficiency.\n- Predictions of 78M net new jobs globally by 2030.\n- Anthropic raising $2B to enhance AI safety.\n- OpenAI proposing a $175B U.S. investment blueprint for AI leadership.\n\nThis is just a taste of what’s inside this week’s AI News Recap. Swipe through the carousel to get the full scoop.\n\nWant a complete news roundup? Subscribe to my Newsletter for more AI analysis, trends, and exclusive updates delivered to your inbox every week.\n\nLet’s build an informed and connected AI community together.\n\nWhat’s the most exciting AI trend you’re following right now?\nDoes this align with your vision?\n\nNo time to read? Listen to the AI news episode of Leveraging AI.",
      "reactions": {
        "likes": "18",
        "comments": "5 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "It's going to be agentic year, Isar Meitis",
          "userName": "Sanchit Shangari",
          "userProfileURL": "https://www.linkedin.com/in/sanchit-shangari",
          "dataId": "urn:li:comment:(ugcPost:7287128205679853568,7287140349926354947)"
        }
      ],
      "commentAdded": "Exciting times ahead in AI! The potential for new jobs and advancements in safety is truly promising. Cant wait to see where this leads! 🚀"
    },
    {
      "postId": "urn:li:activity:7287015726085738496",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287015726085738496",
      "url": "https://www.linkedin.com/in/pooja-yadav27?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAD3OIq0BZiSRfb1Bbgid5QwWhyZbIT8Rbi8",
      "name": "Pooja Yadav\nPooja Yadav",
      "content": "In the dynamic world of business, maintaining a balanced approach is essential for success. \n\nOur mantra encourages professionals to thrive by fostering a culture of professionalism, productivity, and teamwork.",
      "reactions": {
        "likes": "27",
        "comments": "1 comment",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Indeed",
          "userName": "Sumit Mishra",
          "userProfileURL": "https://www.linkedin.com/in/sumit-mishraa",
          "dataId": "urn:li:comment:(activity:7287014325561561088,7287015716514320384)"
        }
      ],
      "commentAdded": "Absolutely agree! A balanced approach not only boosts productivity but also enhances collaboration. Lets keep driving that culture forward!"
    }
  ],
  "errors": [
    {
      "postId": "urn:li:activity:7287155684201181184",
      "url": "https://www.linkedin.com/in/walterlcrosby?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABnRy4BfAi04dsWOrVfiDq5Fz8C2uALVWA",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287106668981583872",
      "url": "https://www.linkedin.com/in/alex-turnbull-1ab9992?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAACAYtMB_ahNSSaY_yym6KikVRWc-UeBn6s",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287155452008697856",
      "url": "https://www.linkedin.com/in/itssimranjeetkaur?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABzof5cBcqmpq9ERC5GDhaNxBdY7ahtT_NM",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287154406687485952",
      "url": "https://www.linkedin.com/in/adam-bidd?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAEM4AwgBaYcWlSZiRY8l23S87DWTouU2VeA",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7286804636097789953",
      "url": "https://www.linkedin.com/in/ezxpo?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAIjGYB6b_NDVVPDgshQzRZBv-z3gmsaT0",
      "errors": [
        "Failed to fetch reactions.",
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7286046708982075392",
      "url": "https://www.linkedin.com/in/ychowdhury?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACaawXcBYYg0wn5Vr6gmk98Pheyl7k_znN8",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7286600770005659648",
      "url": "https://www.linkedin.com/in/alex-turnbull-1ab9992?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAACAYtMB_ahNSSaY_yym6KikVRWc-UeBn6s",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287128206824886272",
      "url": "https://www.linkedin.com/in/isarmeitis?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAMB50B_3NCLMZCvxrShlDeX2sL4TyWZBs",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287015726085738496",
      "url": "https://www.linkedin.com/in/pooja-yadav27?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAD3OIq0BZiSRfb1Bbgid5QwWhyZbIT8Rbi8",
      "errors": [
        "Failed to fetch media URL."
      ]
    }
  ]
}