[
  {
    "postsData": [
      {
        "postId": "urn:li:activity:7293310997069500417",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293310997069500417",
        "url": "https://www.linkedin.com/in/michael-walker-ed-d-5089a870?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAA8YztgBm8rk0lWrlsBMwk25SywnBCiZv8I",
        "name": "Michael Walker Ed.D.\nMichael Walker Ed.D.",
        "content": "𝗪𝗵𝗶𝗰𝗵 𝘄𝗼𝘂𝗹𝗱 𝘆𝗼𝘂 𝗰𝗵𝗼𝗼𝘀𝗲: 𝗔 𝗴𝘂𝗮𝗿𝗮𝗻𝘁𝗲𝗲𝗱 $𝟱𝟬 𝗼𝗿 𝗮 𝟱𝟬% 𝗰𝗵𝗮𝗻𝗰𝗲 𝘁𝗼 𝘄𝗶𝗻 $𝟭𝟬𝟬?\n\nMost people take the sure $50—even though the gamble has the same expected value.\n\nWhy? 𝗕𝗲𝗰𝗮𝘂𝘀𝗲 𝘄𝗲 𝗳𝗲𝗮𝗿 𝗹𝗼𝘀𝘀𝗲𝘀 𝗺𝗼𝗿𝗲 𝘁𝗵𝗮𝗻 𝘄𝗲 𝘃𝗮𝗹𝘂𝗲 𝗲𝗾𝘂𝗶𝘃𝗮𝗹𝗲𝗻𝘁 𝗴𝗮𝗶𝗻𝘀—that’s loss aversion in action.\n\nHow a decision is framed shapes how we perceive risk, reward, and urgency.\n\nIn a famous study by Tversky & Kahneman (1981), participants were given two options for treating a deadly disease:\n\n Gain Frame: “This treatment will save 200 out of 600 lives.\"\n Loss Frame: “This treatment will result in 400 deaths out of 600.\"\n\nEven though both statements describe the same outcome, far more people chose the \"save 200 lives\" option.\n\n𝗪𝗵𝘆?\n We fear losses more than we desire gains.\n Losing feels twice as painful as an equivalent gain feels rewarding.\n The way information is framed shifts our perception of risk.\n\n𝗛𝗼𝘄 𝘁𝗼 𝗨𝘀𝗲 𝗙𝗿𝗮𝗺𝗶𝗻𝗴 𝘁𝗼 𝗠𝗮𝗸𝗲 𝗕𝗲𝘁𝘁𝗲𝗿 𝗗𝗲𝗰𝗶𝘀𝗶𝗼𝗻𝘀:\n 𝗘𝗺𝗽𝗵𝗮𝘀𝗶𝘇𝗲 𝘄𝗵𝗮𝘁’𝘀 𝗮𝘁 𝘀𝘁𝗮𝗸𝗲: Instead of saying, “Sign up for benefits,” highlight the loss: “Don’t miss out on your exclusive benefits.”\n 𝗧𝘂𝗿𝗻 𝗰𝗼𝘀𝘁𝘀 𝗶𝗻𝘁𝗼 𝗶𝗻𝘃𝗲𝘀𝘁𝗺𝗲𝗻𝘁𝘀: Rather than “This course costs $500,” say “Invest $500 to boost your career and increase your earning potential.”\n 𝗠𝗮𝗸𝗲 𝘁𝗵𝗲 𝗯𝗲𝘀𝘁 𝗰𝗵𝗼𝗶𝗰𝗲 𝘁𝗵𝗲 𝗱𝗲𝗳𝗮𝘂𝗹𝘁: Set the preferred option as the automatic choice, like “Your subscription renews automatically—cancel anytime.”\n\nWhen you are making a decision, ask yourself: 𝗔𝗺 𝗜 𝗿𝗲𝗮𝗰𝘁𝗶𝗻𝗴 𝘁𝗼 𝘁𝗵𝗲 𝗰𝗵𝗼𝗶𝗰𝗲—o𝗿 𝘁𝗼 𝗵𝗼𝘄 𝗶𝘁 𝗶𝘀 𝗳𝗿𝗮𝗺𝗲𝗱?\n\n𝗪𝗮𝗻𝘁 𝘁𝗼 𝗶𝗺𝗽𝗿𝗼𝘃𝗲 𝘆𝗼𝘂𝗿 𝗱𝗲𝗰𝗶𝘀𝗶𝗼𝗻-𝗺𝗮𝗸𝗶𝗻𝗴? Attend my Workshop on Feb. 19th:",
        "reactions": {
          "likes": "0",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Great insights on loss aversion! It’s fascinating how framing can drastically influence our decision-making. Excited for the workshop!"
      },
      {
        "postId": "urn:li:activity:7293304143434145793",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293304143434145793",
        "url": "https://www.linkedin.com/in/devansh-bajaj08?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAC5aUq0BBaKDUmMdZXxkR2223N1G3gtbvio",
        "name": "Devansh Bajaj\nDevansh Bajaj",
        "content": "𝒀𝒐𝒖 𝒂𝒓𝒆𝒏’𝒕 𝑩𝒂𝒍𝒂𝒏𝒄𝒆𝒅 \n\n\nHey LinkCom \n———————————————————————\n\n 𝐖𝐞’𝐫𝐞 𝐨𝐟𝐭𝐞𝐧 𝐭𝐨𝐥𝐝 𝐭𝐨 𝐬𝐞𝐞𝐤 𝐛𝐚𝐥𝐚𝐧𝐜𝐞 𝐢𝐧 𝐥𝐢𝐟𝐞 — 𝐞𝐪𝐮𝐚𝐥 𝐭𝐢𝐦𝐞 𝐟𝐨𝐫 𝐰𝐨𝐫𝐤 , 𝐫𝐞𝐬𝐭 , 𝐟𝐚𝐦𝐢𝐥𝐲 𝐚𝐧𝐝 𝐡𝐨𝐛𝐛𝐢𝐞𝐬\n\nBut here’s the truth :\n\n\n️ 𝐓𝐡𝐞 𝐞𝐥𝐢𝐭𝐞 — 𝐭𝐡𝐞 𝐭𝐨𝐩 𝐩𝐞𝐫𝐟𝐨𝐫𝐦𝐞𝐫𝐬, 𝐭𝐡𝐞 𝐠𝐚𝐦𝐞 𝐜𝐡𝐚𝐧𝐠𝐞𝐫𝐬 , 𝐭𝐡𝐞 𝐡𝐢𝐬𝐭𝐨𝐫𝐲 𝐦𝐚𝐤𝐞𝐫𝐬 — 𝐚𝐫𝐞𝐧’𝐭 𝐛𝐚𝐥𝐚𝐧𝐜𝐞𝐝.\n\n️ 𝐓𝐡𝐞𝐲 𝐚𝐫𝐞 𝐨𝐛𝐬𝐞𝐬𝐬𝐞𝐝. 𝐅𝐨𝐜𝐮𝐬𝐞𝐝 . 𝐀𝐥𝐥 𝐢𝐧\n\n\n 𝐁𝐚𝐥𝐚𝐧𝐜𝐞 𝐜𝐫𝐞𝐚𝐭𝐞𝐬 :\n\n Comfort\n Obsession\n Mastery\n\n\n️ A balanced athlete trains a few hours a day while an elite one wakes up before dawn , sacrifices weekends and pushes beyond limits .\n\n️ The world’s best don’t strive for balance. They strive for greatness.\n\n\n 𝐒𝐭𝐚𝐠𝐧𝐚𝐭𝐢𝐨𝐧 𝐡𝐢𝐝𝐞𝐬 𝐛𝐞𝐡𝐢𝐧𝐝 :\n\n Comfort\n\n️ A perfectly balanced life often means no extreme struggles but also no extreme wins .\n\n️ Growth isn’t found in balance — it’s found in intensity, sacrifice and pushing limits.\n\n\n 𝐄𝐥𝐢𝐭𝐞 𝐤𝐧𝐨𝐰 𝐰𝐡𝐞𝐧 𝐭𝐨 𝐠𝐨 𝐚𝐥𝐥 𝐢𝐧\n\n️ This doesn’t mean burnout is the goal . It means knowing when to go all in and when to recover .\n\n️ They weren’t balanced. They were purpose driven .\n\n\nGreatness demands sacrifice, obsession and relentless effort . Balance can come later — but first , you must build .\n\n\nPs - 𝘛𝘩𝘦 𝘰𝘯𝘦𝘴 𝘸𝘩𝘰 𝘨𝘰 𝘢𝘭𝘭 𝘪𝘯 𝘤𝘩𝘢𝘯𝘨𝘦 𝘵𝘩𝘦 𝘸𝘰𝘳𝘭𝘥 . 𝘛𝘩𝘦 𝘰𝘯𝘦𝘴 𝘸𝘩𝘰 𝘴𝘦𝘦𝘬 𝘣𝘢𝘭𝘢𝘯𝘤𝘦 𝘸𝘢𝘵𝘤𝘩 𝘵𝘩𝘦𝘮 𝘥𝘰 𝘪𝘵 \n\n———————————————————————\n\nFollowfor more content",
        "reactions": {
          "likes": "31",
          "comments": "7 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Devansh Bajaj This perspective is truly thought-provoking!  While balance has its place, true mastery often requires going all in. The world’s top performers didn’t settle for ‘equal parts’—they committed, sacrificed, and pushed beyond limits. Greatness isn’t found in comfort, but in relentless pursuit!",
            "userName": "Bhuvaneshwari Kumaravel",
            "userProfileURL": "https://www.linkedin.com/in/bhuvaneshwari-businessgrowthstrategist",
            "dataId": "urn:li:comment:(activity:7293297437316632576,7293306693508071424)"
          },
          {
            "commentText": "Not balanced exactly but purpose driven, nice \n\nDevansh Bajaj",
            "userName": "Mrinalani Teotia",
            "userProfileURL": "https://www.linkedin.com/in/mrinalani-teotia",
            "dataId": "urn:li:comment:(activity:7293297437316632576,7293310051182657536)"
          }
        ],
        "commentAdded": "Absolutely agree! Greatness requires intensity and focus. Embracing the grind often leads to extraordinary results. Lets build our legacy!"
      },
      {
        "postId": "urn:li:activity:7293305660996304896",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293305660996304896",
        "url": "https://www.linkedin.com/in/favour-commander?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADqWFqgBxr87W2LwHW8NY2L8CH6D-lPWzps",
        "name": "Favour Commander\nFavour Commander",
        "content": "Celebrating the Unsung Heroes Behind My Newsletter's Success!\n\nWhen I started working on my newsletter idea, I knew I couldn’t do it alone.\n\nI needed people who would buy into my idea.\n\nSo I did one of the hardest things for me.\n\nI reached out; I didn’t know how they would respond, but I knew what I needed to do,\n\nand surprisingly, they bought it just from the idea alone,\n\nno fancy graphics, no embellished statements, no grammar, just me.\n\n️- thank you for your guidance on how to write an introduction.\n\n️,,, Chinecherem Ohaechesi - thank you guys for granting my request for an interview.\n\n️- thank you for the designs.\n\nThis post is just a reminder that you should shoot your shot and surround yourself with people you can learn from.\n\nWho has been a great influence on you on?\n\nTag the people in the comment section.\n\n\n\n\n_______________\n\nP.S.: It’s not MCM or WCW, but permit me to celebrate these people.",
        "reactions": {
          "likes": "56\nYou and 55 others",
          "comments": "55 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "I'm not going to preach what I don't practice. \n\nTo be honest, the initial process was scary, but the end result made it worthwhile.",
            "userName": "Favour Commander",
            "userProfileURL": "https://www.linkedin.com/in/favour-commander",
            "dataId": "urn:li:comment:(ugcPost:7293148259399692289,7293149729176129536)"
          },
          {
            "commentText": "There’s still so much in store for you, \n\nDo hard things!",
            "userName": "Favour Commander",
            "userProfileURL": "https://www.linkedin.com/in/favour-commander",
            "dataId": "urn:li:comment:(ugcPost:7293148259399692289,7293150848237334528)"
          }
        ],
        "commentAdded": "Kudos for recognizing the power of collaboration! It’s inspiring how reaching out can lead to amazing outcomes. Who’s your biggest inspiration? 🚀"
      },
      {
        "postId": "urn:li:activity:7293311197125206017",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293311197125206017",
        "url": "https://www.linkedin.com/in/sumit-mishraa?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABzxJgABicfZ4DuY9VOL59k-AsbQ23EBTqM",
        "name": "Sumit Mishra\nSumit Mishra",
        "content": "Quick Highlights of the day \n\nMyntra secures $81 million fund infusion from parent.\n\nDeepinder Goyal-led food delivery giantLimited is changing its name to Eternal Limited after getting approval from the company's board.\n\nsurpasses Rs 85 Cr revenue in FY24 with sound economics.\n\nDeepika Padukone-backed wellness brandraises Rs 35 Cr.\n\n’s growth woes continue in FY24, losses drop 37.5%.\n\nHealthtech startupraises $700K led by Good Capital.\n\nReceives INR 32 Cr GST Penalty Notice\n\n, which claims to be India's first gaming commerce startup, has raised $500,000 in a seed funding round led by IAN Angel Fund and 100X[dot]VC.\n\n, a Bengaluru-based payments solutions startup, has raised $53 million (about Rs 450 crore) in a funding round led by South Korea’s gaming company\n\nraises Rs 12 Cr in Seed round.\n\nposts Rs 459 Cr revenue and Rs 92 Cr profit in FY24.\n\nFoodtech startuphas raised $1 million in funding from a mix of Foreign Direct Investment (FDI), a network of Shark Tank founders, and angel investors associated with companies such as Goldman Sachs and Oracle.",
        "reactions": {
          "likes": "2",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Exciting developments across sectors! 🚀 Congrats to all the startups securing funds. Innovation is truly thriving in India! #StartupEcosystem #FundingNews"
      },
      {
        "postId": "urn:li:activity:7292995862895415296",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292995862895415296",
        "url": "https://www.linkedin.com/in/manujaggarwal?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAMY_wBiA538UlzNcv3ls30NXdjZZ2cT2c",
        "name": "Manuj Aggarwal\nManuj Aggarwal",
        "content": "Tomorrow, I’m hosting a 𝗟𝗶𝗻𝗸𝗲𝗱𝗜𝗻 𝗟𝗶𝘃𝗲 𝗔𝘀𝗸 𝗠𝗲 𝗔𝗻𝘆𝘁𝗵𝗶𝗻𝗴 to help you cut through the confusion and find real opportunities with AI.\n\n 𝗗𝗮𝘁𝗲: 06 February\n\n⏰ 𝗧𝗶𝗺𝗲: 2 PM PST\n\nBring your questions and let’s get straight to the solutions you need.\n\nDon’t miss it!\n\nOne day to go!\n\nMark your calendar now!\n\nRegistration link in first comment.",
        "reactions": {
          "likes": "3",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "https://www.linkedin.com/events/askmeanything-literally-open-fo7290799209690079232/",
            "userName": "Manuj Aggarwal",
            "userProfileURL": "https://www.linkedin.com/in/manujaggarwal",
            "dataId": "urn:li:comment:(activity:7292995536578588672,7292995856985731072)"
          }
        ],
        "commentAdded": "Excited for tomorrows session! Cant wait to dive into AI opportunities and solutions. See you all at 2 PM PST! 🚀"
      },
      {
        "postId": "urn:li:activity:7293281836028309504",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293281836028309504",
        "url": "https://www.linkedin.com/in/romanmohren?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAp2DkBDFXXvlUlO0ZdH_icizuwqplzl5g",
        "name": "Roman M.\nRoman M.",
        "content": "Thinking of selling your business? Don’t get blinded by the biggest offer.\n\nIn my article, I explain why the highest price isn’t always the best deal. Inflated valuations, risky deal structures, and tricky earnouts can leave you with less cash—and more headaches.\n\nThe real win? A deal that offers solid terms, upfront cash, and a smooth transition.\n\nBefore you sign on the dotted line, make sure you're not trading a big number for big regrets.\n\nCheck out the full story here:",
        "reactions": {
          "likes": "2",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Great insights! Its crucial to focus on the deals structure and transition, not just the price. Well said! 👏 #BusinessStrategy"
      },
      {
        "postId": "urn:li:activity:7292972766272577537",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292972766272577537",
        "url": "https://www.linkedin.com/in/mkoesterer?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAJ9iiAB5bh6NL9kMz59hr5JCHi31nuQIM8",
        "name": "Mark R. Koesterer\nMark R. Koesterer",
        "content": "Challenge Your Comfort Zone This Week!\n\nAs athletes, we often find ourselves pushing physical limits, but what about our mental and emotional boundaries? This week, I challenge you to step outside your comfort zone.\n\n**What’s one thing you can commit to that makes you feel a little uncomfortable?**\n\nIt could be striking up a conversation with a teammate you’ve never spoken to, trying a new training technique, or even sharing your personal goals with a mentor. Each small step can lead to significant growth both on and off the field.\n\nRemember, growth happens when we embrace discomfort. By challenging ourselves, we not only enhance our skills but also develop resilience and confidence – essential traits for success in athletics and life!\n\nI’d love to hear what you decide to tackle this week. Share your challenges below, and let’s support each other in our journeys! ",
        "reactions": {
          "likes": "12",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/739805fc-b2b0-4299-b5a4-9157205e9506",
        "comments": [],
        "commentAdded": "Great challenge! Im committing to reaching out to a mentor for guidance this week. Excited to see how this push helps me grow! 💪🌟"
      },
      {
        "postId": "urn:li:activity:7293242571038867456",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293242571038867456",
        "url": "https://www.linkedin.com/in/anifilipova?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADf8CYBCCTeR_Yi6O0ORIau69ntFjDD6P4",
        "name": "Ani Filipova\nAni Filipova",
        "content": "The easiest way for a boss to hide their incompetence? Blame you.\n\nWhen you succeed -\nIt is because of their great management skills.\n\nWhen you struggle -\nit's because you are not good enough.\n\nMost don’t even realise their own lack of skill is the real problem.\n\nThey never ask, “Did I fail as a leader?”\nThey assume “You just weren’t good enough.”\n\nAnd they slap a label on you: lazy, slow, disorganised, incompetent.\n\nSound familiar? Here’s how to know if your boss is setting you up to fail:\n\n1️⃣ No Clear Expectations:\nYour role feels like a moving target.\n\n2️⃣ Lack of Resources:\nYou’re expected to win with no resources.\n\n3️⃣ Constant Micromanagement:\nEvery move and decision is second-guessed.\n\n4️⃣ Excessive Criticism:\nMistakes are magnified. Wins are ignored.\n\n5️⃣ Isolation:\nYou’re left out of key meetings and conversations.\n\n6️⃣ Changing the Rules:\nThe goalpost keeps moving.\n\n7️⃣ Your Confidence is Crushed:\nYou start doubting yourself.\n\nChecked off 3 or more? It’s not just you.\n\nSwipe through the carousel for exact steps to take back control.\n\n Know someone dealing with this? Tag them below.\n Repost to help others spot the signs and follow me,for career advice that actually helps.",
        "reactions": {
          "likes": "428",
          "comments": "388 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "When a leader fails to take responsibility, they often shift the blame onto you. True leadership is not about claiming credit, but owning accountability.",
            "userName": "Damesha Craig, Leadership Coach and Startup Advisor",
            "userProfileURL": "https://www.linkedin.com/in/dameshacraig",
            "dataId": "urn:li:comment:(ugcPost:7293241042894499840,7293242561786171393)"
          },
          {
            "commentText": "Damesha Craig, Leadership Coach and Startup Advisor >> Select Best Job For You - https://rb.gy/1juuvp\n\n >> For More Job Update, Join Here -",
            "userName": "Most Trusted Job Portal 3",
            "userProfileURL": "https://www.linkedin.com/company/most-trusted-job-portal-3/posts",
            "dataId": "urn:li:comment:(ugcPost:7293241042894499840,7293253405668458496)"
          }
        ],
        "commentAdded": "This post hits home! Its crucial to recognize toxic management patterns. Lets empower ourselves and support each other in thriving workplaces!"
      },
      {
        "postId": "urn:li:activity:7293308367098290178",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293308367098290178",
        "url": "https://www.linkedin.com/in/stevenbartlett-123?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAc-_yEBDbEZ0yk-N5U15AyZ8dwveDX9VKo",
        "name": "Steven Bartlett\nSteven Bartlett",
        "content": "With the right leadership, the UK could compete with the US in so many ways… but a lot needs to change: \n\nIncluding our attitude towards success, entrepreneurship and failure.",
        "reactions": {
          "likes": "139",
          "comments": "20 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/db45afd4-54f7-4362-a24b-bdb3d94d8f61",
        "comments": [
          {
            "commentText": "I completely agree with your perspective on the UK's potential to compete with the US Steven Bartlett. However, I believe that in addition to changing our attitude towards success, entrepreneurship and failure, we also need to focus on fostering a culture of innovation and creativity. This means investing in education and research, encouraging collaboration between businesses and universities, and providing support for startups and small businesses. Furthermore, we need to prioritize diversity and inclusion in our workforce, as diverse teams have been shown to be more innovative and successful. By embracing these changes, I believe that the UK can truly become a global leader in innovation and entrepreneurship.",
            "userName": "Kshitij Sharma",
            "userProfileURL": "https://www.linkedin.com/in/kshitij-sharma-1ab338266",
            "dataId": "urn:li:comment:(ugcPost:7293305843754622977,7293312191565312000)"
          },
          {
            "commentText": "The UK possesses extraordinary potential to compete with the US on the global stage, yet it is clear that we need a transformative shift in our mindset and approach. This shift transcends mere policy adjustments and demands a cultural renaissance.\n\nWe must create an environment that embraces innovation, wholeheartedly celebrates the entrepreneurial spirit, and reframes setbacks as invaluable learning experiences rather than failures. Moreover, we must urgently tackle our energy dependency. The soaring costs are not just a temporary setback; they significantly drag on our economy, affecting households and businesses alike.\n\nTo unlock our true potential, we need bold, visionary leadership that confronts these challenges head-on and galvanises a new era of ambition and resilience. What critical changes do you believe are necessary for the UK to truly thrive? Let’s engage in this vital discussion!",
            "userName": "Anthony Gorman",
            "userProfileURL": "https://www.linkedin.com/in/anthony-gorman",
            "dataId": "urn:li:comment:(ugcPost:7293305843754622977,7293308182825713672)"
          }
        ],
        "commentAdded": "Absolutely! Cultivating a growth mindset and embracing risk are crucial for fostering innovation and driving competitiveness. Let’s champion change!"
      },
      {
        "postId": "urn:li:activity:7293308876190322688",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293308876190322688",
        "url": "https://www.linkedin.com/in/walkerdeibel?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAOuGsBTul6kKDjIbaaJPNFoIIJzQMbuIg",
        "name": "Walker Deibel\nWalker Deibel",
        "content": "The biggest wealth transfer in history is happening right now:\n\nThe next wave of millionaires won't come from startups...\n\nThey'll come from old businesses that embrace this ONE thing.\n\nHere's the SMB strategy that will dominate the next decade:\n\n$72.6 trillion will move between generations by 2046.\n\nThe startup game is getting harder - 90% fail within 5 years.\n\nBut there's a massive opportunity hiding in plain sight:\n\n32.5M small businesses in the US alone are ready for transformation.\n\nI call it SMB 2.0:\n\nThe fusion of old economy infrastructure with new economy technology.\n\nThink about Tesla - it's not a car company, it's a software company that happens to make cars.\n\nThe data is crystal clear.\n\nDigitally mature companies are:\n\n• 50% more likely to grow revenue\n• 8x more likely to create jobs\n• 14x more likely to innovate\n• 3x more likely to export\n\nBut most of these businesses are held back by legacy systems, costing them 15% in revenue annually.\n\nLet me show you a real example:\n\nAce Hardware's digital transformation resulted in:\n\n• 3.5x increase in online sales\n• 28% higher transaction sizes\n• 15% reduction in inventory costs\n• 98% higher customer satisfaction\n\nManufacturing companies implementing AI and IoT are seeing:\n\n• 80% reduction in prototyping time\n• 50% reduction in time-to-market\n• 20% reduction in downtime\n• 30% reduction in costs\n\nBy 2025, 75% of business leaders will be leveraging digital platforms to adapt to new markets.\n\nAfter facilitating over $200M in acquisitions, I've learned the key to capitalizing on this wealth transfer isn't just technology.\n\nYou need three things:\n\n• Access to the right deals\n• A proven framework for evaluating opportunities\n• A clear roadmap for post-acquisition transformation\n\nThe entrepreneurs who succeed aren't the most tech-savvy.\n\nThey're the ones who understand how to identify undervalued businesses and deliver real improvements.\n\nBuy then build.\n\n-\n\nIf you enjoyed this post:\n\n️ Reshare for others who might find it useful\n Follow me, Walker Deibel for more\n Share your thoughts below ",
        "reactions": {
          "likes": "53",
          "comments": "10 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Spot on Walker Deibel and automotive is a perfect example of an industry that is both fragmented and underserved with software, there are thousands of financially resilient companines with overlapping supply chains and strong recurring customer profiles - exciting time to be building in this space ",
            "userName": "Josh Hanning",
            "userProfileURL": "https://www.linkedin.com/in/joshhanning",
            "dataId": "urn:li:comment:(activity:7293297503955763201,7293302248967733249)"
          },
          {
            "commentText": "transforming established businesses opens doors to vast potential. how do we foster innovation in this space? \nhashtag\n#smb20",
            "userName": "Jessica Dragan",
            "userProfileURL": "https://www.linkedin.com/in/jessicadragan",
            "dataId": "urn:li:comment:(activity:7293297503955763201,7293308466360684545)"
          }
        ],
        "commentAdded": "Exciting insights, Walker! Embracing digital transformation in established businesses is a game-changer for future growth. Lets drive SMB 2.0 together!"
      }
    ],
    "errors": [
      {
        "postId": "urn:li:activity:7293310997069500417",
        "url": "https://www.linkedin.com/in/michael-walker-ed-d-5089a870?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAA8YztgBm8rk0lWrlsBMwk25SywnBCiZv8I",
        "errors": [
          "Failed to fetch reactions.",
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293304143434145793",
        "url": "https://www.linkedin.com/in/devansh-bajaj08?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAC5aUq0BBaKDUmMdZXxkR2223N1G3gtbvio",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293305660996304896",
        "url": "https://www.linkedin.com/in/favour-commander?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADqWFqgBxr87W2LwHW8NY2L8CH6D-lPWzps",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293311197125206017",
        "url": "https://www.linkedin.com/in/sumit-mishraa?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABzxJgABicfZ4DuY9VOL59k-AsbQ23EBTqM",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292995862895415296",
        "url": "https://www.linkedin.com/in/manujaggarwal?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAMY_wBiA538UlzNcv3ls30NXdjZZ2cT2c",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293281836028309504",
        "url": "https://www.linkedin.com/in/romanmohren?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAp2DkBDFXXvlUlO0ZdH_icizuwqplzl5g",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293242571038867456",
        "url": "https://www.linkedin.com/in/anifilipova?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADf8CYBCCTeR_Yi6O0ORIau69ntFjDD6P4",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293308876190322688",
        "url": "https://www.linkedin.com/in/walkerdeibel?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAOuGsBTul6kKDjIbaaJPNFoIIJzQMbuIg",
        "errors": [
          "Failed to fetch media URL."
        ]
      }
    ]
  },
  {
    "postsData": [
      {
        "postId": "urn:li:activity:7293015979901534209",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293015979901534209",
        "url": "https://www.linkedin.com/in/chuck-h-securityexecutive?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAC-toB4skrS8pVEa4Zv-ERwHRJBBeLbhw",
        "name": "Chuck Herrin, CISSP, CCSP, NACD.DC\nChuck Herrin, CISSP, CCSP, NACD.DC",
        "content": "Hope y'all can join us tomorrow - lot to cover, but we're keeping it quick and focused, so whether you're just busy or you just have the attention span of a goldfish, there's value for everyone trying to keep up with the whirlwind of AI!",
        "reactions": {
          "likes": "3",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "How do we join this event? Link just takes you to YouTube landing page for the overall series",
            "userName": "Phil Moroni",
            "userProfileURL": "https://www.linkedin.com/in/philmoroni",
            "dataId": "urn:li:comment:(activity:7293015979901534209,7293259663641366528)"
          }
        ],
        "commentAdded": "Excited for the session! Quick, focused insights are exactly what we need to navigate the fast-paced world of AI. See you all there! 🚀"
      },
      {
        "postId": "urn:li:activity:7293304207355351040",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293304207355351040",
        "url": "https://www.linkedin.com/in/sanjaykalluvilayil?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAEETbgB-lbZx1-E1BSWZlWTEl3eQ_xKUuA",
        "name": "Sanjay Kalluvilayil\nSanjay Kalluvilayil",
        "content": " Episode #5 of The AI Space Podcast with Host Sanjay Kalluvilayil launches tomorrow! \n\nMeet, Founder & CEO of, a digital transformation consultancy whose mission is to democratize AI and make it accessible to businesses of all sizes by empowering organizations with the knowledge, strategy, and tools needed to implement AI responsibly and successfully.\n\nBrad breaks down how AI is reshaping industries, including healthcare and finance, while also exploring the rise of agentic AI and emerging AI frameworks\n\nTeaser Alert: Brad shares insights & hacks on:\n Innovation – AI is reshaping industries, including Healthcare & Finance.\nAI Technology – The rise of agentic AI & emerging AI frameworks.\n Scaling  – Scale rapidly with automation and Agentic AI.\n Journey – Engineer turned AI Entrepreneur & Venture Builder.\n\n Don’t miss it—dropping Friday, Feb 7, 2025!\n\nYouTube:",
        "reactions": {
          "likes": "4",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/c679dc0d-3572-43a3-a2c9-e2a37ff80887",
        "comments": [],
        "commentAdded": "Excited for this episode! Brads insights on AI in healthcare and finance are sure to be game-changing. Cant wait to listen! 🎧🚀"
      },
      {
        "postId": "urn:li:activity:7293307842797658114",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293307842797658114",
        "url": "https://www.linkedin.com/groups/2395089?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A2395089-7293307841690361856",
        "name": "Embedded C Programming\nEmbedded C Programming",
        "content": "(Open Access) Dependable Embedded Systems - https://lnkd.in/gCSdwEPW\nLook for \"Read and Download Links\" section to download. Follow/Connect me if you like this post.",
        "reactions": {
          "likes": "0",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Excited to explore this resource on dependable embedded systems! Thank you for sharing—looking forward to connecting for more insights!"
      },
      {
        "postId": "urn:li:activity:7292950140066131968",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292950140066131968",
        "url": "https://www.linkedin.com/company/kpmgindia/posts",
        "name": "KPMG India\nKPMG India",
        "content": "#UnionBudget2025 introduces several measures to boost the \nhashtag\n#industrialmarkets and \nhashtag\n#automobile industry. \nhashtag\n#Budget2025 proposes reduction in \nhashtag\n#customsduties on raw materials and components, benefiting sectors like chemicals, electronics, and renewable energy. For in-depth insights, explore's sectoral PoV - Click here ",
        "reactions": {
          "likes": "44",
          "comments": "2 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Great initiatives in #Budget2025! Reducing #customsduties will surely pave the way for innovation in #industrialmarkets and #automobile. Exciting times ahead!"
      },
      {
        "postId": "urn:li:activity:7293308588595326976",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293308588595326976",
        "url": "https://www.linkedin.com/in/ashutoshmitraji?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAC_5nkoBaY9ofCTb1o19Bnd3gFeIeCx935E",
        "name": "Ashutosh Mitra\nAshutosh Mitra",
        "content": " Excited to share my journey of building an AI-powered HealthCare Chatbot using Hugging Face models!  This project was part of my AICTE Internship on AI: Transformative Learning with TechSaksham - an insightful initiative by&, in collaboration with().\n\nMany many thanks to,,,andfor their invaluable guidance throughout this journey. Their mentorship played a crucial role in shaping the project and making this experience enriching.\n\n Technologies Used:\n Hugging Face Transformers – For natural language processing (NLP) and chatbot responses.\n Streamlit – To develop a user-friendly, interactive chatbot interface.\n Python – The core programming language for AI model integration.\n NLTK (Natural Language Toolkit) – For text preprocessing and keyword detection.\n FastAPI – (Future scope) To enhance chatbot performance with a robust backend.\n\n Check out the GitHub repository:\n Experience the chatbot live on Streamlit App:\n Also, I’ve shared my insights in a Medium article on the role of AI in healthcare: \"The Importance of AI in Healthcare: A Chatbot Revolution\":\n\nThis internship was an incredible learning experience - leveraging AI to solve real-world healthcare challenges while working alongside industry experts. Looking forward to applying these learnings in future AI-driven innovations!",
        "reactions": {
          "likes": "9\nRaghav Kathuria and 8 others",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Incredible work! Your journey in AI and healthcare is inspiring. Excited to see how your chatbot will make a difference! 🚀🤖 #AIInnovation"
      },
      {
        "postId": "urn:li:activity:7293307043329818624",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293307043329818624",
        "url": "https://www.linkedin.com/in/westmcdonaldco?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAEvxMQBQ77AN3_0OXUHuUpKcY6AMaxm8us",
        "name": "West McDonald\nWest McDonald",
        "content": "We're all hearing about \"AI Agents\" and how they are going to automate work, but what's real and what's B/S? GoWest.ai cuts to the chase. We wrote an extensive piece on this forto make sure you get the facts. Check it out:",
        "reactions": {
          "likes": "0",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Excited to see a straightforward approach to AI Agents! Looking forward to reading your insights and separating fact from fiction."
      },
      {
        "postId": "urn:li:activity:7293310693074776065",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293310693074776065",
        "url": "https://www.linkedin.com/in/geoffreyjrodgers?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAac1gBzbX3XIDZtheHJ4lBwuCFE8ew9yc",
        "name": "Geoffrey (Geoff) Rodgers\nGeoffrey (Geoff) Rodgers",
        "content": "Another SFO Pavilion dinner in the books! 25 of us gathered to discuss three topics: \n\n1) The benefits and challenges of having the CMO function report to the CRO function.\n\n2) The fractional experience: what was it like to be a consumer of fractional talent and what was the experience of providing fractional experience.\n\n3) When is the right time to hire for the rev ops role, and how do you elevate that role to the executive team?\n\nGreat discussion, great camaraderie, and the dinner was fantastic!\n\nThanks to,,,,,,,,,,,,,,,,,, andfor your thoughtful contributions!",
        "reactions": {
          "likes": "2",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Sounds like a fantastic evening of insightful discussions! Excited to see how these ideas evolve and impact our industry. Great initiative!"
      },
      {
        "postId": "urn:li:activity:7293306763842334720",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293306763842334720",
        "url": "https://www.linkedin.com/in/eric-enge?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABi9XRsBwjoktKwfrWCYHxIY_x_thUTBktQ",
        "name": "Eric Engebretsen\nEric Engebretsen",
        "content": "3 years ago this week, I quit my day job to go all in on Bloom. \n\nI remember imagining this moment beforehand, thinking it would be a daunting decision.\n\nIt wasn't at all.\n\nIt was one of the easiest decisions I've ever made.\n\nI felt peace, confidence, and total excitement.\n\nIt had been my dream to build something mission-driven since I was a teenager.\n\nI remember telling my parents, \"I want to do something with my life that helps people abroad, but I don't know what.\"\n\nAnd in the early, validation days of, we saw our first team members overseas more than double their income.\n\nPlus, our first clients told us our staff were just as good as US talent and they already wanted to hire more from us.\n\nI knew we were onto something special. A once-in-a-lifetime opportunity.\n\nAnd I had a partner inwho was just as all-in as I was.\n\nSo it was easy to make the leap.\n\nNow 2025 marks our FOURTH year of business! \n\nWe're arguably the fastest-growing bootstrapped business in the state of Utah.\n\nImpacting thousands of people around the globe who have joined our staff.\n\nAnd revolutionizing how work is done for our clients — household-name companies that people use every day.\n\nI'm nostalgic this week thinking back to making the plunge 3 years ago, but I'm even more excited for the next 3 years ahead.\n\nWe're just at the beginning of our story.\n\nMore to come!",
        "reactions": {
          "likes": "102",
          "comments": "11 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "I so love the impact. The work you are doing so matters. Nathan McClellan I thought you might enjoy this. ",
            "userName": "Dallin Harmon",
            "userProfileURL": "https://www.linkedin.com/in/dallinharmon",
            "dataId": "urn:li:comment:(activity:7293297312078966785,7293312475230257152)"
          },
          {
            "commentText": "I hope to relate with your nostalgia soon Eric Engebretsen . I have a dream to also birth a company as influential as yours that will also change the lives of people all over the world. You are an inspiration. Godspeed sir . Cheers  to more greatness",
            "userName": "Wonder Kojo Deku",
            "userProfileURL": "https://www.linkedin.com/in/wonderkojodeku",
            "dataId": "urn:li:comment:(activity:7293297312078966785,7293303141473697792)"
          }
        ],
        "commentAdded": "Congratulations on this incredible journey! Your passion and impact are inspiring. Cheers to even more success in the years to come! 🌟"
      },
      {
        "postId": "urn:li:activity:7292961537864925184",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292961537864925184",
        "url": "https://www.linkedin.com/in/rickconlowservantleadership?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAPUxFwB6p1p6ESvdwgOkdRMuNdW3KDrJTU",
        "name": "Richard A. Conlow\nRichard A. Conlow",
        "content": "Read these \nhashtag\n#positivibe quotes today. https://buff.ly/3q2C27R \nhashtag\n#leadership \nhashtag\n#management \nhashtag\n#servantleadership \nhashtag",
        "reactions": {
          "likes": "0",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Great reminder to fuel our minds with positivity! These quotes can inspire not just leaders but everyone. Thanks for sharing! #PositiviteVibes #Leadership"
      },
      {
        "postId": "urn:li:activity:7293188773385822209",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293188773385822209",
        "url": "https://www.linkedin.com/in/hlarsson?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAPSV0ABtIkvReoAAi4HomczTBrxcMUlSEo",
        "name": "Hanna Larsson\nHanna Larsson",
        "content": "Our kids don't want our life.\n\nWho could blame them?\n\nThis is what success looks like for a lot of people today:\n\n- a fancy title\n- asking for permission\n- never seeing your kids\n- never being present with people you love\n- asking for growth and waiting to be promoted\n- counting down the days until vacation each year\n- waiting for a boss to give you 2% salary increase\n- coming back from vacation thinking: \"now it’s going to be different, I won’t let work rule my life”. 2 days goes by: you’re in the same sh!t\n- so tired from sitting in back to back meetings all day that you’ve started to forget who you are and started dying from the inside\n\n→ This is just being hi-jacked 24/7.\n\nWe seriously need to REDEFINE what success looks like.\n\nIt should be:\n\n- owning our time\n- not be held back\n- setting our own rules\n- design the life we want\n- decide our own income\n- ownership and accountability\n- having time to experience life\n- working from wherever we want\n- time with family and being present\n- waking up every day feeling challenged, curious, excited, hungry and at the same time content with life\n\nThe traditional 9-to-5 is just a hamster wheel.\n\nIt's a broken old model that hasn’t been updated in a very long time.\n\nIt leaves you zero autonomy.\n\n→ It does its job though: it keeps you busy and focused on just getting through the day.\n\nIt leaves you no time to do anything else than building someone else's dream.\n\nWe have to do better than this.\n\nDo you agree?\n\n\n\n️ Repost this to your network, and follow mefor more content about entrepreneurship, personal branding, and leveraging the attention economy to build profitable online businesses.",
        "reactions": {
          "likes": "1,016",
          "comments": "573 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Success isn't just about having money, it's about having money and freedom as well Hanna Larsson",
            "userName": "Blessing Ikpia",
            "userProfileURL": "https://www.linkedin.com/in/blessing-ikpia-54b790244",
            "dataId": "urn:li:comment:(activity:7293182782615265280,7293188745413984257)"
          }
        ],
        "commentAdded": "Absolutely agree! Its time to prioritize fulfillment and redefine success on our own terms. Lets embrace autonomy and live life fully!"
      }
    ],
    "errors": [
      {
        "postId": "urn:li:activity:7293015979901534209",
        "url": "https://www.linkedin.com/in/chuck-h-securityexecutive?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAC-toB4skrS8pVEa4Zv-ERwHRJBBeLbhw",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293307842797658114",
        "url": "https://www.linkedin.com/groups/2395089?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A2395089-7293307841690361856",
        "errors": [
          "Failed to fetch reactions.",
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292950140066131968",
        "url": "https://www.linkedin.com/company/kpmgindia/posts",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293308588595326976",
        "url": "https://www.linkedin.com/in/ashutoshmitraji?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAC_5nkoBaY9ofCTb1o19Bnd3gFeIeCx935E",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293307043329818624",
        "url": "https://www.linkedin.com/in/westmcdonaldco?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAEvxMQBQ77AN3_0OXUHuUpKcY6AMaxm8us",
        "errors": [
          "Failed to fetch reactions.",
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293310693074776065",
        "url": "https://www.linkedin.com/in/geoffreyjrodgers?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAac1gBzbX3XIDZtheHJ4lBwuCFE8ew9yc",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293306763842334720",
        "url": "https://www.linkedin.com/in/eric-enge?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABi9XRsBwjoktKwfrWCYHxIY_x_thUTBktQ",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292961537864925184",
        "url": "https://www.linkedin.com/in/rickconlowservantleadership?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAPUxFwB6p1p6ESvdwgOkdRMuNdW3KDrJTU",
        "errors": [
          "Failed to fetch reactions.",
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293188773385822209",
        "url": "https://www.linkedin.com/in/hlarsson?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAPSV0ABtIkvReoAAi4HomczTBrxcMUlSEo",
        "errors": [
          "Failed to fetch media URL."
        ]
      }
    ]
  },
  {
    "postsData": [
      {
        "postId": "urn:li:activity:7293308916384296960",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293308916384296960",
        "url": "https://www.linkedin.com/in/flaviodstrianese?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABxj3wBCeGqT3pgzf6PzFxzNr87txKIWxs",
        "name": "Flavio D. Strianese\nFlavio D. Strianese",
        "content": "Unlock global talent and scale your business with software outsourcing! \n\n Faster delivery\n Cutting-edge tech\n Cost-effective solutions\n\nPartner with the right experts to stay ahead and drive innovation!\n\nLearn more when you book your free consultation today\n",
        "reactions": {
          "likes": "0",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/0df4965b-7e56-456a-b96f-ea65e3815924",
        "comments": [],
        "commentAdded": "Great insights! Investing in software outsourcing is a smart move for businesses looking to innovate and grow. Excited to see the benefits unfold!"
      },
      {
        "postId": "urn:li:activity:7293307663780646913",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293307663780646913",
        "url": "https://www.linkedin.com/in/sandeepthakur4u?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAANePBgBiP7WcYerb-c2gXWrQhehv2NrS3Y",
        "name": "Sandeep Thakur\nSandeep Thakur",
        "content": "The gregariousness of the human species, the formation of clans and tribes, groups and societies, sects and religions, nations and States, all tend to one fundamental end, the finding of oneness in this world of infinite variation, the unity that eludes but which is in the heart of things, secret, yet, sending ever the message that it lies in wait to be discovered, the profound end of evolution, the transcendence of phenomenal life, the infinitude of existence. Man hears this voice of freedom coming from within but mistakes its source as a revelation from without from an omnipotent arbiter inhabiting a higher heaven with a rod to strike the errant one who chooses not to fall in line with the dictum from above. Fear and ignorance and their foster-child arrogance have thus gripped the world for ages, superstition bred in the primitive mind devoid of enlightenment of reason or real inspiration have plunged the world with bloodshed such that we feel the echoes of those ancient clashes even today with technological tentacles holding us in their death-grip like never before. But there is hope as well. Scientific knowledge and the Vedanta are releasing humanity from the insensate culture of its brutal past and the combination of the two will bring forth a renaissance of all that has been highest and noblest in human history with added discoveries of the future ushering in a golden age for all of humankind. There will be resistance, often violent ones, to thwart the progress of man for the conservative element in the organic system is hard to rid of, but victory shall be sealed with fresher generations seeing the light of day and accepting what is true and best in human culture as the future man scales higher peaks en route to the summit of realizations that we are outwardly many, inwardly one. An enforced homogeneity will not work for it is against the basic principle of Nature, the variegation of life built on the foundation of the essential oneness of existence. Unity in diversity will have to be accepted as the one basis for a variegated flowering of the human species. Only on such an enlightened acceptance of each other may we be sure of the promotion of peace and harmony of the peoples of the world, only on such a universal understanding of truth may we be able to truly love our fellow-beings as we move towards a world civilization with a common agenda, the freedom of all, fellowship with all and the well-being of all that inhabit this beautiful home of ours, Planet earth.\nWritten by Sugata Bose",
        "reactions": {
          "likes": "225",
          "comments": "8 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Sadashiv bhagwan bholenath ke charno mein koti koti pranam \nHar Har Mahadev \nOm Namah Shivay",
            "userName": "Mahender Kumar",
            "userProfileURL": "https://www.linkedin.com/in/mahenderkumar2019",
            "dataId": "urn:li:comment:(activity:7293304942008651776,7293312265020129281)"
          },
          {
            "commentText": "om namah shivaya ️ ",
            "userName": "Durgadevi Anasuri",
            "userProfileURL": "https://www.linkedin.com/in/durgadevi-anasuri-1a2a92319",
            "dataId": "urn:li:comment:(activity:7293304942008651776,7293310010330112001)"
          }
        ],
        "commentAdded": "Inspiring perspective, Sugata! Embracing unity in diversity can indeed pave the way for a harmonious and enlightened global community. 🌍✨"
      },
      {
        "postId": "urn:li:activity:7293286012552658944",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293286012552658944",
        "url": "https://www.linkedin.com/in/rachit-gupta-18a550251?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAD4x4foBnDBjfAJ7OTcTFyjeRJye_YA9cdY",
        "name": "Rachit Gupta\nRachit Gupta",
        "content": "LinkedIn or Just Another Social Media Feed?\nLately, LinkedIn—once a hub for meaningful discussions, insights, and learning—feels like just another social media feed.\n\n Zepto’s ‘Skoda cars’ ad? Turns out, it’s just a test-drive feature. But the way it spread, you’d think they actually launched 10-minute car deliveries.\n️ Zomato’s rebrand to Eternal? A serious business move, but the feed is flooded with jokes like \"Deepinder woke up and decided to rename Zomato for engagement.\"\n\nWhere’s the real conversation? The analysis? The industry takeaways? Instead, everyone’s just posting whatever gets likes, turning LinkedIn into a noisy, mindless scroll.\n\n Here’s a thought: Instead of chasing engagement for the sake of it, why not contribute something of value? Challenge ideas, share insights, build real discussions. That’s what this platform was meant for.\n\nWhat do you actually find valuable on LinkedIn these days? Or has it just become another engagement-driven echo chamber?",
        "reactions": {
          "likes": "2\nHarshit Kumar Gupta and 1 other",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Great observation! Lets reclaim LinkedIn as a space for insightful discussions and meaningful connections. Quality over quantity!"
      },
      {
        "postId": "urn:li:activity:7290419905122758659",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290419905122758659",
        "url": "https://www.linkedin.com/in/yash-kumar-b9348b1a5?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAC_yWN8Bt99bHcBFY8Sgwq-XnHXLBWjCei4",
        "name": "Yash Kumar\nYash Kumar",
        "content": "Do you ever feel like people just don’t get you?\n\nLike no matter how clear you are, they still don’t understand?\n\nI see this all the time—even with skilled professionals.\n\n→ They are incredible at their craft.\n→ But they struggle to connect with people.\n\nBecause humans don’t work like machines.\n\n8.2 billion people. 8.2 billion personalities.\n\nUntil you learn to see the world through someone else’s eyes, you will never truly understand their struggles.\n\nAnd if you can’t understand them, how can you help them?\n\nHere’s how I truly empathize with my prospect to discover the real pain points and build a tailored solution:\n\n→ Humility leads to Empathy.\n→ Empathy leads to Emotional Intelligence.\n→ Emotional Intelligence leads to Adaptability.\n→ Adaptability leads to Success.\n\nHumility → Success.\n\nIt all starts with Humility.\n\nAnd this does not just apply to Sales, it applies to Life.\n\nRepost, so your real ones “ Adapt → Succeed “. ",
        "reactions": {
          "likes": "9",
          "comments": "7 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": " This is exactly what makes you stand out in Sales: Adaptibility.",
            "userName": "Yash Kumar",
            "userProfileURL": "https://www.linkedin.com/in/yash-kumar-b9348b1a5",
            "dataId": "urn:li:comment:(ugcPost:7290419904149639170,7290428985614757888)"
          }
        ],
        "commentAdded": "Absolutely! Humility is the foundation for true connections. Understanding others is key to unlocking our potential. Thanks for sharing!"
      },
      {
        "postId": "urn:li:activity:7293173262052659201",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293173262052659201",
        "url": "https://www.linkedin.com/in/krittika-sharda-corporate-trainer?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADIzkh0B-EUE_tFQCNeID6ouvuv4-PvDABg",
        "name": "Krittika S.\nKrittika S.",
        "content": "𝐂𝐨𝐫𝐩𝐨𝐫𝐚𝐭𝐞 𝐄𝐭𝐢𝐪𝐮𝐞𝐭𝐭𝐞: 𝐓𝐡𝐞 𝐔𝐧𝐬𝐩𝐨𝐤𝐞𝐧 𝐄𝐝𝐠𝐞 𝐓𝐡𝐚𝐭 𝐒𝐞𝐭𝐬 𝐘𝐨𝐮 𝐀𝐩𝐚𝐫𝐭\n\nEver walked into a room and instantly felt drawn to someone—not because they were the loudest or the most flamboyant, but because they carried an effortless sense of confidence and class?\n\nThat’s the silent power of 𝐜𝐨𝐫𝐩𝐨𝐫𝐚𝐭𝐞 𝐞𝐭𝐢𝐪𝐮𝐞𝐭𝐭𝐞—the invisible yet defining factor that shapes how people perceive, respect, and remember you.\n\nIn my recent Corporate Etiquette Session with, we explored the fine nuances that separate professionals from true leaders.\n\nBecause in the corporate world, it's not just about what you do—it’s about how you carry yourself while doing it.\n\n𝐇𝐞𝐫𝐞’𝐬 𝐰𝐡𝐚𝐭 𝐰𝐞 𝐮𝐧𝐜𝐨𝐯𝐞𝐫𝐞𝐝: ⬇️\n\n⦾ Grooming & Appearance: Like it or not, first impressions aren’t just lasting—they’re defining. The way you present yourself sends an instant message about your professionalism, confidence, and attention to detail.\n\n⦾ The Power of Uniforms: Think of a uniform (whether literal or figurative) as your visual signature—a mark of discipline, unity, and personal branding.\n\nWhether you’re in a tailored suit or business casual, how you wear it matters as much as what you wear.\n\n⦾ Cubicle & Workspace Etiquette: Your workspace is an extension of you.\n\nCluttered desks, loud phone calls, or casual interruptions?\n\nThey might seem harmless, but they speak volumes about your work ethic and consideration for others.\n\n⦾ Email & Communication Etiquette: Every email you send is a reflection of your personal brand—is it sharp, structured, and respectful, or rushed and careless?\n\nProfessionalism isn’t just about words, but how you say them.\n\n⦾ Customer Service & Professionalism: Your success is built on more than just skills—it’s built on relationships. The way you handle interactions, resolve conflicts, and respond to challenges can either win loyalty or lose trust.\n\n⦾ Interactive Activities & Role Plays: Because etiquette isn’t just about theory—it’s about application. We brought scenarios to life with role plays, self-reflection activities, and real-world problem-solving, ensuring that etiquette isn’t just learned—it’s embodied.\n\n The Takeaway?\nCorporate etiquette isn’t about rigid rules—it’s a strategy for influence, credibility, and long-term career success.\n\nThe smallest refinements in your personal and professional behavior can create the biggest impact in your career.\n\nIf you’re looking to fine-tune your professional presence, communication, and personal brand, let’s talk.\n\n\nBook a free consultation call and let’s explore what works best for you—because in business, the most powerful statements are often made without saying a word. ",
        "reactions": {
          "likes": "230",
          "comments": "31 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": " Corporate etiquette truly is the silent game-changer that elevates not just individuals but entire teams. Loved the emphasis on how small refinements can lead to major transformations.  Thanks for sharing these valuable insights!",
            "userName": "Marianna Outsia",
            "userProfileURL": "https://www.linkedin.com/in/marianna-outsia-48974b9a",
            "dataId": "urn:li:comment:(ugcPost:7292901141695053826,7293173206033526784)"
          }
        ],
        "commentAdded": "Insightful post! Corporate etiquette truly plays a crucial role in shaping our professional image. Excited to see how it transforms careers!"
      },
      {
        "postId": "urn:li:activity:7293307722047848448",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293307722047848448",
        "url": "https://www.linkedin.com/in/maththinking?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAD5LcBBZCNJ3T89euZhuJxAmL1RWcykg4",
        "name": "Ju Rao\nJu Rao",
        "content": "(Open Access) Dependable Embedded Systems - https://lnkd.in/gCSdwEPW\nLook for \"Read and Download Links\" section to download. Follow/Connect me if you like this post.",
        "reactions": {
          "likes": "1",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Exciting resource for embedded systems! Looking forward to diving into the content. Thanks for sharing this valuable info!"
      },
      {
        "postId": "urn:li:activity:7293262612450967552",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293262612450967552",
        "url": "https://www.linkedin.com/in/vipin-yadav-aa78b520a?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADUrot8BFTs7iJl2bgurtY7IjbYebpPjOz4",
        "name": "Vipin Yadav\nVipin Yadav",
        "content": "11 visuals that will change the way you think \n\n Stop comparing yourself to others - you're on your own journey \n\nFocus on today, celebrate the small wins, and never stop learning \n\nHard work pays off, but so does self-care.\n\nGoogle is offering FREE courses in following areas:\n- A.I.\n- IoT\n- Machine Learning\n- Data Science\n- Computer Science\n\n1. Introduction to Generative AI\n\n\n2. Google Data Analytics Professional Certificate\n\n\n3. Agile Project Management\n\n\n4. Project Execution: Running the Project\n\n\n5. Foundations of Project Management\n\n\n6. Project Initiation: Starting a Successful Project\n\n\n7. Project Planning: Putting It All Together\n\n\n8. Google Data Analytics:\n\n\n9. Fundamentals of digital marketing\n\n\n10. Get Started with Python\n\n\n11. Learn Python Basics for Data Analysis\n\n\n12. Data, ML, and AI in Google Cloud\n?\n\n13. Google Cloud Computing Foundations: Networking and Security in Google Cloud\n?\n\n14. Google Advanced Data Analytics Capstone\n\n\n15. Data Analysis with R Programming\n\n\n16. IBM Full Stack Software Developer Professional Certificate\n\n\n17. Introduction to Web Development with HTML, CSS, JavaScript\n\n\n18. IBM Front-End Developer Professional Certificate\n\n\n19. IBM Back-End Development Professional Certificate\n\n\n20. IBM Python for Data Science, AI & Development\n\n\n21. IBM Developing Cloud Apps with Node.js and React\n\n\nJoin Our Telegram for more amazing notes and study materials\n\n\n\n𝐖𝐡𝐢𝐜𝐡 𝐨𝐧𝐞 𝐨𝐟 𝐭𝐡𝐞𝐬𝐞 𝐯𝐢𝐬𝐮𝐚𝐥𝐬 𝐫𝐞𝐬𝐨𝐧𝐚𝐭𝐞𝐝 𝐰𝐢𝐭𝐡 𝐲𝐨𝐮 𝐭𝐡𝐞 𝐦𝐨𝐬𝐭?\n\nRepost to inspire your network, and Follow me, for more Content.",
        "reactions": {
          "likes": "421",
          "comments": "53 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "It's awesome that Google offers free courses on such relevant topics",
            "userName": "Yohann M.",
            "userProfileURL": "https://www.linkedin.com/in/yohann-merran",
            "dataId": "urn:li:comment:(ugcPost:7293123145526296576,7293202027856191488)"
          },
          {
            "commentText": "Looking forward to checking out your next posts",
            "userName": "Chanpreet Singh",
            "userProfileURL": "https://www.linkedin.com/in/chanpreet515",
            "dataId": "urn:li:comment:(ugcPost:7293123145526296576,7293222844077916161)"
          }
        ],
        "commentAdded": "Love this perspective! Celebrating small wins and continuous learning is key. Excited about those free courses from Google! 🌟 #LifelongLearning"
      },
      {
        "postId": "urn:li:activity:7293307654729297920",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293307654729297920",
        "url": "https://www.linkedin.com/in/aditi-singh-670056325?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAFIOETQBXPqfRD_jk_RgninVVuUSL8ahMaQ",
        "name": "Aditi Singh\nAditi Singh",
        "content": "- *Google Analytics Releases New Features*: Google Analytics has recently released features like copying reports and explorations across properties, and a consent settings hub ².\n\n7000+ Course Access :\n\n1. Google Data Analytics:\n\n2. Learn Python Basics for Data Analysis\n\n\n\n3. Data Analysis with R Programming\n\n\n\n4. Foundations: Data, Data, Everywhere\n\n\n\n5. Ask Questions to Make Data-Driven Decisions\n\n\n\n6. Process Data from Dirty to Clean\n\n\n\n7. Share Data Through the Art of Visualization\n\n\n\n8. Analyze Data to Answer Questions\n\n\n\n9. Get Started with Python\n\n\n\n10. Go Beyond the Numbers: Translate Data into Insights\n\n\n\n11. The Power of Statistics\n\n\n\n12. Regression Analysis: Simplify Complex Data Relationships\n\n\n\n13. The Nuts and Bolts of Machine Learning\n\n\n\n14. Google Advanced Data Analytics Capstone\n\n\n\n️FREE [/]\nHappy Learning",
        "reactions": {
          "likes": "38",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Very helpful",
            "userName": "Nitesh Kumar",
            "userProfileURL": "https://www.linkedin.com/in/nitesh-kumar-9a8005314",
            "dataId": "urn:li:comment:(ugcPost:7293297031081545732,7293307474709749761)"
          }
        ],
        "commentAdded": "Exciting updates from Google Analytics! These new features will enhance our data-driven decisions. Happy learning to all! 📊✨ #DataAnalytics"
      },
      {
        "postId": "urn:li:activity:7293307579223429123",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293307579223429123",
        "url": "https://www.linkedin.com/in/brentonmwest?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAACsp-kB69JJgwFUfXn1Z66vWINZo2H2hH8",
        "name": "Brenton West\nBrenton West",
        "content": "You don’t need to be on DealHub.io to appreciate the panic of discovering a missing approval at the eleventh hour. ️ We’ve all had that gut-wrenching moment when an important sign-off goes MIA. \n\nIn our latest blog, we admit how we dropped the ball—plus discuss the fixes that saved us. Let me know in the comments: What’s your biggest approval slip-up?",
        "reactions": {
          "likes": "1 comment",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": " Full scoop: 10 DealHub Mistakes & lessons learned https://thriviti.com/blog/10-mistakes-we-made-as-new-dealhub-admins",
            "userName": "Brenton West",
            "userProfileURL": "https://www.linkedin.com/in/brentonmwest",
            "dataId": "urn:li:comment:(ugcPost:7293307578107777027,7293307762787123202)"
          }
        ],
        "commentAdded": "Great insights! Weve all been there. I’d love to share my experience with last-minute approvals. Looking forward to the fixes you found!"
      },
      {
        "postId": "urn:li:activity:7293229256736735233",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293229256736735233",
        "url": "https://www.linkedin.com/groups/762547?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A762547-7293229255457472512",
        "name": "Big Data 🟥 Data Science | Machine Learning | Deep Learning | Artificial Intelligence\nBig Data 🟥 Data Science | Machine Learning | Deep Learning | Artificial Intelligence",
        "content": "BIOMIMICRY CONTINUUM – Part 5 – CURATING Agentic Expertise\nMultidisciplinary expertise is critical to correctly define the key premises driving problem analysis and solution architecture, and the Agentic Expertise Ecosystem (left image) enables capturing that expertise as a reusable computing asset.\n\nThe current AI chaos is due to 70 years of narrow and unexamined premises. The promise of AGI in the 1950s was rooted in premises that have been disproven by real-world evidence but blindly adhered to by those making today’s AGI claims. Key examples:\n\n-Premise: language is the source of intelligence\n-Reality: intelligence is the source of language - babies are intelligent before they can speak\n\n-Premise: data is a representation of the real world\n-Reality: data is the output of a machine and represents only what the machine was designed to capture\n\n-Premise: the brain constructs objects by identifying frequent patterns of object bits\n-Reality: the brain contains networks of abstract concept cells which fire when the concepts are presented in diverse versions and formats (text, image, sound, etc.)\n\n-Premise: neural networks imitate how the brain reasons by processing massive data exhaustively\n-Reality: the brain computes the relevance of inputs using inhibition networks, filtering out over 99.99% of sensory data\n\nThere are more, but the point is that the main objectives of curation are:\n1-Ensure that knowledge from all relevant domains is included in the ontology\n2-Map the relevant knowledge concepts across the domains to problem and solution concepts\n3-Maintain the landscape concepts (science, business, regulation, etc.) reasonably updated\n\nTo enable these objectives, the custodian systems must support:\n1-Biomimetic digital twinning of problem and solution concepts\n2-Independent update by authorized experts\n2-Simulation and testing of the impact of proposed updates across the ontology architecture\n\nThe methodology and technology to build this type of biomimetic digital twin ecosystem exist, we have produced published results, and I have discussed this in my posts.\n\nThe vision of the Agentic Expertise Ecosystem in the image, however, is in early stages and will require committed partners with the necessary resources who want to participate in shaping the implementation of this new paradigm.",
        "reactions": {
          "likes": "0",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Exciting insights! Challenging outdated premises is crucial for AIs evolution. Looking forward to seeing how the Agentic Expertise Ecosystem progresses!"
      }
    ],
    "errors": [
      {
        "postId": "urn:li:activity:7293308916384296960",
        "url": "https://www.linkedin.com/in/flaviodstrianese?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABxj3wBCeGqT3pgzf6PzFxzNr87txKIWxs",
        "errors": [
          "Failed to fetch reactions."
        ]
      },
      {
        "postId": "urn:li:activity:7293307663780646913",
        "url": "https://www.linkedin.com/in/sandeepthakur4u?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAANePBgBiP7WcYerb-c2gXWrQhehv2NrS3Y",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293286012552658944",
        "url": "https://www.linkedin.com/in/rachit-gupta-18a550251?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAD4x4foBnDBjfAJ7OTcTFyjeRJye_YA9cdY",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7290419905122758659",
        "url": "https://www.linkedin.com/in/yash-kumar-b9348b1a5?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAC_yWN8Bt99bHcBFY8Sgwq-XnHXLBWjCei4",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293173262052659201",
        "url": "https://www.linkedin.com/in/krittika-sharda-corporate-trainer?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADIzkh0B-EUE_tFQCNeID6ouvuv4-PvDABg",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293307722047848448",
        "url": "https://www.linkedin.com/in/maththinking?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAD5LcBBZCNJ3T89euZhuJxAmL1RWcykg4",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293262612450967552",
        "url": "https://www.linkedin.com/in/vipin-yadav-aa78b520a?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADUrot8BFTs7iJl2bgurtY7IjbYebpPjOz4",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293307654729297920",
        "url": "https://www.linkedin.com/in/aditi-singh-670056325?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAFIOETQBXPqfRD_jk_RgninVVuUSL8ahMaQ",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293307579223429123",
        "url": "https://www.linkedin.com/in/brentonmwest?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAACsp-kB69JJgwFUfXn1Z66vWINZo2H2hH8",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293229256736735233",
        "url": "https://www.linkedin.com/groups/762547?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A762547-7293229255457472512",
        "errors": [
          "Failed to fetch reactions.",
          "Failed to fetch media URL."
        ]
      }
    ]
  },
  {
    "postsData": [
      {
        "postId": "urn:li:activity:7292270693180653568",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292270693180653568",
        "url": "https://www.linkedin.com/in/gbrentbarkin?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAI5v54B8OquVDdHfjnHpuC9Ga3eD6YsXtk",
        "name": "G. Brent Barkin\nG. Brent Barkin",
        "content": "I’d like to thanks Mike Stashak for sending me this article after we had a morning discussing \nhashtag\n#NIL.\n\nFor post 23 I’d like to delve into this idea, that these high school athletes are now seeing NIL deals.\n\nFirst let’s recognize that the big dollar deals for high school athletes are not the norm. It’s rare that a player gets this sort of monetary recognition for the combination that their athletic performance and social media prowess have granted a select few.\n\nWhat I do find interesting is that, unlike many\ndeals that are more about boosters drafting a player, these deals seem to have brands making calculations based on expectations of return.\n\nFor the ones that have little to do with social media following, it’s all about the promise that an early investment in an athlete will pay handsome dividends when he or she hits it big in college- and in the pros.\n\nFor the players that also have distinctive social followings, it’s a unique recognition that this person has a unique voice that’s already earning appeal as a brand onto itself, and that match will certainly elevate their brand beyond simple athletic performance.\n\nThis article does indeed recognize that younger athlete influencers can actually sell more goods and services because they are adept at using their authenticity to advocate products they believe in, and that non-scripted authentic self encourages others to vote with their wallets.\n\nInteresting times, especially as 80% of states now allow these NIL deals with high school players.\n\nMore to come.",
        "reactions": {
          "likes": "2\nG. Brent Barkin and 1 other",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Thanks Brent - always like discussing NIL with you. ",
            "userName": "Mike Stashak",
            "userProfileURL": "https://www.linkedin.com/in/mikestashak",
            "dataId": "urn:li:comment:(activity:7292270693180653568,7292576577534541824)"
          }
        ],
        "commentAdded": "Great insights! The shift towards recognizing young athletes as brands is a game changer. Excited to see how this evolves! #NIL"
      },
      {
        "postId": "urn:li:activity:7292761390442778624",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292761390442778624",
        "url": "https://www.linkedin.com/in/praveshmaurya?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAC04Pb8BSG-2daPlPr1HQ86TmtMpVb589sY",
        "name": "Pravesh Maurya\nPravesh Maurya",
        "content": " The Power of Leadership in Business \nGreat businesses aren’t just built on ideas; they’re built on strong leadership.  As a Founder & CEO, I’ve learned that leadership is more than just giving orders—it’s about inspiring, guiding, and empowering your team.\nHere’s what I believe makes a great leader:\n Vision & Clarity – A leader must set a clear direction and keep the team aligned.\n Leading by Example – Actions speak louder than words. If you want dedication, show it first.\n Empowering Others – Trust your team, delegate responsibilities, and help them grow.\n Adaptability – The best leaders embrace change and adjust to challenges with confidence.\n Emotional Intelligence – Leadership is about people, not just processes. Listen, understand, and support.\nAt Dream LogicX, leadership isn’t about titles—it’s about driving impact and creating opportunities for growth. \n What’s one leadership lesson you’ve learned in your journey? Let’s discuss below! ",
        "reactions": {
          "likes": "2",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Great insights! Leadership truly shapes company culture. One lesson I’ve learned is that vulnerability fosters trust and connection."
      },
      {
        "postId": "urn:li:activity:7293229024628146177",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293229024628146177",
        "url": "https://www.linkedin.com/in/kiran-hr?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAHhYG4BnNcuAhvc-Nzupufy7LLXhlThd7U",
        "name": "Kiran Babu\nKiran Babu",
        "content": "I GOT LAID OFF… and it was the best thing that ever happened to me\n\nI remember sitting at my desk, the ping of the email hitting my inbox\n\nSubject: Organizational Restructuring.\n\nI didn’t even need to open it to know what was coming. That sinking feeling hit me like a freight train—I was laid off. For a moment, the world seemed to stop.\n\nWhat now? Mortgage payments, bills —how was I going to keep it all together?\n\n\nIt’s natural to feel defeated, overwhelmed, maybe even a little lost. First, change your state. Move your body, get outside, breathe deeply.\n\nWhen I felt crushed, I didn’t stay in bed. I put on my running shoes and hit the pavement, joined a dance class, picked up cooking, socialized.\n\nMotion creates emotion. When you shift your physiology, your mind follows.\n\n\nWhen you’re laid off, it’s tempting to retreat into a shell, but that’s the exact opposite of what you need.\n\nDon’t just send a bland, “Hey, I’m looking for work” message. Instead, let your network see your passion and skills. Post about what you’ve achieved, share what you’re excited about, and make it personal.\n\nWhen I reached out to my network, I didn’t just ask for help—I showed them how I could add value. And the opportunities started rolling in.\n\n\nA layoff might feel like a door closing, but what if it’s the universe forcing you to knock on the one that leads to your dream job?\n\nI'd say “Life is happening for you, not to you.”\n\n\nWhile you’re job hunting, carve out time to pursue the dream.\n\nAlways wanted to shift industries? Now’s the time.\nBeen eyeing that certification or side hustle? Dive in.\n\nWhen I was laid off, I didn’t just settle for any job—I aimed higher. And guess what? I landed a role that paid more and aligned perfectly with my passions.\n\n\nYou are stronger than this moment. You are bigger than your job title. This layoff? It’s just a plot twist in your success story.\n\nSo feel the hit, eat that ice cream, but then GET UP. Rally your network, chase that dream, and show the world that a setback isn’t the end—it’s the fire that forges your next big win.\n\nBecause you, my friend, are unstoppable.",
        "reactions": {
          "likes": "147",
          "comments": "3 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "This is the kind of perspective that turns setbacks into stepping stones. More people need to hear this Kiran Babu",
            "userName": "Sadia Khanani, MD, FSBI",
            "userProfileURL": "https://www.linkedin.com/in/sadia-khanani-md-fsbi-5562b9318",
            "dataId": "urn:li:comment:(activity:7293165277389680640,7293283884287369217)"
          }
        ],
        "commentAdded": "What an inspiring perspective! Embracing change can lead to incredible new opportunities. Thanks for sharing your journey—truly motivating! 💪✨"
      },
      {
        "postId": "urn:li:activity:7293302466249441280",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293302466249441280",
        "url": "https://www.linkedin.com/in/andrewyng?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAqBL5gBXJ8MGhQh-qHYyxAOW-DYlHM3VLg",
        "name": "Andrew Ng\nAndrew Ng",
        "content": "Introducing Agentic Object Detection!\n\nGiven a text prompt like “unripe strawberries” or “Kellogg’s branded cereal” and an image, we use an agentic workflow to reason at length and detect the specified objects. No need to label any training data. Watch the video for details.\n\nOr play with the demo here:",
        "reactions": {
          "likes": "1,397",
          "comments": "50 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/72c4d17a-d868-4076-93cf-8528fa01b29f",
        "comments": [
          {
            "commentText": "Wow, this is truly impressive Andrew Ng. The agentic workflow approach to object detection is a game-changer, especially for those who don't have access to labeled training data. It's amazing how AI technology continues to evolve and improve, making tasks like object detection more efficient and accurate. I can see this being incredibly useful in various industries, from retail to healthcare. Keep up the great work.",
            "userName": "Kshitij Sharma",
            "userProfileURL": "https://www.linkedin.com/in/kshitij-sharma-1ab338266",
            "dataId": "urn:li:comment:(ugcPost:7293299270349135873,7293312899928727554)"
          }
        ],
        "commentAdded": "Exciting innovation! Agentic Object Detection opens new doors for AI understanding. Cant wait to see the demo in action! 🚀"
      },
      {
        "postId": "urn:li:activity:7293275815591522304",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293275815591522304",
        "url": "https://www.linkedin.com/in/emma-stratton-punchy?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAWCygkBgyghT99pxh_IU24FDOXxP41xGbs",
        "name": "Emma Stratton\nEmma Stratton",
        "content": "You have a natural tendency to write messaging that assumes your reader knows what you know. \n\nDon’t worry, it’s not just you. We all have this tendency\n\nWe unconsciously assume other people see the inherent value of a feature the same way we see it.\n\nIt’s like if you’re a really great cook.\n\nYou have so much experience stored in your brain that you can’t remember what it was like to NOT know all that stuff.\n\nSo you dive into the nuances of achieving a fluffy soufflé for an audience that doesn’t know how to properly crack an egg \n\nNo wonder so much tech messaging goes over people’s heads, right?\n\nThat’s why you want to get clear on your customer’s level of knowledge about your product.\n\nAsk yourself:\n\n– How tech-savvy are my customers?\n– How solution-aware are my customers?\n\nUse the answers to shape your messaging.\n\nThis will help you write without assuming your customers know what you know.\n\nSo you can meet them on their level \n\n\n\n\n\n Join my upcoming cohort and get better at messaging \n\nLink in comments ",
        "reactions": {
          "likes": "50\nAuroriele Hans and 49 others",
          "comments": "7 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Yep. I've even had tech founders tell me they want the copy to be overly technical so the right audience knows it for them. The page was 50% acronyms. ",
            "userName": "Auroriele Hans",
            "userProfileURL": "https://www.linkedin.com/in/auroriele-hans-b2b-saas-email-strategist-and-conversion-copywriter",
            "dataId": "urn:li:comment:(activity:7293274751777566720,7293275775477104641)"
          }
        ],
        "commentAdded": "Great insights! Meeting customers at their level is key to effective messaging. Excited to see how your cohort helps refine this skill!"
      },
      {
        "postId": "urn:li:activity:7293295482896846849",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293295482896846849",
        "url": "https://www.linkedin.com/in/raymondlyles?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADhhqDUBng9q5kPw1AW3CWZj4Pm6Aui3oXc",
        "name": "Ray Lyles\nRay Lyles",
        "content": "\"I’m Bringing visions to life, one project at a time. As a Creative Director, I love transforming ideas into impactful experiences.\"- Book your appointment now!!",
        "reactions": {
          "likes": "5",
          "comments": "2 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Love it",
            "userName": "Syreta Oglesby",
            "userProfileURL": "https://www.linkedin.com/in/syreta-oglesby-5ba3062",
            "dataId": "urn:li:comment:(activity:7293263899875815424,7293295339736879105)"
          },
          {
            "commentText": "Looks great",
            "userName": "NOVELLA NOVELLA",
            "userProfileURL": "https://www.linkedin.com/in/novella-novella-2b8a476",
            "dataId": "urn:li:comment:(activity:7293263899875815424,7293296027908911105)"
          }
        ],
        "commentAdded": "Exciting to see creativity in action! Your passion for transforming ideas inspires others. Looking forward to seeing more of your impactful work!"
      },
      {
        "postId": "urn:li:activity:7293071355200090114",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293071355200090114",
        "url": "https://www.linkedin.com/in/matthewfisch?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAEPGzwBC67FIZVt4efloby-T1i39iK4hmw",
        "name": "Matthew Fisch, CISSP\nMatthew Fisch, CISSP",
        "content": null,
        "reactions": {
          "likes": "3",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/3c24f5ba-4c99-4c0b-a91f-ed10294a9577",
        "comments": []
      },
      {
        "postId": "urn:li:activity:7293309335391113216",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293309335391113216",
        "url": "https://www.linkedin.com/in/marksaint?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAghc5QB205vSJB-ACw-Dnc8pQ7QV8w7CMg",
        "name": "Mark Saint\nMark Saint",
        "content": "We've Developed AURA a Automated User Response Agent @ InASec.Ai !!!",
        "reactions": {
          "likes": "0",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Congratulations on the launch of AURA! Excited to see how it enhances user experiences and streamlines interactions. Great work, team! 🚀"
      },
      {
        "postId": "urn:li:activity:7293268316943495170",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293268316943495170",
        "url": "https://www.linkedin.com/in/audracarpenter?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAIV-XwBaHjg0Ty5MHMV9xdIMj3LIdjhmKo",
        "name": "Audra Carpenter\nAudra Carpenter",
        "content": "Everyone's rushing to master AI overnight \n\nBut here's the challenging truth about AI success:\n\nIt's not about speed. It's about consistency.\n\nYes, I know, I know. You've heard that every single day of your business life. But it's even more true here.\n\n\nListen, the winners in 2025 won't be those who:\n\n↳ Chased every new AI tool\n\n↳ Copied trending prompts\n\n↳ Jumped on every AI bandwagon\n\n\n\nThey'll be the ones who:\n\n→ Picked ONE area of focus\n\n→ Built systems + processes\n\n→ Actually did the work\n\n→ Stayed consistent for 12+ months\n\n\n\nWhile others chase shiny objects, focus on mastery.\n\n\nBecause AI is both:\n\n→ Moving at light speed → A long-term game\n\n\nThe paradox?\n\n\nYou need to start NOW. But you also need patience.\n\nStop looking for overnight success. Start building your AI expertise brick by brick.\n\n\nRemember AI isn't the tool to become lazier, it's a tool to help you become greater!\n\n\n- Audra ️\n\n\n️ Repost this if you're playing the long game with AI.\n\nPS: What's your ONE AI focus area for 2025? Comment below ",
        "reactions": {
          "likes": "6",
          "comments": "7 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Then, a few of us put in the work across multiple AI fronts, but it has to be your full time job at that point.",
            "userName": "Dan Sanchez",
            "userProfileURL": "https://www.linkedin.com/in/digitalmarketingdan",
            "dataId": "urn:li:comment:(activity:7293268316943495170,7293305804353359872)"
          },
          {
            "commentText": "Dan Sanchez  stinkin' percent \n\nEvery day I wake up excited to bring my A game for what's new and next!",
            "userName": "Audra Carpenter",
            "userProfileURL": "https://www.linkedin.com/in/audracarpenter",
            "dataId": "urn:li:comment:(activity:7293268316943495170,7293308973749809152)"
          },
          {
            "commentText": "Agreed. I’m focused on working with AI like I would a colleague spending the time to onboard and train just like i would a new team member.",
            "userName": "David Waring",
            "userProfileURL": "https://www.linkedin.com/in/dave-waring",
            "dataId": "urn:li:comment:(activity:7293268316943495170,7293298560211533826)"
          },
          {
            "commentText": "David Waring David did you ever think you'd be making a statement like that in your lifetime? \n\nI don't think I did. Wanted to but never really thought I'd have the gift.",
            "userName": "Audra Carpenter",
            "userProfileURL": "https://www.linkedin.com/in/audracarpenter",
            "dataId": "urn:li:comment:(activity:7293268316943495170,7293309218378457088)"
          }
        ],
        "commentAdded": "Great insights, Audra! Consistency truly is key in mastering AI. Excited to see where focused efforts can take us by 2025! 🚀 #AIJourney"
      },
      {
        "postId": "urn:li:activity:7293241051945877505",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293241051945877505",
        "url": "https://www.linkedin.com/in/dr-axa-yox-first-prize-award-8529b1262?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAECTUn4BIQ-5G6CNHiuTrqrr3sl8yfKG-GU",
        "name": "Dr. Axa Yox, First-Prize Award\nDr. Axa Yox, First-Prize Award",
        "content": "No. is a full sentence.\n\nWhat's the one thing you learned in 2025 so far?\n\nWith",
        "reactions": {
          "likes": "56",
          "comments": "88 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/beffc84f-fb9c-44df-8275-3c0fcac0a8a4",
        "comments": [
          {
            "commentText": "Love this! For me, it's outsourcing. The whole \"I can take care of it\" song is getting old! Ooh, thank you, I just thought of another thing I can outsource!",
            "userName": "Malkie Rimon",
            "userProfileURL": "https://www.linkedin.com/in/malkie-rimon",
            "dataId": "urn:li:comment:(ugcPost:7293216345767174145,7293241002130042880)"
          },
          {
            "commentText": "Malkie Rimon great to hear it helped\n\nYes, is a full sentence, too! You got it!\nwe have many professionals in our LinkedIn family who can help you!",
            "userName": "Dr. Axa Yox, First-Prize Award",
            "userProfileURL": "https://www.linkedin.com/in/dr-axa-yox-first-prize-award-8529b1262",
            "dataId": "urn:li:comment:(ugcPost:7293216345767174145,7293245581693452289)"
          },
          {
            "commentText": "Dr. Axa Yox, First-Prize Award it's great!",
            "userName": "Malkie Rimon",
            "userProfileURL": "https://www.linkedin.com/in/malkie-rimon",
            "dataId": "urn:li:comment:(ugcPost:7293216345767174145,7293247015377895424)"
          }
        ],
        "commentAdded": "Embracing adaptability has been key this year. How about you? What’s your biggest takeaway from 2025 so far?"
      }
    ],
    "errors": [
      {
        "postId": "urn:li:activity:7292270693180653568",
        "url": "https://www.linkedin.com/in/gbrentbarkin?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAI5v54B8OquVDdHfjnHpuC9Ga3eD6YsXtk",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292761390442778624",
        "url": "https://www.linkedin.com/in/praveshmaurya?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAC04Pb8BSG-2daPlPr1HQ86TmtMpVb589sY",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293229024628146177",
        "url": "https://www.linkedin.com/in/kiran-hr?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAHhYG4BnNcuAhvc-Nzupufy7LLXhlThd7U",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293275815591522304",
        "url": "https://www.linkedin.com/in/emma-stratton-punchy?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAWCygkBgyghT99pxh_IU24FDOXxP41xGbs",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293295482896846849",
        "url": "https://www.linkedin.com/in/raymondlyles?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADhhqDUBng9q5kPw1AW3CWZj4Pm6Aui3oXc",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293071355200090114",
        "url": "https://www.linkedin.com/in/matthewfisch?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAEPGzwBC67FIZVt4efloby-T1i39iK4hmw",
        "errors": [
          "Failed to fetch content."
        ]
      },
      {
        "postId": "urn:li:activity:7293309335391113216",
        "url": "https://www.linkedin.com/in/marksaint?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAghc5QB205vSJB-ACw-Dnc8pQ7QV8w7CMg",
        "errors": [
          "Failed to fetch reactions.",
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293268316943495170",
        "url": "https://www.linkedin.com/in/audracarpenter?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAIV-XwBaHjg0Ty5MHMV9xdIMj3LIdjhmKo",
        "errors": [
          "Failed to fetch media URL."
        ]
      }
    ]
  },
  {
    "postsData": [
      {
        "postId": "urn:li:activity:7293307160589971457",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293307160589971457",
        "url": "https://www.linkedin.com/in/lukaor?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAD0b_ABTWSb6o_mOJvFRXbb4GIN6N2_0B8",
        "name": "luka or\nluka or",
        "content": "AI isn't a magic wand for design... But when designers master the when and how of using AI in their workflow - the result can be amazing.\n\n\nLast year, inspired by design educators likeand, and together with my colleague Shir Atar , I took on a challenge with my Industrial Design students at HIT: exploring how AI could fit into the design process.\n\nThe idea was simple but ambitious—learning by doing.The students developed their own methods for using AI tools, combining them with traditional techniques and personal insights. They didn’t stop there—they turned their discoveries into tutorial videos to share with the wider design community. Fast forward to today: we’re in the second year of this journey, and the results continue to inspire me.\nThis year, nine more student groups tackled diverse applications of AI in design, from AI-driven Ideation and AI-VR integration to re imagining mock-ups and 3D modeling workflows.\nThe outcome? A collection of tutorials showing how AI can elevate the design process, now available for anyone curious about integrating AI into their work.\nA few lessons stand out from this experience:\nLetting go of the fear of change makes experimenting with AI feel less intimidating—it’s just another powerful tool in our creative toolbox.\nStarting small, like testing AI on one part of the design process, can spark new methods that inspire and elevate creativity.\nThe magic lies in personalization—finding the unique mix of tools that works for you.\nIt’s been a great experience to guide students as they explore how designers can shape the future with AI, rather than letting it shape us.\n*Both the website and videos are in Hebrew, but (AI) subtitles are available we are working on a translated version to be up and running soon.\n\nin the video- a preview to the student's tutorial videos on the course's site:",
        "reactions": {
          "likes": "3\nBrian Sykes and 2 others",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/8ec49cb0-f602-4083-8a36-a7279537aac9",
        "comments": [
          {
            "commentText": "Learning by DOING is my biggest push! Love that I got to be a small part of inspiration. I will have a fun time this weekend diving into these student led tutorials!",
            "userName": "Brian Sykes",
            "userProfileURL": "https://www.linkedin.com/in/brianwsykes",
            "dataId": "urn:li:comment:(ugcPost:7293303225695281152,7293308051107766274)"
          }
        ],
        "commentAdded": "Inspiring initiative! Excited to see how these students blend traditional design with AI—innovation thrives at the intersection of creativity and technology!"
      },
      {
        "postId": "urn:li:activity:7288488635845287937",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7288488635845287937",
        "url": "https://www.linkedin.com/in/jepsontaylor?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAT1knkBKurLdx7ocCJOtEwdp07TIBzisxg",
        "name": "🦾Jepson Taylor\n🦾Jepson Taylor",
        "content": "I feel like I need to watch an entire movie explaining Arcane. Just finished it, so many questions. Felt that same way with Attack on Titans, need a movie to understand it.",
        "reactions": {
          "likes": "6",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Both series are fantastic! Their depth leaves us wanting more. Any recommendations for similar shows or insightful analyses?"
      },
      {
        "postId": "urn:li:activity:7293306451916189696",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293306451916189696",
        "url": "https://www.linkedin.com/in/liam-lawson-674b3120a?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADU0YXgBbLnfS8W1Tv74evGt0VFkpaqQRys",
        "name": "Liam Lawson\nLiam Lawson",
        "content": "Most businesses are failing at implementing AI...\n\nThey know it exists. \n\nThey know it’s powerful.\n\nBut when it comes to turning AI into real results—efficiency, revenue, automation—they’re completely lost.\n\nThat’s exactly why I sat down with, CEO of, on this weeks episode of.\n\nWe broke down:\n- The biggest shifts in AI from 2024 to 2025\n- The best AI tools for automation & business growth\n- The real reason most companies struggle with AI adoption,\n\nCurious about how businesses can actually implement AI?\n\nTun in to the full episode, out tomorrow at 9 a.m. GMT!",
        "reactions": {
          "likes": "3",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/7c262654-3654-4daf-8bda-a655d1e532b6",
        "comments": [
          {
            "commentText": "what a great conversation - so much value. from strategy and mindset to tactics and tools. I am looking forward to listening to this episode",
            "userName": "Isar Meitis",
            "userProfileURL": "https://www.linkedin.com/in/isarmeitis",
            "dataId": "urn:li:comment:(ugcPost:7293303397972103169,7293306773673791489)"
          }
        ],
        "commentAdded": "Excited to hear your insights on AI adoption! It’s crucial for businesses to leverage these tools effectively. Looking forward to the episode!"
      },
      {
        "postId": "urn:li:activity:7292418450931494912",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292418450931494912",
        "url": "https://www.linkedin.com/company/squareboat/posts",
        "name": "Squareboat\nSquareboat",
        "content": "At Squareboat, We Sail Through Code! \n\nFrom \"All Hands on Deck!\" in production to \"We’re Flagged for Error!\" in QA, coding is just like sailing. Smooth or stormy—we navigate it all! ",
        "reactions": {
          "likes": "17",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Absolutely love this analogy! Just like sailing, every line of code leads us to new horizons. Here’s to navigating challenges together! ⛵💻"
      },
      {
        "postId": "urn:li:activity:7293257536881774593",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293257536881774593",
        "url": "https://www.linkedin.com/in/surabhi-shenoy-ceo-coach?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAC6IyagB63u_arZR9u6AI0smjQSx1sD1ucA",
        "name": "Surabhi Shenoy\nSurabhi Shenoy",
        "content": "\"Nobody cares about us.\"\n\nThese words changed how I saw culture.\n\nThey didn't come from our engineers.\nThey came from our competitor's engineers.\n\nContext:\nAs a tech company, one of our services included\ndeploying engineers at client sites.\n\nThey worked alongside people from other vendors.\n\nThe industry norm?\nOnce deployed, they were out of sight, out of mind.\n\nWe refused to accept that.\n\nInstead, we did this:\n↳ Once a month, our HR visited them.\n\nNot for paperwork.\nNot for performance reviews.\nJust to connect — human to human.\n\nThe ritual was simple:\n→ Bring their favorite snacks\n→ Share some laughs\n→ Take fun pictures\n→ Actually listen\n→ Truly care\n\nTiny gestures. Massive impact.\n\nWhat happened next surprised us:\n\n1. Our engineers felt anchored\nEven off-site, they knew they belonged.\n(Loyalty and retention skyrocketed.)\n\n2. Clients took notice\n\"You actually care for your people.\"\n(We became their vendor of choice.)\n\n3. Our competitor’s engineers took notice\n\"Nobody does this for us.\"\n(We became their employer of choice.)\n\nThe big lesson?\nCulture isn’t built inside your office.\n↳ It’s built 𝘄𝗵𝗲𝗿𝗲𝘃𝗲𝗿 your people are.\n\nMost companies think:\nOut of sight = Out of mind.\n\nReality?\nOut of sight = Needs more mind.\n\nCheckout the exact frameworks we used to build strong bonds with off-site teams\n\nSave it for future.\n\nFound this valuable? ️ Repost to your network and followfor more.\n\n--\n\nWant to level up your CEO game?\n\n𝗝𝗼𝗶𝗻 𝗖𝗘𝗢 𝗠𝗮𝘀𝘁𝗲𝗿𝘆 —my free weekly newsletter trusted by 1500+ Founders and CEOs.\n\nEvery Thursday, I share systems and strategies that helped me start, scale, and exit 2 MM$ businesses (now helping my clients do the same).\n\n BONUS: Get instant access to my 'CEO’s Growth Playbook' (27 exclusive cheatsheets).\n\nClick \"𝗩𝗶𝗲𝘄 𝗺𝘆 𝗻𝗲𝘄𝘀𝗹𝗲𝘁𝘁𝗲𝗿\" above or scan the QR code below.",
        "reactions": {
          "likes": "351",
          "comments": "115 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Small gestures, like truly listening and making people feel valued, can create ripple effect",
            "userName": "Rahul Kumar",
            "userProfileURL": "https://www.linkedin.com/in/rahul-kumar-b91328332",
            "dataId": "urn:li:comment:(activity:7293230198701891585,7293312756215083012)"
          }
        ],
        "commentAdded": "Love this approach! True connections make all the difference in culture and retention. A great reminder that people matter, no matter where they are!"
      },
      {
        "postId": "urn:li:activity:7293284604386361344",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293284604386361344",
        "url": "https://www.linkedin.com/in/madina-shaik?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAMt6EBi3qIcpvVfoL8w-6iIfHsEYsaaPA",
        "name": "Madina Shaik\nMadina Shaik",
        "content": "How do we find investors who are the right fit?\n\nHere are the key factors we look at and the criteria we follow to find the perfect partners for every project.\n\nI also talk about howspots opportunities others might miss and the strategies we use to drive value in our investments - get the scoop in the full interview on the Future Forward Podcast hosted byKumar.",
        "reactions": {
          "likes": "3",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/9ee2d625-f8e8-417b-9b1a-436b04193c55",
        "comments": [],
        "commentAdded": "Great insights! Finding the right investors can transform a project. Excited to hear more about your strategies on the podcast! 🎧"
      },
      {
        "postId": "urn:li:activity:7290741820022575104",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290741820022575104",
        "url": "https://www.linkedin.com/in/adamcboggs?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAleqsBokR5OtINxWoQeepdyDwoBz3vOnI",
        "name": "Adam Boggs\nAdam Boggs",
        "content": "Too many meetings feel like a grind—full of resistance, misalignment, and wasted time. But what if you could flip that resistance into momentum?\nIn my latest post, I break down how to run meetings that move people forward instead of holding them back. Whether you're leading a team, driving change, or just trying to get more done with less friction, these strategies will help.\n\nWould love to hear your thoughts—how do you turn resistance into progress in your meetings?",
        "reactions": {
          "likes": "2",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Great insights! Transforming resistance into progress is key. Im eager to implement your strategies and boost our teams effectiveness!"
      },
      {
        "postId": "urn:li:activity:7293264039172784129",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293264039172784129",
        "url": "https://www.linkedin.com/in/arafathossen-profile?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAEgke4kBuZxP4-EyxhsqAZU2YRxcPGq2poA",
        "name": "Arafat Hossain\nArafat Hossain",
        "content": "Your website is losing money...\n\n(and templates are to blame)\n\nHere’s why you’re shooting yourself in the foot.\n\nLet me explain.\n\nTemplates promise a “professional” site in minutes.\n\nBut they’re designed for everyone.\n\nWhich means they work for no one.\n\nThink about it.\n\nWould you wear a suit tailored for The Rock?\n\nOf course not.\n\n(Unless you’re also 6’5” and built like a tank)\n\nHere’s what happens when you use templates:\n\n1. Your site looks like everyone else’s.\n2. Users leave before they even see what you offer.\n3. Your brand screams “generic”.\n\nI recently analyzed a template-based site.\n\nIt looked “good enough”.\n\nBut it wasn’t converting.\n\nWhy?\n\nBecause templates don’t consider:\n\n↳ Your unique value.\n↳ Your audience’s behavior.\n↳ Your business goals.\n\nInstead of settling, here’s what works:\n\n→ Build a site that tells YOUR story.\n→ Design for YOUR audience.\n→ Solve YOUR customer’s problems.\n\nTemplates are bandaids.\n\nNot solutions.\n\nAnd your business deserves better.\n\nP.S. If you’re tired of blending in, it’s time to stand out.\n\n- - - - -\n\nBTW, need a website that drives growth and attracts your ideal customers?\n\nBetter message,!",
        "reactions": {
          "likes": "7\nAuroriele Hans and 6 others",
          "comments": "10 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Sames goes for your copy (looking at you copy-paste Gen AI users). ",
            "userName": "Auroriele Hans",
            "userProfileURL": "https://www.linkedin.com/in/auroriele-hans-b2b-saas-email-strategist-and-conversion-copywriter",
            "dataId": "urn:li:comment:(activity:7293260811416805377,7293264009842016256)"
          },
          {
            "commentText": "Auroriele Hans For sure. Generic copy kills conversions just as much as generic design.\n\nAs soon as I see words like \"empowering\", \"seamlessly\"... on a website\n\nI’m like - okay, bye. If you put no effort into telling me about your service/product, why should I trust you?",
            "userName": "Arafat Hossain",
            "userProfileURL": "https://www.linkedin.com/in/arafathossen-profile",
            "dataId": "urn:li:comment:(activity:7293260811416805377,7293267952202588160)"
          }
        ],
        "commentAdded": "Absolutely spot on! A customized website is key to standing out and truly connecting with your audience. Generic wont cut it in today’s market!"
      },
      {
        "postId": "urn:li:activity:7292472102241083392",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292472102241083392",
        "url": "https://www.linkedin.com/in/rajanand?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABTTxABlhKrCKpDreBifuDRc9AAvO4NrpM",
        "name": "Raj Goodman Anand\nRaj Goodman Anand",
        "content": "Just wrapped up another AI workshop with EO Malaysia.\n\nThis session went beyond typical tech talk. We spoke about how AI can fundamentally transform business strategy and not just streamline processes. The real focus was on tangible business impact; how AI can directly contribute to growth and profitability. We discussed the practical steps through which AI can drive real value, moving past theory to real-world applications that move the needle for entrepreneurs and business leaders.\n\nI am genuinely curious to hear your perspective. What insights are you seeing in your industry?",
        "reactions": {
          "likes": "481",
          "comments": "21 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "I love how you’re emphasizing AI’s direct contribution to profitability, Raj. This is the type of discussion businesses need to hear!",
            "userName": "Angelo Tabada",
            "userProfileURL": "https://www.linkedin.com/in/angelo-tabada-a19771349",
            "dataId": "urn:li:comment:(ugcPost:7292472101142151168,7292805447789514752)"
          },
          {
            "commentText": "Raj Goodman Anand, your focus on tangible business impact makes all the difference! AI can unlock so much potential if applied correctly.",
            "userName": "Pedro Pinto",
            "userProfileURL": "https://www.linkedin.com/in/pepinto",
            "dataId": "urn:li:comment:(ugcPost:7292472101142151168,7292807118980562944)"
          }
        ],
        "commentAdded": "Great insights! AIs potential to reshape business strategy is enormous. Excited to see how industries adapt and thrive with these innovations!"
      },
      {
        "postId": "urn:li:activity:7293305116336541696",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293305116336541696",
        "url": "https://www.linkedin.com/in/maththinking?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAD5LcBBZCNJ3T89euZhuJxAmL1RWcykg4",
        "name": "Ju Rao\nJu Rao",
        "content": "(Open Access) Semiconductor Packaging: Materials Interaction and Reliability - https://lnkd.in/gUtY5X_x\nLook for \"Read and Download Links\" section to download. Follow/Connect me if you like this post.",
        "reactions": {
          "likes": "6",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Used to be one of my favorite topics - pre Nvidia domination and awakening",
            "userName": "Umit Sami, MBA",
            "userProfileURL": "https://www.linkedin.com/in/umitdsami",
            "dataId": "urn:li:comment:(activity:7293305116336541696,7293305701588688898)"
          }
        ],
        "commentAdded": "Great resource! Exploring materials interaction in semiconductor packaging is crucial for innovation. Thanks for sharing! Looking forward to connecting!"
      }
    ],
    "errors": [
      {
        "postId": "urn:li:activity:7288488635845287937",
        "url": "https://www.linkedin.com/in/jepsontaylor?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAT1knkBKurLdx7ocCJOtEwdp07TIBzisxg",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292418450931494912",
        "url": "https://www.linkedin.com/company/squareboat/posts",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293257536881774593",
        "url": "https://www.linkedin.com/in/surabhi-shenoy-ceo-coach?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAC6IyagB63u_arZR9u6AI0smjQSx1sD1ucA",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7290741820022575104",
        "url": "https://www.linkedin.com/in/adamcboggs?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAleqsBokR5OtINxWoQeepdyDwoBz3vOnI",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293264039172784129",
        "url": "https://www.linkedin.com/in/arafathossen-profile?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAEgke4kBuZxP4-EyxhsqAZU2YRxcPGq2poA",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292472102241083392",
        "url": "https://www.linkedin.com/in/rajanand?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABTTxABlhKrCKpDreBifuDRc9AAvO4NrpM",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293305116336541696",
        "url": "https://www.linkedin.com/in/maththinking?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAD5LcBBZCNJ3T89euZhuJxAmL1RWcykg4",
        "errors": [
          "Failed to fetch media URL."
        ]
      }
    ]
  },
  {
    "postsData": [
      {
        "postId": "urn:li:activity:7293274369416396800",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293274369416396800",
        "url": "https://www.linkedin.com/in/amir-tabch?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACtovxcBQFgProDaob15jIuBjp9gl70BoRA",
        "name": "Amir Tabch\nAmir Tabch",
        "content": "Great leaders take it in stride—even when it’s a brick to the face\n\nLeadership is a lot like walking through a crowded street: no matter how smoothly you navigate, someone’s going to bump into you, step on your foot, or spill their coffee down your shirt. & if you’re leading anything worthwhile, you’re going to get hit with far worse—criticism, setbacks, & the occasional existential crisis over why you ever signed up for this in the first place.\n\nThe best leaders don’t just survive these moments; they take them in stride. They don’t flinch, don’t spiral, & definitely don’t rage-post on LinkedIn about how ungrateful their team is. They absorb the blow, recalibrate, & move forward like it was all part of the plan.\n\nAn HBR study found that leaders who demonstrate emotional resilience in the face of criticism or failure foster 33% higher engagement among their teams. Meanwhile, those who react poorly create a ripple effect of stress, disengagement, & occasional popcorn-worthy workplace drama.\n\nIn other words, when you take setbacks in stride, your team learns to do the same. & that’s how you build a culture that can actually handle pressure—instead of one that collectively loses its mind every time there’s a bad quarter.\n\nNot sure if you take things in stride? Here’s a quick test:\n\n• Someone gives you tough feedback. Do you: A) Thank them & reflect on it? (Good.) B) Spend the next 48 hours coming up with a strategic revenge plan? (Bad.)\n\n• A project flops. Do you: A) Gather your team, assess what went wrong, & move forward? (Good.) B) Launch into a dramatic monologue about how nobody respects your genius? (Bad.)\n\n• A team member challenges your decision. Do you: A) Listen & evaluate their perspective? (Good.) B) Reply with, \"Do you know who I am?!\" (Bad & also embarrassing.)\n\nIf you find yourself leaning toward the \"bad\" column, don’t worry. Here’s how you can develop this essential leadership skill:\n\n1. Pause before you react — When hit with criticism or bad news, don’t react immediately. Take a breath. Count to six. Or, if necessary, step outside & scream into the void (privately).\n\n2. Reframe the setback — Instead of seeing failures or critiques as personal attacks, view them as data. What can you learn? How can this make you better?\n\n3. Keep the big picture in mind — Will this matter in a month? A year? Most things that feel like earthquakes today are barely speed bumps in hindsight.\n\n4. Lead by example — If you panic, your team panics. If you stay cool, they stay cool. Simple as that.\n\nLeadership will always throw curveballs your way. If you take every hit personally, you won’t last long. But if you take things in stride, you’ll build resilience—not just for yourself, but for your entire team.\n\nSo, the next time someone drops a load of criticism on you, just smile, nod, & keep moving. & maybe, just maybe, invest in a metaphorical helmet.",
        "reactions": {
          "likes": "647",
          "comments": "5 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Indeed - it’s not about avoiding setbacks, but about handling them with grace and turning them into learning opportunities. ",
            "userName": "Rakesh Sharma",
            "userProfileURL": "https://www.linkedin.com/in/rakesh-sharma-succession",
            "dataId": "urn:li:comment:(activity:7293109545470464000,7293126958748508162)"
          }
        ],
        "commentAdded": "Absolutely agree! Resilience in leadership is key to fostering a strong, united team. Its all about turning obstacles into growth opportunities! 🌱"
      },
      {
        "postId": "urn:li:activity:7293252951962226688",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293252951962226688",
        "url": "https://www.linkedin.com/in/ychowdhury?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACaawXcBYYg0wn5Vr6gmk98Pheyl7k_znN8",
        "name": "Yash Chowdhury\nYash Chowdhury",
        "content": "Indie Hacker Blog is one of the most relatable easy to read and understand blog that I have read in a long time",
        "reactions": {
          "likes": "1",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Absolutely agree! Indie Hacker Blog offers valuable insights in such a digestible format—perfect for entrepreneurs seeking inspiration!"
      },
      {
        "postId": "urn:li:activity:7293189267181215744",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293189267181215744",
        "url": "https://www.linkedin.com/in/ameliasordell?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAA0ZfGYB0seFtZMfePUDD0gAglXRJ87u6XU",
        "name": "Amelia Sordell 🔥\nAmelia Sordell 🔥",
        "content": "Everyone wants to be “authentic” online.\nUntil it actually requires being yourself.\n\nYou aren’t building a personal brand. You're curating a persona.\n\n- Posting what’s safe.\n- What’s acceptable.\n- What won’t ruffle feathers.\n\nAnd then they wonder why no one is paying attention.\n\nThe truth? Your personal brand isn’t about being liked. It's about being known.\n\nAnd I've never met anyone who is well known that filtered themselves down to fit in.\n\nOwn your opinions.\nTake up space.\nShow up as you TRULY are.\n\nStop trying to sound like everyone else - be yourself. Loudly.\n\nIf you need the support, community, and confidence to get there, join my LinkedIn LIVE FREE today at 12.15pm GMT.\n\nHundreds of us come together to meet, learn, collaborate and support one another on our personal branding journeys - authentically.\n\nBecause in a world where EVERYONE is trying to fit in - it pays the most to stand out.\n\nSo, are you in?\n\n",
        "reactions": {
          "likes": "480",
          "comments": "182 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/baa4ea45-4a81-4a0a-a6cb-14b5651349fa",
        "comments": [
          {
            "commentText": "When it comes to branding, chances are that some people won't like what you put out Amelia Sordell \n\nBut a greater chunk of people would. So why hide yourself because of a few nay-sayers?",
            "userName": "Blessing Ikpia",
            "userProfileURL": "https://www.linkedin.com/in/blessing-ikpia-54b790244",
            "dataId": "urn:li:comment:(ugcPost:7293180322941218816,7293189251620376576)"
          }
        ],
        "commentAdded": "Absolutely agree! Authenticity is key in personal branding. Cant wait for your LIVE session to dive deeper into this! 🌟 #BeYourself"
      },
      {
        "postId": "urn:li:activity:7293307623586598913",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293307623586598913",
        "url": "https://www.linkedin.com/in/priyank-ahuja?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAL9WCIBlpfzadAVTWPPVd5XG57aasvhRYY",
        "name": "Priyank Ahuja\nPriyank Ahuja",
        "content": "I don't understand why everyone wants US, Canadian, Australian, or German Citizenship.\n\nHere are 10 sites for finding remote jobs that pay in USD worldwide:\n\n[1] Truly Remote\n\nFeatures jobs that allow you to work from anywhere, with new listings added daily.\n\n\n\n[2] RemoteCo\n\nOffers a variety of remote international jobs across multiple industries, including tech, marketing, and customer support.\n\n\n\n[3] Remotive\n\nProvides a curated list of remote jobs in tech, customer support, marketing, and more, accessible to candidates worldwide.\n\n\n\n[4] Jobspresso\n\nFeatures a wide range of remote job opportunities in tech, marketing, customer service, and other sectors, open to international applicants.\n\n\n\n[5] SkipTheDrive\n\nAggregates remote job listings from various industries, including IT, project management, and healthcare, suitable for global candidates.\n\n\n\n[6] Interview Sidekick\n\nYour Personal AI Interview Assistant. Receive real-time, discreet feedback during live interviews.\n\n\n\n[7] Cover Letter Copilot\n\nCraft cover letters in under a minute using your resume and job description.\n\n\n\n[8] Eztrackr\n\nTrack your job applications effortlessly, gain valuable insights, all in one place\n\n\n\n[9] Resume builder\n\nNow you don't have to waste hours on building a resume. This tool can help you out in minutes.\n\n\n\n[10 BetterPic\n\nTransform any selfie into a professional LinkedIn headshot.\n\n\n\nHope you find this content useful.\n\nLike, Comment, Share for better reach.\n\nLooking for help, mentorship or career counselling?\nBook your 1:1 session at:\n\nFollow\n\nTwitter:\nInstagram:\nThreads:\nTelegram:",
        "reactions": {
          "likes": "471",
          "comments": "86 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "The way you present is truly impressive. It provided me with value on. Keep up the great work, and I look forward to seeing more from you in the future!",
            "userName": "Dr.Shivani Sharma",
            "userProfileURL": "https://www.linkedin.com/in/dr-shivani-sharma-animagecoach",
            "dataId": "urn:li:comment:(activity:7293222119130157056,7293313801603399681)"
          },
          {
            "commentText": "Useful tips Priyank Ahuja ",
            "userName": "Vedant Purohit",
            "userProfileURL": "https://www.linkedin.com/in/vedantpurohit04",
            "dataId": "urn:li:comment:(activity:7293222119130157056,7293294735882866688)"
          }
        ],
        "commentAdded": "Great resources! The future of work is remote, and these options open up global opportunities. Excited to explore them! 🌍💼"
      },
      {
        "postId": "urn:li:activity:7293274964068122624",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293274964068122624",
        "url": "https://www.linkedin.com/in/annachernyshova1?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACnZ9egBfnNe0XqSWaDo9A-aIgsUneNkzAg",
        "name": "Anna Chernyshova\nAnna Chernyshova",
        "content": "75% of employees leave jobs because of their managers (Gallup).\n\nPeople don't leave bad jobs, they leave:\n\n Low pay – feeling undervalued leads to job hunting.\n No career growth – no advancement means no future.\n Toxic work culture – negativity makes work unbearable.\n Bad managers – poor leadership drives employees away.\n Feeling burned out – overwork kills motivation and health.\n No work-life balance – constant work leads to resentment.\n No appreciation – unrecognized effort leads to disengagement.\n\nHere is what people care about:\n\n Work-life balance – respecting boundaries boosts retention.\n Supportive leaders – good managers create stronger teams.\n Career opportunities – growth keeps employees engaged.\n Positive culture – a great environment keeps talent.\n Being appreciated – recognition fuels motivation.\n Meaning work – purpose drives job satisfaction.\n Good pay – fair compensation builds loyalty.\n\nWhat else would you add?\n\n️ Repost if you agree\n Followfor more posts like this",
        "reactions": {
          "likes": "414",
          "comments": "293 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "People don’t leave jobs, they leave managers who schedule a \"quick sync\" at 4:59 PM on a Friday. Let’s be honest, if your job involves constant \"urgent\" tasks, no praise except for surviving another quarter, and a culture where \"work-life balance\" means replying to emails on a beach, then yeah… I’m leaving faster than a LinkedIn recruiter can say, \"Are you open to new opportunities?\"",
            "userName": "Nicolas Roquefort-Villeneuve",
            "userProfileURL": "https://www.linkedin.com/in/nicolasrv",
            "dataId": "urn:li:comment:(ugcPost:7293268575526498306,7293295626874720256)"
          }
        ],
        "commentAdded": "Absolutely! Investing in leadership development and fostering a positive culture are key to retaining top talent. Lets prioritize our people!"
      },
      {
        "postId": "urn:li:activity:7292217108069859328",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292217108069859328",
        "url": "https://www.linkedin.com/in/drmirobada?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAeYI3wBBMUorBOTN5_fJ7wwuLKK9f6DQ84",
        "name": "Dr. Miro Bada\nDr. Miro Bada",
        "content": "21 Worst Career Mistakes\n(Fix them fast to accelerate your career):\n\n1/ Solving problems that aren't yours.\n↳ Let small fires burn. Build systems that prevent them.\n\n2/ Staying because it's comfortable.\n↳ Update your resume monthly. Interview before you're stuck.\n\n3/ Making yourself irreplaceable.\n↳ Document your role and train your replacement.\n\n4/ Thinking work friends are real friends.\n↳ Schedule coffee with someone two levels up. Monthly.\n\n5/ Waiting for permission to lead.\n↳ Find a broken process. Fix it without being asked.\n\n6/ Playing the long-term game.\n↳ Build skills that travel, not roots that trap.\n\n7/ Avoiding office politics.\n↳ Build three allies above your pay grade.\n\n8/ Hiding behind hard work.\n↳ Turn wins into visible process improvements.\n\n9/ Trusting HR is on your side.\n↳ Document everything. Build your own evidence trail.\n\n10/ Saving questions for later.\n↳ Ask the awkward question in the big meeting.\n\n11/ Chasing titles over skills.\n↳ Focus on building rare, valuable skills.\n\n12/ Becoming too specialized.\n↳ Learn adjacent skills. Build breadth and depth.\n\n13/ Avoiding difficult conversations.\n↳ Address issues early. Be direct but kind.\n\n14/ Not building your network.\n↳ Build one new connection weekly. Stay in touch monthly.\n\n15/ Ignoring industry trends.\n↳ Read industry news daily. Learn one new tool monthly.\n\n16/ Taking credit instead of giving it.\n↳ Highlight their contributions. Build through generosity.\n\n17/ Not negotiating early offers.\n↳ Research market rates. Ask for more than is comfortable.\n\n18/ Staying too long in one role.\n↳ Change roles every 2-3 years. Seek new challenges.\n\n19/ Not building personal brand.\n↳ Share insights weekly. Build thought leadership.\n\n20/ Avoiding all risk.\n↳ Take one calculated risk quarterly.\n\n21/ Working without metrics.\n↳ Define key success metrics. Track and share results.\n\n---\n\nP.S. - Don't forget to check the carousel for how to spot each mistake.\n\nWhat’s your biggest career mistake?\nTell me below \n\n️ Followand share this to help others\n Save this post for future reference!⁣⁣⁣⁣\n\nIf you want a copy of my top 60+ infographics (free):\n Like, Repost, then Signup here:",
        "reactions": {
          "likes": "15,619",
          "comments": "1,360 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Insightful",
            "userName": "Thomas Wiegelman",
            "userProfileURL": "https://www.linkedin.com/in/thomas-wiegelman-05793a7",
            "dataId": "urn:li:comment:(ugcPost:7292217106908004352,7292519968733052928)"
          },
          {
            "commentText": "Thanks. Avoid these to fast-track your career.",
            "userName": "Dr. Miro Bada",
            "userProfileURL": "https://www.linkedin.com/in/drmirobada",
            "dataId": "urn:li:comment:(ugcPost:7292217106908004352,7292529325558378497)"
          },
          {
            "commentText": "Dr. Miro Bada will do once I find employment again. Recently laid off and can definitely say I have made a few of these mistakes without realizing. Thank you for highlighting them! Have a super day!!",
            "userName": "Thomas Wiegelman",
            "userProfileURL": "https://www.linkedin.com/in/thomas-wiegelman-05793a7",
            "dataId": "urn:li:comment:(ugcPost:7292217106908004352,7292535229112594432)"
          },
          {
            "commentText": "Wow… some real truths in this. Great share",
            "userName": "Linda Medder",
            "userProfileURL": "https://www.linkedin.com/in/linda-medder-836b5267",
            "dataId": "urn:li:comment:(ugcPost:7292217106908004352,7292517892250648578)"
          },
          {
            "commentText": "Agree, Linda. Career truths hurt, but they help. Good catch. Anything resonate for you?",
            "userName": "Dr. Miro Bada",
            "userProfileURL": "https://www.linkedin.com/in/drmirobada",
            "dataId": "urn:li:comment:(ugcPost:7292217106908004352,7292529342583095297)"
          }
        ],
        "commentAdded": "Great insights! Its crucial to continuously reflect on our career choices. I especially resonate with avoiding difficult conversations—such a game changer!"
      },
      {
        "postId": "urn:li:activity:7293284039950540800",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293284039950540800",
        "url": "https://www.linkedin.com/in/corryrobertson?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADj5NMBDzU-bZYZCLbk2F99p2D2TnkVfgM",
        "name": "Corry Robertson PCC\nCorry Robertson PCC",
        "content": "It’s February, and while the days are still short and winter's chill lingers, I urge you to carve out time for rest and rejuvenation—you deserve it.\n\nThe stress takes its toll.\n\nJuggling family responsibilities, work demands, and staying mindful about health—for ourselves and those around us—can feel overwhelming at times. It’s no wonder stress can creep in.\n\nTo help myself navigate through the chaos, I’ve crafted a personal playbook that I turn to whenever life feels a bit too much.\n\nOne of my favourite strategies is taking one full day each week to rest and recharge. That’s right—one entire day dedicated to resetting and rejuvenating.\nSurprised? Well, it’s really all about what I take a day off FROM.\n\nREAD MORE ",
        "reactions": {
          "likes": "3\nMarianna Outsia and 2 others",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "I love your idea of dedicating a full day to focus on joy and rejuvenation—it’s such a powerful reminder to prioritize self-care. Your YES list resonates with me, especially the reading and writing part. Wishing you all the best with the upcoming coaching cohorts!",
            "userName": "Marianna Outsia",
            "userProfileURL": "https://www.linkedin.com/in/marianna-outsia-48974b9a",
            "dataId": "urn:li:comment:(ugcPost:7293272577932738560,7293284010774953985)"
          }
        ],
        "commentAdded": "Great reminder! Carving out time for self-care is essential for productivity and well-being. Your playbook sounds like a valuable tool!"
      },
      {
        "postId": "urn:li:activity:7292084089774297089",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292084089774297089",
        "url": "https://www.linkedin.com/company/squareboat/posts",
        "name": "Squareboat\nSquareboat",
        "content": "Salary game strong, tax game stronger.    \n\nhashtag\n#TaxTips \nhashtag\n#NegotiationGoals \nhashtag\n#WorkSmartNotHard \nhashtag",
        "reactions": {
          "likes": "27",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Absolutely! Maximizing our earnings while being tax-savvy is key to financial success. Heres to working smart and negotiating effectively! 💪💼"
      },
      {
        "postId": "urn:li:activity:7293310749924278273",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293310749924278273",
        "url": "https://www.linkedin.com/in/robynnstorey?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAFiz8MBlhi77_FReTGQmRRL6qKnY_n4Hd8",
        "name": "Roberta Storey\nRoberta Storey",
        "content": "When my husband scores a good parking spot, either in the first row or right by the door……\n\nHe says, “Nobody puts Baby in the corner.”\n\nThat’s me. I’m Baby. Lol. \n\nHe’s been saying this for all of the 30 years we’ve been married.\n\nThe flying dance move, also made famous by the classic movie Dirty Dancin…. has been copied by tons of other movies.\n\nIt’s been performed at hundreds, if not thousands of weddings, parties and events.\n\nYou may have even attempted that move in the privacy of your own home with a trusted partner. (We listen and we don’t judge).\n\nWhen Dirty Dancing came out, waaaaaay back in 1987, it was WIDELY panned by critics.\n\nIn fact, the most famous movie reviewers of the time, Rodger and Ebert gave it a paltry 1 star ⭐️.\n\nBut that didn’t stop people from loving it. It made over $170MM dollars within months of it’s release.\n\nJust because something doesn’t always get the respect it deserves, doesn’t mean it’s not worth it.\n\nWhether it’s a movie, your job or something else that doesn’t seem like it’s a good fit, there’s always someone else who will think it (or you) are amazing.\n\nSometimes, you just have to find the right audience.",
        "reactions": {
          "likes": "132",
          "comments": "5 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Amen! Plus my wife always takes credit for good parking spots due to \"mojo\" and criticizes me for parking too far out and not trusting the magic!!",
            "userName": "Kevin Garrett",
            "userProfileURL": "https://www.linkedin.com/in/kevin-garrett-b132082",
            "dataId": "urn:li:comment:(activity:7293310085118726144,7293312582352785408)"
          },
          {
            "commentText": "Kevin Garrett Lol. As she should.",
            "userName": "Roberta Storey",
            "userProfileURL": "https://www.linkedin.com/in/robynnstorey",
            "dataId": "urn:li:comment:(activity:7293310085118726144,7293314705731805185)"
          },
          {
            "commentText": "The GF calls is a “Doris Day” in reference to every time she shows up at a location (in a movie), there’s always a spot directly in front of the entrance.",
            "userName": "Robert Loomas",
            "userProfileURL": "https://www.linkedin.com/in/robert-loomas-9276166",
            "dataId": "urn:li:comment:(activity:7293310085118726144,7293311075188383744)"
          },
          {
            "commentText": "Robert Loomas Love it. I loved Doris Day. Her memoir was one of the first grown up books I read as a kid. It was surprisingly racy lol.",
            "userName": "Roberta Storey",
            "userProfileURL": "https://www.linkedin.com/in/robynnstorey",
            "dataId": "urn:li:comment:(activity:7293310085118726144,7293314958916829186)"
          }
        ],
        "commentAdded": "Love this perspective! 🎉 Sometimes the most unique gems shine the brightest, even when critics don’t see their value. Keep dancing through life! 💃✨"
      },
      {
        "postId": "urn:li:activity:7293233542002618368",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293233542002618368",
        "url": "https://www.linkedin.com/in/vanessabraun?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAA455rsB7q9QakMaPL-130ZNrod7v9W9B2M",
        "name": "Vanessa Braun\nVanessa Braun",
        "content": "When you hesitate too long, opportunities slip away.\n\nIs overthinking slowing you down?\n\nOr is it the fear of making the wrong decision?\n\nSometimes,\n→ We get lost in too many options.\n→ We wait for everything to be perfect.\n→ We’re scared of making the wrong choice.\n\nThis leads to being stuck\nand missed opportunities.\n\nHᴇʀᴇ ᴀʀᴇ 5 ᴛɪᴘꜱ ᴛᴏ ᴛᴀᴋᴇ ᴄᴏɴᴛʀᴏʟ ᴏꜰ ʏᴏᴜʀ ᴄʜᴏɪᴄᴇꜱ\nᴀɴᴅ ᴍᴏᴠᴇ ꜰᴏʀᴡᴀʀᴅ ᴡɪᴛʜ ᴄʟᴀʀɪᴛʏ:\n\n𝟭/ 𝗟𝗶𝗺𝗶𝘁 𝗬𝗼𝘂𝗿 𝗢𝗽𝘁𝗶𝗼𝗻𝘀\n↳ Set a maximum of 3 choices.\n↳ Eliminate irrelevant options.\n↳ Focus only on top choices.\n\n𝟮/ 𝗧𝗿𝘂𝘀𝘁 𝗬𝗼𝘂𝗿 𝗚𝘂𝘁\n↳ Clear your mind first.\n↳ Listen to your initial reaction.\n↳ Make the decision fast.\n\n𝟯/ 𝗜𝗱𝗲𝗻𝘁𝗶𝗳𝘆 𝗖𝗹𝗲𝗮𝗿 𝗪𝗶𝗻𝘀 𝗮𝗻𝗱 𝗟𝗼𝘀𝘀𝗲𝘀\n↳ Write down top outcomes.\n↳ List pros and cons for each.\n↳ Remove options that don’t align.\n\n𝟰/ 𝗩𝗮𝗹𝘂𝗲 𝗬𝗼𝘂𝗿 𝗧𝗶𝗺𝗲 𝗟𝗶𝗸𝗲 𝗠𝗼𝗻𝗲𝘆\n↳ Set a 10-15 minute limit.\n↳ Decide within the time frame.\n↳ Stick to your decision.\n\n𝟱/ 𝗧𝗮𝗰𝗸𝗹𝗲 𝗣𝗿𝗼𝗰𝗿𝗮𝘀𝘁𝗶𝗻𝗮𝘁𝗶𝗼𝗻\n↳ Start with small decisions.\n↳ Break big decisions into steps.\n↳ Take action immediately.\n\nRemember,\nYour decisiveness grows\nwith every choice you make.\n\n𝙒𝙝𝙖𝙩’𝙨 𝙤𝙣𝙚 𝙙𝙚𝙘𝙞𝙨𝙞𝙤𝙣 𝙮𝙤𝙪 𝙘𝙖𝙣 𝙢𝙖𝙠𝙚 𝙩𝙤𝙙𝙖𝙮 𝙩𝙤 𝙢𝙤𝙫𝙚 𝙛𝙤𝙧𝙬𝙖𝙧𝙙 𝙛𝙖𝙨𝙩𝙚𝙧?\n\n\n\n—————————\nRepost if this resonated . Thanks!\nFollow meand tap the () on my profile!\nI write daily about personal development.",
        "reactions": {
          "likes": "55",
          "comments": "52 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "I like how you break it down Vanessa Braun. Overthinking disguises itself as caution, but in reality, it’s just hesitation in slow motion.",
            "userName": "Damesha Craig, Leadership Coach and Startup Advisor",
            "userProfileURL": "https://www.linkedin.com/in/dameshacraig",
            "dataId": "urn:li:comment:(activity:7293229448496037888,7293233537372041218)"
          },
          {
            "commentText": "Damesha Craig, Leadership Coach and Startup Advisor Thanks! Overthinking really can feel like caution, but it’s all about recognizing when it's holding us back.",
            "userName": "Vanessa Braun",
            "userProfileURL": "https://www.linkedin.com/in/vanessabraun",
            "dataId": "urn:li:comment:(activity:7293229448496037888,7293236026322403329)"
          }
        ],
        "commentAdded": "Great insights! Taking control of our choices is vital for growth. What’s a decision you made recently that propelled you forward?"
      }
    ],
    "errors": [
      {
        "postId": "urn:li:activity:7293274369416396800",
        "url": "https://www.linkedin.com/in/amir-tabch?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACtovxcBQFgProDaob15jIuBjp9gl70BoRA",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293252951962226688",
        "url": "https://www.linkedin.com/in/ychowdhury?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACaawXcBYYg0wn5Vr6gmk98Pheyl7k_znN8",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293307623586598913",
        "url": "https://www.linkedin.com/in/priyank-ahuja?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAL9WCIBlpfzadAVTWPPVd5XG57aasvhRYY",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293274964068122624",
        "url": "https://www.linkedin.com/in/annachernyshova1?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACnZ9egBfnNe0XqSWaDo9A-aIgsUneNkzAg",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292217108069859328",
        "url": "https://www.linkedin.com/in/drmirobada?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAeYI3wBBMUorBOTN5_fJ7wwuLKK9f6DQ84",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293284039950540800",
        "url": "https://www.linkedin.com/in/corryrobertson?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADj5NMBDzU-bZYZCLbk2F99p2D2TnkVfgM",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292084089774297089",
        "url": "https://www.linkedin.com/company/squareboat/posts",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293310749924278273",
        "url": "https://www.linkedin.com/in/robynnstorey?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAFiz8MBlhi77_FReTGQmRRL6qKnY_n4Hd8",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293233542002618368",
        "url": "https://www.linkedin.com/in/vanessabraun?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAA455rsB7q9QakMaPL-130ZNrod7v9W9B2M",
        "errors": [
          "Failed to fetch media URL."
        ]
      }
    ]
  },
  {
    "postsData": [
      {
        "postId": "urn:li:activity:7293235027721527296",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293235027721527296",
        "url": "https://www.linkedin.com/in/sumit-mishraa?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABzxJgABicfZ4DuY9VOL59k-AsbQ23EBTqM",
        "name": "Sumit Mishra\nSumit Mishra",
        "content": "Corporate employees try to save their salary after being credited:",
        "reactions": {
          "likes": "134",
          "comments": "5 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/b773b471-b874-4e06-81eb-dbe071f3f1d7",
        "comments": [
          {
            "commentText": "After that match, he changed the company and moved to the new country",
            "userName": "Ameet Choudhary",
            "userProfileURL": "https://www.linkedin.com/in/ameet-choudhary",
            "dataId": "urn:li:comment:(ugcPost:7293235026605834241,7293277565958422528)"
          }
        ],
        "commentAdded": "Saving is essential! Its great to see employees prioritizing financial wellness. What strategies are you finding effective? #FinancialHealth"
      },
      {
        "postId": "urn:li:activity:7292884034030895104",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292884034030895104",
        "url": "https://www.linkedin.com/in/brianwsykes?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAXRYOcBGOrQ6Lxw96BA7IQD7eEHvYUXHq0",
        "name": "Brian Sykes\nBrian Sykes",
        "content": "From Zero to 70K: When AI Meets Creative Design \n\nStarted 2025 with a mission: 1 video per week, no excuses.\n\nFirst month in, here's the raw truth:\n 70,700 views (Mind. Blown.)\n 94 videos deep\n 2,100 amazing subscribers\n\nBut let's talk about those 28  on my AI animation short.\nA first for me, and - Yeah, that happened!  But here's the thing - every thumbs down teaches me what you really want.\n\nInstead of hiding from criticism, I'm learning from it.\n\nI bridge Design + AI, keeping the human element alive.\n\nMy mission? Help creative professionals like you\nharness AI without losing your artistic soul.\n\n What's burning in your creative mind?\n• Which AI tools puzzle you most?\n• What design challenges keep you up at night?\n• How can we make AI work FOR your creativity?\nDrop your thoughts below  Let's shape this channel together.\n\nReady to transform your creative workflow?\nSubscribe:\n\n| AI LAB",
        "reactions": {
          "likes": "40\nBrian Sykes and 39 others",
          "comments": "12 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Currently, I am small potatoes in the YouTube world, but my 'friends' discussing AI, lead this space. Be sure and give them a follow!:\n\nCaleb Ward at Curious Refuge \n[ 198k Subs, 166 Videos, 33.7M views ]\n>\n\nat Theoretically Media\n[ 134k Subs, 237 Videos, 16M view ]\n>",
            "userName": "Brian Sykes",
            "userProfileURL": "https://www.linkedin.com/in/brianwsykes",
            "dataId": "urn:li:comment:(activity:7292884034030895104,7292884566199947264)"
          },
          {
            "commentText": "Brian Sykes well, YouTube is different beast, i can tell. Hardest of all. Just keep.consistency",
            "userName": "Ludovit Nastisin",
            "userProfileURL": "https://www.linkedin.com/in/ludovitnastisin",
            "dataId": "urn:li:comment:(activity:7292884034030895104,7292906373648908289)"
          },
          {
            "commentText": "On this day, I got the following email:\n\nHi,Brian\nI observed your YouTube Channel and analyze that your content qualities are great but the problem is that you are not getting views because of 13 problems, like\n\n1. Subscriber 2.1 k only\n2. Non-SEO-friendly Descriptions\n3. Non-SEO-friendly Ranked Tags\n4. Non-Algorithm Friendly Content\n5. SEO Score 16 out of 100\n6. Social Engagement \"Bad\"\n7. Actionable Score low\n8. Video Performance low\n9. All Video same problem\n10. Video Optimization Problem\n11. View very low\n12. Video and Thumbnail Metadata Missing\n13. There are also many other problems\n__\n\nWow... ",
            "userName": "Brian Sykes",
            "userProfileURL": "https://www.linkedin.com/in/brianwsykes",
            "dataId": "urn:li:comment:(activity:7292884034030895104,7292969990960377857)"
          }
        ],
        "commentAdded": "Inspiring journey! Your commitment to blending AI with creativity is commendable. Excited to see how we can evolve our design practices together! 🚀"
      },
      {
        "postId": "urn:li:activity:7293252131510239233",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293252131510239233",
        "url": "https://www.linkedin.com/in/bradley-guernsey?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAA1bh5sBkTxEVq2LhyeI9el8oW2zqMxDJ7I",
        "name": "Brad Guernsey\nBrad Guernsey",
        "content": "Time and time again I still hear that AI or automating isn't something that is going to stick...Do you all really feel that this is a fad and will go away? I don't think so and encourage others to embrace and implement to not fall behind.\n\nImplementing the right tools can streamline operations and enhance decision-making:\n\nAutomation Tools: Use software to handle routine tasks such as invoicing, payroll, and reconciliations. If you can take manual tasks away from team members you free them up to focus on other critical tasks and you also help eliminate errors.\n\nData Analysis: Leverage financial insights to drive better decision-making and strategy. Do you primarily use Excel or something like PowerBI?\n\nCloud-Based Solutions: Improve collaboration and access to real-time data for greater flexibility. I use Google for my business and clients. That’s been very easy to manage and allows them direct access to everything we are doing.\n\n\n\nBeing able to help in this area has been a blast the past two years. If you have questions or issues in this area, join our free newsletter or online community to learn more.",
        "reactions": {
          "likes": "0",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Absolutely agree! Embracing AI and automation is essential for staying competitive. Let’s innovate and optimize for future success! 🌟"
      },
      {
        "postId": "urn:li:activity:7293305196703551488",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293305196703551488",
        "url": "https://www.linkedin.com/in/abisolaolabode?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACL7j5cBqIlClaQ4v4-q5Iv-XXGyq5Ajiuo",
        "name": "Abisola Olabode\nAbisola Olabode",
        "content": "I just crossed over to 15k followers!\n\nMe: That's nice, but you got them all from your WhatsApp engagement pod \n\nI am not against engagement and growth strategy\n\nBut I am against Lies and Deceit.\n\nBeing sincere and true to yourself is the highest form of self growth.\n\nDo the work.\nOwn your growth.\nDo not receive people.\nLearn the process with pride.\nPut in the actual work this demands.\nLearn how real growth happens here.\n\nThe truth?\n\nIt won't be fast.\nYou'll want to stop.\nYou'll wonder if it worth it.\nYou'll feel like quitting most times.\n\nBut when you stick here regardless..\n\nYour results will start speaking\nThe Clients will start coming in\nYour community will start striving.\n\nAnd the best ROI (In my opinion)\n\nYou will be able to teach and help others on how to replicate your success.",
        "reactions": {
          "likes": "9",
          "comments": "6 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Indeed real growth takes time but it is worth it Abisola Olabode",
            "userName": "Janet Chidera Chieke",
            "userProfileURL": "https://www.linkedin.com/in/janet-chidera-chieke-38a379323",
            "dataId": "urn:li:comment:(activity:7293289942145785856,7293304234878345216)"
          }
        ],
        "commentAdded": "Congratulations on your milestone! 🚀 Your commitment to authenticity is inspiring. Real growth always pays off in the long run. Keep it up!"
      },
      {
        "postId": "urn:li:activity:7293171351446577152",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293171351446577152",
        "url": "https://www.linkedin.com/in/mariaspiliopoulou?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAA02It4B18aQWvKX90tn-uFlnrK_C1Px-lo",
        "name": "Maria Spiliopoulou\nMaria Spiliopoulou",
        "content": "Η χαρά του σχεδιασμού. Η μαγεία της δημιουργίας.\n\nΤώρα είναι ένας άδειος χώρος.\nΑλλά εμείς βλέπουμε ήδη το αποτέλεσμα.\n\nΒλέπουμε το stage να παίρνει θέση.\nΤα περίπτερα των ζυθοποιών να στήνονται.\nΤους λάτρεις της craft beer να δοκιμάζουν μοναδικές γεύσεις.\nΒλέπουμε το street food να ετοιμάζεται.\n\nΤα Bands να παίζουν κομματαρες και να δινουν ρυθμό.\nΤην ενέργεια, τη γιορτή, τη στιγμή που ο χώρος γεμίζει ζωή.\n\nΟ σχεδιασμός γίνεται πιο εφικτός όταν βλέπεις την εικόνα πριν ακόμα δημιουργηθεί.\n\nΌταν δεν βλέπεις μόνο τον άδειο χώρο, αλλά όλα όσα πρόκειται να γίνουν.\n\nΤο Greek Beer Festival έρχεται. Και θα είναι ακριβώς όπως το φανταστήκαμε.ανυπομονώ!!!\n\nΠάμε για μια μπύρα;\n\nSAVE THE DATE:\n\n 28-29-30 Μαρτίου 2025\n Παλιό Αμαξοστάσιο, Γκάζι\n️ Οι καλύτερες ελληνικές craft μπίρες\n️ Δυνατές γεύσεις & μοναδικές ζυθοποιίες\n️ Live μουσική & κορυφαία vibes!",
        "reactions": {
          "likes": "29",
          "comments": "6 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/db3e89c0-15a5-480d-bcb3-0d72095850c2",
        "comments": [
          {
            "commentText": "Ο χώρος μπορεί να είναι ακόμα άδειος, αλλά μπορώ ήδη να φανταστώ τη μυρωδιά της μπίρας και την ατμόσφαιρα του φεστιβάλ!  Ανυπομονώ να δω πώς θα μεταμορφωθεί – το design σίγουρα θα είναι αντάξιο της γεύσης! Καλή επιτυχία!",
            "userName": "Marianna Outsia",
            "userProfileURL": "https://www.linkedin.com/in/marianna-outsia-48974b9a",
            "dataId": "urn:li:comment:(ugcPost:7292560181383647233,7293171335248158720)"
          }
        ],
        "commentAdded": "Ανυπομονούμε κι εμείς! Η ενέργεια και η δημιουργία του Greek Beer Festival θα είναι αξέχαστες! 🥳🍻"
      },
      {
        "postId": "urn:li:activity:7293298242694389762",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293298242694389762",
        "url": "https://www.linkedin.com/in/rajat-narang-92aa383?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAACv1jIBqxFDisVxlYUUE4M7Rx1uz6Qm0Es",
        "name": "Rajat Narang\nRajat Narang",
        "content": "𝐌𝐚𝐱𝐢𝐦𝐢𝐳𝐞 𝐀𝐈’𝐬 𝐏𝐨𝐭𝐞𝐧𝐭𝐢𝐚𝐥 𝐟𝐨𝐫 𝐘𝐨𝐮𝐫 𝐁𝐮𝐬𝐢𝐧𝐞𝐬𝐬\n\nAI is revolutionizing industries—but how can you seamlessly integrate it into your operations? Our latest article outlines 8 practical steps to help you unlock AI’s full potential, whether you're just starting or scaling your initiatives.\n\nDiscover how to:\n Define clear AI objectives\n Select the right AI tools\n Build a strong data-driven foundation\n Scale AI initiatives strategically …and more!\n\nDon’t get left behind—read now to future-proof your business with AI.",
        "reactions": {
          "likes": "3\nAnil Kaul and 2 others",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Great insights! Excited to explore these steps and enhance our strategy. AI is indeed the future of business. Thanks for sharing!"
      },
      {
        "postId": "urn:li:activity:7292412322524844033",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292412322524844033",
        "url": "https://www.linkedin.com/company/independent-dealer/posts",
        "name": "Independent Dealer\nIndependent Dealer",
        "content": "The February issue of Independent Dealer Magazine is online now at www.idealercentral.com. Our cover story by Lisa Veeck is called Breaking Away and looks at how the breakroom continues to evolve in the modern office environment. Also in this issue we focus on Carolina Business Supplies of Charlotte, North Carolina in Secrets of Success; we have stories of good things happening to independents in Winners Circle; all the latest industry news, we talk toin Supply Side; we have updates from your trade body;on using AI agents in the office products channel;asks where have all the custom contracts gone?;on promoting sustainable workplace solutions;asks the “or what?” question;provides a checklist for pipeline momentum and game-changing results; and more.",
        "reactions": {
          "likes": "4",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Exciting content in the February issue! Love how it explores the evolving breakroom and promotes sustainable workplace solutions. Great read!"
      },
      {
        "postId": "urn:li:activity:7293306051917991938",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293306051917991938",
        "url": "https://www.linkedin.com/groups/10350430?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A10350430-7293306050944851968",
        "name": "Artificial Intelligence, Machine Learning, Python, Data Science - Scientist, Analyst, AI/ML Engineer\nArtificial Intelligence, Machine Learning, Python, Data Science - Scientist, Analyst, AI/ML Engineer",
        "content": "Artificial Intelligence - Intelligent Art? https://lnkd.in/eTPfh7Xb\nLook for \"Read and Download Links\" section to download. Follow/Connect me if you like this post.",
        "reactions": {
          "likes": "10",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Fascinating insights on AI and art! Excited to explore the download links for more in-depth knowledge. Thanks for sharing! 🎨🤖"
      },
      {
        "postId": "urn:li:activity:7290997323495596032",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290997323495596032",
        "url": "https://www.linkedin.com/in/thillaisundaram?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADCny-8BLaanSpFLvvM5CAzvpOuDKk5bgQ0",
        "name": "Thillaikumar Sivakamai Sundaram Nagammal\nThillaikumar Sivakamai Sundaram Nagammal",
        "content": "As we step into 2025, Indian founders are facing some tough challenges:\n\n1️⃣ Funding: Investors are more cautious, making it harder to secure capital.\n2️⃣ Talent: High demand for skilled workers means competition is fierce.\n3️⃣ Regulations: Navigating India’s complex legal landscape remains a struggle.\n4️⃣ Infrastructure: Scaling beyond metros is tough with limited connectivity and logistics.\n5️⃣ Global Competition: Competing with global players with bigger resources.\n\nIndia’s entrepreneurial spirit is resilient. Innovation, adaptability, and a focus on real problems can turn challenges into growth opportunities.\n\nWhat’s your take? What’s the biggest challenge for Indian startups in 2025?",
        "reactions": {
          "likes": "116",
          "comments": "5 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Unga post pakkumbothu apdiya antha \"vidukathayaa...\" background song mind-la vandhu pochu! SO funny and relevant.  ",
            "userName": "Hameed Rahamathullah",
            "userProfileURL": "https://www.linkedin.com/in/hameedraha",
            "dataId": "urn:li:comment:(ugcPost:7290997319892635650,7291066343900991490)"
          },
          {
            "commentText": "I was trying to add \" Nan seitha theengu enna\" at the last slide, but dropped it lol ",
            "userName": "Thillaikumar Sivakamai Sundaram Nagammal",
            "userProfileURL": "https://www.linkedin.com/in/thillaisundaram",
            "dataId": "urn:li:comment:(ugcPost:7290997319892635650,7291084684942290944)"
          },
          {
            "commentText": "Literally, it's TRUE :)\n\nIn a startup, if you genuinely want to help people with your idea, you first need to know how to sell the idea (your product) by addressing the pain points. This is an unavoidable aspect of the startup industry and can determine up to 50% of the startup's success.\n\n“Sometimes life's going to hit you in the head with a BRICKS (Funding, Talent, Regulations, Infrastructure, Global Competition). Don't lose faith. I'm convinced that the only thing that kept me going was that I loved what I did.” — Steve Jobs\n\nMeet more people, gather insights; this helps you a lot.\n\nAnyway, the post seems funny, but it is the reality :)\n\n- Perfect post",
            "userName": "Raahul Saravanan",
            "userProfileURL": "https://www.linkedin.com/in/raahul-saravanan-2961591b3",
            "dataId": "urn:li:comment:(ugcPost:7290997319892635650,7291100367394615296)"
          }
        ],
        "commentAdded": "Great insights! I believe talent acquisition will be the most critical challenge. Attracting the right skills is key to driving innovation!"
      },
      {
        "postId": "urn:li:activity:7293004195459190784",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293004195459190784",
        "url": "https://www.linkedin.com/in/samhilsman?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAA7jHLEBLVPtnOolCIDKRY4DfAcFGUpph4A",
        "name": "Sam Hilsman\nSam Hilsman",
        "content": "Fabio Back is \nhashtag\n#hiring. Know anyone who might be interested?",
        "reactions": {
          "likes": "1",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "I'm interested",
            "userName": "Quincy Allen",
            "userProfileURL": "https://www.linkedin.com/in/quincy-allen-50b5252a3",
            "dataId": "urn:li:comment:(activity:7293004195459190784,7293057954654695424)"
          }
        ],
        "commentAdded": "Exciting opportunity, Fabio! 🎉 I’ll keep an eye out for anyone who might be a great fit! #JobOpportunities"
      }
    ],
    "errors": [
      {
        "postId": "urn:li:activity:7292884034030895104",
        "url": "https://www.linkedin.com/in/brianwsykes?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAXRYOcBGOrQ6Lxw96BA7IQD7eEHvYUXHq0",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293252131510239233",
        "url": "https://www.linkedin.com/in/bradley-guernsey?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAA1bh5sBkTxEVq2LhyeI9el8oW2zqMxDJ7I",
        "errors": [
          "Failed to fetch reactions.",
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293305196703551488",
        "url": "https://www.linkedin.com/in/abisolaolabode?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACL7j5cBqIlClaQ4v4-q5Iv-XXGyq5Ajiuo",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293298242694389762",
        "url": "https://www.linkedin.com/in/rajat-narang-92aa383?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAACv1jIBqxFDisVxlYUUE4M7Rx1uz6Qm0Es",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292412322524844033",
        "url": "https://www.linkedin.com/company/independent-dealer/posts",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293306051917991938",
        "url": "https://www.linkedin.com/groups/10350430?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A10350430-7293306050944851968",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7290997323495596032",
        "url": "https://www.linkedin.com/in/thillaisundaram?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADCny-8BLaanSpFLvvM5CAzvpOuDKk5bgQ0",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293004195459190784",
        "url": "https://www.linkedin.com/in/samhilsman?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAA7jHLEBLVPtnOolCIDKRY4DfAcFGUpph4A",
        "errors": [
          "Failed to fetch media URL."
        ]
      }
    ]
  },
  {
    "postsData": [
      {
        "postId": "urn:li:activity:7293096051836653571",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293096051836653571",
        "url": "https://www.linkedin.com/in/dionnemejer?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABls9oB5ZrrM_h3dIB2xNuQ-dqu4dnd6XE",
        "name": "Dionne Mejer\nDionne Mejer",
        "content": "Matt is a master RevOps Guru helping start-up map their client journey and get their tech in gear so it's an asset to the company! \n\nWant to create live streams like this? Check out StreamYard:",
        "reactions": {
          "likes": "4",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Absolutely inspiring, Matt! Your expertise in streamlining client journeys is invaluable for startups. Keep up the great work! 🚀"
      },
      {
        "postId": "urn:li:activity:7293311405640798208",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293311405640798208",
        "url": "https://www.linkedin.com/in/rodneysteele?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAENP-gBmlg-991ZKsHYdKpu1GvviA7l5VU",
        "name": "Rodney Steele\nRodney Steele",
        "content": "How to Destroy a Deal in 45 Minutes (A Masterclass) \n\nPicture this: You get a pitch. \n\nIt’s 12 pages long. It’s in Word (yes, Word).\n\nIt’s packed with more jargon than a legal thriller, and oh, there are seven different options to choose from.\n\nSeven.\n\nLike I’m at a buffet deciding between mashed potatoes or quinoa.\n\nBy the end of the pitch, I had:\n\n• A headache.\n• Zero understanding of what problem they could solve.\n• And a deep, primal urge to set my inbox on fire.\n\nHere’s what went wrong:\n\n They gave me everything but clarity.\n\n Instead of confidence, I felt like I needed a translator and a therapist.\n\n No one addressed the big question: What’s in it for me?\n\nAt the 45-minute mark, I tapped out.\n\nI wasn’t interested. I wasn’t engaged. I was mentally googling “How to fake bad WiFi.”\n\nLet’s get real:\n\nNo one cares about your company’s long history or how many words you can cram into a document.\n\nNot until you can answer one simple question:\n\n Can you solve my problem?\n\nIf you’re pitching, here’s how not to suck at it:\n\n️ Be clear. Like, “crystal-clear vodka” clear.\n\n️ Tell me what’s in it for me. No jargon. No fluff.\n\n️ Stop offering seven options. I barely trust myself to pick a sandwich.\n\n\nThe best pitch I ever got?\n\nTwo pages. One solution.\n\nI walked away thinking, “Wow, they get it.”\n\nSo, please: don’t be the 12-page Word document of pitches.\n\nBe the two-pager that wins.\n\nWhat’s the worst pitch you’ve ever received?",
        "reactions": {
          "likes": "10\nBrion Carroll (II) and 9 others",
          "comments": "9 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "12 pages, Rodney Steele?!?!? I'm getting a headache just thinking about you reading it. ",
            "userName": "Paul Daniels, Jr.",
            "userProfileURL": "https://www.linkedin.com/in/pauldanielsjr",
            "dataId": "urn:li:comment:(activity:7293259665562304512,7293268965642878976)"
          },
          {
            "commentText": "Paul Daniels, Jr. I’m still recovering from it.",
            "userName": "Rodney Steele",
            "userProfileURL": "https://www.linkedin.com/in/rodneysteele",
            "dataId": "urn:li:comment:(activity:7293259665562304512,7293275804069744641)"
          },
          {
            "commentText": "Rodney Steele  ",
            "userName": "Paul Daniels, Jr.",
            "userProfileURL": "https://www.linkedin.com/in/pauldanielsjr",
            "dataId": "urn:li:comment:(activity:7293259665562304512,7293279794673131520)"
          },
          {
            "commentText": "Rodney Steele a lot of people talk themselves out of sales. Be precise and get to the point quickly. ",
            "userName": "Jessica Bertram",
            "userProfileURL": "https://www.linkedin.com/in/jessica-bertram-b64873231",
            "dataId": "urn:li:comment:(activity:7293259665562304512,7293260289976737792)"
          },
          {
            "commentText": "Jessica Bertram get to the point or lose the person.",
            "userName": "Rodney Steele",
            "userProfileURL": "https://www.linkedin.com/in/rodneysteele",
            "dataId": "urn:li:comment:(activity:7293259665562304512,7293263340624117760)"
          }
        ],
        "commentAdded": "Great insights! Clarity and a clear value proposition can make all the difference. Less really is more in pitching! 🚀"
      },
      {
        "postId": "urn:li:activity:7293285669081071616",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293285669081071616",
        "url": "https://www.linkedin.com/in/amyposnerbusinessgrowthmentor?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAANqLKABESb3q8pD094NE1Bz5xUxhxo24nI",
        "name": "Amy Posner\nAmy Posner",
        "content": "How long does it take? \n\nTo get your freelance business up and running so it brings in good clients on a reliable basis and turns a healthy profit?\n\nSix months.\n\nI’m not talking about a six-figure business, but one you can make a living at.\n\nSix figures is down the line a bit. (Honestly, I'm not a fan of that metric. There are better ways to measure success.)\n\nBut there’s a catch.\n\nThat six months can be shortened to three months or can drag on for years.\n\nBecause it’s not a measure of time. It’s a measure of what you achieve.\n\nThere are very specific milestones every freelance business must reach.\n\nSix months is just a reasonable timeframe for doing that.\n\nIf your aim for 2024 is to establish the foundations of a thriving freelance business, then you need to get those milestones behind you as quickly as possible.\n\nHow?\n\nBy switching from windfall clients to system clients.\n\nBy understanding how leveraging 10% efficiency improvements translates into 100% profit bumps.\n\nAnd by seizing on the enormous revenue potential of not being that good at the business stuff right now (seriously, that one shift will put more money in your pocket than anything else I can think of until you crack six figures).\n\nThis is what I’m going to talk about in this Saturday’s edition of The Breakthrough Beat Newsletter.\n\nWant a copy?\n\nLeave a YES in the comments and I’ll sort you out.",
        "reactions": {
          "likes": "7\nAuroriele Hans and 6 others",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "\"Windfall clients to system clients.\" You've piqued my curiosity! What's the difference?",
            "userName": "Auroriele Hans",
            "userProfileURL": "https://www.linkedin.com/in/auroriele-hans-b2b-saas-email-strategist-and-conversion-copywriter",
            "dataId": "urn:li:comment:(activity:7293278864024182784,7293285659883028480)"
          }
        ],
        "commentAdded": "Excited for the insights! Achieving those milestones is key. Count me in for the newsletter! 🚀 #FreelanceSuccess"
      },
      {
        "postId": "urn:li:activity:7293264532116844545",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293264532116844545",
        "url": "https://www.linkedin.com/in/manoj-sharma-207434289?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAEYCTycBv454d81ZVBrEYXKSwoPASSDPm2k",
        "name": "Manoj Sharma\nManoj Sharma",
        "content": "Hey guys it's nice Opportunity so go to link fill the data.",
        "reactions": {
          "likes": "0",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Great opportunity! Looking forward to seeing more details and how we can contribute. Thanks for sharing!"
      },
      {
        "postId": "urn:li:activity:7288813096112996358",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7288813096112996358",
        "url": "https://www.linkedin.com/in/mvaodhan?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADaUC-gBHNhBpUr66BlwqmGWh08EYSe47fE",
        "name": "Aodhan Hamilton\nAodhan Hamilton",
        "content": "As a disabled man with poor balance, I can finally ride a bicycle ",
        "reactions": {
          "likes": "10",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/bd6a1e0d-5ee9-45fb-92b9-e7ecc6845396",
        "comments": [],
        "commentAdded": "Inspiring journey! Your determination showcases the power of resilience. Keep pushing boundaries and enjoying every ride! 🚴‍♂️💪"
      },
      {
        "postId": "urn:li:activity:7293304481897660417",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293304481897660417",
        "url": "https://www.linkedin.com/in/michael-stramaglio-4274886?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAEjUF8BpMiThuAI-pWy748CPTDkLrKiPUc",
        "name": "Michael Stramaglio\nMichael Stramaglio",
        "content": "AI is so helpful ",
        "reactions": {
          "likes": "7\nWest McDonald and 6 others",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Absolutely agree! AI is transforming industries and enhancing productivity in ways we never imagined. Excited for what’s next!"
      },
      {
        "postId": "urn:li:activity:7290764584741687297",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290764584741687297",
        "url": "https://www.linkedin.com/groups/13927028?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A13927028-7289929337456197633",
        "name": "Brain Expansion Group\nBrain Expansion Group",
        "content": "BIOMIMICRY CONTINUUM – Part 4 – Update Agent LEARNING\nFundamental evidence of learning is the ability to recall and utilize what is learned. Receiving and integrating new information is a starting point. It is not learning, but an exceedingly small subset.\nRecent research published in Nature uncovered that Concept Cells help our brain abstract information and build memories. (,)\n\nA report in Quanta magazine () provides an example: The idea of a “bank” has its own set of concept cells, maybe millions of them. Concept neurons fire for their concept no matter how it is presented: in real life or a photo, in text or speech, on television or in a podcast. “It’s more abstract, really different from what you’re seeing,” said Elizabeth Buffalo, a neuroscientist at the University of Washington.\n\nThese discoveries support and align with the abstraction methodology discussed in Part 2 and the contextualization methodology in Part 3.\n\n\n\nIn contrast to how the brain learns, LLMs:\n-process all ingested data rather than filtering for relevance, and\n-output the detailed words and pixels based on statistical proximity rather than conceptual value\nThe aim is to pass the Turing test, output that imitates the appearance of intelligence sufficiently to deceive the user.\n\nThe correctness of the result is dependent on the concentrations of relevant data in the training content. AI speed hides the fact that the model does not “know” anything but rather recomputes even identical prompts.\n\nOn the other hand, by imitating the learning and memory architecture and methodology of the brain the Agentic Expertise Ecosystem creates a library of reusable expertise and continues to learn. Imagine the applications when expertise is in high demand but sparse due to \"brain drain\" scenarios, new science and technology, or economic constraints.\n\nIn part 5 I will discuss the curation methodology.",
        "reactions": {
          "likes": "1",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Fascinating insights on learning! Bridging brain mimicry and AI opens doors to innovative solutions in expertise management. Excited for Part 5!"
      },
      {
        "postId": "urn:li:activity:7293302690686607360",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293302690686607360",
        "url": "https://www.linkedin.com/in/matthewgierc?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAx9CsBa3BrKTDsi1iRqarYFzaHABJ8AvM",
        "name": "Matthew Gierc\nMatthew Gierc",
        "content": "Utilities are under pressure to deliver reliable energy, meet decarbonization goals, and engage customers more effectively. \n\nBut outdated, one-size-fits-all approaches like broad demand response programs and generic peak load management are falling short.\n\nWhat’s the solution?\n\nDisaggregation technology enables utilities to analyze real-time smart meter data, breaking down energy use into appliance-level insights without additional hardware.\n\nThis allows for more precise Demand Response and Energy Efficiency programs, leading to better grid management, cost savings, and higher customer participation.\n\nAt Rainforest Automation, we help utilities unlock the full potential of their data. Read more about how precision energy management is reshaping utility programs.",
        "reactions": {
          "likes": "1",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Great insights! Disaggregation technology is a game-changer for utilities, enhancing efficiency and customer engagement. Excited to see this evolution!"
      },
      {
        "postId": "urn:li:activity:7293274787575906305",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293274787575906305",
        "url": "https://www.linkedin.com/in/auroriele-hans-b2b-saas-email-strategist-and-conversion-copywriter?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAi6GP4BRpZNX2jpwf5GDD5-P1DOEXVp7ak",
        "name": "Auroriele Hans\nAuroriele Hans",
        "content": " 𝗜 𝘁𝗮𝗹𝗸 𝗮𝗯𝗼𝘂𝘁 𝘁𝗵𝗲 𝘃𝗮𝗹𝘂𝗲 𝗼𝗳 𝗰𝘂𝘀𝘁𝗼𝗺𝗲𝗿 𝗶𝗻𝘁𝗲𝗿𝘃𝗶𝗲𝘄𝘀 𝗮 𝗹𝗼𝘁.\n\nBut sometimes it’s hard to schedule them. In those cases…\n\nI talk to sales.\n\nBecause they’re close to customers. They know their top pain points, desires, and objections. \n\nThat’s the approach I took to optimize Fora Financial’s sales emails for conversions.\n\nThe result?\n\n They loved them! Here’s what Fora Financial’s Marketing Manager Tatiana Chua had to say about the emails I wrote for them.\n\n“𝘈𝘶𝘳𝘰𝘳𝘪𝘦𝘭𝘦 𝘪𝘴 𝘢 𝘸𝘰𝘳𝘥𝘴𝘮𝘪𝘵𝘩! 𝘚𝘩𝘦’𝘴 𝘱𝘳𝘰𝘧𝘦𝘴𝘴𝘪𝘰𝘯𝘢𝘭, 𝘮𝘦𝘵𝘩𝘰𝘥𝘪𝘤𝘢𝘭, 𝘢𝘯𝘥 𝘢 𝘤𝘭𝘦𝘢𝘳 𝘤𝘰𝘮𝘮𝘶𝘯𝘪𝘤𝘢𝘵𝘰𝘳. 𝘐 𝘦𝘯𝘫𝘰𝘺𝘦𝘥 𝘸𝘰𝘳𝘬𝘪𝘯𝘨 𝘸𝘪𝘵𝘩 𝘩𝘦𝘳 𝘢𝘯𝘥 𝘸𝘪𝘭𝘭 𝘤𝘰𝘯𝘵𝘪𝘯𝘶𝘦 𝘵𝘰 𝘭𝘦𝘷𝘦𝘳𝘢𝘨𝘦 𝘩𝘦𝘳 𝘧𝘰𝘳 𝘱𝘶𝘯𝘤𝘩𝘺 𝘦𝘮𝘢𝘪𝘭 𝘤𝘰𝘱𝘺𝘸𝘳𝘪𝘵𝘪𝘯𝘨 𝘵𝘩𝘢𝘵 𝘤𝘰𝘯𝘷𝘦𝘳𝘵𝘴.”",
        "reactions": {
          "likes": "29",
          "comments": "16 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Great insights on leveraging sales for customer understanding! Its inspiring to see how your efforts translated to impactful communication! 🚀"
      },
      {
        "postId": "urn:li:activity:7290863461180280833",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290863461180280833",
        "url": "https://www.linkedin.com/in/rickconlowservantleadership?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAPUxFwB6p1p6ESvdwgOkdRMuNdW3KDrJTU",
        "name": "Richard A. Conlow\nRichard A. Conlow",
        "content": "HORRIBLE CUSTOMER SERVICE REIGNS. DO YOU AGREE? https://buff.ly/3CfaMig\nhashtag\n#leadership \nhashtag\n#management \nhashtag\n#servantleadership \nhashtag",
        "reactions": {
          "likes": "1",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Absolutely agree! Exceptional customer service starts with leadership that values every interaction. Lets elevate the standard! #ServantLeadership"
      }
    ],
    "errors": [
      {
        "postId": "urn:li:activity:7293096051836653571",
        "url": "https://www.linkedin.com/in/dionnemejer?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABls9oB5ZrrM_h3dIB2xNuQ-dqu4dnd6XE",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293311405640798208",
        "url": "https://www.linkedin.com/in/rodneysteele?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAENP-gBmlg-991ZKsHYdKpu1GvviA7l5VU",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293285669081071616",
        "url": "https://www.linkedin.com/in/amyposnerbusinessgrowthmentor?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAANqLKABESb3q8pD094NE1Bz5xUxhxo24nI",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293264532116844545",
        "url": "https://www.linkedin.com/in/manoj-sharma-207434289?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAEYCTycBv454d81ZVBrEYXKSwoPASSDPm2k",
        "errors": [
          "Failed to fetch reactions.",
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293304481897660417",
        "url": "https://www.linkedin.com/in/michael-stramaglio-4274886?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAEjUF8BpMiThuAI-pWy748CPTDkLrKiPUc",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7290764584741687297",
        "url": "https://www.linkedin.com/groups/13927028?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A13927028-7289929337456197633",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293302690686607360",
        "url": "https://www.linkedin.com/in/matthewgierc?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAx9CsBa3BrKTDsi1iRqarYFzaHABJ8AvM",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293274787575906305",
        "url": "https://www.linkedin.com/in/auroriele-hans-b2b-saas-email-strategist-and-conversion-copywriter?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAi6GP4BRpZNX2jpwf5GDD5-P1DOEXVp7ak",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7290863461180280833",
        "url": "https://www.linkedin.com/in/rickconlowservantleadership?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAPUxFwB6p1p6ESvdwgOkdRMuNdW3KDrJTU",
        "errors": [
          "Failed to fetch media URL."
        ]
      }
    ]
  },
  {
    "postsData": [
      {
        "postId": "urn:li:activity:7293309726363136001",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293309726363136001",
        "url": "https://www.linkedin.com/in/hasantoxr?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADpeKY0B1uX5gp5hm8hw3EWkiqqxbZXhw4s",
        "name": "Hasan Toor ✪\nHasan Toor ✪",
        "content": "Stop taking notes in meetings by yourself!\n\nUse AI to become 10x productive.\n\nMeet, a tool that uses AI to listen and take notes during your meetings.\n\nYou don't have to write everything down anymore!\n\nReasons to like AI Meeting Notes:\n\n- No More Typing: AI captures key points and tasks.\n- Quick Summaries: Get clear notes right after your meeting.\n- Stay Focused: Listen without worrying about note-taking.\n- Works with Your Calendar: AI runs in the background during meetings.\n- Use Anywhere: Access your notes on any device.\n\nWho Should Try It?\n\n- Professionals who want to save time in meetings.\n- Teams and entrepreneurs who need clear action steps.\n- Students who want fast lecture summaries.\n\nLet AI take care of your notes so you can focus on what's important.\n\nTry it today:",
        "reactions": {
          "likes": "541",
          "comments": "56 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/23bf7576-6d46-4e07-b63c-0bd8c78a1643",
        "comments": [
          {
            "commentText": "I have an AI note-taker and it's pretty good.\nBut I still take notes - the act of taking notes myself forces in the moment summarising of content which strengthens subsequent recall.\nThe notetaker is a good back-up.",
            "userName": "Richard Leader",
            "userProfileURL": "https://www.linkedin.com/in/richardleader",
            "dataId": "urn:li:comment:(ugcPost:7293165851334037504,7293273800790425600)"
          },
          {
            "commentText": "It's impressive that you can access notes on any device, making remote work more seamless",
            "userName": "Erica Robb",
            "userProfileURL": "https://www.linkedin.com/in/ericarobb",
            "dataId": "urn:li:comment:(ugcPost:7293165851334037504,7293192868209274881)"
          }
        ],
        "commentAdded": "Exciting innovation! AI Meeting Notes could revolutionize how we approach meetings—less typing and more engagement. Cant wait to try it!"
      },
      {
        "postId": "urn:li:activity:7293305222091661312",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293305222091661312",
        "url": "https://www.linkedin.com/groups/12124577?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A12124577-7293305221139578880",
        "name": "VLSI Professional Group\nVLSI Professional Group",
        "content": "(Open Access) Semiconductor Packaging: Materials Interaction and Reliability - https://lnkd.in/gUtY5X_x\nLook for \"Read and Download Links\" section to download. Follow/Connect me if you like this post.",
        "reactions": {
          "likes": "10",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Great resource! Excited to explore the insights on semiconductor packaging. Thanks for sharing!📦🔧 #Semiconductors #Research"
      },
      {
        "postId": "urn:li:activity:7293247498834370561",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293247498834370561",
        "url": "https://www.linkedin.com/in/rukhsar-shahin-624571292?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAEbrHTwBkwjk8MSiZEeVEw4oEXAAYm-7Ce8",
        "name": "Rukhsar Shahin\nRukhsar Shahin",
        "content": " Excited to Share My Latest Project: A 𝗡𝗼𝘁𝗲-𝗧𝗮𝗸𝗶𝗻𝗴 𝗔𝗽𝗽 Built with \nhashtag\n#Reactjs! \nI recently built a fully functional note-taking application using React.js, where users can:\n\n Create, Edit, and Delete Notes.\n Organize notes efficiently.\n Enjoy a seamless and responsive user interface.\n\nTechnologies Used:\n Frontend: React.js.\n Styling: CSS/Styled Components.\n State Management: React Hooks (useState, useEffect).\n Others: Local Storage for saving notes.\n\nTop Resources for Coding Enthusiasts:\n,,\n\nThis project helped me improve my skills in\n, and I learned a lot about building user-friendly, interactive applications. Feel free to check it out and let me know your thoughts! \n.",
        "reactions": {
          "likes": "8\nRukhsar Shahin and 7 others",
          "comments": "2 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/969d45fd-dea4-47df-b2a2-95bc70b82686",
        "comments": [
          {
            "commentText": "Rukhsar Shahin Awesome project!  A note-taking app with React.js is a great way to showcase your skills. Love the use of local storage and React hooks for smooth functionality. Keep building and learning—looking forward to seeing more! ",
            "userName": "Ali Khan",
            "userProfileURL": "https://www.linkedin.com/in/alikhan-devs",
            "dataId": "urn:li:comment:(ugcPost:7293247386523459584,7293290610457731072)"
          },
          {
            "commentText": "Ali Khan Thank you! Your appreciation means a lot and motivates me. I'm constantly working on new projects and learning. I truly value your feedback and hope you'll like my next project as well!",
            "userName": "Rukhsar Shahin",
            "userProfileURL": "https://www.linkedin.com/in/rukhsar-shahin-624571292",
            "dataId": "urn:li:comment:(ugcPost:7293247386523459584,7293294410237112320)"
          }
        ],
        "commentAdded": "Fantastic work! 🎉 Your note-taking app sounds impressive—love how you utilized React.js for a seamless user experience. Cant wait to check it out!"
      },
      {
        "postId": "urn:li:activity:7293301057068142592",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293301057068142592",
        "url": "https://www.linkedin.com/in/erin-rollenhagen-b4b7317?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAFahCsB7P5LtpL0ZHSF0sc15HYaQPA3kv8",
        "name": "Erin Rollenhagen\nErin Rollenhagen",
        "content": "One of our themes this year is that each person is a leader of a team of at least one. When I think of the most impactful team members we've had over the years, they have always showcased these great qualities regardless of whether they had direct reports or not. I'm sharing it in case it gives anyone else a boost today too - ice storms, late winter moods and hectic schedules can create distracting chaos. Amid all of that, it helps me to re-center around what's important to make a step forward today.",
        "reactions": {
          "likes": "12",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "I love \"Help Future Us.\" It's amazing when we consider what we can do for our future selves – and do them!",
            "userName": "Miriam Bookey",
            "userProfileURL": "https://www.linkedin.com/in/mbookey",
            "dataId": "urn:li:comment:(activity:7293272942891741204,7293313717155311617)"
          }
        ],
        "commentAdded": "Love this perspective! Leadership is truly about influence, regardless of title. Lets embrace our roles and uplift each other! 💪✨"
      },
      {
        "postId": "urn:li:activity:7293276504925380609",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293276504925380609",
        "url": "https://www.linkedin.com/in/olenabomko?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAC6BaE4Bbj0nsrGeZ5U8cV0aaQeLdYjKfP4",
        "name": "Olena Bomko\nOlena Bomko",
        "content": "Should you run LinkedIn Ads?\n\"How do you know if LinkedIn Ads is the right channel for your company?\" — this was the first question I asked.\n\nHere's what he mentioned:\n- You target B2B\n- You know your who your ICP is\n- Your audience is active on LinkedIn\n- Average contract value is significant\n- You have the budget\n- You have product-market fit (it isn't a cheap channel for testing)\n- Ads are a part of your overall marketing strategy\n- Someone from your team is active on LinkedIn (it helps)\n- Your LinkedIn Company page is active\n- You use CRM\n\nGabriel and I have been following each other for years now. And when I was looking for some answers last month, he suggested his help.\nThank you,:)",
        "reactions": {
          "likes": "27\nAuroriele Hans and 26 others",
          "comments": "8 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/2a18dfba-da11-4b74-843e-811019ffc0e2",
        "comments": [
          {
            "commentText": "Love this! Did you start a podcast?",
            "userName": "Auroriele Hans",
            "userProfileURL": "https://www.linkedin.com/in/auroriele-hans-b2b-saas-email-strategist-and-conversion-copywriter",
            "dataId": "urn:li:comment:(ugcPost:7293250899026624512,7293276480841601024)"
          },
          {
            "commentText": "Auroriele thank you  \nNo, we just recorded our session with Gabriel.",
            "userName": "Olena Bomko",
            "userProfileURL": "https://www.linkedin.com/in/olenabomko",
            "dataId": "urn:li:comment:(ugcPost:7293250899026624512,7293280534888157184)"
          },
          {
            "commentText": "Olena Bomko  ",
            "userName": "Auroriele Hans",
            "userProfileURL": "https://www.linkedin.com/in/auroriele-hans-b2b-saas-email-strategist-and-conversion-copywriter",
            "dataId": "urn:li:comment:(ugcPost:7293250899026624512,7293281675902341120)"
          }
        ],
        "commentAdded": "Great insights! Understanding if LinkedIn Ads fit your strategy is crucial. Targeting the right audience makes all the difference! 🚀"
      },
      {
        "postId": "urn:li:activity:7293276961760509952",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293276961760509952",
        "url": "https://www.linkedin.com/in/bradfederman?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAPmj0BJTWPba7ngtdb-ptmeUtZ69ETJ-4",
        "name": "Brad Federman\nBrad Federman",
        "content": "Mirror, Mirror on the Wall\n Would I hire me at all?\n\nWould I show up strong and true,\nOr crack beneath a task brand new?\nDo I lead with heart and grace,\nOr just compete to win the race?\n\nMirror, mirror, tell no lies—\nDo I inspire, or just advise?\nDo I lift my team up high,\nOr take the credit, let them sigh?\n\nWould I trust me, take the leap,\nOr fear the promises I keep?\nDo I learn, adapt, and grow,\nOr just pretend to always know?\n\nMirror, mirror, looking back—\nDo I hold the skills I lack?\nDo I blame, deflect, defend,\nOr own mistakes and make amends?\n\nIf I were hiring, truth be told,\nWould I see fire, brave and bold?\nOr someone lost behind a mask,\nAfraid to own the greater task?\n\nMirror, mirror, clear and bright—\nTime to sharpen, time to fight.\nNot just work, but who I be,\nTo make a team proud to have me.\n\nReflection leads to growth. Do you make time for self-reflection?",
        "reactions": {
          "likes": "8",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "What a powerful reminder of self-reflection! Its crucial for personal growth and to inspire those we lead. Lets embrace our true potential! 🌟"
      },
      {
        "postId": "urn:li:activity:7293254518849306624",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293254518849306624",
        "url": "https://www.linkedin.com/groups/13927028?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A13927028-7291078873830551552",
        "name": "Brain Expansion Group\nBrain Expansion Group",
        "content": "This Town Learned Sign Language Just to Surprise Their Neighbor ️ (Cue the Happy Tears)\n\n\nImagine moving to a new town, and feeling isolated because no one speaks your language. Now imagine that same town secretly learning your language—just to welcome you.\nThat’s exactly what happened to a deaf neighbour whose entire community learned sign language to surprise her. The moment she realized what they’d done? Pure, unfiltered joy. \nThis isn’t just a story about inclusion. It’s a reminder that belonging is built by choice—one small act of kindness at a time.\n\n Why this matters:\n1️⃣ Inclusion starts with effort – They didn’t wait for her to adapt; they met her where she was.\n2️⃣ Community is a verb – It’s not just about living near each other; it’s about showing up for each other.\n3️⃣ Small actions create big change – Learning a few signs transformed her world—and theirs.\n\nTo the people of this town: Thank you for showing us what true connection looks like.\n\nLooking to supercharge your Career, Mindset, or Creativity? These influencers are changing the game in their fields and are a must-follow for daily inspiration and actionable insights: ||||||||\n\nWhat’s one small way you can make someone feel seen and included today? Let’s inspire each other in the comments. ",
        "reactions": {
          "likes": "913\nJason Bramble and 912 others",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/6a53c350-2cb3-4a5d-add3-f42deb7feff4",
        "comments": [],
        "commentAdded": "What a beautiful example of community spirit! 🌟 Small actions, like learning sign language, can truly make a world of difference. #InclusionMatters"
      },
      {
        "postId": "urn:li:activity:7293196981496168448",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293196981496168448",
        "url": "https://www.linkedin.com/in/danielle-mimoni-social-media-marketing?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACZyevEBYRulgB8ZZpj0hy31IDvLi07OD20",
        "name": "Danielle Mimoni\nDanielle Mimoni",
        "content": "How I got 1,200+ shares on ONE LinkedIn post \n\nMy LinkedIn post went viral. \n\nAnd by viral up, I mean…\n 10,000+ followers overnight\n 10 million views\n 4,000+ comments\n\nAfter that, I spent hours studying why it took off. What actually made people engage, share, and comment?\n\nHere’s what I learned (and how you can apply it too):\n\n Your hook is everything.\n→ If your first sentence doesn’t grab attention, nothing else matters.\n\nYour hook should make people stop scrolling and feel curious enough to keep reading.\n\nPro tip: Study posts that go viral (especially from creators without huge followings) and analyse what made their opening line work.\n\n________________\n\n Format matters more than you think.\n→ No one wants to read a huge block of text. Make it skimmable.\n\nUse spacing, emojis, and bullet points to break up ideas and keep people engaged.\n\n________________\n\n Know exactly why you’re posting.\n→ Before you hit publish, ask yourself: What’s the goal of this post?\n\nAre you trying to educate, entertain, inspire, or start a conversation? The clearer your message, the better the engagement.\n\n________________\n\n Use the algorithm to your advantage.\n→ Whether we like it or not, the algorithm matters.\n\nIf LinkedIn is pushing selfies, post selfies. If engaging with comments early boosts reach, reply quickly. If a certain type of content is performing well, lean into it.\n\n________________\n\nThe truth is, virality can be random—but there are patterns.\n\nOnce you recognise them, you can apply them to every post you create.\n\nWhich of these do you think makes the biggest difference? Let me know in the comments ",
        "reactions": {
          "likes": "578",
          "comments": "185 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Getting the right hook is everything Danielle Mimoni\n\nYour hook needs to be able to capture people with a glance alone",
            "userName": "Blessing Ikpia",
            "userProfileURL": "https://www.linkedin.com/in/blessing-ikpia-54b790244",
            "dataId": "urn:li:comment:(activity:7293191703702691840,7293196948285583361)"
          },
          {
            "commentText": "Blessing Ikpia hook is soooo key",
            "userName": "Danielle Mimoni",
            "userProfileURL": "https://www.linkedin.com/in/danielle-mimoni-social-media-marketing",
            "dataId": "urn:li:comment:(activity:7293191703702691840,7293208180111601665)"
          }
        ],
        "commentAdded": "Incredible insights! Your point about the hook really resonates. Excited to apply these strategies to my future posts. 🌟"
      },
      {
        "postId": "urn:li:activity:7293304049955741696",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293304049955741696",
        "url": "https://www.linkedin.com/in/marcuschanmba?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADV6VYB5xEDTLNcyMjRq_O2WLSb1gkal5A",
        "name": "Marcus Chan\nMarcus Chan",
        "content": "LinkedIn is free sales education.\n\n18 profiles that will teach you more about sales in 2025 than any online course.\n\n1. Jen Allen-Knuth\n2. Ian Koniak\n3. Krysten Connor\n4. Amy Volas\n5. Jamal Reimer\n6. Alexine Mudawar\n7. Kyle Asay\n8. Leslie Venetz\n9. Salman Mohiuddin\n10. Lindsey Boggs\n11. Jason Bay\n12. Justin Jay Johnson\n13. Kyle Vamvouris\n14. John Barrows\n15. Richard Harris\n16. Dale Dupree\n17. Niraj Kapur\n18. Donald Kelley\n\n\n\nWho’d you add? \n\nP.S. Here’s more free game - steal this 39-page manifesto on how we’re closing at 40%+:",
        "reactions": {
          "likes": "41",
          "comments": "39 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Marcus Chan",
            "userName": "Julian C.",
            "userProfileURL": "https://www.linkedin.com/in/juliancalvo",
            "dataId": "urn:li:comment:(activity:7293282376925806593,7293285191941312512)"
          },
          {
            "commentText": "Julian C. Thanks,man!",
            "userName": "Marcus Chan",
            "userProfileURL": "https://www.linkedin.com/in/marcuschanmba",
            "dataId": "urn:li:comment:(activity:7293282376925806593,7293287134667390977)"
          },
          {
            "commentText": " ",
            "userName": "Julian C.",
            "userProfileURL": "https://www.linkedin.com/in/juliancalvo",
            "dataId": "urn:li:comment:(activity:7293282376925806593,7293288278965833731)"
          },
          {
            "commentText": "Chris Orlob is a MUST!",
            "userName": "Brendan Kane",
            "userProfileURL": "https://www.linkedin.com/in/brendan-kane-1b198a98",
            "dataId": "urn:li:comment:(activity:7293282376925806593,7293290208001740800)"
          },
          {
            "commentText": "Brendan Kane Great add-on.",
            "userName": "Marcus Chan",
            "userProfileURL": "https://www.linkedin.com/in/marcuschanmba",
            "dataId": "urn:li:comment:(activity:7293282376925806593,7293300459153293313)"
          }
        ],
        "commentAdded": "Great list! I’d also suggest following people like Marc Wayshak and Jeb Blount for even more sales insights. Who else do you recommend?"
      },
      {
        "postId": "urn:li:activity:7293307504367697920",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293307504367697920",
        "url": "https://www.linkedin.com/company/os-community/posts",
        "name": "AI - Artificial intelligence\nAI - Artificial intelligence",
        "content": "Tired of guessing what makes an iOS app successful?\n\nIntroducing ScreensDesign, where you can finally unlock the secrets of million-dollar iOS apps.\n\nWe analyzed over 1500 subscription apps to reveal the winning formulas:\n\nWatch complete video flows: See exactly how top apps guide users through their journeys.\nStudy real revenue data: Understand what drives conversions and maximizes profits.\nSteal proven tactics: Implement strategies that have been proven to work in the real world.\n\nNo more guesswork. No more wasted time.\n\ngives you the blueprint for building a thriving iOS app.\n\nCheck it out on Product Hunt:",
        "reactions": {
          "likes": "252",
          "comments": "9 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/b3cbff5f-b7a6-40c0-b046-68367724dbcc",
        "comments": [
          {
            "commentText": "Analyzing real data is crucial for making informed decisions in any field.",
            "userName": "Teena James",
            "userProfileURL": "https://www.linkedin.com/in/teena-james-growthmarketer",
            "dataId": "urn:li:comment:(ugcPost:7293244380381900802,7293252397508755456)"
          },
          {
            "commentText": "It's great to see solutions that focus on eliminating guesswork in development.",
            "userName": "Jamie Yu",
            "userProfileURL": "https://www.linkedin.com/in/jamie-yu-677416128",
            "dataId": "urn:li:comment:(ugcPost:7293244380381900802,7293246859307810818)"
          }
        ],
        "commentAdded": "This is a game changer! Unlocking insights from 1500+ apps is invaluable. Excited to apply these winning strategies to my projects! 🚀"
      }
    ],
    "errors": [
      {
        "postId": "urn:li:activity:7293305222091661312",
        "url": "https://www.linkedin.com/groups/12124577?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A12124577-7293305221139578880",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293301057068142592",
        "url": "https://www.linkedin.com/in/erin-rollenhagen-b4b7317?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAFahCsB7P5LtpL0ZHSF0sc15HYaQPA3kv8",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293276961760509952",
        "url": "https://www.linkedin.com/in/bradfederman?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAPmj0BJTWPba7ngtdb-ptmeUtZ69ETJ-4",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293196981496168448",
        "url": "https://www.linkedin.com/in/danielle-mimoni-social-media-marketing?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACZyevEBYRulgB8ZZpj0hy31IDvLi07OD20",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293304049955741696",
        "url": "https://www.linkedin.com/in/marcuschanmba?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADV6VYB5xEDTLNcyMjRq_O2WLSb1gkal5A",
        "errors": [
          "Failed to fetch media URL."
        ]
      }
    ]
  },
  {
    "postsData": [
      {
        "postId": "urn:li:activity:7292971038697512961",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292971038697512961",
        "url": "https://www.linkedin.com/groups/14382461?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A14382461-7292971037783187457",
        "name": "StayHealthy365\nStayHealthy365",
        "content": " JumpStart Your Business in 2025:\nVote & Claim Your AI-Powered Virtual Booth! \n Only 10 FREE Virtual Booths Left – Vote Now! \n\n Vote for AI X Network as Best Local Business of 2025 and be one of the first 25 to claim a FREE Virtual Booth at our JumpStart Your Business 2025 Expo (Mar)! \n\n Booth Includes:\n AI-SEO & AI-Social tools (worth $500+/month)\n Exclusive Featured Hall Placement for maximum exposure!\n\n How to Claim Your Spot:\n\nVote for us now\nGet your FREE Booth!\n I’ll vote for you back—let’s grow together!\n",
        "reactions": {
          "likes": "1",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Exciting opportunity! 🚀 Voting for AI X Network as Best Local Business of 2025! Let’s boost our growth together! #SupportLocal #VirtualExpo"
      },
      {
        "postId": "urn:li:activity:7293307355801268224",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293307355801268224",
        "url": "https://www.linkedin.com/in/denisesbrownmd?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAGDkhQBziUeHo6KtrkkCYnV8ChfeA80pVw",
        "name": "Denise S. Brown, MD\nDenise S. Brown, MD",
        "content": "Do you ever feel like you're living your life on someone else's timeline? \n\nNonlinear womanhood frees us from the confines of a prescriptive life path and opens up a spectrum of possibilities.\n\nIt is liberating to know that we can pursue\ncareer advancements,\npersonal growth,\nor motherhood\nin any order and at any pace that feels right to us.\n\nThis freedom is not just liberating; it’s revolutionary.\n\nI’m currently in L.A. this week recording my NEW book coming out this Spring! You don’t want to miss what’s coming…",
        "reactions": {
          "likes": "24",
          "comments": "11 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "BEST PHOTOS EVER -- I know you rocked it and cannot wait to HEAR the book!!!",
            "userName": "Nataly Kogan",
            "userProfileURL": "https://www.linkedin.com/in/natalykogan",
            "dataId": "urn:li:comment:(ugcPost:7293099112621580288,7293287452495015937)"
          },
          {
            "commentText": "Go girl Go!! That has to be so exciting Denise S. Brown, MD!!! Can't wait to catch up next week!",
            "userName": "Lyndsay Dowd",
            "userProfileURL": "https://www.linkedin.com/in/lyndsaydowdh4h",
            "dataId": "urn:li:comment:(ugcPost:7293099112621580288,7293313286387769346)"
          }
        ],
        "commentAdded": "Absolutely inspiring! Embracing nonlinear paths empowers us to craft our own journeys. Excited to hear about your upcoming book! 🌟"
      },
      {
        "postId": "urn:li:activity:7291112918597738498",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7291112918597738498",
        "url": "https://www.linkedin.com/company/inc42/posts",
        "name": "Inc42 Media\nInc42 Media",
        "content": "Bhavish Aggarwal’s AI unicorn Krutrim is now hosting open source AI models of Chinese GenAI company DeepSeek on its cloud platform. \n\nTaking to the X, Aggarwal said, “Krutrim has accelerated efforts to develop world class AI. As a first step, our cloud now has DeepSeek models live, hosted on Indian servers. Pricing lowest in the world.”\n\nFurther hinting on the open source efforts, Aggarwal said that the details on its “AI lab, state of the art (SOTA) model and research progress, open source drops on 4th Feb!”\n\nAs of now, five models of DeepSeek are available on the platform, ranging from 8 Bn tokens to 70 Bn trained models.\n\nTo read the full article, click here -",
        "reactions": {
          "likes": "1,231",
          "comments": "111 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "How is this news? Lol, anyone can do this. It would only be significant if they created their own AI model and operated like DeepSeek.",
            "userName": "amit anand Niraj",
            "userProfileURL": "https://www.linkedin.com/in/queryamit",
            "dataId": "urn:li:comment:(activity:7291112918597738498,7291387968471097344)"
          },
          {
            "commentText": "amit anand Niraj News bananey walo ko bhi nahi pata news kaise banatet hai, aur news item ko bhi nahi pata AI kaise banate hai.",
            "userName": "Deepak Singh",
            "userProfileURL": "https://www.linkedin.com/in/deepaksinghbusinessobjects",
            "dataId": "urn:li:comment:(activity:7291112918597738498,7293246709818703874)"
          },
          {
            "commentText": "Tacky PR. Who are you fooling here? Its an open source model which is only a package installation away from cloud hosting or on a private ecosystem. Have some standards.",
            "userName": "Joseph Davis",
            "userProfileURL": "https://www.linkedin.com/in/josephabbeydavis",
            "dataId": "urn:li:comment:(activity:7291112918597738498,7291274234285170688)"
          },
          {
            "commentText": "",
            "userName": "Dr. Yuvrraj K.",
            "userProfileURL": "https://www.linkedin.com/in/yuvraj-kumar",
            "dataId": "urn:li:comment:(activity:7291112918597738498,7293149962647785472)"
          }
        ],
        "commentAdded": "Exciting developments! Thrilled to see Krutrim enhancing AI accessibility with DeepSeeks models. Looking forward to more updates on Feb 4th!"
      },
      {
        "postId": "urn:li:activity:7293183791462780928",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293183791462780928",
        "url": "https://www.linkedin.com/in/mustapha-o-5051a243?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAkatlUBqrrh83NufTk11w1ofYM5GN_JvMs",
        "name": "Mustapha O.\nMustapha O.",
        "content": "You shouldn't care about your emotions.\n\nEmotions are human.\n\nBut letting them take over is a choice.\n\n95% people worldwide,\ncan't control their emotions.\n\nBecome part of the 5% today.\n\n𝗛𝗲𝗿𝗲 𝗮𝗿𝗲 3 𝗵𝗮𝗰𝗸𝘀 𝘁𝗼 𝗺𝗮𝘀𝘁𝗲𝗿 𝘆𝗼𝘂𝗿 𝗲𝗺𝗼𝘁𝗶𝗼𝗻𝘀:\n\n1. Your emotions are separate from your reaction\n→ Your emotions should not decide your reaction.\n→ How you react should suite the situation.\n→ Your reaction should promote peace and growth.\n\n2. Stop expecting people to behave like you\n→ People don’t operate by your standards or values.\n→ Expecting others to act like you ego-centric.\n→ Peoples reaction isn’t the problem, yours is.\n\n3. Let go of the need to always be right\n→ The need to be right is costing you your peace.\n→ Focus on your own path, not that of others.\n→ Just like you’re convinced of your truth, so are they.\n\nEmotions aren't the problem.\nHow you handle them is.\n\nWhat's one thing you do to control your emotions?\n\n️ Like and repost to inspire someone in your network!\n\nFollow me → Mustapha Oizaz for more on personal development, culture and leadership.",
        "reactions": {
          "likes": "82",
          "comments": "128 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "One of the greatest sets of people are the ones who know how to keep their emotions in check Mustapha O.\n\nIt's a powerful trait I believe everyone should master",
            "userName": "Blessing Ikpia",
            "userProfileURL": "https://www.linkedin.com/in/blessing-ikpia-54b790244",
            "dataId": "urn:li:comment:(ugcPost:7293176657333379073,7293183783539761153)"
          },
          {
            "commentText": "Blessing Ikpia How do you become better ta mastering emotions?",
            "userName": "Mustapha O.",
            "userProfileURL": "https://www.linkedin.com/in/mustapha-o-5051a243",
            "dataId": "urn:li:comment:(ugcPost:7293176657333379073,7293184145084571649)"
          }
        ],
        "commentAdded": "Great insights, Mustapha! Mastering our responses instead of our emotions can truly transform our interactions. Thanks for sharing!"
      },
      {
        "postId": "urn:li:activity:7290372225759682560",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290372225759682560",
        "url": "https://www.linkedin.com/in/rickconlowservantleadership?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAPUxFwB6p1p6ESvdwgOkdRMuNdW3KDrJTU",
        "name": "Richard A. Conlow\nRichard A. Conlow",
        "content": "THE FIRST AND ONLY RULE OF LEADERSHIP: https://buff.ly/4gdbYR6 \nhashtag\n#leadership \nhashtag\n#management \nhashtag\n#servantleadership \nhashtag",
        "reactions": {
          "likes": "2",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "I agree that we must always show up and show up authentically. If people see the real us, then we can build that relationship on trust and integrity.",
            "userName": "Erwin Jack",
            "userProfileURL": "https://www.linkedin.com/in/erwinjack",
            "dataId": "urn:li:comment:(activity:7290372225759682560,7290445179310784514)"
          }
        ],
        "commentAdded": "Great insights on leadership! Embracing the servant leadership approach truly makes a difference in team dynamics. #leadership #servantleadership"
      },
      {
        "postId": "urn:li:activity:7293261705730560003",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293261705730560003",
        "url": "https://www.linkedin.com/in/parth-sanghvi-humour-finance?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACrWWHIBmYh46hKHEhDWXQ-ljd36aXDIVp8",
        "name": "Parth Sanghvi\nParth Sanghvi",
        "content": "I saw this hiring banner and couldn’t resist sharing it.\n\nmagicpin is hiring for Chief Bak**od Officer.\n\nAnd no, it’s NOT a prank. \n\nForget the hustle to understand the job description by Chat-GPT – this one’s simple.\n\nIf you can make a chai ad sound more exciting than a sports car, then Magicpin wants YOU.\n\nSo, are you applying?",
        "reactions": {
          "likes": "206",
          "comments": "86 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Haha amazing",
            "userName": "Anushka Khemka",
            "userProfileURL": "https://www.linkedin.com/in/anushka-khemka-0bb5a520a",
            "dataId": "urn:li:comment:(activity:7293260797831503872,7293310907420397571)"
          },
          {
            "commentText": "It's an interesting way to get the attention. Bina job description ke hi job ka description samajh gya",
            "userName": "Gaurav Yadav",
            "userProfileURL": "https://www.linkedin.com/in/gaurav-s-yadav",
            "dataId": "urn:li:comment:(activity:7293260797831503872,7293262827337715715)"
          },
          {
            "commentText": "Gaurav Yadav hainna?",
            "userName": "Parth Sanghvi",
            "userProfileURL": "https://www.linkedin.com/in/parth-sanghvi-humour-finance",
            "dataId": "urn:li:comment:(activity:7293260797831503872,7293263156720680960)"
          },
          {
            "commentText": "Parth Sanghvi haan",
            "userName": "Gaurav Yadav",
            "userProfileURL": "https://www.linkedin.com/in/gaurav-s-yadav",
            "dataId": "urn:li:comment:(activity:7293260797831503872,7293264703638630400)"
          }
        ],
        "commentAdded": "This role sounds like a unique challenge! Excited to see how creativity can redefine the everyday. Best of luck to all applicants! ☕✨"
      },
      {
        "postId": "urn:li:activity:7293285673623515137",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293285673623515137",
        "url": "https://www.linkedin.com/in/beverlyhathorn?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAI1cOwBQiOjPyjNnNAcC75WXQDEhrYxrMc",
        "name": "Beverly Hathorn, PHR, PMP\nBeverly Hathorn, PHR, PMP",
        "content": "𝗧𝗵𝗲 𝗖𝘂𝗹𝘁𝘂𝗿𝗲 𝗕𝗹𝗶𝗻𝗱 𝗦𝗽𝗼𝘁 𝗖𝗼𝘀𝘁𝗶𝗻𝗴 𝗬𝗼𝘂 𝗟𝗼𝘆𝗮𝗹𝘁𝘆!\n\nThough your teams clunk along, every day seems a bit rocky or unsteady.\n\nYour team knows where the gaps are - but why do they hesitate to raise red flags?\n\nBecause culture is a process too—and when it’s broken, customers and teams suffer.\n\nWithout psychological safety, your team won’t:\n Flag churn risks early\n Challenge broken processes\n Offer proactive solutions\n\nGreat teams don’t just follow processes—they improve them.\n\nBut you'll only get that when leaders foster a culture where speaking up is safe, innovation is encouraged, and problem-solving is rewarded.\n\nThe \"𝙐𝙣𝙨𝙩𝙤𝙥𝙥𝙖𝙗𝙡𝙚 𝙎𝙮𝙨𝙩𝙚𝙢𝙨\" audio program was designed to fix exactly this.\n\nIn just 5 days, you’ll uncover the cultural gaps slowing your retention efforts—and learn how to build a system where teams take initiative, customers feel valued, and referrals become second nature.\n\n Drop \"culture\" or DM me, and I’ll send you the free audio series.\n\nYour culture is either fueling loyalty—or quietly destroying it.\n\nWhich one is yours?\n\n Ready to fix it?\n\nLet’s go!",
        "reactions": {
          "likes": "17",
          "comments": "6 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Great insights, Beverly!\n\nBuilding a culture of trust and innovation is the real key to unlocking loyalty, both from teams and customers.",
            "userName": "Jitendra Sheth Founder, Cosmos Revisits",
            "userProfileURL": "https://www.linkedin.com/in/cosmosrevisits",
            "dataId": "urn:li:comment:(activity:7293282369095036928,7293285628643885056)"
          }
        ],
        "commentAdded": "Absolutely agree! Cultivating psychological safety is key to unlocking team potential and driving innovation. Lets transform our cultures for the better!"
      },
      {
        "postId": "urn:li:activity:7293252125541687297",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293252125541687297",
        "url": "https://www.linkedin.com/in/colbywegter?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABKlU-gB43StC0lTFt2eMY4ubjQvzVYSc9w",
        "name": "Colby Wegter\nColby Wegter",
        "content": "Want to stop clients from scope creeping?\n\nLearn to ask this simple question:\n\nWhy?\n\nI chat with agency owners weekly who speak about scope creep like it’s a disease they’ve been afflicted with.\n\nI’m throwing a snowball at your head.\n\nIf a client scope creeps, and you let them, are we still seeing this as an unsolvable problem?\n\nHere’s the antidote.\n\nNo fear. No combativeness. No awkward turtle.\n\nAsk.\nThem.\nWhy.\n\nExample: I’ve served hundreds of manufacturing clients in my SEO career.\n\nI’d always hear this: “We need to be on social media.”\n\nThis is what you hear: “They can pay me more.”\n\nBut you’ll find a way to underprice it\nthey’ll ask for more than you agreed\nand the vicious cycle continues.\n\nMy approach?\n\n“Why?”\n\nIt’s not your job to say yes.\nIt’s your job to serve them to the best of your ability.\n\nMy clients would often say, “We think it’s what we need to do.”\n\nAgain, “Why?”\n\nOver and over and over I’d ask until we realized they thought it was a good idea but didn’t have a real reason.\n\nHere’s how I’d serve them to the best of my ability:\n\n“If we’ve established that it’s highly unlikely you’ll get more immediate business from social media, but you’re already seeing traction from our SEO work, can I propose that, if there’s more in the budget, we double down on what’s working instead of lose focus on something we don’t have a guarantee for?”\n\nThis is how you say no to a client.\n\nThey scope creep because you’re saying yes instead of serving them to the\nbest of your ability.\n\nCool? Cool.\n\nHate saying no to clients and need systems for how to do it effectively—without fearing churn?\n\n",
        "reactions": {
          "likes": "11",
          "comments": "3 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Love this, Colby. Asking “Why?” shifts the focus from just agreeing to actually understanding the core need - and often, clients realize they don’t need more, they just need what’s already working to be amplified.",
            "userName": "Shiv Shenoy",
            "userProfileURL": "https://www.linkedin.com/in/shivshankershenoy",
            "dataId": "urn:li:comment:(activity:7293252125541687297,7293272084820934656)"
          },
          {
            "commentText": "What a great way to approach clients who think they can 'outsmart' the expert they just hired, or just want to do more, blindly betting on things that they 'feel' might work",
            "userName": "Sofia Blanco",
            "userProfileURL": "https://www.linkedin.com/in/sofi-blanco",
            "dataId": "urn:li:comment:(activity:7293252125541687297,7293259205900136449)"
          }
        ],
        "commentAdded": "Great advice! Asking Why? not only clarifies needs but also empowers us to guide clients toward the best solutions. 💡#ClientSuccess #AgencyGrowth"
      },
      {
        "postId": "urn:li:activity:7293297657022746624",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293297657022746624",
        "url": "https://www.linkedin.com/in/ajeet-kaur-4855ba2b0?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAErW_SUBXJUYpLVMTdVFlwvpKNbRZ_cWtoQ",
        "name": "Ajeet Kaur\nAjeet Kaur",
        "content": "Learn Chinese with Fang ling 芳玲 \n1. Take Your Time - Màn Màn Lái - 慢慢来 !\n\nWanna Learn Chinese  , Follow for more",
        "reactions": {
          "likes": "1",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/c018626f-f9d8-41ea-9d73-5939af79fdc4",
        "comments": [],
        "commentAdded": "Exciting initiative, Fang Ling! 🌟 Taking it slow is key to mastering a language. Looking forward to following your journey!"
      },
      {
        "postId": "urn:li:activity:7293305195839545344",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293305195839545344",
        "url": "https://www.linkedin.com/in/chidiebele-chukwuma?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABlhTh4B98-aQLzcUnL4NgVYN42RrEWjwuI",
        "name": "Chidiebele Chukwuma\nChidiebele Chukwuma",
        "content": "𝐘𝐎𝐔 𝐍𝐄𝐄𝐃 𝐓𝐎 𝐒𝐄𝐄 𝐓𝐇𝐈𝐒!!!\n\n\n\n\n\n\n10 Powerful Lessons Life Has Taught Me\n\n\nLife has been my greatest teacher, and along the way, I’ve learned lessons that have shaped me into who I am today.\n\n\nSome came through wins, others through struggles, but all have been valuable.\n\nHere are 10 things life has taught me:\n\n'n Your mindset determines your reality. If you believe you can, you’re halfway there.\n\n'n Nobody owes you anything. Take responsibility for your growth, your success, and your happiness.\n\n'n Consistency beats talent. It’s not about how skilled you are; it’s about how often you show up.\n\n'n Rejection is redirection. Every \"no\" is just pushing you closer to the right opportunity.\n\n'n Your network is your net worth. Surround yourself with people who inspire and challenge you.\n\n'n Done is better than perfect. Perfectionism kills progress. Start now and improve as you go.\n\n'n Money flows where value goes. Focus on providing solutions, and opportunities will come.\n\n'n Rest is productive. Burnout isn’t a badge of honor—listen to your body and recharge.\n\n'n Learn to say no. Protecting your time and energy is self-respect.\n\n'n You are your best investment. Never stop learning, growing, and betting on yourself.\n\n𝑾𝒉𝒊𝒄𝒉 𝒐𝒇 𝒕𝒉𝒆𝒔𝒆 𝒍𝒆𝒔𝒔𝒐𝒏𝒔 𝒓𝒆𝒔𝒐𝒏𝒂𝒕𝒆 𝒘𝒊𝒕𝒉 𝒚𝒐𝒖 𝒕𝒉𝒆 𝒎𝒐𝒔𝒕? 𝑳𝒆𝒕’𝒔 𝒕𝒂𝒍𝒌 𝒊𝒏 𝒕𝒉𝒆 𝒄𝒐𝒎𝒎𝒆𝒏𝒕𝒔!\n\n#\n\n\nPS: More life lessons will be in the comments",
        "reactions": {
          "likes": "28",
          "comments": "36 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Nobody owes you anything, you have to take action for the result you want to see.",
            "userName": "Favour Commander",
            "userProfileURL": "https://www.linkedin.com/in/favour-commander",
            "dataId": "urn:li:comment:(ugcPost:7293244406566952960,7293303187959128065)"
          },
          {
            "commentText": "Favour Commander Exactly, the earlier people learn it, the better",
            "userName": "Chidiebele Chukwuma",
            "userProfileURL": "https://www.linkedin.com/in/chidiebele-chukwuma",
            "dataId": "urn:li:comment:(ugcPost:7293244406566952960,7293305451704680450)"
          }
        ],
        "commentAdded": "Fantastic insights! I completely resonate with the importance of mindset and networking. Excited to hear more lessons in the comments! 🌟 #GrowthMindset"
      }
    ],
    "errors": [
      {
        "postId": "urn:li:activity:7292971038697512961",
        "url": "https://www.linkedin.com/groups/14382461?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A14382461-7292971037783187457",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293307355801268224",
        "url": "https://www.linkedin.com/in/denisesbrownmd?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAGDkhQBziUeHo6KtrkkCYnV8ChfeA80pVw",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7291112918597738498",
        "url": "https://www.linkedin.com/company/inc42/posts",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293183791462780928",
        "url": "https://www.linkedin.com/in/mustapha-o-5051a243?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAkatlUBqrrh83NufTk11w1ofYM5GN_JvMs",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7290372225759682560",
        "url": "https://www.linkedin.com/in/rickconlowservantleadership?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAPUxFwB6p1p6ESvdwgOkdRMuNdW3KDrJTU",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293261705730560003",
        "url": "https://www.linkedin.com/in/parth-sanghvi-humour-finance?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACrWWHIBmYh46hKHEhDWXQ-ljd36aXDIVp8",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293285673623515137",
        "url": "https://www.linkedin.com/in/beverlyhathorn?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAI1cOwBQiOjPyjNnNAcC75WXQDEhrYxrMc",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293252125541687297",
        "url": "https://www.linkedin.com/in/colbywegter?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABKlU-gB43StC0lTFt2eMY4ubjQvzVYSc9w",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293305195839545344",
        "url": "https://www.linkedin.com/in/chidiebele-chukwuma?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABlhTh4B98-aQLzcUnL4NgVYN42RrEWjwuI",
        "errors": [
          "Failed to fetch media URL."
        ]
      }
    ]
  }
]