{
  "posts": [
    {
      "postId": "urn:li:activity:7287880280705511424",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287880280705511424",
      "url": "https://www.linkedin.com/in/jaysingh10125?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABJoMRYBVdF7qW-FPEZ9AMmGe0-sLvgDXW8",
      "name": "Jay Singh\nJay Singh",
      "content": "\"We chose to work with you over other firms because you’re hungrier, earlier in your journey, and I want to grow together with you.\" This whole founder journey can be hard but hearing that makes me feel all warm inside ",
      "reactions": {
        "likes": "9",
        "comments": "6 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Honestly, this positivity is rare ",
          "userName": "Aimen Banu 🥘 WordChef",
          "userProfileURL": "https://www.linkedin.com/in/aimen-banu-%F0%9F%A5%98-wordchef-64b8aa251",
          "dataId": "urn:li:comment:(activity:7287878668591210496,7287880530681880576)"
        },
        {
          "commentText": "Aimen :) ",
          "userName": "Jay Singh",
          "userProfileURL": "https://www.linkedin.com/in/jaysingh10125",
          "dataId": "urn:li:comment:(activity:7287878668591210496,7287881340035731457)"
        },
        {
          "commentText": "The mutual benefit is where it's at. ",
          "userName": "Kassidy Jezierski",
          "userProfileURL": "https://www.linkedin.com/in/kassidyjezierski",
          "dataId": "urn:li:comment:(activity:7287878668591210496,7287879484429463552)"
        },
        {
          "commentText": "Kassidy exactly! ",
          "userName": "Jay Singh",
          "userProfileURL": "https://www.linkedin.com/in/jaysingh10125",
          "dataId": "urn:li:comment:(activity:7287878668591210496,7287880195619930114)"
        }
      ],
      "commentAdded": "Such a heartwarming sentiment! Collaboration and shared growth are truly the essence of success in the entrepreneurial journey. 🌟"
    },
    {
      "postId": "urn:li:activity:7287851859472531459",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287851859472531459",
      "url": "https://www.linkedin.com/in/courtneyturich1?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAALzytwB7yaYdzNaRJ5DfBf2Nakbrc4djDw",
      "name": "Courtney Turich✨\nCourtney Turich✨",
      "content": "Traveling isn’t easy these days…\n.\n.\nBut a necessary for many of us…\n\nEspecially for us in medical sales\nUnpredictable long days\nTime away from family\nPhysical exhaustion\nLack of routine\nFood on the go\nBasic hotels\n\nThe glamour does not exist\n\nOn the flipside it shakes things 🆙\nNew customer opportunities\nSeeing is believing (ex: Amma)\nBreak from routine\nProfessoonal wins\nPersonal growth\nCompany perks\n\nWhile I’m on the road, I’m fortunate\nTo have the BEST travel buddy\n\nAmma\n\nAtwe HELP\nCancer patients minimize chemo Hairloss during a difficult time\n\nThis isn’t VANITY, it’s about…\n\nMAINTAINING A SENSE OF SELF\nIDENTITY\nPRIVACY\n\nSo if YOU see Amma and myself\nWalking through your airport\nGive us a quick HELLO\nWe are on a mission\n\nDo you know about scalp cooling?\n\nWe’re growing like crazy,\nCome check us out!\n\nBe Bold. Be Confident. Be You\n\nCourtney\n\n—————\nFor more ways to be with fun, follow",
      "reactions": {
        "likes": "59",
        "comments": "30 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "That's one tidy package there, Courtney Turich",
          "userName": "✒️Claire M. Davis🖋️",
          "userProfileURL": "https://www.linkedin.com/in/clairemdavis",
          "dataId": "urn:li:comment:(activity:7287848399188471808,7287851848269500417)"
        },
        {
          "commentText": "️Claire M. Davis️ YES! She is small and MIGHTY! Different than anything on the market!!!",
          "userName": "Courtney Turich✨",
          "userProfileURL": "https://www.linkedin.com/in/courtneyturich1",
          "dataId": "urn:li:comment:(activity:7287848399188471808,7287852827144540160)"
        }
      ],
      "commentAdded": "Love your perspective, Courtney! Traveling may be tough, but the impact you and Amma have on patients is truly inspiring. Keep shining! 🌟"
    },
    {
      "postId": "urn:li:activity:7287823863650893826",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287823863650893826",
      "url": "https://www.linkedin.com/in/mkoesterer?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAJ9iiAB5bh6NL9kMz59hr5JCHi31nuQIM8",
      "name": "Mark R. Koesterer\nMark R. Koesterer",
      "content": "Day 22 of The Rocky Steps Challenge: Unlocking Influence \n\nWhy Young Athletes Need a Plan for NIL Content Posting\n\nHow do you get started building your brand and creating content for NIL (Name, Image, and Likeness) opportunities?\n\nIn today’s lesson, I’m answering one of the most common questions I hear from athletes and creatives:“Where do I begin?”\n\nTo help, I’ve created a list of 20 content ideas specifically designed for young athletes. These ideas will guide you in showcasing your skills, personality, and values while building an authentic brand that attracts opportunities.\n\nHere’s why a plan is essential for NIL content:\n* It ensures consistency and professionalism.\n* It helps attract sponsors by highlighting what makes you unique.\n* It gives you the tools to stay organized and compliant with NIL guidelines.\n\nEvery day, I share insights from my journey and the lessons I’ve learned about creating content, building influence, and supporting others in doing the same.\n\nLet’s connect: Are you a young athlete, coach, or creative looking to unlock your influence? Drop your favorite content idea or NIL question in the comments—I’d love to hear from you!\n\n\nYou can listen to my thoughts HERE:",
      "reactions": {
        "likes": "11",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Great insights! A solid content plan is key for young athletes to shine in the NIL landscape. Excited to see the ideas you share! 🌟"
    },
    {
      "postId": "urn:li:activity:7287880808600616961",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287880808600616961",
      "url": "https://www.linkedin.com/in/selloyd?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAEsIOAB-SrrgrEwLuIyvyn_9ikS5c2vPWk",
      "name": "Sarah Lloyd Favaro\nSarah Lloyd Favaro",
      "content": "Exciting Trusted AI™ News! \n\n\nI'm delighted to joinwhere I'll serve as Senior Business Executive, Safe & Trustworthy AI Strategy, alongside renowned AI governance expert. This role combines my experience in global AI transformation with's pioneering work in safe and secure AI implementation.\n\nBuilding on my track record of driving AI initiatives across five continents, I'm passionate about helping organizations navigate the complexities of Responsible AI adoption. Atwe're focused on de-risking AI initiatives and maximizing value through our comprehensive AI TIPS framework andas a Service offering.\n\nOur approach uniquely combines strategic risk management with practical implementation expertise. Whether you're starting your AI journey, scaling existing initiatives, or leading enterprise-wide AI transformation, we provide end-to-end support – from AI governance and risk assessments to ethical implementation and continuous monitoring.\n\nWe're already making an impact! Join us this Friday, January 24, 2025, at 11:30 AM ET for our secondevent on \"Safe Secure Trusted AI Agents - Building and Deploying,\" where, Trusted AI's Chief AI Governance and AI Trust Officer, will discuss practical approaches to implementing trustworthy AI agents. Link to join/register in the comments below! \n\nLooking to accelerate your AI transformation while ensuring responsible implementation? Let's connect! Whether you're interested in AI governance frameworks, risk management strategies, or building trustworthy AI solutions, I'm here to help your organization achieve its AI objectives safely and successfully.\n\n️#ResponsibleAI \n\n",
      "reactions": {
        "likes": "12",
        "comments": "2 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "I'm attending Safe Secure Trusted AI Agents - Building and Deploying by Trusted AI™ and Pamela Gupta. Join me on January 24 at 11:30 am ET \nhttps://www.linkedin.com/events/safesecuretrustedaiagents-build7282386305454419969/theater/",
          "userName": "Sarah Lloyd Favaro",
          "userProfileURL": "https://www.linkedin.com/in/selloyd",
          "dataId": "urn:li:comment:(activity:7287876703052275712,7287877697765023746)"
        },
        {
          "commentText": "Welcome Sarah Lloyd Favaro, looking forward to working with you on helping clients get value form their AI Investments!",
          "userName": "Pamela Gupta",
          "userProfileURL": "https://www.linkedin.com/in/buildingtrustedaiholistically",
          "dataId": "urn:li:comment:(activity:7287876703052275712,7287881649118171136)"
        }
      ],
      "commentAdded": "Congratulations on this exciting new role! Your expertise in Responsible AI will surely lead to impactful transformations. Looking forward to the event!"
    },
    {
      "postId": "urn:li:activity:7287615200134873088",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287615200134873088",
      "url": "https://www.linkedin.com/in/daniel-goodman2001?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAeS6L0BdHsGXRto-nWwwPVPt8hNYJ4niZI",
      "name": "Dan Goodman\nDan Goodman",
      "content": "If managers were accountable for placing employees on PIPs, there would be a lot less PIPs. \n\nIt should be a reflection on both the manager and employee, not just the employee.\n\nNot a weapon for a manager to manage an employee out of the business that they don't like or want around anymore.\n\nAccountability must go in both directions.",
      "reactions": {
        "likes": "137",
        "comments": "43 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Well said Dan. In some other countries, there are no such things as PIPs but domestic enquiries chaired & attended by committee members all of whom has not worked with the employee concerned. The employee's manager is not to be involved whatsoever. That's to ensure fairness & no conflict of interests. Whereas PIP ( from what I have read & heard) is written by the manager concerned & also assessed & concluded by himself!! That can't be fair..In other countries, if the employee is unjustly dismissed, he /she can be compensated usually with 24 months back pay plus reinstatement. Further the employment lawyer there who acts for employees only is not allowed ( at least morally or professionally ) to act for the Employer even in other unrelated cases or different Employers. That compelled everyone to be fair & honest.",
          "userName": "Seng Lee Jot",
          "userProfileURL": "https://www.linkedin.com/in/seng-lee-jot-99a47516",
          "dataId": "urn:li:comment:(activity:7287615200134873088,7287653474459164672)"
        },
        {
          "commentText": "Seng Lee Jot i’ve consulted with more than a dozen people from other countries, including in Europe, Asia, and north and South America. The United States has some of the worst protections for employees of most countries that I’ve worked with people in.",
          "userName": "Dan Goodman",
          "userProfileURL": "https://www.linkedin.com/in/daniel-goodman2001",
          "dataId": "urn:li:comment:(activity:7287615200134873088,7287780659740180480)"
        },
        {
          "commentText": "Agree I always held my managers accountable for turnover. Either they had no eye for talent and hired poorly or couldn’t develop talent who was failing under their wing.",
          "userName": "Jack Ducanis",
          "userProfileURL": "https://www.linkedin.com/in/jackducanis",
          "dataId": "urn:li:comment:(activity:7287615200134873088,7287624339485532161)"
        },
        {
          "commentText": "Quinton Allen ",
          "userName": "Dan Goodman",
          "userProfileURL": "https://www.linkedin.com/in/daniel-goodman2001",
          "dataId": "urn:li:comment:(activity:7287615200134873088,7287782621768499200)"
        },
        {
          "commentText": "Dan Goodman it starts with the leadership team developing a solid business plan for success and each persons defined role. The sales manager is then championed with setting the proper expectations, training their team, delivering the implementation of the plan and understanding that their success is a culmination of the team success and that is their responsibility to deliver.",
          "userName": "Jack Ducanis",
          "userProfileURL": "https://www.linkedin.com/in/jackducanis",
          "dataId": "urn:li:comment:(activity:7287615200134873088,7287796794262962176)"
        }
      ],
      "commentAdded": "Absolutely agree! Accountability should be a two-way street, fostering growth and collaboration rather than becoming a tool for exclusion."
    },
    {
      "postId": "urn:li:activity:7287875932936105985",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287875932936105985",
      "url": "https://www.linkedin.com/in/daisyaugerdominguez?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADW_d0BhfWxWaFCWj4P4x9BWBCdZ2UtZnE",
      "name": "Daisy Auger-Domínguez (she/her/ella)\nDaisy Auger-Domínguez (she/her/ella)",
      "content": "I’ve spent the past few days on calls and emails, helping leaders, HR professionals, and DEI practitioners figure out how to meet this moment without burning out.  It’s not uncharted territory—we’ve weathered years of upheaval, learning to adapt, keep things moving, and care for our teams. But it’s still hard, and it helps to remember that you don’t have to do it alone.\n\nNavigating this moment can feel like walking a tightrope. The issues demanding our attention seem endless. On the one hand, we’re expected to stay neutral, steering clear of politics at work, and on the other, staying silent when team members feel the real impacts of decisions can feel like letting them down.\n\nIn moments like these, lean on the beautiful basics:\n\n Be a steady presence. You don’t need to have all the answers—no one does right now. What matters most is showing up for your team with care and consistency. Build trust and show them you’ll figure out whatever comes next together.\n\n Lean into your workplace rhythms. Every team member should know that a safe work environment is a priority—a place where they can turn, be heard, and find support—while respecting that some may choose to opt-out. If statements are your thing, go for it. It doesn’t have to be a big production. Use meetings, check-ins, or 1:1s as intentional moments to listen and connect. A simple \"How can I support you?\" or a thoughtful note can go a long way.\n\n Be clear about safety and well-being. Let your team know it’s OK (and encouraged) to step away, recharge, and care for themselves or their families. Be equally clear that harm to co-workers won’t be tolerated. Revisit your shared values and code of conduct (or create one if missing). If formal benefits aren’t available, small gestures—like gift cards, mindfulness breaks, or a fun playlist—can boost energy and lift spirits for those feeling worried, disengaged or burned out.\n\n Don’t forget about you. “You can’t pour from an empty cup” is a saying for a reason. Set boundaries, ask for support, and prioritize your well-being. You’re modeling what care and balance look like for your team.\n\nIf your organization’s values and principles feel unclear, let this be your signal to take stock.\n\nYour team is paying attention. Show up with confidence, heart, and a steady presence. You’re not just navigating a moment; you’re shaping the conditions for your team to thrive. That’s powerful, meaningful work—and it starts with you.\n\nHow are you showing up for your teams right now?",
      "reactions": {
        "likes": "4",
        "comments": "1 comment",
        "shares": "0"
      },
      "mediaUrl": "blob:https://www.linkedin.com/542f2fd8-3b0f-48cb-b6dc-dc59e7f26077",
      "comments": [
        {
          "commentText": "Thank you for this message Daisy Auger-Domínguez (she/her/ella). We are all working hard to navigate right now and messages like these are so important. Our team instituted weekly Open Forums to provide safe spaces to staff - these have been an important tool for us throughout the past few months.",
          "userName": "Emma McKee",
          "userProfileURL": "https://www.linkedin.com/in/emma-mckee",
          "dataId": "urn:li:comment:(ugcPost:7287870061384511490,7287878039328227329)"
        }
      ],
      "commentAdded": "Absolutely love this! 🙌 Prioritizing care and connection is key to empowering our teams. Together, we can navigate these challenges!"
    },
    {
      "postId": "urn:li:activity:7287838805691125760",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287838805691125760",
      "url": "https://www.linkedin.com/in/jenniferchony?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAFDJqAB9JuCrd2aD3xdZPNxf6I8Uj8UDjU",
      "name": "Jennifer Cho\nJennifer Cho",
      "content": "New year, new me….new gig! Hope you all have enjoyed the Creator Deck farewell tour  \n\nThe agency is TRANSFORMED – faster than I could have ever imagined.\n\nTo my team - I’m SO PROUD OF US. How we call came TOGETHER, celebrating our strengths and winning as one. This is just the beginning \n\nTo my clients and partners - thank you for giving us the chance to do some amazing work together. Our collabs will stand the test of time and I’m excited to see what the future holds \n\nFinishing out the transition process but stay tuned for what’s next! \n\nBut in between time, actively looking for clients as I get into my next thing  Reach out if I can help you with:\n\n- All things Marketing, Influencer and Social - you already know!!\n- Are you a Founder that needs help operationalizing your work? Ready to scale? I can help!\n- Coaching and mentoring is my jam, and I’m recruiting for a few open spots! There is a Founder cohort and a Corporate Hustle cohort depending on where and how you are trying to level up. \n\nI would love to connect with you and see how YOU are navigating the chaos of 2025 and seizing your opportunities! ️",
      "reactions": {
        "likes": "57",
        "comments": "6 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "It has been such a joy to watch you go to work and transform the agency! I am so grateful for everything I’ve learned from working alongside you, from tough decisions to celebratory wins, it’s been an unforgettable ride. On to bigger and brighter things, I’m sure! Keep us all updated on what’s next!",
          "userName": "Renee Johnson",
          "userProfileURL": "https://www.linkedin.com/in/reneecjohnson1",
          "dataId": "urn:li:comment:(ugcPost:7287838804609007617,7287868979837054976)"
        },
        {
          "commentText": "Congratulations on such an incredible journey and the amazing milestones you’ve achieved! Your energy, passion, and ability to transform ideas into impact have always been so inspiring.\n\nHaving had the chance to meet you and your brother back during my time volunteering with New Jersey Needs You, I’ve always appreciated that moment and the work you’ve championed since. It’s been amazing to follow your updates and witness the incredible legacy you continue to build.\n\nThank you for sharing such an inspiring part of your story. Looking forward to seeing how you continue to thrive and transform what’s next. Keep soaring high - your impact is undeniable, and I’m excited to earn the chance to continue to experience your work and seeing what the future holds as a result of your brilliance today. ",
          "userName": "Joel Ruffin Jr., SHRM-CP, PHR",
          "userProfileURL": "https://www.linkedin.com/in/joeleruffinjr",
          "dataId": "urn:li:comment:(ugcPost:7287838804609007617,7287842221142290432)"
        }
      ],
      "commentAdded": "Congratulations on the new adventure! Excited to see the amazing impact youll continue to make. Here’s to new opportunities ahead! 🚀"
    },
    {
      "postId": "urn:li:activity:7287881095428157443",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287881095428157443",
      "url": "https://www.linkedin.com/in/sudarshana-sinha-283b1498?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABTPcYMBHhVdOn0brk2fifhlmGS4q_fNpkU",
      "name": "Sudarshana Sinha\nSudarshana Sinha",
      "content": "\"Wow, I knew it would work, but seeing the results still blew my mind!\"- One of my clients said recently after putting my advice into action for her business.\n\nHonestly, the recommendation seemed like a no-brainer to me—I've spent years helping solopreneurs grow their businesses, so I know exactly what works. But seeing it all click for my client? That never gets old.\n\nI spend a lot of time thinking about challenges like this, and the solutions I offer are ones I know will make a difference. What might seem basic to me can often be a game-changer for someone else who's still figuring things out.\n\nAnd I bet you have some of those insights in your work too. What seems like second nature to you could be exactly what someone else needs to move their business forward.\n\nMy advice: Don’t hold back! Speak up and share your expertise. You never know when something you think is “simple” could be the breakthrough someone else needs.\n\nWhat’s the best \"basic\" piece of advice you've shared that truly made an impact?",
      "reactions": {
        "likes": "2",
        "comments": "1 comment",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "That's so right! Sometimes, the simplest of advices can do wonders, it's so important to speak to someone about the challenges we face .",
          "userName": "Mehwish Hassan",
          "userProfileURL": "https://www.linkedin.com/in/mehwish-hassan-38538324b",
          "dataId": "urn:li:comment:(activity:7287880006712635392,7287881250164404225)"
        }
      ],
      "commentAdded": "Absolutely! Sometimes the simplest insights can spark the biggest changes. Cheers to sharing knowledge and uplifting each other!"
    },
    {
      "postId": "urn:li:activity:7287873937814769665",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287873937814769665",
      "url": "https://www.linkedin.com/in/maththinking?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAD5LcBBZCNJ3T89euZhuJxAmL1RWcykg4",
      "name": "Ju Rao\nJu Rao",
      "content": "Art Intelligence: How Generative AI Relates to Human Art-Making - https://lnkd.in/eWtSwNaH\nLook for \"Read and Download Links\" section to download. Follow/Connect me if you like this post.",
      "reactions": {
        "likes": "7",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "An intriguing exploration of AIs role in art! Excited to learn more and see the creative possibilities unfold. Thanks for sharing!"
    },
    {
      "postId": "urn:li:activity:7287816277719412737",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287816277719412737",
      "url": "https://www.linkedin.com/in/colbywegter?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABKlU-gB43StC0lTFt2eMY4ubjQvzVYSc9w",
      "name": "Colby Wegter\nColby Wegter",
      "content": "How you’ll prepare your people to scale without you.\n\nYou won’t leave them behind.\n\nYou hit a good run. You see a honeyhole of leads and sales.\n\nBut you’re already worried about your reputation suffering.\n\nBecause your employees aren’t ready to handle it.\n\nThey’ll fail you.\n\nFire fighting. Sleepless nights.\n\nYou could look to hire.\n\n→ More overhead\n→ More work\n→ No guarantees\n\nYou could pass the opportunity\n\n→ No growth\n→ Less stress\n→ Potential unreached\n→ Mediocrity and stuck in neutral\n\nNo man’s land sucks. You need to grow.\n\nAnd you need people to be ready.\n\nHere’s how you’ll do it:\n\nAppoint a leader\nExecution plan for the leader\nEmployee roadmaps for everyone else\nLoom SOPs\n\nIncredibly easy to understand.\n\nExtremely difficult to execute.\n\nBut possible.\n\nIf you want to see how I did it when we were scaling the agency from $50K to $200K months, check this:",
      "reactions": {
        "likes": "7",
        "comments": "1 comment",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Love the focus on people. A strong team makes scaling way less scary.",
          "userName": "Zane Schartz",
          "userProfileURL": "https://www.linkedin.com/in/zaneschartz",
          "dataId": "urn:li:comment:(activity:7287816277719412737,7287853751535550464)"
        }
      ],
      "commentAdded": "Great insights! Investing in leadership and clear roadmaps is key to sustainable growth. Excited to learn more about your success story! 🚀"
    }
  ],
  "errors": [
    {
      "postId": "urn:li:activity:7287880280705511424",
      "url": "https://www.linkedin.com/in/jaysingh10125?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABJoMRYBVdF7qW-FPEZ9AMmGe0-sLvgDXW8",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287851859472531459",
      "url": "https://www.linkedin.com/in/courtneyturich1?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAALzytwB7yaYdzNaRJ5DfBf2Nakbrc4djDw",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287823863650893826",
      "url": "https://www.linkedin.com/in/mkoesterer?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAJ9iiAB5bh6NL9kMz59hr5JCHi31nuQIM8",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287880808600616961",
      "url": "https://www.linkedin.com/in/selloyd?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAEsIOAB-SrrgrEwLuIyvyn_9ikS5c2vPWk",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287615200134873088",
      "url": "https://www.linkedin.com/in/daniel-goodman2001?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAeS6L0BdHsGXRto-nWwwPVPt8hNYJ4niZI",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287838805691125760",
      "url": "https://www.linkedin.com/in/jenniferchony?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAFDJqAB9JuCrd2aD3xdZPNxf6I8Uj8UDjU",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287881095428157443",
      "url": "https://www.linkedin.com/in/sudarshana-sinha-283b1498?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABTPcYMBHhVdOn0brk2fifhlmGS4q_fNpkU",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287873937814769665",
      "url": "https://www.linkedin.com/in/maththinking?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAD5LcBBZCNJ3T89euZhuJxAmL1RWcykg4",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287816277719412737",
      "url": "https://www.linkedin.com/in/colbywegter?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABKlU-gB43StC0lTFt2eMY4ubjQvzVYSc9w",
      "errors": [
        "Failed to fetch media URL."
      ]
    }
  ]
}