{
  "posts": [
    {
      "postId": "urn:li:activity:7286046343591051265",
      "url": "https://www.linkedin.com/in/richkingrecruiter?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAM_kegBOwf-CNSjl-e9pZc_VECLU27iUzM",
      "name": "Richard King\nRichard King",
      "content": "Gosh, I love Supreme Court rulings. Maybe it's the finality that makes me so happy. TikTok, under its current ownership, in the US is dead. \n\nAll the details here:\n\nSidenote: why would anyone *want* to use that app? This has NOTHNG to do with free speech...it is a national security issue. From the brief:\n\n\"...TikTok collects user data, user content, behavioral data (including “keystroke patterns and rhythms”), and device and network data (including device contacts and  calendars)). If, for example, a user allows TikTok access to the user’s phone contact list to connect with others on the platform, TikTok can access “any data stored in the user’s contact list,” including names, contact information, contact photos, job titles, and notes. 2 id., at 659. Access to such detailed information about U. S. users, the Government worries, may enable “China to track the locations of Federal employees and contractors, build dossiers of personal information for blackmail, and conduct corporate espionage.” 3 CFR 412. And Chinese law enables China to require companies to surrender data to the government, “making companies headquartered there an espionage tool” of China.\"",
      "reactions": {
        "likes": "8",
        "comments": "13 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Oh you’ve done it now Richard. You’ve besmirched the good name of people’s Ticky Tock. They’re going to come out in droves now telling you how it’s no different than this or they already have that.",
          "userName": "Aaron Glidewell, MBA",
          "userProfileURL": "https://www.linkedin.com/in/aaron-glidewell-mba",
          "dataId": "urn:li:comment:(activity:7286046343591051265,7286052122373111809)"
        },
        {
          "commentText": "Aaron Glidewell, MBA Oh I know. Everything we do online is tracked...and readily available for a domestic or \"friendly\" government...but China? Also in the ruling: \"...China—a designated foreign adversary...\"",
          "userName": "Richard King",
          "userProfileURL": "https://www.linkedin.com/in/richkingrecruiter",
          "dataId": "urn:li:comment:(activity:7286046343591051265,7286054465562886144)"
        },
        {
          "commentText": "Richard King I’m with you on this one. Poo pooing away the bad actor in this case like it doesn’t matter is completely missing the point. It’s not IF data is collected. We know that it is. It’s WHO gets the data and what are they doing with it.\n\nAlso, I’ll just leave this here. The biggest problem, in addition to the security concerns, is the backdoor espionage we’ve so willingly and enthusiastically embraced:",
          "userName": "Aaron Glidewell, MBA",
          "userProfileURL": "https://www.linkedin.com/in/aaron-glidewell-mba",
          "dataId": "urn:li:comment:(activity:7286046343591051265,7286056907868446720)"
        },
        {
          "commentText": "People use it because it’s the easiest/fastest platform for monetizing content creation.",
          "userName": "Erin Riska",
          "userProfileURL": "https://www.linkedin.com/in/erinriska-recruiter",
          "dataId": "urn:li:comment:(activity:7286046343591051265,7286071642047332352)"
        },
        {
          "commentText": "Easy come...easy go. ",
          "userName": "Richard King",
          "userProfileURL": "https://www.linkedin.com/in/richkingrecruiter",
          "dataId": "urn:li:comment:(activity:7286046343591051265,7286072379917680641)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7286019465945792515",
      "url": "https://www.linkedin.com/in/jakedunlap?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAENCicB0qY59ybik0DUN4FzM8lk0Rq6bjk",
      "name": "Jake Dunlap\nJake Dunlap",
      "content": "We have raised two generations of sellers who were taught that sales is about qualification and getting the deal done...vs creating satisfied customers.\n\nSaw this in a Deloitte report and was immediately sad\n\nBut it really made me think \"why\"\n\nWhy is the largest contingent of sellers in the workforce (Gen Z + Millenials) less motivated than ever by customer satisfaction?\n\nThe answer hit me hard. I was born in 1980 so in some groupings I'm a Millenial and others I'm like a year away.\n\nThis gave me an interesting view coming up in the workforce as I was both seeing changes and a part of the changes in behavior\n\nSo why are we here?\n\n1. It started with when we started to really hyper-segment roles in the 2010s. This group was just coming up in the workforce and seller were taught to close deals and you get $0 if they renew.\n\nGet the deal done, customer satisfaction isn't your problem.\n\n2. I hear less and less sales leaders today talking about \"how can we try to help the client, regardless of fit\" and more and more saying \"Did you qualify them?\" \"We don't waste time on....\" or \"sure let's do the discount, tell them CS is great and get the deal done\"\n\nWe have raised two generations of sellers now that believe sales is about qualification and getting the deal done...vs creating satisfied customers.\n\nMirror check sales leaders - What kind of reps are you raising? What habits are we creating that are slowing destroying B2B sales credibility with buyers in the process?",
      "reactions": {
        "likes": "10",
        "comments": "8 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "This goes deeper than just sales training or onboarding. This is about alignment. If the purpose of the role, the business and it's impact on it's customers' world isn't clearly articulated, shared and embedded, how can any sales person get behind it to focus on the customer? The number of surface dressing customer journey based sales pitches are what are really driving this mentality in the recent generations. Instead, we should be aligning the sales journey with customer impact and focusing less on quick wins towards arbitrary metrics and more on meaningful connections, conversations and feedback loops for new sales people to see their roles not about smashing targets, but about smashing problems.",
          "userName": "Kim Nuut",
          "userProfileURL": "https://www.linkedin.com/in/kim-nuut-4910537a",
          "dataId": "urn:li:comment:(activity:7286019465945792515,7286030258384846849)"
        },
        {
          "commentText": "Kim Nuut I think comp and leadership is just as much to blame",
          "userName": "Jake Dunlap",
          "userProfileURL": "https://www.linkedin.com/in/jakedunlap",
          "dataId": "urn:li:comment:(activity:7286019465945792515,7286033160738390016)"
        },
        {
          "commentText": "Jake Dunlap but that is causal to the overall mission and goals set. Leadership is not responsible in my view. The environment is what is to blame. That is not down to any one individual and instead is either designed or left to develop on its own. When designed, it has purpose and clarity. When left to develop on its own it is then subject to individual leadership styles, individual value sets and expectations.\n\nI understand where you are coming from but I think getting the cultural environment designed for purpose is key, removing individual leaders as hubs of the wheel and replacing them with a shared purpose, aligned vision and common value set to hire, reward and make decisions from. Then the comp and leadership can fit that narrative and not determine it.",
          "userName": "Kim Nuut",
          "userProfileURL": "https://www.linkedin.com/in/kim-nuut-4910537a",
          "dataId": "urn:li:comment:(activity:7286019465945792515,7286035121579720704)"
        },
        {
          "commentText": "This is a really good point, Jake Dunlap. I often felt like an outsider on sales teams where I held customer satisfaction as the most important success criteria. Clients always appreciated my approach but my managers were mixed. For renewals and long term success of the software business, customer satisfaction is critical.",
          "userName": "Todd Weinstein",
          "userProfileURL": "https://www.linkedin.com/in/todd-weinstein",
          "dataId": "urn:li:comment:(activity:7286019465945792515,7286024608351244288)"
        },
        {
          "commentText": "Todd Weinstein for sure. Like I mentioned, when I started in sales, I did both sales and manage the client. So it's built into the job",
          "userName": "Jake Dunlap",
          "userProfileURL": "https://www.linkedin.com/in/jakedunlap",
          "dataId": "urn:li:comment:(activity:7286019465945792515,7286033038818398208)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7286019395556945920",
      "url": "https://www.linkedin.com/in/worldsgreatestmarketer?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAAfo8BWo3j_DT5h2aNghVXnte2LVWGVzo",
      "name": "Evan Weber\nEvan Weber",
      "content": "Do you want to finally crack the code on multi-channel digital advertising this year? I can make that happen for you. Contact me to discuss!",
      "reactions": {
        "likes": "4",
        "comments": "1 comment",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Evan Weber I loved your post on reddit the other day. What other channels are you seeing emerge that will be important for brands in 2025?",
          "userName": "Jordan Finger",
          "userProfileURL": "https://www.linkedin.com/in/jordanfinger",
          "dataId": "urn:li:comment:(activity:7286019395556945920,7286058641583964160)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7286067018015875072",
      "url": "https://www.linkedin.com/in/carlosllanes?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAA0W13oBzIE7ytrNPmwWSc9UiHDAy_sMNOU",
      "name": "Carlos M. Llanes Jr.\nCarlos M. Llanes Jr.",
      "content": "Agree?",
      "reactions": {
        "likes": "307",
        "comments": "31 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Money comes and goes, but the lives you touch leave a legacy.",
          "userName": "Gregory shepard",
          "userProfileURL": "https://www.linkedin.com/in/gregshepard",
          "dataId": "urn:li:comment:(activity:7286060141928464384,7286070010123366400)"
        },
        {
          "commentText": "An inspiring perspective that we should all strive to live by.",
          "userName": "Scott Pallais",
          "userProfileURL": "https://www.linkedin.com/in/scott-pallais-4590467",
          "dataId": "urn:li:comment:(activity:7286060141928464384,7286067136081362944)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7286003671954292738",
      "url": "https://www.linkedin.com/in/houseofbricks?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAA-MkMBNOorFGtIDG0boxkwxMypXZhfUgk",
      "name": "Michael Kainatsky\nMichael Kainatsky",
      "content": "Where my Snake Oil Salesmen at?\n\n\nThis is a gift just for you.\n\nBut anyone else that might benefit, please enjoy as well.\n\nI don’t believe in lead magnets, that’s just me.\n\nYou needn’t provide me your email address\n\nand I promise. . .\n\nYou won’t be put into a sales funnel.\n\nI am giving away my Snake Oil Sales Guide Video . . .\n\nRight here, right now, absolutely free without any obligations.\n\nHow do you know if this for you?\n\n• You lie about your experience\n• You have no social proof of success\n• Your posts have only compliments\n• Your class is always almost full\n• You teach what you’ve never done\n\nCome on, let’s not kid each other\n\nyou know exactly who you are.\n\nI hope you enjoy, happy Friday!\n\nYours truthfully,",
      "reactions": {
        "likes": "76",
        "comments": "55 comments",
        "shares": "0"
      },
      "mediaUrl": "blob:https://www.linkedin.com/ebe3dcbe-1a57-475a-acbc-c4a154ade240",
      "comments": [
        {
          "commentText": "Do you have a playbook I can download?",
          "userName": "Adam House Sr.",
          "userProfileURL": "https://www.linkedin.com/in/adamhousesr",
          "dataId": "urn:li:comment:(ugcPost:7286003618405613569,7286005083119525888)"
        },
        {
          "commentText": "Adam ghostwriter? I’d never. It’s all in ChatGPT.",
          "userName": "Michael Kainatsky",
          "userProfileURL": "https://www.linkedin.com/in/houseofbricks",
          "dataId": "urn:li:comment:(ugcPost:7286003618405613569,7286007723358339073)"
        },
        {
          "commentText": "Michael Kainatsky only 17 spots left so hurry right? This is a 100k offering for $79",
          "userName": "Brad Bischoff",
          "userProfileURL": "https://www.linkedin.com/in/brad-bischoff",
          "dataId": "urn:li:comment:(ugcPost:7286003618405613569,7286009098205052928)"
        },
        {
          "commentText": "The parody of this is hilarious. Delete and block those who disagree. \nSerious note. I hope you were passenger while filming this. \nMy wife just got a ticket for cell phone down in w. Caldwell/Fairfield NJ yesterday. Drive safe.",
          "userName": "Brad Bischoff",
          "userProfileURL": "https://www.linkedin.com/in/brad-bischoff",
          "dataId": "urn:li:comment:(ugcPost:7286003618405613569,7286008764929851393)"
        },
        {
          "commentText": "Brad secret hack. Video records in mirror image. Instead of changing it, I left it so they people would think I was in passenger seat. Snake oil mantra all the way!",
          "userName": "Michael Kainatsky",
          "userProfileURL": "https://www.linkedin.com/in/houseofbricks",
          "dataId": "urn:li:comment:(ugcPost:7286003618405613569,7286009957575974912)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7286023852256636929",
      "url": "https://www.linkedin.com/in/stevelitzow?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAOjBwBP9nWnY_-6KWhJLV-EzTXeRDsxTg",
      "name": "Steve Litzow\nSteve Litzow",
      "content": "Big deal about to close... but it’s not the ICP?\n\nWhen I work on refining sales strategies for scale ups, I always include a validation step.\n\nIt comes after the proposal and negotiation.\n\nIt’s an internal step for:\n– The CEO or VP of Sales to review the deal.\n– The SDR or sales manager to self-analyze.\n– An item to discuss during weekly or monthly deal reviews.\n\nThe key focus of validation?\n\nDouble-check the customer still fits your ICP.\n\nIt’s overlooked because:\n– The SDR wants to hit quota.\n– The sales manager wants to hit quota.\n– Or simply, the revenue is too tempting to resist.\n\nBut if you’re serious about scaling to 8 or 9 figures, you must take this step.\n\nYou must reconsider going ahead if the ICP isn’t the right fit.\n\nHere’s why…\n\nI recently read a story from Jake Fuentes, co-founder of Cascade, about why he shut his startup down.\n\nHe admitted that “ICP fray” was a key factor.\n\nCascade initially defined their ICP as “nontechnical business analysts using Excel to crunch big data sets”.\n\nThe definition was too broad.\n\nThey ended up chasing customers with wildly different use cases:\n– A scooter company managing location data.\n– An HR team managing employee data.\n\nThey didn’t have a framework to accept or reject opportunities, so they tried to support them all.\n\nJake described this as “a slow death of a thousand cuts.”\n\nSupporting anyone and everyone pulled the company in a million directions, ultimately diluting their focus and stunting growth.\n\nIf you want to scale successfully, rejecting deals from prospects who don’t fit your ICP is the tough but necessary way forward.\n\nValidate every deal.\n\nStick to your guns.\n\nKeep closing.\n\nLike what you read? ️ Repost it to your network and follow Steve Litzow for more.\n\nWant to accelerate your sales? Join our community of CEOs & Sales Leaders subscribers today:",
      "reactions": {
        "likes": "16",
        "comments": "6 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Staying true to your ICP is crucial for growth. Misaligned deals might boost short-term revenue but often lead to inefficiencies and lost focus. Discipline here pays dividends!",
          "userName": "Neil Sarkar",
          "userProfileURL": "https://www.linkedin.com/in/neil-sarkar",
          "dataId": "urn:li:comment:(activity:7286008448524107776,7286023806983225345)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7286017428067631105",
      "url": "https://www.linkedin.com/in/guillaume-moubeche-a026541b2?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADGS3aIB50yotmXVjvGJKyqetfg0qhs20-c",
      "name": "Guillaume Moubeche\nGuillaume Moubeche",
      "content": "I've invested millions of dollars in startups and have met more than 3000 founders in the last 10 years, here's my #1 learning about success:\n\nFounders driven by \"money\" or \"purpose\" alone are doomed to fail.\n\n→ Founders who are 100% purpose-driven are too idealistic.\nThey believe that because they have a \"purpose,\" they are entitled to more.\nToo often, they run their company like a charity because what they do \"truly matters\" and eventually run out of cash.\n\n→ Founders who are 100% money-driven end up chasing every shiny object. They’re playing short-term games that rarely go the distance.\nThey never truly build to last...\n\nSo, what common traits have successful founders?\n\nThey have the perfect balance between finding a problem they're passionate to solve and that gives them a sense of purpose.\nWhile at the same time they understand the game of business and money and love to chase growth, sustainability and profitability.\n\nPurpose and profit don’t have to compete.\n\nThey can complement each other.\n\nPeace ️\n\nG.",
      "reactions": {
        "likes": "174",
        "comments": "29 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "100% agree! By definition, a real entrepreneur mindset is a combination of both (business + purpose/passion). The most successful founders I've encountered are those who can blend purpose with pragmatic business acumen. That's the economic realities! A delicate balance ",
          "userName": "Mohamed Hamdouni",
          "userProfileURL": "https://www.linkedin.com/in/mohamedhamdouni",
          "dataId": "urn:li:comment:(activity:7285889669089705986,7286050619457503233)"
        },
        {
          "commentText": "I know a lot of founders that were uniquely driven by success and money almost obsessionally that actually made it...they were smart enough to have a growth mindset, understand delayed rewards and surround themselves with insanely more competent people all being highly complementary....needless to say even Cuban was...and nothing wrong with this",
          "userName": "Olivier Gamrasni Åhlén",
          "userProfileURL": "https://www.linkedin.com/in/ogahlen",
          "dataId": "urn:li:comment:(activity:7285889669089705986,7286028630424473600)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7285861944433999872",
      "url": "https://www.linkedin.com/groups/121615?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A121615-7285063491680452608",
      "name": "JavaScript\nJavaScript",
      "content": "In programming, your career is a reflection of the problems you choose to solve and the value you bring to others.\n\nBelow an overview of career paths :\n\n\n Software Developer: Building and maintaining applications or software for various platforms.\ndevelopment (Front end, back end and fullstack).\n\n Mobile App Developer: Creating apps for iOS, Android, or cross-platform solutions.\n\n Game Developer: Designing and programming video games for various platforms.\n\n DevOps Engineer: Streamlining development, deployment, and operations processes.\n\n Data Scientist/Engineer: Analyzing data and building data-driven applications or pipelines.\n\n Machine Learning Engineer: Developing algorithms and models for AI and machine learning.\n\n Cybersecurity Specialist: Protecting systems and applications from security threats.\n\n Cloud Engineer: Designing and managing cloud infrastructure and services.\n\n Quality Assurance (QA) Engineer: Testing and ensuring the quality of software.\n\n Technical Architect: Designing the overall structure of software and systems.\n\n Product Manager (Tech-focused): Leading teams to build and enhance products.\n\n\nHow to choose ?\n\n Interest: Pick what excites you—frontend, backend, data, etc.\n\n Strengths: Play to your strengths—design, logic, or analysis.\n\n Growth: Look for fields with strong future demand (AI, data science).\n\n Job Market: Research roles in demand locally and globally.\n\n Work Style: Consider if you prefer teamwork (DevOps) or solo work (freelancing).\n\n Learning: Choose paths you’re willing to invest time in (ML, cybersecurity).\n\n Salary: Match career choices with your financial goals.\n\n Long-Term: Think about future goals, management or deep technical expertise.",
      "reactions": {
        "likes": "347",
        "comments": "1 comment",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Mom was talking about all the video games you're playing. It was a jump point for me (wanted to do it, but never found that opportunity). I'm enjoying full stack work, though.\n\nBeing an optimizer first makes it easier to go to market with an efficient product with first release. It also helps to be able to communicate with all stakeholders without losing interest or comprehension.",
          "userName": "Christopher Sworen, MS-IT",
          "userProfileURL": "https://www.linkedin.com/in/csworen",
          "dataId": "urn:li:comment:(groupPost:121615-7285063491680452608,7286067220080640000)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7285993017323192320",
      "url": "https://www.linkedin.com/in/salesdevelopmentexpert?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABZ9ncBQCkg16MHmgIThw5U-kp1mzMqZVU",
      "name": "Rocky LaGrone\nRocky LaGrone",
      "content": "Forging is Like Sales… is back.\n\nI’m particularly proud of this piece. It's my 26th knife, but I made it from scratch. It’s 46 layers of Damascus that took about 50 hours. The entire time I worked on it, I thought about the person I had made it for. How would they use it? Where would they keep it? What would they tell their friends and colleagues when they pulled it out? Would they actually use it? How would they take care of it? Would they eventually pass it down? Who would wind up with it in 25 years? Would it survive the abuse? The questions one can ask themselves during 50 hours of a labor of love could go on for pages and pages.\n\nIt’s the same in sales. Most everyone thinks they do Consultative Selling, but few actually do. Here’s a quick test: Give yourself 10 points for each yes.\n\nI ask more than 50 questions in discovery.\nCan you quickly state the five hardest questions you ask every prospect?\nDo your questions show your expertise?\nI don’t launch into a feature-benefit presentation when I hear buying signals.\nI get the prospect to share their personal impact of the problem.\n\nQuestions are what create Prospect Urgency. But they must be good questions, hard questions, questions the prospect has never heard before. Questions that cause the prospect to work hard to answer? Questions that expose their weakness to themselves. Questions that help the prospect see you as an expert? Questions that show you care? Questions that place you as the expert? Questions are your best sales tool.\n\nAdvice: When you think you know the solution to the problem and want to start telling…stop and ask 30 more questions to help the prospect reach the same conclusion you arrived at after the first 10 minutes of the call. They need you NOW! You know you've done it right when you hear from your prospect; what I heard at the end of my last sales call, “You didn’t sell me anything… I sold you, and I’m ready to go”.\n\nHow did you do in the test?",
      "reactions": {
        "likes": "5",
        "comments": "4 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "That is gorgeous. How many layers? Etching is beautiful.",
          "userName": "Paul Fuller",
          "userProfileURL": "https://www.linkedin.com/in/psfuller",
          "dataId": "urn:li:comment:(activity:7285993017323192320,7286036281329954816)"
        },
        {
          "commentText": "Paul Fuller 46 layers ladder Damascus",
          "userName": "Rocky LaGrone",
          "userProfileURL": "https://www.linkedin.com/in/salesdevelopmentexpert",
          "dataId": "urn:li:comment:(activity:7285993017323192320,7286063535082635264)"
        },
        {
          "commentText": "Beautiful knife Rocky!",
          "userName": "William Behr",
          "userProfileURL": "https://www.linkedin.com/in/wdbehr",
          "dataId": "urn:li:comment:(activity:7285993017323192320,7286066652331327488)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7286009447032750080",
      "url": "https://www.linkedin.com/in/connectwithjulian?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAscdUBi5KjtDVRnRgA7U3vV17-uelfhIE",
      "name": "Julian Lee\nJulian Lee",
      "content": "The latest in \"Storage Wars\": Lenovo set to acquire Infinidat. What will this mean for channel partners? Check out all of the preview interviews we did onwith's team and. We always knew that Infinidat was on a rocket ship  as their storage solutions and value proposition is simply hard to best!!! Congrats team!",
      "reactions": {
        "likes": "3",
        "comments": "1 comment",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Exciting times!",
          "userName": "Rabbi Hasan",
          "userProfileURL": "https://www.linkedin.com/in/rabbi-hasan-23608321b",
          "dataId": "urn:li:comment:(activity:7286009447032750080,7286017635949985792)"
        }
      ]
    }
  ],
  "errors": [
    {
      "postId": "urn:li:activity:7286046343591051265",
      "url": "https://www.linkedin.com/in/richkingrecruiter?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAM_kegBOwf-CNSjl-e9pZc_VECLU27iUzM",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7286019465945792515",
      "url": "https://www.linkedin.com/in/jakedunlap?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAENCicB0qY59ybik0DUN4FzM8lk0Rq6bjk",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7286019395556945920",
      "url": "https://www.linkedin.com/in/worldsgreatestmarketer?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAAfo8BWo3j_DT5h2aNghVXnte2LVWGVzo",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7286067018015875072",
      "url": "https://www.linkedin.com/in/carlosllanes?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAA0W13oBzIE7ytrNPmwWSc9UiHDAy_sMNOU",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7286023852256636929",
      "url": "https://www.linkedin.com/in/stevelitzow?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAOjBwBP9nWnY_-6KWhJLV-EzTXeRDsxTg",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7286017428067631105",
      "url": "https://www.linkedin.com/in/guillaume-moubeche-a026541b2?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADGS3aIB50yotmXVjvGJKyqetfg0qhs20-c",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285861944433999872",
      "url": "https://www.linkedin.com/groups/121615?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A121615-7285063491680452608",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285993017323192320",
      "url": "https://www.linkedin.com/in/salesdevelopmentexpert?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABZ9ncBQCkg16MHmgIThw5U-kp1mzMqZVU",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7286009447032750080",
      "url": "https://www.linkedin.com/in/connectwithjulian?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAscdUBi5KjtDVRnRgA7U3vV17-uelfhIE",
      "errors": [
        "Failed to fetch media URL."
      ]
    }
  ]
}