[
  {
    "postsData": [
      {
        "postId": "urn:li:activity:7294769903490711554",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294769903490711554",
        "url": "https://www.linkedin.com/in/dieterwolf?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABsFh-8B6C7Xleh7DoXRkF9r0IfCKIovw6o",
        "name": "Dieter Wolf 🖥️\nDieter Wolf 🖥️",
        "content": "Imagine having a virtual assistant that works alongside you as you browse the web, helping you make sense of cluttered pages overloaded with information. That’s the promise of Microsoft’s Copilot Vision, which is now available in preview.\n\nCopilot Vision isn’t just another AI assistant you ask questions. It’s like having a second pair of eyes that can scan, analyze, and offer insights on the information in front of you. Whether you’re comparing products or digging through complex reports, Copilot Vision could make overwhelming tasks much easier.\n\nIt could be a valuable tool for business owners, helping you to make decisions faster and achieve a more efficient workflow. Need to find the best supplier, analyze market trends, or get online research done quickly? Copilot Vision works in real time to help you focus on what’s important to you.\n\nFor now, it only works on specific websites in Microsoft Edge and is only available to Copilot Pro subscribers. As for privacy, Microsoft's said all data is deleted after use.\n\nDoes this sound like the kind of smart assistant that could help your team work faster, or are you still on the fence about using AI in your business?",
        "reactions": {
          "likes": "1",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Excited to see how Copilot Vision can transform productivity! A game-changer for navigating complex information and enhancing decision-making."
      },
      {
        "postId": "urn:li:activity:7294769648263151619",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294769648263151619",
        "url": "https://www.linkedin.com/in/clifflocks?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABjEhQBSI0l3aMI-cMP2Vg13uOKrWUxYVE",
        "name": "Cliff K. Locks\nCliff K. Locks",
        "content": "As companies grow, the key to success lies in having smart people. While technology becomes more generic and affordable, the real leverage is in the talent. Small companies can be nimble and achieve great things with minimal bureaucracy. Smart individuals drive innovation and create amazing outcomes. Understanding and leveraging this dynamic is crucial for sustainable growth. \n\n\nYour repost might be exactly what someone needs today. Appreciate your support!",
        "reactions": {
          "likes": "0",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": "https://dms.licdn.com/playlist/vid/v2/D4E10AQGFxKZ-32Zemw/mp4-720p-30fp-crf28/B4EZTw6TV0HcB0-/0/1739208607147?e=1739818800&v=beta&t=5LK-7Nq6htyY8jFRpoe4Ui2P1zZ4BmGQNneQOtDkqcQ",
        "comments": [],
        "commentAdded": "Absolutely agree! Talent is the true differentiator. Embracing smart individuals can propel innovation and drive sustainable growth."
      },
      {
        "postId": "urn:li:activity:7294774656010530816",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294774656010530816",
        "url": "https://www.linkedin.com/in/manujaggarwal?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAMY_wBiA538UlzNcv3ls30NXdjZZ2cT2c",
        "name": "Manuj Aggarwal\nManuj Aggarwal",
        "content": "𝗔𝗜 𝘁𝗿𝗲𝗻𝗱𝘀 𝗲𝘃𝗲𝗿𝘆 𝗯𝘂𝘀𝗶𝗻𝗲𝘀𝘀 𝗹𝗲𝗮𝗱𝗲𝗿 𝗺𝘂𝘀𝘁 𝘄𝗮𝘁𝗰𝗵 𝗶𝗻 𝟮𝟬𝟮𝟱\n\nThe AI race isn’t slowing down, it’s just getting started.\n\nWith tools like DeepSeek’s entry into the game,\n\nwe’re seeing a level of innovation that’s rewriting the rules.\n\nSo what does this mean for business leaders?\n\nIt’s simple: AI is evolving faster than ever, and those who adapt will lead.\n\nHere are five trends shaping AI in 2025 that you should NOT ignore:\n\n 𝗔𝗜 𝗔𝗴𝗲𝗻𝘁𝘀 𝗪𝗶𝗹𝗹 𝗥𝘂𝗻 (𝗮𝗻𝗱 𝗦𝗰𝗮𝗹𝗲) 𝗕𝘂𝘀𝗶𝗻𝗲𝘀𝘀𝗲𝘀\n\nForget basic chatbots, AI Agents are smarter, autonomous, and built to drive growth.\n\nThey don’t just answer questions; they manage tasks, automate workflows, and make decisions.\n\nSMBs can now compete with enterprise-level efficiency without hiring massive teams.\n\nAI Agents act as 24/7 employees, cutting costs and boosting productivity.\n\n 𝗣𝗲𝗿𝘀𝗼𝗻𝗮𝗹𝗶𝘇𝗮𝘁𝗶𝗼𝗻 𝗶𝘀 𝗿𝗲𝗮𝗰𝗵𝗶𝗻𝗴 𝗻𝗲𝘄 𝗵𝗲𝗶𝗴𝗵𝘁𝘀\n\nWith AI’s rapid development, customer experiences are becoming hyper-personalized.\n\nThink about ChatGPT plugins or AI systems that adapt content and services in real-time.\n\nYou can use AI to make every customer feel like your business was designed just for them.\n\n 𝗖𝘆𝗯𝗲𝗿𝘀𝗲𝗰𝘂𝗿𝗶𝘁𝘆 𝗴𝗲𝘁𝘀 𝘀𝗺𝗮𝗿𝘁𝗲𝗿\n\nAI isn’t just detecting threats anymore, it’s preventing them.\n\nCompanies are integrating AI into their security systems to predict vulnerabilities before hackers exploit them.\n\nThis isn’t just about protecting data; it’s about protecting your business.\n\n Humans and AI will work as a team\n\nRather than replacing people, AI is becoming a partner.\n\nTeams are already using tools like Codex and Copilot to streamline work and boost creativity.\n\nIt’s like AI handles the grunt work.\n\nThe result?\n\nA happier, more productive team.\n\nBut having said all that, what’s the big picture?\n\nThe AI race is on, and it’s moving faster than ever.\n\nAs leaders, it’s on us to stay ahead, embrace these tools,\n\nand find ways to innovate without losing sight of what matters:\n\npeople, trust, and long-term value.\n\nReady to lead the way?\n\nLet’s talk about how you can start leveraging AI to stay ahead of the curve.\n\nThe future isn’t waiting.\n\nAre you ready to lead it?",
        "reactions": {
          "likes": "1",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Absolutely agree! Embracing AI is crucial for leaders. Lets innovate while keeping people and trust at the forefront. Exciting times ahead! 💡🚀"
      },
      {
        "postId": "urn:li:activity:7294777599317225473",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294777599317225473",
        "url": "https://www.linkedin.com/in/johnkraski?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABkbm-0Be4xxSTDslQoX9c9qcRoExoNAGWk",
        "name": "John Kraski\nJohn Kraski",
        "content": "I’m absolutely convinced if you’ve met one amazing person here on LinkedIn, you're already more successful than 99% of people will ever be here.",
        "reactions": {
          "likes": "31",
          "comments": "10 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/0a4bcfc8-dae3-4cbe-822e-2b11c3b65a8f",
        "comments": [
          {
            "commentText": "Totally agree. You’re only ever one DM or one post away from making a brand new relationship here ",
            "userName": "Andrew Sheppard",
            "userProfileURL": "https://www.linkedin.com/in/andrewsheppard7",
            "dataId": "urn:li:comment:(ugcPost:7294760894910132226,7294777540609536002)"
          },
          {
            "commentText": " Andrew Sheppard ! This is the way! Happy Monday! ",
            "userName": "John Kraski",
            "userProfileURL": "https://www.linkedin.com/in/johnkraski",
            "dataId": "urn:li:comment:(ugcPost:7294760894910132226,7294779643604160512)"
          },
          {
            "commentText": "A met someone on here and then met them in person too. Say what!? That was wild.",
            "userName": "Kyle Faulkner 🧩",
            "userProfileURL": "https://www.linkedin.com/in/kylefaulkner--",
            "dataId": "urn:li:comment:(ugcPost:7294760894910132226,7294777151109644288)"
          },
          {
            "commentText": "Wow wow wow Kyle Faulkner  ! Love it! ",
            "userName": "John Kraski",
            "userProfileURL": "https://www.linkedin.com/in/johnkraski",
            "dataId": "urn:li:comment:(ugcPost:7294760894910132226,7294779493997576199)"
          }
        ],
        "commentAdded": "Absolutely agree! Building meaningful connections is the key to success on LinkedIn. Cheers to networking and collaboration! 🌟"
      },
      {
        "postId": "urn:li:activity:7294729912614088705",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294729912614088705",
        "url": "https://www.linkedin.com/in/shellabaludo?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAD0X0bEBbnw2YuMyiRC2KcJ0WXe9XCThlZE",
        "name": "Marie Y.\nMarie Y.",
        "content": "Lessons in Style, Humor, and Resilience: A Deep Dive into Sakamoto desu ga? \n\nAs anime continues to evolve as a storytelling medium, few shows have managed to blend humor, style, and life lessons quite like Sakamoto desu ga? (also known as Haven’t You Heard? I’m Sakamoto). For anyone who’s a fan of witty character development and comedic brilliance, this show is a gem that not only entertains but also provides valuable insights into navigating life’s challenges with grace.\n\nHere are a few takeaways from the unforgettable protagonist, Sakamoto, that resonate beyond the screen:\n\nConfidence is Key: Sakamoto's unwavering self-assurance teaches us that embracing who we are, no matter how unconventional, is powerful. His ability to stay calm and collected in any situation is a true example of maintaining confidence under pressure.\n\nEmbrace Your Uniqueness: Sakamoto’s style—whether in his impeccable fashion or his quirky actions—reminds us to embrace what makes us stand out. It's a lesson in authenticity and leadership.\n\nThe Power of Humor: The series brilliantly combines slapstick humor and subtle wit. It reminds us that laughter, even in the most unlikely situations, can break down barriers and connect people in meaningful ways.\n\nResilience in the Face of Adversity: No matter how many challenges Sakamoto faces, he handles each one with composure, making it clear that resilience and adaptability are traits we should all nurture.\n\nWhether you’re looking for a good laugh or an insightful reminder of how to approach life with style, Sakamoto desu ga? is a must-watch. It's more than just an anime—it's a masterclass in cool, with a sprinkle of inspiration that can be applied in both personal and professional settings.\n\nWhat's your favorite moment or lesson from Sakamoto desu ga? Let’s discuss in the comments!",
        "reactions": {
          "likes": "236\nYou and 235 others",
          "comments": "43 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "The way laughter connects people was portrayed so well. Truly an important reminder!",
            "userName": "Chahat Raj Kapoor",
            "userProfileURL": "https://www.linkedin.com/in/chahat-raj-kapoor",
            "dataId": "urn:li:comment:(activity:7294718204516466690,7294729892510744579)"
          }
        ],
        "commentAdded": "Absolutely loved Sakamotos confidence and humor! It truly teaches us how to embrace our uniqueness in both life and work. Whats your favorite moment?"
      },
      {
        "postId": "urn:li:activity:7294778388299296768",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294778388299296768",
        "url": "https://www.linkedin.com/in/nidaateeq?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAo0DSEBnzh2QNeP_p0WeIAxYzJ5WKgrL2Y",
        "name": "Nida Ateeq\nNida Ateeq",
        "content": "𝗪𝗲𝗲𝗸 𝟲: 𝗖𝗶𝗿𝗰𝗲 – 𝗔 𝗦𝘁𝗼𝗿𝘆 𝗼𝗳 𝗣𝗼𝘄𝗲𝗿, 𝗦𝗼𝗹𝗶𝘁𝘂𝗱𝗲, 𝗮𝗻𝗱 𝗕𝗲𝗰𝗼𝗺𝗶𝗻𝗴.\n\nThis week, I dove into Circe by Madeline Miller (recommended by), and wow—what a journey. This book was mythology, magic, and self-discovery all woven into one powerful narrative.\n\nIt wasn’t just a retelling of a Greek myth; it was a deeply personal and moving story about finding one’s place in the world.\n\nCirce’s story is about exile, transformation, and resilience. She starts as an outcast, underestimated and overlooked, but through trials and heartbreak, she reclaims her power and identity on her own terms.\n\n𝗢𝗻𝗲 𝗸𝗲𝘆 𝘁𝗮𝗸𝗲𝗮𝘄𝗮𝘆?\n\nStrength isn’t about brute force—it’s about self-awareness, growth, and the courage to stand alone. Circe doesn’t just survive; she thrives, creating her own destiny outside the expectations of gods and mortals alike.\n\nThis book made me reflect on the moments in life where we are forced to choose between fitting in and forging our own path. And sometimes, solitude is where we discover our truest selves.\n\nHave you read Circe? I’d love to hear your thoughts.\n\nOr, if you’ve ever read a book that made you feel deeply empowered, drop your recommendations below.",
        "reactions": {
          "likes": "123",
          "comments": "4 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Nida Ateeq, I haven't read Circe yet, but your description makes it sound like a must-read. I love stories about self-discovery and transformation. Thank you for sharing your insights!",
            "userName": "Jaitan Puri",
            "userProfileURL": "https://www.linkedin.com/in/jaitanpuri",
            "dataId": "urn:li:comment:(activity:7294773734136037376,7294775040871415809)"
          },
          {
            "commentText": "I recently read 'The Alchemist' by Paulo Coelho, and it resonated with me deeply, much like your experience with Circe. It’s fascinating how stories can inspire us to reflect on our own paths.",
            "userName": "Arantha Mascarenhas",
            "userProfileURL": "https://www.linkedin.com/in/aranthawork",
            "dataId": "urn:li:comment:(activity:7294773734136037376,7294775335835873281)"
          }
        ],
        "commentAdded": "Circe is truly a powerful read! It highlights resilience and self-discovery beautifully. What other books inspire you to embrace your journey?"
      },
      {
        "postId": "urn:li:activity:7294746994751746049",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294746994751746049",
        "url": "https://www.linkedin.com/in/davidhermann?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAB3hLYBTVZtRFITHPiQyaUJoOSlk-1SnVA",
        "name": "David. Hermann\nDavid. Hermann",
        "content": "AI-native startups achieve 50% higher efficiency; is this the future of business?\n\n[FP]: What We are Watching This Week",
        "reactions": {
          "likes": "3",
          "comments": "3 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Absolutely, AI-native startups are redefining efficiency! Excited to see how they shape the future of business and innovation. \nhashtag\n#AI \nhashtag",
            "userName": "Adamya Kumar",
            "userProfileURL": "https://www.linkedin.com/in/adamya-kumar-5947751ba",
            "dataId": "urn:li:comment:(ugcPost:7293653680724025346,7294760304645677056)"
          }
        ],
        "commentAdded": "Absolutely! AI-native startups are redefining efficiency. Excited to see how this shapes the future landscape of business! 🚀 #Innovation"
      },
      {
        "postId": "urn:li:activity:7294642847180304386",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294642847180304386",
        "url": "https://www.linkedin.com/in/radha-vyas-flashpack?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABcBWV8BOD0_siaFHrXf8hZwUwMJft-02q0",
        "name": "Radha Vyas\nRadha Vyas",
        "content": "Not all bullies grow up. \n\nThey just trade playground tactics for office politics. \n\nThese 7 subtle signs are silent killers of culture:\n\n1/ They take credit but deflect blame.\n2/ They withhold crucial information from teammates.\n3/ They criticise relentlessly without offering solutions.\n4/ They choose public forums for \"feedback.\"\n5/ They exclude teammates from key conversations.\n6/ They make subtle digs about your competence.\n7/ They make you question your reality.\n\nAnd when called out?\n\n\"It was just a joke.\"\n\"You're overreacting.\"\n\"You're being too sensitive.\"\n\nA toxic workplace doesn't just cost you talent.\n\nIt erodes your entire culture from the inside out.\n\nCompany culture is shaped by what you permit.\n\nYou NEED to have a zero tolerance policy for workplace bullies. Even if they're high performers with shiny titles.\n\nAgreed?\n\n️ Share to warn your network.\n\n_\n\n I'm, CEO & Co-Founder of, connecting solo travelers on life-changing social adventures.\n\nFollow for daily posts on the journey!",
        "reactions": {
          "likes": "589",
          "comments": "283 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Toxic culture undermines growth. Addressing these issues strengthens the foundation!",
            "userName": "Tom Wanek",
            "userProfileURL": "https://www.linkedin.com/in/tomwanek",
            "dataId": "urn:li:comment:(ugcPost:7294637514122817537,7294779793739268096)"
          }
        ],
        "commentAdded": "Absolutely agree! A strong zero-tolerance policy is vital for fostering a healthy work culture. Lets prioritize respect and collaboration!"
      },
      {
        "postId": "urn:li:activity:7294769610497622018",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294769610497622018",
        "url": "https://www.linkedin.com/in/sammyjames?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAAtAMBB2ZZiVFrzbXd4T-YvXEN0dnpS6w",
        "name": "Sammy James\nSammy James",
        "content": "Your Team Is Wasting Time on the Wrong Leads.\n\nNot all leads are equal. But most teams treat them the same.\n\nFor businesses and schools handling high lead volume, prioritization is everything.\n\nAI-driven lead scoring = higher enrollments & conversions.\n\nThe best teams focus on high-intent leads while nurturing others.\nAI, data, and automation should tell you who to call, when to call, and how to engage.\n\nBut what if you don’t have high lead volume?\n\nWhen every inquiry matters, the focus shifts from prioritization to maximization—making sure every lead gets immediate attention and personalized engagement.\n\nWhether you're handling 100 leads or 10,000, the key is efficiency.\n\nHow does your team manage lead prioritization (or lack of it)?",
        "reactions": {
          "likes": "1",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Great insights! Prioritizing leads effectively transforms engagement strategies. Curious to hear how others fine-tune their approach!"
      },
      {
        "postId": "urn:li:activity:7294777691809951745",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294777691809951745",
        "url": "https://www.linkedin.com/groups/4702266?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A4702266-7294777690912407554",
        "name": "Marketing Communication: Digital Advertising Online SEO/SEM Internet Search Mobile Apps Social Media\nMarketing Communication: Digital Advertising Online SEO/SEM Internet Search Mobile Apps Social Media",
        "content": "Fact: AI is not just a tool—it’s a revolution.\nThe rules of business are being rewritten. \nEntrepreneurs and business owners who choose \n\nto ignore this shift\n\nrisk falling behind.\n\n\nBut those who seize the opportunity,\n\nmaster the tools,\n\nand harness AI to their advantage?\n\n\nThey won’t just survive—they’ll dominate.\n\n\nHere’s the truth:\n\n• AI can automate tasks you never thought possible.\n• It can analyze data faster than any human.\n• It can unlock creativity, innovation, and efficiency at levels we’ve never seen before.\n\n\nBut the key isn’t just having access to AI.\n\nIt’s knowing how to use it.\n\n\n\nThe winners will be the ones\n\nwho are fearless learners,\n\nthe ones who embrace change\n\ninstead of resisting it.\n\n\nSo ask yourself:\nAre you leveraging AI\n\nto grow your business—or are you\n\nletting your competitors take the lead?\n\nThe choice is yours.",
        "reactions": {
          "likes": "2\nMarianna Outsia and 1 other",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Absolutely agree! Embracing AI isnt just smart—its essential for staying competitive. Let’s adapt and thrive in this new era! 💡🚀"
      }
    ],
    "errors": [
      {
        "postId": "urn:li:activity:7294769903490711554",
        "url": "https://www.linkedin.com/in/dieterwolf?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABsFh-8B6C7Xleh7DoXRkF9r0IfCKIovw6o",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294769648263151619",
        "url": "https://www.linkedin.com/in/clifflocks?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABjEhQBSI0l3aMI-cMP2Vg13uOKrWUxYVE",
        "errors": [
          "Failed to fetch reactions."
        ]
      },
      {
        "postId": "urn:li:activity:7294774656010530816",
        "url": "https://www.linkedin.com/in/manujaggarwal?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAMY_wBiA538UlzNcv3ls30NXdjZZ2cT2c",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294729912614088705",
        "url": "https://www.linkedin.com/in/shellabaludo?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAD0X0bEBbnw2YuMyiRC2KcJ0WXe9XCThlZE",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294778388299296768",
        "url": "https://www.linkedin.com/in/nidaateeq?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAo0DSEBnzh2QNeP_p0WeIAxYzJ5WKgrL2Y",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294746994751746049",
        "url": "https://www.linkedin.com/in/davidhermann?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAB3hLYBTVZtRFITHPiQyaUJoOSlk-1SnVA",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294642847180304386",
        "url": "https://www.linkedin.com/in/radha-vyas-flashpack?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABcBWV8BOD0_siaFHrXf8hZwUwMJft-02q0",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294769610497622018",
        "url": "https://www.linkedin.com/in/sammyjames?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAAtAMBB2ZZiVFrzbXd4T-YvXEN0dnpS6w",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294777691809951745",
        "url": "https://www.linkedin.com/groups/4702266?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A4702266-7294777690912407554",
        "errors": [
          "Failed to fetch media URL."
        ]
      }
    ]
  },
  {
    "postsData": [
      {
        "postId": "urn:li:activity:7294752194581446658",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294752194581446658",
        "url": "https://www.linkedin.com/in/matthewbuchalski?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAHq5rcBUODCOiAZTTtYH3Xvrex0EdMFjpA",
        "name": "Matthew Buchalski\nMatthew Buchalski",
        "content": "Want to boost your income? It's not just about the value you offer, but also about the number of people you impact.\n\nKey takeaways:\n️Law of Value: Your worth is directly tied to the value you provide.\n️Law of Compensation: Your income is determined by the number of lives you positively influence.\n\nWant to level up your earnings? Focus on:\n️Enhancing your value: Continuously learn and grow.\n️Expanding your reach: Connect with more people and make a difference.\n\nLet's discuss! Share your thoughts on these laws and how you're applying them in your life.\n\n\n\nWant to learn more about Multifamily Investing? Sign up for our newsletter and create your Investor Profile here -",
        "reactions": {
          "likes": "1 comment",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/a6eba004-cb37-4130-9f3f-93921c2edcaf",
        "comments": [],
        "commentAdded": "Great insights! Its powerful to see how value and reach intertwine. Excited to connect and learn how others are implementing these laws!"
      },
      {
        "postId": "urn:li:activity:7294719709680168960",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294719709680168960",
        "url": "https://www.linkedin.com/in/amir-tabch?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACtovxcBQFgProDaob15jIuBjp9gl70BoRA",
        "name": "Amir Tabch\nAmir Tabch",
        "content": "The day I won the argument… & lost the room\n\nYears ago, I was in a heated discussion with my team. I had facts, figures, & logic on my side. I dissected every counterpoint with surgical precision. By the time I finished, there was silence.\n\nI had won.\n\nOr so I thought.\n\nThen I looked around. Instead of nods of agreement, I saw blank stares. Arms crossed. That \"Yeah, but screw this guy\" energy was thick in the air.\n\nI had successfully proven my point—but in the process, I had lost my team.\n\nThat was the day I learned one of the most dangerous leadership traps: the curse of being right.\n\nGreat leadership isn’t about winning arguments—it’s about winning trust, alignment, & commitment. If your goal is to be right all the time, congratulations—you’re an excellent debater. But you might be a terrible leader.\n\nHere’s why:\n\n1. People would rather follow someone they trust than someone who’s always right\n\nA study from HBR found that trust in leadership is the #1 predictor of high-performance teams. Not intelligence. Not charisma. Trust.\n\n& guess what? Trust isn’t built by being the smartest person in the room. It’s built by showing humility, listening, & making people feel heard.\n\nLeaders who obsess over being right often bulldoze over other people’s ideas. The result? Their teams check out. People stop challenging them. Innovation dies.\n\n2. The ‘Rightness Paradox’: The more you prove you’re right, the more people resist\n\nPsychologists call this reactance theory—when people feel their autonomy is threatened, they resist, even if they know you’re right.\n\nEver argued with someone & noticed that the harder you push, the harder they dig in? That’s reactance in action.\n\nIn leadership, it’s worse. If your team feels like every conversation is a battle they’re doomed to lose, they’ll either stop contributing or quietly sabotage your decisions.\n\n3. Being right doesn’t mean you’re making the best decision\n\nDaniel Kahneman, Nobel Prize-winning psychologist, talks about cognitive biases that trick us into believing we’re more rational than we actually are. One of the worst offenders? The overconfidence bias.\n\nLeaders who are too confident in their own correctness miss critical blind spots. They mistake certainty for wisdom & logic for leadership.\n\nGreat leaders don’t just ask, “Am I right?” They ask, “What am I missing?”\n\nIf leadership was just about having the right answers, Google would be our CEO.\n\nBut leadership isn’t about knowing everything—it’s about bringing people along.\n\nSo, the next time you’re about to unleash a masterclass in why you’re right, stop & ask: Am I trying to win the argument… or am I trying to win my team?\n\nBecause the best leaders don’t just win debates. They win people.",
        "reactions": {
          "likes": "406",
          "comments": "4 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "If you’ve ever found yourself in a meeting thinking, Why can’t people just admit I’m right?, take a breath. Here’s how to shift from proving points to leading people:\n\n Listen like you might be wrong. Even if you’re 99% sure you’re right, leave room for the 1% chance you’re not. It makes people more willing to engage.\n\n Trade ‘winning the argument’ for ‘winning alignment.’ If you force a decision, you’ll get compliance. If you build buy-in, you’ll get commitment.\n\n Ask, “What do you see that I don’t?” This shifts the conversation from proving who's right to uncovering what’s best for the organization.\n\n Know when to let go. Sometimes, letting someone else be right—even when you know they’re not—is the best long-term move. People learn by doing, not by being told.",
            "userName": "Amir Tabch",
            "userProfileURL": "https://www.linkedin.com/in/amir-tabch",
            "dataId": "urn:li:comment:(activity:7294695477332115456,7294695560987508736)"
          }
        ],
        "commentAdded": "This is such a powerful reminder! Winning trust is far more valuable than winning arguments. Lets focus on collaboration over correct answers!"
      },
      {
        "postId": "urn:li:activity:7294674876123037696",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294674876123037696",
        "url": "https://www.linkedin.com/in/favour-commander?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADqWFqgBxr87W2LwHW8NY2L8CH6D-lPWzps",
        "name": "Favour Commander\nFavour Commander",
        "content": "I didn’t have it all figured out when I started, \n\nThe brand colours, purpose or even how to engage the right way.\n\n️ I did things as they came, strongly relying on spontaneous ideas.\n\n️ I can still remember showing up 5-10 minutes before I post to engage. \n\n️ I also didn’t have a structured posting time, I only knew I had to beat the morning rush and post no later than 10:00 AM (Nigerian time)\n\nAll these are to let you know, that it was a journey, from misaligned goals to short term gains.\n\n—> I'll be posting at 7:00 AM weekdays and weekends.\n\n—> My newsletter interview features will go live at 12:00 PM (all GMT +1).\n\nWhat is something you’ve agreed to do differently on LinkedIn this year?\n\n\n\n________________\n\nP.S.: I'm celebrating 3,000 followers today and it wouldn't have been possible without you.\n\nThank you for the likes, comments and reposts ",
        "reactions": {
          "likes": "118",
          "comments": "132 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": " This is a reminder that the success stories you admire on LinkedIn today started with uncertainty. \n\nYou can read all these stories when you subscribe to my newsletter.",
            "userName": "Favour Commander",
            "userProfileURL": "https://www.linkedin.com/in/favour-commander",
            "dataId": "urn:li:comment:(activity:7294596693595942912,7294597985429078016)"
          },
          {
            "commentText": "I have so much in store for you here ",
            "userName": "Favour Commander",
            "userProfileURL": "https://www.linkedin.com/in/favour-commander",
            "dataId": "urn:li:comment:(activity:7294596693595942912,7294601379312996353)"
          },
          {
            "commentText": " You have a long way to go, don’t panic, \n\nI’m rooting for you.",
            "userName": "Favour Commander",
            "userProfileURL": "https://www.linkedin.com/in/favour-commander",
            "dataId": "urn:li:comment:(activity:7294596693595942912,7294598513609314305)"
          },
          {
            "commentText": "Take daily actions towards your goals.",
            "userName": "Favour Commander",
            "userProfileURL": "https://www.linkedin.com/in/favour-commander",
            "dataId": "urn:li:comment:(activity:7294596693595942912,7294601507138629632)"
          }
        ],
        "commentAdded": "Congratulations on reaching 3,000 followers! Your journey is inspiring. Im excited to see your new routine and growth this year! 🚀"
      },
      {
        "postId": "urn:li:activity:7294664044471336961",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294664044471336961",
        "url": "https://www.linkedin.com/in/rachelparkco?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAa1ojgB6thaDElEllbhupHwYhc6Wgk0cao",
        "name": "Rachel Park\nRachel Park",
        "content": "Working Hard Won't Get You Promoted.\n\n7 Uncomfortable Truths About Career Advancement\n(And what to do next)\n\nYou’ve been there…\nWatching someone else present your idea.\nSitting silently, frustration twisting in your gut.\n\nYour silence isn't just killing you inside.\nIt's costing you opportunities and advancement.\n\nHere's what nobody tells you about getting promoted:\n(And how you can take control)\n\n1. You Stay Invisible\n↳ Your hard work means nothing if no one notices it\n↳ Document your wins and share progress intentionally\n\n2. You Trust Process Over Politics\n↳ You believe the system will recognize your effort\n↳ Build relationships with decision-makers strategically\n\n3. You Let Others Tell Your Story\n↳ You wait for others to notice while they claim credit\n↳ Learn to advocate for yourself professionally\n\n4. You Mistake Activity for Achievement\n↳ You focus on doing more instead of doing right\n↳ Prioritize high-visibility projects and strategic work\n\n5. You Play by Rules Others Write\n↳ You follow the path while others create their own\n↳ Design your career strategy beyond just working hard\n\n6. You Confuse Loyalty with Growth\n↳ You stay too long hoping hard work will be noticed\n↳ Set clear milestones for your advancement\n\n7. You Choose Comfort Over Growth\n↳ You stay in your lane, afraid to ruffle feathers\n↳ Take calculated risks and expand your influence\n\n\nHard work opens doors.\n\nBut you have to walk through them.\n\nWhich bold move are you ready to take next?\nShare below \n\n\n If you enjoyed this content, you might like my newsletter here:\n\n___\n\n️ Repost to help someone move beyond just working hard\n Followfor more insights on career & wellbeing",
        "reactions": {
          "likes": "127",
          "comments": "115 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Hard work builds the door, but strategy gets us the key. Stop waiting to be noticed. We need to step up, speak up, and take what’s ours.",
            "userName": "Damesha Craig, Leadership Coach and Startup Advisor",
            "userProfileURL": "https://www.linkedin.com/in/dameshacraig",
            "dataId": "urn:li:comment:(ugcPost:7294589206524305409,7294663989089710080)"
          },
          {
            "commentText": "Love this, Damesha. Speaking up and taking intentional steps is how we create opportunities.",
            "userName": "Rachel Park",
            "userProfileURL": "https://www.linkedin.com/in/rachelparkco",
            "dataId": "urn:li:comment:(ugcPost:7294589206524305409,7294664503089082368)"
          }
        ],
        "commentAdded": "Great insights! Its crucial to advocate for ourselves and prioritize strategic visibility over mere hard work. Time for bold moves! 🌟"
      },
      {
        "postId": "urn:li:activity:7294775981494386693",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294775981494386693",
        "url": "https://www.linkedin.com/in/jnando82?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAACfbcYB5KtgXpUrgMeAwPG8MEfAiRXX3wU",
        "name": "Fernando Perez\nFernando Perez",
        "content": "Why Winning Requires 100% Responsibility & Accountability \n▸",
        "reactions": {
          "likes": "0",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Absolutely! Taking full responsibility not only drives personal growth but also fosters a culture of accountability within teams. Well said!"
      },
      {
        "postId": "urn:li:activity:7294777257573658624",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294777257573658624",
        "url": "https://www.linkedin.com/in/marianna-outsia-48974b9a?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABUchOkBCpQtnZTjT4cnylaX9tuwAm8N1RU",
        "name": "Marianna Outsia\nMarianna Outsia",
        "content": "Fact: AI is not just a tool—it’s a revolution.\nThe rules of business are being rewritten. \nEntrepreneurs and business owners who choose \n\nto ignore this shift\n\nrisk falling behind.\n\n\nBut those who seize the opportunity,\n\nmaster the tools,\n\nand harness AI to their advantage?\n\n\nThey won’t just survive—they’ll dominate.\n\n\nHere’s the truth:\n\n• AI can automate tasks you never thought possible.\n• It can analyze data faster than any human.\n• It can unlock creativity, innovation, and efficiency at levels we’ve never seen before.\n\n\nBut the key isn’t just having access to AI.\n\nIt’s knowing how to use it.\n\n\n\nThe winners will be the ones\n\nwho are fearless learners,\n\nthe ones who embrace change\n\ninstead of resisting it.\n\n\nSo ask yourself:\nAre you leveraging AI\n\nto grow your business—or are you\n\nletting your competitors take the lead?\n\nThe choice is yours.",
        "reactions": {
          "likes": "5\nMarianna Outsia and 4 others",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Great insights! Embracing AI truly sets the stage for innovation. Let’s be fearless learners and drive our businesses forward! 🚀 #AI #BusinessTransformation"
      },
      {
        "postId": "urn:li:activity:7294769647248166912",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294769647248166912",
        "url": "https://www.linkedin.com/in/shane-mcconigly?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAKenrIB9H6ljMAh0CtN2xsk1yJg_aT5C6Q",
        "name": "Shane McConigly\nShane McConigly",
        "content": "True high performance isn't found in intense bursts of energy.\n\nIt's found in consistent effort.\n\nThe most successful people aren't those who can push themselves to extreme limits for a short time.\n\nBut those who can maintain a steady, purposeful pace.\n\nThey understand that true excellence comes from discipline, not dramatic explosions of effort.\n\nWould you rather have an athlete who burns bright and fast, or one who consistently delivers exceptional results?\n\nThe answer is clear.\n\nConsistency is the real game-changer.\n\nThis means balancing intensity with smart, sustainable practices.\n\nIt means understanding your limits.\nRespecting your body and mind.\nAnd building a routine that supports long-term growth.\n\nSo forget about trying to be a spectacular flash in the pan.\n\nFocus on showing up.\n\nFocus on the small, daily improvements.\n\nFocus on building a practice that you can sustain not just for weeks, but for years.\n\nBecause in the end, success isn't about how hard you can work for a moment.\n\nIt's about how well you can keep it up, day after day, week after week, year after year.\n\nSlow and steady doesn't just win the race. It dominates it.",
        "reactions": {
          "likes": "69\nJason Bramble and 68 others",
          "comments": "20 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Great parallel to investment strategy - dollar-cost averaging consistently over time typically outperforms trying to time the market with big, dramatic moves.",
            "userName": "Jason Bramble",
            "userProfileURL": "https://www.linkedin.com/in/jasonbramble-revcarto",
            "dataId": "urn:li:comment:(activity:7294767868242444288,7294769637215354880)"
          },
          {
            "commentText": "Jason Bramble totally agree. Consistency beats chasing the perfect moment every time. Smart, steady moves win in the long run.",
            "userName": "Shane McConigly",
            "userProfileURL": "https://www.linkedin.com/in/shane-mcconigly",
            "dataId": "urn:li:comment:(activity:7294767868242444288,7294777519717629952)"
          }
        ],
        "commentAdded": "Absolutely! Consistency truly builds a strong foundation for success. Its all about sustainable growth and committing to the process. 🌟"
      },
      {
        "postId": "urn:li:activity:7294692817371582464",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294692817371582464",
        "url": "https://www.linkedin.com/in/ata-muhiuldin?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACZwH_sBaXpz6zVKkUnZj-O97cOAmbAYgOA",
        "name": "Ata Muhi Ul Din\nAta Muhi Ul Din",
        "content": "Just saw an amazing concept video on mixed reality  \n\nA Reddit user used Vision Pro to record in VR and then transformed the footage with Runway's video-to-video feature.\n\nThe result? absolutely stunning visual styles.\n\nThe future of creative workflows looks exciting\n\nAnd I can't stop thinking about it.\n\n-------------------------------------------------------------------------\n\nFollow me for more AI updates on LinkedIn as I run an AI and IT solutions company.",
        "reactions": {
          "likes": "64",
          "comments": "52 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/6e5e8b0c-0c35-409e-abf1-c70aa6b0f65c",
        "comments": [
          {
            "commentText": "Very cool, does this process take long to make with that feature?",
            "userName": "Miodrag O. Markovic",
            "userProfileURL": "https://www.linkedin.com/in/miodrag-o-markovic",
            "dataId": "urn:li:comment:(ugcPost:7294648881861042177,7294692787973705728)"
          },
          {
            "commentText": "Miodrag O. Markovic depends on the video and transformation complexity. \n\nRunway's Turbo model is pretty quick – it can create a 10-second clip in about 10 seconds, older Gen-3 Alpha model takes longer, refining text prompts might add some time.",
            "userName": "Ata Muhi Ul Din",
            "userProfileURL": "https://www.linkedin.com/in/ata-muhiuldin",
            "dataId": "urn:li:comment:(ugcPost:7294648881861042177,7294717916271251456)"
          }
        ],
        "commentAdded": "Incredible! The fusion of VR and AI is transforming creativity. Excited to see where this technology takes us next! 🚀 #MixedReality #Innovation"
      },
      {
        "postId": "urn:li:activity:7294779385188954115",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294779385188954115",
        "url": "https://www.linkedin.com/in/jean-criss?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAE5NWsBm_iBcBYtAWfWVLRiNCKOeQLpr48",
        "name": "Jean Criss\nJean Criss",
        "content": "Book a business strategy consult, media discussion, or plan your next steps as a start up with award-winning creative multi-media innovator Jean Criss.",
        "reactions": {
          "likes": "6",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Excited to see Jean Criss sharing her expertise! A consultation with her could be a game-changer for any startup. Dont miss out!"
      },
      {
        "postId": "urn:li:activity:7294773820194705409",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294773820194705409",
        "url": "https://www.linkedin.com/in/yarocelis?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAHEm9EBv2iwPw2Xrew4Hq7KE7qWEBazObQ",
        "name": "Yaro Celis\nYaro Celis",
        "content": "Greetings Everyone,\nToday we explore why DOGE’s Access to Critical Systems is Raising Major Concerns. Also, Is AI Driving IT Unemployment? We explore the rising job losses and corporate \"cost avoidance.\"\n\nMeanwhile, France’s $112B AI investment aims to rival the U.S., and the battle between Altman and Musk heats up as they maneuver to secure their AI agendas. Looking forward to your comments.",
        "reactions": {
          "likes": "0",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Intriguing topics! The intersection of AI, labor, and investment strategies will shape our future job landscape. Excited to see more insights!"
      }
    ],
    "errors": [
      {
        "postId": "urn:li:activity:7294719709680168960",
        "url": "https://www.linkedin.com/in/amir-tabch?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACtovxcBQFgProDaob15jIuBjp9gl70BoRA",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294674876123037696",
        "url": "https://www.linkedin.com/in/favour-commander?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADqWFqgBxr87W2LwHW8NY2L8CH6D-lPWzps",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294664044471336961",
        "url": "https://www.linkedin.com/in/rachelparkco?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAa1ojgB6thaDElEllbhupHwYhc6Wgk0cao",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294775981494386693",
        "url": "https://www.linkedin.com/in/jnando82?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAACfbcYB5KtgXpUrgMeAwPG8MEfAiRXX3wU",
        "errors": [
          "Failed to fetch reactions.",
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294777257573658624",
        "url": "https://www.linkedin.com/in/marianna-outsia-48974b9a?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABUchOkBCpQtnZTjT4cnylaX9tuwAm8N1RU",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294769647248166912",
        "url": "https://www.linkedin.com/in/shane-mcconigly?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAKenrIB9H6ljMAh0CtN2xsk1yJg_aT5C6Q",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294779385188954115",
        "url": "https://www.linkedin.com/in/jean-criss?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAE5NWsBm_iBcBYtAWfWVLRiNCKOeQLpr48",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294773820194705409",
        "url": "https://www.linkedin.com/in/yarocelis?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAHEm9EBv2iwPw2Xrew4Hq7KE7qWEBazObQ",
        "errors": [
          "Failed to fetch reactions.",
          "Failed to fetch media URL."
        ]
      }
    ]
  },
  {
    "postsData": [
      {
        "postId": "urn:li:activity:7294755024461557760",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294755024461557760",
        "url": "https://www.linkedin.com/in/dor-nachshoni?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAB05SbwBMBtd8Sg2gDi4ae7XGInBx5Uyvxg",
        "name": "Dor Nachshoni\nDor Nachshoni",
        "content": "Performance Reviews Are a Waste of Time\n\n\n 90 minutes of meaningless conversation\n\n\n Months of “feedback” forgotten in days\n\n\n A scorecard that says nothing about actual impact\n\n\nPerformance reviews don’t drive success—they delay it\n\n\nEmployees don’t need a recap of the past year\n\n\nThey need real-time support, feedback, and opportunities for growth that actually move the needle\n\n\nIf your review process doesn’t translate into action, it’s time to throw it out and build something better",
        "reactions": {
          "likes": "54\nChahat Raj Kapoor and 53 others",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Great insights! Real-time feedback fosters growth far more effectively than traditional reviews. Let’s prioritize actionable support for success!"
      },
      {
        "postId": "urn:li:activity:7294779230700093440",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294779230700093440",
        "url": "https://www.linkedin.com/in/melissarosenthal5?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAPS76gB8Ec38yuoL5J6ZAHXHK-Wy28dItk",
        "name": "Melissa Rosenthal\nMelissa Rosenthal",
        "content": "At Outlever we think about ROI a little differently.\n\n\n\nWe view our motion as an opportunity to intersect the entire customer journey—not just one piece of it.\n\nNot everyone loves hearing that.\n\nThey want to put us in a box.\n\nAnd sure, sometimes it's fine to be put in a box.\n\nBut our holistic vision and approach to ROI and KPIs is about influencing every stage of the journey.\n\nIt hasn’t been necessarily a harder sell, but it has required more education.\n\nGood thing I’m always up for a challenge. \n\nMore here on my Spark of Ages interview with",
        "reactions": {
          "likes": "58",
          "comments": "3 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/d8f65671-1b98-480e-b530-efbc06357aaa",
        "comments": [
          {
            "commentText": "Melissa Rosenthal educating the market isn’t always easy, but shifting perspectives is where real impact happens.",
            "userName": "Mohit Srivastava",
            "userProfileURL": "https://www.linkedin.com/in/mohit4success",
            "dataId": "urn:li:comment:(ugcPost:7275303135286345729,7294752125379584000)"
          }
        ],
        "commentAdded": "Love this holistic approach to ROI! Educating on the full customer journey is key in todays market. Excited to see where this leads!"
      },
      {
        "postId": "urn:li:activity:7294779176635490306",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294779176635490306",
        "url": "https://www.linkedin.com/in/douglasabrush?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAACGaigBJ5Ue40KsAfxm60ZrZXooYHz8SbA",
        "name": "Douglas Brush\nDouglas Brush",
        "content": "It is an honor and a privilege to continue to work alongside a colleague and friend like Gregg Friedman.\n\nGregg and I became the dynamic duo atto expand discussions with CISOs, executives, and corporate boards about cybersecurity programs, SOC transformations, and Incident Response.\n\nThe past year was rocket ship growth for, and 2025 is poised to be even bigger!!\n\nResponse",
        "reactions": {
          "likes": "6",
          "comments": "2 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Excellent ",
            "userName": "Neal Conlon",
            "userProfileURL": "https://www.linkedin.com/in/nealconlon",
            "dataId": "urn:li:comment:(ugcPost:7294752546215079938,7294779219182518273)"
          },
          {
            "commentText": "Congratulations Douglas Brush!",
            "userName": "Michael Potts",
            "userProfileURL": "https://www.linkedin.com/in/hackmp",
            "dataId": "urn:li:comment:(ugcPost:7294752546215079938,7294777895426621441)"
          }
        ],
        "commentAdded": "Exciting times ahead! Collaborating with great minds like you and Gregg is the key to driving impactful cybersecurity innovations. 🚀"
      },
      {
        "postId": "urn:li:activity:7294753319057539072",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294753319057539072",
        "url": "https://www.linkedin.com/in/maththinking?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAD5LcBBZCNJ3T89euZhuJxAmL1RWcykg4",
        "name": "Ju Rao\nJu Rao",
        "content": "(Open Access) Digital Signal Processing: A Focus on Implementation - https://lnkd.in/gx6-qHNj\nLook for \"Read and Download Links\" section to download. Follow/Connect me if you like this post.",
        "reactions": {
          "likes": "10",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Great resource! Excited to explore the insights on digital signal processing. Thanks for sharing! #SignalProcessing #OpenAccess"
      },
      {
        "postId": "urn:li:activity:7294777144994320386",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294777144994320386",
        "url": "https://www.linkedin.com/in/releaseteam?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAWPdgBj2e2jnKybUhZU5TK_7fztntDgcQ",
        "name": "Shawn Doyle\nShawn Doyle",
        "content": "Amazon Web Services (AWS) is extending its AI agent capabilities to software testing, aiming to enhance efficiency and accuracy in code validation. \n\nThis move integrates AI-driven automation into the testing process, helping developers identify issues faster and streamline workflows. Check it out here:",
        "reactions": {
          "likes": "0",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Exciting development! Integrating AI into software testing will surely transform efficiency and accuracy. Cant wait to see the impact!"
      },
      {
        "postId": "urn:li:activity:7294731168195756032",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294731168195756032",
        "url": "https://www.linkedin.com/groups/3990648?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A3990648-7294662530075922432",
        "name": "Artificial Intelligence, Machine Learning, Data Science & Robotics\nArtificial Intelligence, Machine Learning, Data Science & Robotics",
        "content": "Agentic AI layers form the structural foundation that enables AI systems to operate autonomously, make decisions, and adapt dynamically to changing environments. These layers typically consist of four key components. The Perception Layer gathers and processes data from various sources, such as sensors, text, or images, to build an understanding of the environment. The Cognition Layer analyzes this information, applies reasoning, and formulates decisions or strategies using AI models, including machine learning and logical inference. The Action Layer translates these decisions into executable tasks, allowing the AI to interact with digital or physical systems. Finally, the Feedback Layer monitors outcomes, assesses performance, and refines future actions based on learning from past experiences. Together, these layers enable AI to function as an independent agent, continuously improving its decision-making and adaptability in complex scenarios.\n\nFor more follow me at:",
        "reactions": {
          "likes": "15",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Great breakdown of Agentic AI layers! Exciting to see how these components work together to enhance decision-making and adaptability!"
      },
      {
        "postId": "urn:li:activity:7294627868301520896",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294627868301520896",
        "url": "https://www.linkedin.com/in/elizabethkershaw?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACxYmpEB69Tk3HskDAbIa6d6A5y0mFott1M",
        "name": "Elizabeth Kershaw\nElizabeth Kershaw",
        "content": "455 days ago I got turned down for a promotion.\n\nSo I promoted myself instead. How? ↴\n\nBy booking a one-way ticket to Asia. ️\n\nOkay, I know that sounds a little dramatic, but hear me out \n\nJust over a year ago I walked into my yearly review with all the receipts as to how I’d far outgrown just the title of “Brand Designer”.\n\n→ I’d helped organise company PR events,\n→ I’d developed and run the company socials,\n→ I’d designed websites and user experiences,\n→ I'd branched out into animation/motion graphics.\n\nI was told that they’d “get back to me”\n\n↳ They never did.\n\nEventually I got frustrated with how company politics was holding me back from reaching my fullest potential. \n\n But I had my own idea:\n\nI wanted to spend a year in Asia, building businesses and experimenting to see if I could create something valuable out of my own passions.\n\nI’d spent a year saving as much money as I could, working evenings and weekends so I could FINALLY create things I was truly passionate about.\n\n(Moving to Asia was going to make my money last waaaaay longer.)\n\n So I booked a one-way ticket to Vietnam. 🇻🇳\n\nAnd honestly, it was the best (and scariest) decision I’ve ever made.\n\n Now I’ve been in SE Asia for almost a year!!! CRAZY!!!\n\n& I’m the Founder of. I'm very lucky that my work and the people I interact with every day light me the F**K UP \n\nBut more importantly, I’ve gained more than just a change of title:\n\n I alone set the pace on how quickly I progress.\n My earnings are directly related to my input.\n I’m doing work that I’m passionate about.\n There’s no ‘optics’ or politics to uphold.\n I have autonomy over the skills I learn.\n I work for people I genuinely care for.\n I can work when I feel motivated.\n I’m building my OWN wealth.\n\nI realise now that by chasing a promotion, I was prioritising growth in the wrong direction.\n\nSometimes the biggest risks yield the biggest rewards, and that’s exactly what happened when I booked that ticket a year ago.\n\nI could never have predicted how different my life would be now! \n\nSo just a reminder:\n\n- YOU are in control of your own life\n- If you’re not happy with it you have the power to change it\n- Your greatest potential is hiding on the other side of the biggest risks\n\n Where have you taken control of your life recently? ",
        "reactions": {
          "likes": "707",
          "comments": "193 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "I love stories like this Elizabeth Kershaw\n\nAt times that leap in the dark can take you exactly where you need to be",
            "userName": "Blessing Ikpia",
            "userProfileURL": "https://www.linkedin.com/in/blessing-ikpia-54b790244",
            "dataId": "urn:li:comment:(ugcPost:7294619163170340864,7294627861078896641)"
          },
          {
            "commentText": "Blessing Ikpia you’re so right! Has that ever happened to you?",
            "userName": "Elizabeth Kershaw",
            "userProfileURL": "https://www.linkedin.com/in/elizabethkershaw",
            "dataId": "urn:li:comment:(ugcPost:7294619163170340864,7294628468611297280)"
          }
        ],
        "commentAdded": "Inspiring journey! 🌟 Taking risks often leads to unexpected rewards. Your story is a powerful reminder that we create our own paths! 💪✨"
      },
      {
        "postId": "urn:li:activity:7294729491250040832",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294729491250040832",
        "url": "https://www.linkedin.com/in/giulioscolari?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACCzhBkBqvsE8EV6bf4WaDY6iRXy8m6Oifs",
        "name": "Giulio Scolari\nGiulio Scolari",
        "content": "Habits drive success.\nBut breaking them sparks innovation.\n\n\nRoutines make us efficient.\nBut efficiency isn’t the same as innovation.\nThe brain works in patterns; it seeks the familiar.\n\nBut new insights come from breaking the expected.\nWant fresh ideas?\n\nChange something small in your daily routine:\n Take a different route to work. ‍️\n Start your meetings in silence. \n Use a notebook instead of a screen. \n Read from an industry you know nothing about. \n Ask yourself, “What if I did the opposite?” \n\n 𝗜𝗻𝗻𝗼𝘃𝗮𝘁𝗶𝗼𝗻 𝗵𝗮𝗽𝗽𝗲𝗻𝘀 𝘄𝗵𝗲𝗻 𝘆𝗼𝘂 𝗯𝗿𝗲𝗮𝗸 𝗽𝗮𝘁𝘁𝗲𝗿𝗻𝘀.\nThe smallest change in your habits can shift how you think.\n\n Disrupt your routine. Expand your perspective.\n Small habit shifts = Big creative breakthroughs.\n\n What’s one habit change that led to a new insight? Let’s discuss.\n ️ Share this with someone stuck in autopilot.\n Follow me for smarter innovation strategies.",
        "reactions": {
          "likes": "21",
          "comments": "28 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Routine can feel like the enemy of being alive and growing. Small changes can make a huge difference in nudging our brains to think differently. It helps break the patterns and bad habits we’ve gotten so used to.",
            "userName": "Sven Elstermann",
            "userProfileURL": "https://www.linkedin.com/in/svensf",
            "dataId": "urn:li:comment:(activity:7294687240004210689,7294729454189219842)"
          }
        ],
        "commentAdded": "Great insights! Sometimes its the smallest changes that ignite the biggest ideas. Excited to hear others breakthrough habits! #Innovation"
      },
      {
        "postId": "urn:li:activity:7294779122482905088",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294779122482905088",
        "url": "https://www.linkedin.com/in/nealconlon?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAhYvx4BQsaUxum6g_YrZe0lxTaVFqxCY9o",
        "name": "Neal Conlon\nNeal Conlon",
        "content": "Questions I ask myself often...What are some of yours?\n\nWhy do CISO's let their employees burn out of the industry?\n\nWhy do so many Cyber people want someone else to do the work for them?\n\nWhy did the CISO send me a linkedin request and not follow up?\n\nShould I introduce them together or not?",
        "reactions": {
          "likes": "0",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Great questions! Open dialogue is key. Addressing burnout and collaboration could lead to a stronger, more proactive cyber community. Lets discuss!"
      },
      {
        "postId": "urn:li:activity:7294724143218851841",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294724143218851841",
        "url": "https://www.linkedin.com/company/women-on-it/posts",
        "name": "Women On IT powered by WOnIT Digital\nWomen On IT powered by WOnIT Digital",
        "content": "Can we really date AI?\n\nAI-driven romance is reshaping perceptions of relationships by introducing virtual companionship that offers emotional support and personalized interactions. While it presents an innovative response to loneliness, it's crucial to view AI companionship as a complement rather than a replacement—one that enhances social engagement and emotional intelligence.\n\nThe rise of AI romance prompts consideration of how technology impacts human connection, balancing its benefits with the need for genuine social experiences.\n\nGet inspired by this article at Our Mental Health website:\n\nAI is revolutionizing the way we interact and the way we live. But with that change comes risk. Deepfakes. Bias. The jobs that could disappear overnight.\n\nTo break down the reality of AI—the good, the bad, and the terrifying, join us for our upcoming PHD episode, \"AI Dangers & Opportunities: Understanding the Real-World Impact\" with.\n\nDon’t wait until it’s too late to understand the AI shift.",
        "reactions": {
          "likes": "2",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Set your reminders to be notified once the livestream starts: https://www.linkedin.com/feed/update/urn:li:ugcPost:7293604421978996737",
            "userName": "Women On IT powered by WOnIT Digital",
            "userProfileURL": "https://www.linkedin.com/company/women-on-it/posts",
            "dataId": "urn:li:comment:(activity:7294701687959695360,7294703489534898176)"
          }
        ],
        "commentAdded": "Fascinating perspective! Embracing AI in relationships can enhance our connections, but we must remain vigilant about its impacts on genuine interactions."
      }
    ],
    "errors": [
      {
        "postId": "urn:li:activity:7294755024461557760",
        "url": "https://www.linkedin.com/in/dor-nachshoni?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAB05SbwBMBtd8Sg2gDi4ae7XGInBx5Uyvxg",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294779176635490306",
        "url": "https://www.linkedin.com/in/douglasabrush?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAACGaigBJ5Ue40KsAfxm60ZrZXooYHz8SbA",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294753319057539072",
        "url": "https://www.linkedin.com/in/maththinking?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAD5LcBBZCNJ3T89euZhuJxAmL1RWcykg4",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294777144994320386",
        "url": "https://www.linkedin.com/in/releaseteam?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAWPdgBj2e2jnKybUhZU5TK_7fztntDgcQ",
        "errors": [
          "Failed to fetch reactions.",
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294731168195756032",
        "url": "https://www.linkedin.com/groups/3990648?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A3990648-7294662530075922432",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294627868301520896",
        "url": "https://www.linkedin.com/in/elizabethkershaw?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACxYmpEB69Tk3HskDAbIa6d6A5y0mFott1M",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294729491250040832",
        "url": "https://www.linkedin.com/in/giulioscolari?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACCzhBkBqvsE8EV6bf4WaDY6iRXy8m6Oifs",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294779122482905088",
        "url": "https://www.linkedin.com/in/nealconlon?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAhYvx4BQsaUxum6g_YrZe0lxTaVFqxCY9o",
        "errors": [
          "Failed to fetch reactions.",
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294724143218851841",
        "url": "https://www.linkedin.com/company/women-on-it/posts",
        "errors": [
          "Failed to fetch media URL."
        ]
      }
    ]
  },
  {
    "postsData": [
      {
        "postId": "urn:li:activity:7294740109722099712",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294740109722099712",
        "url": "https://www.linkedin.com/in/sonali-malhotra23?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABwfkCUBHzeJEIxfGf2hmbxe6mAFfAZLyq0",
        "name": "Sonali M.\nSonali M.",
        "content": "Sorry, this relationship has been declined due to low creditworthiness.",
        "reactions": {
          "likes": "187",
          "comments": "45 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "P.S. Improve your finances, not just your flirting skills. ️",
            "userName": "Sonali M.",
            "userProfileURL": "https://www.linkedin.com/in/sonali-malhotra23",
            "dataId": "urn:li:comment:(activity:7294709703190753280,7294709788775460864)"
          },
          {
            "commentText": "Sonali M. Somebody said it!",
            "userName": "Kauser Husainee",
            "userProfileURL": "https://www.linkedin.com/in/kauser-husainee",
            "dataId": "urn:li:comment:(activity:7294709703190753280,7294726039245574145)"
          },
          {
            "commentText": "This is really sad to see I guess a person should not be judged everytime just for financial background but they should see the good qualities as well because it's matter of whole life Sonali M. .",
            "userName": "Swapnil Khorava",
            "userProfileURL": "https://www.linkedin.com/in/swapnil-khorava-13bb53179",
            "dataId": "urn:li:comment:(activity:7294709703190753280,7294710433435774976)"
          },
          {
            "commentText": "Swapnil Khorava yeahhh truly— I think girls’ cibil score should also be considered",
            "userName": "Sonali M.",
            "userProfileURL": "https://www.linkedin.com/in/sonali-malhotra23",
            "dataId": "urn:li:comment:(activity:7294709703190753280,7294712784259272705)"
          },
          {
            "commentText": "Sonali M. yes exactly.",
            "userName": "Swapnil Khorava",
            "userProfileURL": "https://www.linkedin.com/in/swapnil-khorava-13bb53179",
            "dataId": "urn:li:comment:(activity:7294709703190753280,7294714175799361536)"
          }
        ],
        "commentAdded": "Important reminder that financial health is key in partnerships. Let’s strive for better credit management for future opportunities!"
      },
      {
        "postId": "urn:li:activity:7294780515373527044",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294780515373527044",
        "url": "https://www.linkedin.com/in/carlosespinosa?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABDgT0BGOqaZOfCQNTwyrfL05w8scEZKZ4",
        "name": "Carlos E.\nCarlos E.",
        "content": "https://lnkd.in/gtqMhH_r",
        "reactions": {
          "likes": "0",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Great insights! Its inspiring to see how innovation drives progress in our industry. Looking forward to seeing more advancements! #Innovation"
      },
      {
        "postId": "urn:li:activity:7294752210008031232",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294752210008031232",
        "url": "https://www.linkedin.com/in/ayushi-gupta-6395052a8?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAEodIU0BBgHi9G-qZ25N_xJYEVgpPEJhNSY",
        "name": "AYUSHI GUPTA\nAYUSHI GUPTA",
        "content": "Day 71 of the GFG 160 Challenge!  \nhashtag hashtag \nhashtag\n#GFGChallenge\nhashtag hashtag \nhashtag\n#CodingJourney\nhashtag hashtag\n\nhashtag hashtag\n\nhashtag hashtag\n\nhashtag hashtag",
        "reactions": {
          "likes": "1",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Impressive progress on Day 71! Your dedication to the #GFGChallenge is inspiring. Keep up the great work on your #CodingJourney! 🚀"
      },
      {
        "postId": "urn:li:activity:7294778903410192385",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294778903410192385",
        "url": "https://www.linkedin.com/in/woodley-b-preucil-cfa-5926b010?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAI9Bj4B3qNRK2O_Co17E5Oqu6TssLiVFvc",
        "name": "Woodley B. Preucil, CFA\nWoodley B. Preucil, CFA",
        "content": "Star Blizzard’s shift to WhatsApp spear-phishing reminds me of the 2016 campaign where threat actors exploited email services like Gmail to target government officials. \n\nBack then, we saw how easily attackers could bypass traditional security methods.\n\nNow, with the use of platforms like HubSpot, they’re making it harder for even the most vigilant to spot malicious activity.\n\nThis evolution in tactics shows just how important it is to constantly rethink and strengthen our digital defenses.\n\n#Privacy#GenerativeAI",
        "reactions": {
          "likes": "1",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Very interesting, thanks for sharing",
            "userName": "Paolo Ibáñez Medina",
            "userProfileURL": "https://www.linkedin.com/in/paolo-ib%C3%A1%C3%B1ez-medina",
            "dataId": "urn:li:comment:(activity:7294778903410192385,7294780301208141827)"
          }
        ],
        "commentAdded": "Great points! The evolution of phishing tactics highlights the need for continuous vigilance and adaptive security measures. #CyberSecurity"
      },
      {
        "postId": "urn:li:activity:7294773477763395586",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294773477763395586",
        "url": "https://www.linkedin.com/in/rickconlowservantleadership?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAPUxFwB6p1p6ESvdwgOkdRMuNdW3KDrJTU",
        "name": "Richard A. Conlow\nRichard A. Conlow",
        "content": "HOW POOR IS CUSTOMER SERVICE TODAY? YOU KNOW...https://buff.ly/3Q7l879 \nhashtag\n#leadership \nhashtag\n#management \nhashtag\n#servantleadership \nhashtag",
        "reactions": {
          "likes": "0",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Great insights! In todays competitive landscape, prioritizing customer service is essential for effective leadership and management. #ServantLeadership"
      },
      {
        "postId": "urn:li:activity:7294768393801367554",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294768393801367554",
        "url": "https://www.linkedin.com/in/seth-yakatan?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAEUlp4BNpSKlqZDyTzIP_4IHSmInUV2MhE",
        "name": "Seth Yakatan\nSeth Yakatan",
        "content": "Most valuable lesson I ever learned?\n\nBillionaires operate with their own set of rules...\n\nEverything changes when you start dealing with that extra couple 0's.\nLearned this lesson and more\n\nGot into this and MUCH MORE with...\nThe incredible+\nOn the\n\nThank you tofor the ride\n+andfor the roster spot...\n\nLike this ?\n\nFollow me on YouTube for daily video here:",
        "reactions": {
          "likes": "194",
          "comments": "94 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/843c712a-354b-42f3-9b44-a295358b292f",
        "comments": [
          {
            "commentText": "Seems like a lot of valuable information; looking forward to tuning in",
            "userName": "Chahat Raj Kapoor",
            "userProfileURL": "https://www.linkedin.com/in/chahat-raj-kapoor",
            "dataId": "urn:li:comment:(ugcPost:7293903608847249408,7294768336385564672)"
          },
          {
            "commentText": "My four plus years at Eaze were better than getting four MBAs from Harvard. I likely aged severely, but I lived a twenty year career in four years. \n\nWould I do it again? In a fucking heartbeat.",
            "userName": "Mick Frederick",
            "userProfileURL": "https://www.linkedin.com/in/mickfrederick",
            "dataId": "urn:li:comment:(ugcPost:7293903608847249408,7294745659889369089)"
          },
          {
            "commentText": "Zachary Eland all about the positivity here…and lets not forget about Javier Segura  ",
            "userName": "Seth Yakatan",
            "userProfileURL": "https://www.linkedin.com/in/seth-yakatan",
            "dataId": "urn:li:comment:(ugcPost:7293903608847249408,7294764250214866945)"
          },
          {
            "commentText": "MBA in Cannabis is an excellent want to put it! \n\nShout out the whole Eaze team for sure was fortunate to work closely with Eaze from the brand side right out of the gate in my CA Cannabis career those experiences were particularly valuable.",
            "userName": "Zachary Eland",
            "userProfileURL": "https://www.linkedin.com/in/zachary-eland-782aa46a",
            "dataId": "urn:li:comment:(ugcPost:7293903608847249408,7294767267181907968)"
          }
        ],
        "commentAdded": "Absolutely! Understanding the unique mindset of billionaires can truly reshape our approach to success. Excited to see what you share next!"
      },
      {
        "postId": "urn:li:activity:7294759614523277312",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294759614523277312",
        "url": "https://www.linkedin.com/in/ahmedrashed974?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAArkZoEBtj4T0zB8xZgeROCj7Y0X7FQG24Q",
        "name": "Ahmed Rashed\nAhmed Rashed",
        "content": " The Future Is Now:\n\n\nA Surgeon in China Just Performed a Lung Surgery from 5,000 Kilometers Away!\n\nI’m blown away by this incredible leap in medical technology. A surgeon in China recently used a robotic controller to operate a surgical robot 5,000 kilometres away and successfully removed a tumour from a patient’s lung. Let that sink in for a moment. \n\nThis isn’t science fiction—it’s real, and it’s happening right now. The precision, the innovation, and the sheer audacity of this achievement are mind-blowing. Imagine the possibilities this opens up: world-class surgeons could perform life-saving procedures on patients in remote areas, war zones, or places with limited access to specialized medical care. \n\nThis breakthrough is a testament to how far we’ve come in merging technology and medicine. It’s not just about robots or distance—it’s about breaking barriers and making healthcare more accessible, efficient, and impactful.\nWhat do you think about this? Could this be the start of a new era in global healthcare?\n\nLooking to supercharge your Career, Mindset, or Creativity? These influencers are changing the game in their fields and are a must-follow for daily inspiration and actionable insights: ||||||||\n\nLet’s discuss it! ",
        "reactions": {
          "likes": "765",
          "comments": "108 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/2dd8e390-b4ad-4d68-9674-f5763dc0cb07",
        "comments": [
          {
            "commentText": "What an astonishing breakthrough! Ahmed Rashed  The fact that a surgeon can perform lung surgery from 5,000 kilometres away is nothing short of revolutionary.\nThis leap in technology not only showcases human ingenuity but also opens a myriad of opportunities for enhancing global healthcare access, especially in underprivileged areas where specialized care is scarce.\n The combination of robotics and telemedicine could redefine how we approach surgery and patient care.\n\n\nImagine the potential lives that could be saved and the impact on healthcare systems worldwide!\nThis truly feels like the dawn of a new era in medicine.\nDo you think our healthcare infrastructure is ready to adopt such changes, or are there hurdles we still need to overcome?\n",
            "userName": "Daily Inspiration 1O1",
            "userProfileURL": "https://www.linkedin.com/company/daily-inspiration-1o1/posts",
            "dataId": "urn:li:comment:(ugcPost:7293965178495238147,7294680003588325376)"
          }
        ],
        "commentAdded": "Incredible advancement! This opens doors for equitable healthcare access worldwide. Excited to see where this technology leads us! #FutureOfMedicine"
      },
      {
        "postId": "urn:li:activity:7294742578007027715",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294742578007027715",
        "url": "https://www.linkedin.com/in/glpetznick?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADE83QIBcc4jsjbpoct0cH40OoADEHOUB60",
        "name": "Gaston Petznick⚡\nGaston Petznick⚡",
        "content": "7 Hidden Performance Killers Sabotaging Your Success:\n\n\nYou're working harder than ever.\n\nBut something feels off.\n\nHere are the hidden culprits stealing your success:\n\n1️⃣ The False Urgency Trap\n↳ Everything feels important.\n↳ Nothing gets your best energy.\n↳ Your real priorities suffer in silence.\n\nSolution\n↳ Rate tasks 1-3, only 1's get today's energy\n↳ schedule deep work before reactive work\n\n2️⃣ Borrowed Standards\n↳ You're chasing the success of others.\n↳ Your unique advantages go unused.\n↳ Your authentic edge stays hidden.\n\nSolution\n↳ List your unique strengths, then build from them\n↳ Measure success by your growth, not others' goals\n\n3️⃣ The Preparation Paradox\n↳ You're too busy executing to prepare.\n↳ Quick wins become long-term losses.\n↳ Your foundation cracks under pressure.\n\nSolution\n↳ Block 2 hours weekly for pure planning time\n↳ Create systems today that serve you tomorrow\n\n4️⃣ Reactive Energy Management\n↳ You respond to every demand.\n↳ Your peak hours get hijacked.\n↳ Your best work never happens.\n\nSolution\n↳ Guard your peak hours like high-value meetings\n↳ Set response windows, not constant availability\n\n5️⃣ The Consistency Killer\n↳ You chase intensity over consistency.\n↳ Your systems break under stress.\n↳ Your results stay unpredictable.\n\nSolution\n↳ Choose one key habit and protect it daily\n↳ Track weekly progress, not daily perfection\n\n6️⃣ Hidden Energy Leaks\n↳ Unresolved decisions drain you.\n↳ Small uncertainties compound.\n↳ Your potential slowly fades.\n\nSolution\n↳ Make quick decisions on small things fast\n↳ Clear lingering tasks in 25-minute sprints\n\n7️⃣ The Recovery Deficit\n↳ You wear exhaustion like a badge.\n↳ Your edge gets dulled by fatigue.\n↳ Your competitors outpace you.\n\nSolution\n↳ Schedule rest like it's your most important meeting\n↳ Create clear work boundaries every day\n\nWhat performance killer resonated most? \n\n️ Repost if you found this insightful.\nAnd followfor more!",
        "reactions": {
          "likes": "112",
          "comments": "123 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "As an introvert, I can deeply relate to a few of these performance killers, especially Reactive Energy Management and Hidden Energy Leaks. Being constantly available or responding to every demand can drain us quickly. It’s so important to guard our peak hours and create clear boundaries.",
            "userName": "Sven Elstermann",
            "userProfileURL": "https://www.linkedin.com/in/svensf",
            "dataId": "urn:li:comment:(ugcPost:7294593986827042816,7294742570427895808)"
          },
          {
            "commentText": "Thanks for sharing Sven! This is an important aspect of work. Have a great day!",
            "userName": "Gaston Petznick⚡",
            "userProfileURL": "https://www.linkedin.com/in/glpetznick",
            "dataId": "urn:li:comment:(ugcPost:7294593986827042816,7294755461101158401)"
          }
        ],
        "commentAdded": "Great insights! The Recovery Deficit really resonates—prioritizing rest is crucial for sustained success. Thanks for the reminders!"
      },
      {
        "postId": "urn:li:activity:7294771490825060354",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294771490825060354",
        "url": "https://www.linkedin.com/company/mk-jobs/posts",
        "name": "MK GROUP JOBS\nMK GROUP JOBS",
        "content": "How are you today? Tell us what you want to hear from us.\n\nIf you want to stay up-to-date with us, follow our Page.",
        "reactions": {
          "likes": "3\nJyoti Singh and 2 others",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Great initiative! I’m looking forward to more updates and insights. What topics do you plan to cover in the future? #StayConnected"
      },
      {
        "postId": "urn:li:activity:7294746545432805378",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294746545432805378",
        "url": "https://www.linkedin.com/in/heather-wampler-6b3269271?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAEJsjqcBBZee9ursLCRKADJfcRsfRgv58Lg",
        "name": "Heather Wampler\nHeather Wampler",
        "content": "Great workplaces aren’t just built—they’re nurtured.\nA strong team culture isn’t about fancy perks or motivational posters; it’s about the people behind the work. It’s about ensuring every team member feels valued, supported, and empowered to succeed.\nThat means:\n Hiring the right people and giving them the tools to grow\n Creating a workplace where fairness and communication are the foundation\n Making sure every policy, decision, and interaction reflects respect and integrity\nPeople don’t just stay in jobs because of a paycheck—they stay because they feel heard, respected, and appreciated.\nSo here’s the question: What’s one small leadership action that made a big impact on your career? Let’s share and learn together!",
        "reactions": {
          "likes": "2",
          "comments": "2 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Heather Wampler Very insightful. Thank you for sharing",
            "userName": "Woodley B. Preucil, CFA",
            "userProfileURL": "https://www.linkedin.com/in/woodley-b-preucil-cfa-5926b010",
            "dataId": "urn:li:comment:(activity:7294739208189919232,7294746535920123904)"
          }
        ],
        "commentAdded": "Great insight! A simple thank you can go a long way in making team members feel valued. What small actions have others found impactful?"
      }
    ],
    "errors": [
      {
        "postId": "urn:li:activity:7294740109722099712",
        "url": "https://www.linkedin.com/in/sonali-malhotra23?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABwfkCUBHzeJEIxfGf2hmbxe6mAFfAZLyq0",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294780515373527044",
        "url": "https://www.linkedin.com/in/carlosespinosa?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABDgT0BGOqaZOfCQNTwyrfL05w8scEZKZ4",
        "errors": [
          "Failed to fetch reactions.",
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294752210008031232",
        "url": "https://www.linkedin.com/in/ayushi-gupta-6395052a8?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAEodIU0BBgHi9G-qZ25N_xJYEVgpPEJhNSY",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294778903410192385",
        "url": "https://www.linkedin.com/in/woodley-b-preucil-cfa-5926b010?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAI9Bj4B3qNRK2O_Co17E5Oqu6TssLiVFvc",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294773477763395586",
        "url": "https://www.linkedin.com/in/rickconlowservantleadership?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAPUxFwB6p1p6ESvdwgOkdRMuNdW3KDrJTU",
        "errors": [
          "Failed to fetch reactions.",
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294742578007027715",
        "url": "https://www.linkedin.com/in/glpetznick?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADE83QIBcc4jsjbpoct0cH40OoADEHOUB60",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294771490825060354",
        "url": "https://www.linkedin.com/company/mk-jobs/posts",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294746545432805378",
        "url": "https://www.linkedin.com/in/heather-wampler-6b3269271?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAEJsjqcBBZee9ursLCRKADJfcRsfRgv58Lg",
        "errors": [
          "Failed to fetch media URL."
        ]
      }
    ]
  },
  {
    "postsData": [
      {
        "postId": "urn:li:activity:7294687859486203904",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294687859486203904",
        "url": "https://www.linkedin.com/in/dagmara-asbreuk?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAXUTgBpj1mNkXHnXX0UtbJ7t3qIFtZXJA",
        "name": "Dagmara Asbreuk\nDagmara Asbreuk",
        "content": "Extraordinary Leadership comes from fullness, ease & flow.\n\nHere is how you can embrace it too.\n\n\n\nThere is something powerful about the ocean.\n\nWatching the waves, feeling the sun’s warmth, being present there reminded me of this:\n\nOur natural state isn’t lack, force or control\nbut it is abundance, trust, ease & flow.️\n\nAnd from this state, extraordinary leadership emerges.\n\nToo often I see leaders, unintentionally block this natural state by:\n\n️ Attaching to outcomes & expectations\n️ Pushing for results, leading from fear\n️ Trying to control situations\n️ Judging or doubting (self or others)\n️ Proving self worth\n\nBy doing so, they block lasting impact & exponential growth.\n\n\nThis week, I invite you to experience the power of leading from fullness, ease & flow:\n\n️ Start day intentionally\n↳Take a deep breath, ground yourself, and set an intention for the day\n\n Focus on aligned action\n↳Lead from vision and purpose, not pressure.\n↳Take actions that feel aligned & energizing.\n\nLet go of resistance\n↳ When challenges arise, see them as gifts, not roadblocks.\n↳ Ask: What is this teaching me?\nWhat do I need to embrace more of?\n\n️ Open yourself to receive\n↳ Allow new insights, unexpected opportunities, new ideas to come naturally\n↳ Open yourself to be supported.\n\n Embrace gratitude\n↳ Appreciate others and self - your strength, resilience, impact you already make\n↳ Be grateful for experiences & what's coming\n\n️ Create moments to connect with self\n↳ Pause during the day to check in with yourself.\n↳ How do you feel? What do you need?\n↳ Are you leading from force or trust?\n\n\nWhich of these will you try this week to embrace leading from state of fullness, ease & flow?\n\nGrateful for the gifts of presence - beauty, ease, and abundance of this magical place. \n\n Location: Sapelo, Georgia, USA.\n\n\n\n️ share with your network\nJoin my newsletter for extraordinary leadership insights:",
        "reactions": {
          "likes": "41",
          "comments": "54 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "That's the picture of the ocean that supposed to be in the post.",
            "userName": "Dagmara Asbreuk",
            "userProfileURL": "https://www.linkedin.com/in/dagmara-asbreuk",
            "dataId": "urn:li:comment:(activity:7294686563387478018,7294687421424635905)"
          },
          {
            "commentText": "Olga natural peace was there.",
            "userName": "Dagmara Asbreuk",
            "userProfileURL": "https://www.linkedin.com/in/dagmara-asbreuk",
            "dataId": "urn:li:comment:(activity:7294686563387478018,7294697702917914624)"
          },
          {
            "commentText": "Beautifully said, Dagmara Asbreuk! True leadership isn't about force or control but about leading from a place of trust, alignment, and flow. When we release resistance and embrace ease, we create the space for deeper impact and lasting influence.",
            "userName": "Damesha Craig, Leadership Coach and Startup Advisor",
            "userProfileURL": "https://www.linkedin.com/in/dameshacraig",
            "dataId": "urn:li:comment:(activity:7294686563387478018,7294687923470249984)"
          },
          {
            "commentText": "Damesha Craig, Leadership Coach and Startup Advisor thank you for summarizing it so greately.\n\nAnd embracing fullness of self place a crutial role in it.",
            "userName": "Dagmara Asbreuk",
            "userProfileURL": "https://www.linkedin.com/in/dagmara-asbreuk",
            "dataId": "urn:li:comment:(activity:7294686563387478018,7294688306510925824)"
          }
        ],
        "commentAdded": "Love this perspective! Embracing ease and flow can truly transform leadership. Excited to implement these practices this week! 🌊✨"
      },
      {
        "postId": "urn:li:activity:7294748131118759938",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294748131118759938",
        "url": "https://www.linkedin.com/in/jasonmlemkin?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAsKtMBHQPJ9rgxpUs8M6pSxrAYCXIX8oY",
        "name": "Jason M. Lemkin\nJason M. Lemkin",
        "content": "You are doing what you love when you love to sweat the details.\n\nWhen the details drive you nuts, maybe it is time to find a different owner, or role.",
        "reactions": {
          "likes": "95",
          "comments": "16 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "The devil is in the details and to me, that's where the real craftsmanship is shown.",
            "userName": "Dak Brown",
            "userProfileURL": "https://www.linkedin.com/in/dakbrown",
            "dataId": "urn:li:comment:(activity:7294739798534017024,7294777353648386051)"
          },
          {
            "commentText": "When the details excite you, you’re in the right place. When they exhaust you, it might be time for a shift. The challenge is knowing when to push through vs. when to pivot.",
            "userName": "Shivam Sethi",
            "userProfileURL": "https://www.linkedin.com/in/shivamsethi-ss",
            "dataId": "urn:li:comment:(activity:7294739798534017024,7294764178366447617)"
          }
        ],
        "commentAdded": "Great insight! Finding passion in the details can be rewarding, but knowing when to pivot is key for growth. Keep inspiring!"
      },
      {
        "postId": "urn:li:activity:7294609625868288001",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294609625868288001",
        "url": "https://www.linkedin.com/in/jnando82?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAACfbcYB5KtgXpUrgMeAwPG8MEfAiRXX3wU",
        "name": "Fernando Perez\nFernando Perez",
        "content": "Creating clear messaging is essential when it comes to content marketing. \n\nRead more ",
        "reactions": {
          "likes": "1",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Absolutely agree! Clear messaging not only captures attention but also builds trust. Excited to see more insights on this topic!"
      },
      {
        "postId": "urn:li:activity:7294757741951168512",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294757741951168512",
        "url": "https://www.linkedin.com/in/romimahajan?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAlYZuQBDEZNbNuEzy5tczl-rn6tmbfIonY",
        "name": "Romi Mahajan\nRomi Mahajan",
        "content": "Old idea. Destroy a place and kill a ton of people. Then suggest that the place is inhabitable because it has been destroyed. So clearly, the \"right\" thing to do is to move those people out. I mean, do you want them to live in rubble?\n\nThey built a wasteland....and called it.....the Riviera.",
        "reactions": {
          "likes": "0",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Thought-provoking perspective! Its essential to critically examine the consequences of our actions and consider the true cost of progress."
      },
      {
        "postId": "urn:li:activity:7294767588708880385",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294767588708880385",
        "url": "https://www.linkedin.com/in/joshuahuilar?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAJaHWQBAZSZ8J2sYVsnz0HFcY2icRSeJBU",
        "name": "Josh Huilar\nJosh Huilar",
        "content": "𝙃𝙚𝙧𝙚'𝙨 𝙬𝙝𝙖𝙩 𝙮𝙤𝙪 𝙢𝙞𝙨𝙨𝙚𝙙 𝙡𝙖𝙨𝙩 𝙬𝙚𝙚𝙠 𝙞𝙣 𝘼𝙄 𝙣𝙚𝙬𝙨.\n\nWant the full news articles?\n\nSubscribe to my newsletter, WKND AI\n\nRead by 5,000+ readers from Amazon, Meta, The Big Four, and more!\n\n𝗚𝗲𝘁 𝗶𝘁 𝗵𝗲𝗿𝗲:\n\n-----------------------\n\nFollow mefor more",
        "reactions": {
          "likes": "324",
          "comments": "81 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": " If you liked this, join WKND AI - my newsletter that helps busy professionals like YOU learn about AI: https://www.wkndai.ai/p/openai-deep-research",
            "userName": "Josh Huilar",
            "userProfileURL": "https://www.linkedin.com/in/joshuahuilar",
            "dataId": "urn:li:comment:(ugcPost:7294447655265439744,7294700529803304960)"
          },
          {
            "commentText": "I sure would like to give Deep Researcy a try. But not at that price tag.",
            "userName": "Nancy Bain",
            "userProfileURL": "https://www.linkedin.com/in/nancyebain",
            "dataId": "urn:li:comment:(ugcPost:7294447655265439744,7294702489868644353)"
          },
          {
            "commentText": "Nancy Bain Yeah! More like deep pockets required! Looks promising, though.",
            "userName": "Josh Huilar",
            "userProfileURL": "https://www.linkedin.com/in/joshuahuilar",
            "dataId": "urn:li:comment:(ugcPost:7294447655265439744,7294711227404926976)"
          },
          {
            "commentText": "Josh Huilar just noticed my typo above. I love that for me. No AI here. lol",
            "userName": "Nancy Bain",
            "userProfileURL": "https://www.linkedin.com/in/nancyebain",
            "dataId": "urn:li:comment:(ugcPost:7294447655265439744,7294714076352442370)"
          }
        ],
        "commentAdded": "Exciting roundup! 📈 Cant wait to catch up on the latest in AI. Subscribing to WKND AI for more insights. 🚀 #AI #TechNews"
      },
      {
        "postId": "urn:li:activity:7294769264501174273",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294769264501174273",
        "url": "https://www.linkedin.com/in/mahmoud-owiesit01?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADv5fHEBRMViUQ9S8FeE1EbzzUGTUAORF_Y",
        "name": "Mahmoud Owies\nMahmoud Owies",
        "content": "You don't need to be the best to be confident...\n\nYou don't need to be the best to be worthy...\n\nAnd you definitely don't need to be the best to try...\n\nI've spent most of my life thinking the exact opposite...If I'm not the best at \"A\" then I don't deserve to get \"B\".\n\nWhy would I win? Why would I be the lucky one?\n\nThey're better so it makes sense they'll be the winners...\n\nEssentially, I thought that there's some sort of ranking, and because I'm not the absolute best at everything in life, I don't deserve or I'm not worthy enough to get what I want...\n\nThe \"aim low because that's what you deserve\" mentality....\n\nBut no surprise here, I was wrong...Very wrong...\n\nAnd the thing that made me most wrong is my definition of confidence...\n\nI thought...That confidence means you're better than the rest...\n\nThat a confident person is the person who believes they're god's gift to earth and they're the ultimate answer to every problem...\n\nSo...Whenever I realized that I'm not the best at something, I immediately shrank and I felt it in my core...I'm not the best...I should hide...Run away...Burry myself...Never try...I don't deserve to...\n\nBut confidence is not thinking you're the absolute best at everything...It's not thinking that you're better than others...It's believing that you can figure it out...You can handle whatever life throws at you...Being confident is going for what you want (despite not being the best at the moment) and believing that you can get it...You will get it...You'll figure out a way...You are the master of your own destiny.\n\nHow about you? What's your definition of confidence?\n\nP.S. This is the first part (yes, It was a very long post). Stay tuned for the sequel. ",
        "reactions": {
          "likes": "71\nYou and 70 others",
          "comments": "56 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Mahmoud Owies this boy is on fire . Confidence is about joining the broken pieces and screaming out loud : Come what may, I will rise up like the Pheonix.",
            "userName": "Sourish Bujarbaruah 📌",
            "userProfileURL": "https://www.linkedin.com/in/sourish-bujarbaruah-%F0%9F%93%8C-358151292",
            "dataId": "urn:li:comment:(activity:7294762404930834433,7294769240597835776)"
          },
          {
            "commentText": "Wow Sourish loooove this so much! Thank you so much for this! ",
            "userName": "Mahmoud Owies",
            "userProfileURL": "https://www.linkedin.com/in/mahmoud-owiesit01",
            "dataId": "urn:li:comment:(activity:7294762404930834433,7294770620431499264)"
          },
          {
            "commentText": "Mahmoud Owies shine, and always grateful for all your support.",
            "userName": "Sourish Bujarbaruah 📌",
            "userProfileURL": "https://www.linkedin.com/in/sourish-bujarbaruah-%F0%9F%93%8C-358151292",
            "dataId": "urn:li:comment:(activity:7294762404930834433,7294770933100097536)"
          }
        ],
        "commentAdded": "This is such an empowering perspective! Confidence truly comes from believing in ourselves and our ability to grow. Excited for the sequel!"
      },
      {
        "postId": "urn:li:activity:7294622218511073281",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294622218511073281",
        "url": "https://www.linkedin.com/in/natalia-ombach?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAurvIAB4PMdcDKzg88C3GIV9R9uarWGxh4",
        "name": "Natalia Ombach ⎈\nNatalia Ombach ⎈",
        "content": "⎈ 𝗠𝗮𝗻𝗮𝗴𝗶𝗻𝗴 𝗮 𝘁𝗲𝗮𝗺? 𝗬𝗼𝘂’𝗿𝗲 𝗮𝗹𝘀𝗼 𝗺𝗮𝗻𝗮𝗴𝗶𝗻𝗴 𝘁𝗵𝗲 𝗺𝗼𝗼𝗱 ⎈\n\n\nEver walked into a room and felt the tension before a word was spoken? Or found yourself irritated, anxious, or frustrated - without really knowing why? Or felt awkward when standing in the group of teenagers?\n\n 𝗘𝗺𝗼𝘁𝗶𝗼𝗻𝘀 𝘀𝗽𝗿𝗲𝗮𝗱. We pick up the moods of those around us and reflect them back. This happens unconsciously, and before we know it, we’re reacting to feelings that may not even be ours.\n\nAt work, this can be powerful or destructive:\n-  A leader’s calm can steady a team under pressure.\n-  A colleague’s anxiety can make an entire team feel tense.\n-  A confident, open mindset can foster trust and collaboration.\n\nSometimes, we take in emotions that don’t belong to us.\nThat frustration :\n↳ was it really yours, or did you absorb it from a colleague?\nThat stress :\n↳ did it come from your workload, or from your manager?\nThat cheerfulness :\n↳ did someone else made you feel happy?\n\nThe more you notice this, the more choice you have in how you respond.\n\n Leadership is about managing emotional climates. Be intentional about the energy you bring, and mindful of what you take in.\n\nP.S. How do you manage the emotional climate in your team?\n__________________________________\n⎈ Get Navigator's Edge in your career\n️ Comment / Like / Repost / Follow\n️ DM me or book an intro call",
        "reactions": {
          "likes": "64",
          "comments": "80 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/49eb298d-9f6b-4444-97c8-088ab74e1608",
        "comments": [
          {
            "commentText": "Great insights, Natalia Ombach ⎈! Leaders shape the emotional climate. The energy we bring influences our team’s confidence, focus, and resilience, making intentional leadership essential.",
            "userName": "Damesha Craig, Leadership Coach and Startup Advisor",
            "userProfileURL": "https://www.linkedin.com/in/dameshacraig",
            "dataId": "urn:li:comment:(ugcPost:7292598581180424195,7294622168070402048)"
          },
          {
            "commentText": "Damesha Craig, Leadership Coach and Startup Advisor that's true, with power comes responsibility, raising self-awareness and EQ is a must for leaders to be effective",
            "userName": "Natalia Ombach ⎈",
            "userProfileURL": "https://www.linkedin.com/in/natalia-ombach",
            "dataId": "urn:li:comment:(ugcPost:7292598581180424195,7294627333557161984)"
          }
        ],
        "commentAdded": "Absolutely! Emotional awareness can transform team dynamics. Cultivating a positive climate leads to greater collaboration and success! 🌟"
      },
      {
        "postId": "urn:li:activity:7294780257163767810",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294780257163767810",
        "url": "https://www.linkedin.com/in/jlcreech?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAPlFEUBGFgILYuMe3B4ul8L1pns82n76RA",
        "name": "James Creech\nJames Creech",
        "content": "Thrilled to be partnering with Vertiqal Studios!\n\nVS is one of North America's largest owners of gaming and lifestyle social media channels. They previously acquired Offbeat Studios and a portfolio of social properties from Viral Nation.\n\nWe're helping them accelerate this growth by identifying and executing acquisitions of Facebook publishers and other social media properties.\n\nIf you're interested in chatting, please reach out! My DMs are open.\n\nRead more in the press release:",
        "reactions": {
          "likes": "14",
          "comments": "2 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": " Here's the full press release: https://www.newsfilecorp.com/release/240138/Vertiqal-Studios-Engages-Quartermast-Advisors-as-Creator-Economy-MA-Advisor",
            "userName": "James Creech",
            "userProfileURL": "https://www.linkedin.com/in/jlcreech",
            "dataId": "urn:li:comment:(ugcPost:7294761627025821697,7294761820953722880)"
          },
          {
            "commentText": "Very excited to work together, James!!",
            "userName": "Vertiqal Studios",
            "userProfileURL": "https://www.linkedin.com/company/vertiqalstudios/posts",
            "dataId": "urn:li:comment:(ugcPost:7294761627025821697,7294781303927803905)"
          }
        ],
        "commentAdded": "Exciting collaboration! Looking forward to seeing how this partnership drives growth in the social media landscape. 🚀 #Innovation #Partnership"
      },
      {
        "postId": "urn:li:activity:7294778942027104258",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294778942027104258",
        "url": "https://www.linkedin.com/in/greg-jarboe-876364?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAANadoBOz0NTCQWtxDcynXfbKY77i07aTw",
        "name": "Greg Jarboe\nGreg Jarboe",
        "content": "Before and during Super Bowl 2025, brands battled for attention. Find out which ads stood out across different rankings.",
        "reactions": {
          "likes": "0",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Excited to see which brands emerged victorious! Super Bowl ads always spark creativity and competition. Great insights ahead! 🏈✨"
      },
      {
        "postId": "urn:li:activity:7294753303203041280",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294753303203041280",
        "url": "https://www.linkedin.com/in/kristiserrano?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAnYoEBVKKk93g1uMogVOvIEAf9cRG23WI",
        "name": "Kristi Faltorusso\nKristi Faltorusso",
        "content": "Strong communication saved me $500K in ARR.\n\nSounds dramatic? Maybe. But it’s true.\n\nA few roles ago, I had to oversee the deprecation of a product used by our smaller customers. We had a new and improved solution ready to go—but with a higher price tag and added complexity that many customers didn’t want (or need).\n\nCue potential churn panic.\n\nMy job? Prevent a mass exodus.\n\nHere’s how strong, proactive communication helped us keep 70% of our customers and over $500K in ARR \n\nThe Playbook:\n\n Personalized Emails – No generic “we’re sunsetting this product” nonsense. We crafted targeted, transparent messages explaining the why, the what, and the when—plus clear options.\n\n Webinar with FAQs – We didn’t just announce change; we walked them through it. A live session let customers hear the plan firsthand and get their biggest questions answered.\n\n 1:1 Calls – High-touch for those who needed it. No one felt abandoned in the process.\n\n Migration & Exit Options – We gave customers choices, not ultimatums. Some migrated, some left (on good terms), and we even helped a few transition to alternative solutions.\n\n Consistent Updates – No surprises. Regular check-ins gave customers control over the transition.\n\n Post-Migration Support – Because the customer experience doesn’t stop after the switch. We made sure they were set up for success.\n\nThe Outcome?\n\n 500K ARR saved\n ~70% retention\n Stronger customer trust\n\nHere’s the lesson: Communication can be more powerful than the product changes themselves. Customers don’t just need a new tool—they need clarity, support, and a sense of control.\n\nSaaS is always changing. Sometimes all you have is communication. Use it wisely.\n\n_________________\n\n If you liked my post, you’ll love my newsletter.\n\nEvery week I share learnings, advice and strategies from my experience going from CSM to CCO. Join 12k+ subscribers of The Journey and turn insights into action.\n\nSign up on my profile.",
        "reactions": {
          "likes": "70\nKoen Stam and 69 others",
          "comments": "26 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Good list here! Never upgrade a customer without showing how it’ll bring them value. Sunsetting platforms can make for tough convos. The more you can focus on their specific use cases so they can see exactly how the latest platform benefits them, the better. Upgrade convos without value mapping = angry customers.",
            "userName": "Jon Rydberg",
            "userProfileURL": "https://www.linkedin.com/in/jon-rydberg-a9928334",
            "dataId": "urn:li:comment:(activity:7294726167654219778,7294727954914234369)"
          },
          {
            "commentText": "Jon Rydberg I have so many \"trust me\" examples to share. ",
            "userName": "Kristi Faltorusso",
            "userProfileURL": "https://www.linkedin.com/in/kristiserrano",
            "dataId": "urn:li:comment:(activity:7294726167654219778,7294730965426327553)"
          },
          {
            "commentText": "Stellar playbook Kristi Faltorusso! Definitely going to borrow these ideas for an upcoming price increase I’m working on with one of my clients-thank you for outlining your success \n\nIn a similar situation, I launched a new product that was 10x the cost of my customers previous solution. They needed to charge at least that much more to their clients.\n\nProving the value to every individual as well as their company as a whole + giving them the messaging to use for their clients turned out most valuable for our playbook-In the first 2 quarters we secured $5M in additional ARR nationwide.",
            "userName": "Kassandra McLaren",
            "userProfileURL": "https://www.linkedin.com/in/kassandra-mclaren",
            "dataId": "urn:li:comment:(activity:7294726167654219778,7294735163924566017)"
          },
          {
            "commentText": "Kassandra McLaren I love that! These types of situations are never \"easy\" but can be pretty positively impactful if managed the right way. ",
            "userName": "Kristi Faltorusso",
            "userProfileURL": "https://www.linkedin.com/in/kristiserrano",
            "dataId": "urn:li:comment:(activity:7294726167654219778,7294736206624407553)"
          },
          {
            "commentText": "Agreed Kristi Faltorusso, there is so much learning in the hard though- I tend to like it more.  ",
            "userName": "Kassandra McLaren",
            "userProfileURL": "https://www.linkedin.com/in/kassandra-mclaren",
            "dataId": "urn:li:comment:(activity:7294726167654219778,7294737930898546689)"
          }
        ],
        "commentAdded": "Great insights! Strong communication is indeed key in retaining customers during transitions. Your playbook is a valuable resource for success!"
      }
    ],
    "errors": [
      {
        "postId": "urn:li:activity:7294687859486203904",
        "url": "https://www.linkedin.com/in/dagmara-asbreuk?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAXUTgBpj1mNkXHnXX0UtbJ7t3qIFtZXJA",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294748131118759938",
        "url": "https://www.linkedin.com/in/jasonmlemkin?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAsKtMBHQPJ9rgxpUs8M6pSxrAYCXIX8oY",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294609625868288001",
        "url": "https://www.linkedin.com/in/jnando82?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAACfbcYB5KtgXpUrgMeAwPG8MEfAiRXX3wU",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294757741951168512",
        "url": "https://www.linkedin.com/in/romimahajan?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAlYZuQBDEZNbNuEzy5tczl-rn6tmbfIonY",
        "errors": [
          "Failed to fetch reactions.",
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294767588708880385",
        "url": "https://www.linkedin.com/in/joshuahuilar?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAJaHWQBAZSZ8J2sYVsnz0HFcY2icRSeJBU",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294769264501174273",
        "url": "https://www.linkedin.com/in/mahmoud-owiesit01?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADv5fHEBRMViUQ9S8FeE1EbzzUGTUAORF_Y",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294780257163767810",
        "url": "https://www.linkedin.com/in/jlcreech?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAPlFEUBGFgILYuMe3B4ul8L1pns82n76RA",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294778942027104258",
        "url": "https://www.linkedin.com/in/greg-jarboe-876364?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAANadoBOz0NTCQWtxDcynXfbKY77i07aTw",
        "errors": [
          "Failed to fetch reactions.",
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294753303203041280",
        "url": "https://www.linkedin.com/in/kristiserrano?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAnYoEBVKKk93g1uMogVOvIEAf9cRG23WI",
        "errors": [
          "Failed to fetch media URL."
        ]
      }
    ]
  },
  {
    "postsData": [
      {
        "postId": "urn:li:activity:7294749041890902018",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294749041890902018",
        "url": "https://www.linkedin.com/in/melanie-paris-jones?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAHer6EBKr7dOkbnZxo4fwi1oA_ONGJvCBU",
        "name": "Melanie Paris Jones\nMelanie Paris Jones",
        "content": "One of the highlights of last week: interviewing Entrepreneur Magazine editor-in-chief Jason Feifer for the Retail War Games podcast. We talked about branding, connecting with an audience, product/brand storytelling, finding a peer group, and content creation (but don’t call it “content”) — after I was done geeking out and asking him all my media-related questions, of course. Jason is a brilliant business leader, and if you haven’t subscribed to his “One Thing Better” newsletter, you definitely should. (Link in comments.)\n\nThis was a great opportunity, and I’m grateful toandfor inviting me to guest host. Thanks to,and the rest of the team who helped this podcast run smoothly.\n\nsnapped this photo of me recording in the booth. I was apparently so focused that I didn’t realize she was there.  Like I said…geeking out.",
        "reactions": {
          "likes": "18",
          "comments": "12 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Fun in Utah ",
            "userName": "KC Sanders",
            "userProfileURL": "https://www.linkedin.com/in/ogdenutah",
            "dataId": "urn:li:comment:(activity:7294743880690712577,7294747490866601984)"
          },
          {
            "commentText": "KC Sanders  ",
            "userName": "Melanie Paris Jones",
            "userProfileURL": "https://www.linkedin.com/in/melanie-paris-jones",
            "dataId": "urn:li:comment:(activity:7294743880690712577,7294758960228704256)"
          },
          {
            "commentText": "Thank you for the thoughtful conversation! So funny, I had no idea you were in one of those little booths!",
            "userName": "Jason Feifer",
            "userProfileURL": "https://www.linkedin.com/in/jasonfeifer",
            "dataId": "urn:li:comment:(activity:7294743880690712577,7294759441621549057)"
          },
          {
            "commentText": "I was a zoo animal — people taking photos and everything.  ",
            "userName": "Melanie Paris Jones",
            "userProfileURL": "https://www.linkedin.com/in/melanie-paris-jones",
            "dataId": "urn:li:comment:(activity:7294743880690712577,7294759878454063106)"
          }
        ],
        "commentAdded": "Sounds like an amazing conversation! Jasons insights are always valuable. Excited to check out the podcast and his newsletter! 🎙️📩"
      },
      {
        "postId": "urn:li:activity:7294738317290393601",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294738317290393601",
        "url": "https://www.linkedin.com/in/jnando82?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAACfbcYB5KtgXpUrgMeAwPG8MEfAiRXX3wU",
        "name": "Fernando Perez\nFernando Perez",
        "content": "Learn how to use the best ChatGPT marketing prompts for online business: https://lttr.ai/AbQSl",
        "reactions": {
          "likes": "0",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Great resource! Leveraging ChatGPT prompts can really elevate our marketing strategies. Excited to explore these insights! 🚀"
      },
      {
        "postId": "urn:li:activity:7294771140864978945",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294771140864978945",
        "url": "https://www.linkedin.com/groups/102939?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A102939-7294771139933798400",
        "name": "Real-Time Embedded Engineering\nReal-Time Embedded Engineering",
        "content": "Real-Time Embedded Systems - https://lnkd.in/e5R_4RWy\nLook for \"Read and Download Links\" section to download. Follow/Connect me if you like this post.",
        "reactions": {
          "likes": "14",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Great resource on Real-Time Embedded Systems! Excited to dive into the materials. Thanks for sharing! #EmbeddedSystems"
      },
      {
        "postId": "urn:li:activity:7294780845465165825",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294780845465165825",
        "url": "https://www.linkedin.com/groups/1850284?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A1850284-7294769059345149954",
        "name": "Business Development - The Missing Link Between Marketing & Sales - 540,000 Members Strong\nBusiness Development - The Missing Link Between Marketing & Sales - 540,000 Members Strong",
        "content": "The impact of kindness lasts long after the moment has passed. A simple gesture, a word of encouragement, or a supportive action can leave a lasting impression on someone’s life and career. As a leader, your kindness can be the spark that ignites someone’s confidence and drives them to greatness. Never underestimate the power of empathy.",
        "reactions": {
          "likes": "24",
          "comments": "5 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Erika Nemcokovan Akpan & Paul Karsties",
            "userName": "Lukas C.",
            "userProfileURL": "https://www.linkedin.com/in/lukas-c-758653a2",
            "dataId": "urn:li:comment:(groupPost:1850284-7294769059345149954,7294780830193778688)"
          }
        ],
        "commentAdded": "Absolutely agree! Kindness is a catalyst for growth. Lets continue to uplift each other and create a culture of empathy in the workplace! 🌟"
      },
      {
        "postId": "urn:li:activity:7294771891691552770",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294771891691552770",
        "url": "https://www.linkedin.com/in/dovidazerad?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAC_NGwkBeoSizPUiIeb1jhaq4PR5Ul44jWA",
        "name": "Dovid Azerad\nDovid Azerad",
        "content": "Deep down, I was wondering, \n\n\"Did I make a big mistake?\"\n\nI was brand new.\nMy first project was to completely redo the discipline process in our school, and it really wasn't working out.\n\nEverything I tried wasn't sticking.\n\nI tried flowcharts, coaching, training, and workshops - and nothing was making a difference. I could not get the staff (or students) to follow the systems and procedures.\n\nTo say I felt frustrated, or, overwhelmed would be an understatement.\n\nIn the first two weeks of school nearly 100 different students were referred to me.\n\nI was paralyzed with self-doubt and the basic feeling that I just wasn't good enough to actually make the change.\n\nThen I had an epiphany.\n\nWhen I was feeling like I needed to blame someone else for something - that was me relinquishing control. It was me not taking ownership over myself and my role.\n\nMy role was to support the staff, not lecture them on how to be better. It was to actually get down in the weeds with them and learn about their challenges. Learn the patterns that they were in - and then guide them through it.\n\nIt took me a few tries, but I understand now that those feelings of inadequacy and overwhelm are really just signals that I need to step into my ownership more.\n\nIf it means taking a training on a specific skill, or paying a coach to guide me through a challenge - that's on me.\n\nIt's always on me.\n\nWithin 3 months, the referrals were down to about 10 students per week.\n\nAnd the crazy thing is, I did it by being calmer, more empathetic, and without burning my staff relationally.\n\nSo, if you're...\n...feeling overwhelmed\n...feeling uncertain\n...feeling like you’re failing\n\nListen to your inner voice and learn from it.\n\nWhat are you trying to unload? What do you need to take accountability for?\n\nThe most accelerated growth you experience comes when you go and do those things that you're trying to avoid.\n\nWhat struggle are you learning from today?\n\n--\n\nThis is exciting for me to share!\nFor six months, I dug into the Tao Te Ching, and it helped me clarify the changes that every CEO, COO, and entrepreneur NEEDS to make to lead without effort.\n\nSo I wrote a 4-part, 15 lesson guide.\nNo fluff and no hacks.\n\nGo check out my featured section for the FREE download!",
        "reactions": {
          "likes": "5\nMalkie Rimon and 4 others",
          "comments": "4 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Yes, in my experience the fastest way to growth is to run toward the things I'd rather avoid!",
            "userName": "Malkie Rimon",
            "userProfileURL": "https://www.linkedin.com/in/malkie-rimon",
            "dataId": "urn:li:comment:(activity:7294724315969716246,7294771870808092673)"
          },
          {
            "commentText": "Malkie Rimon I love the way you phrased it - totally agree!\n\nWhen we feel avoidant, it's usually a signal to just lean in.\n\n'just'...",
            "userName": "Dovid Azerad",
            "userProfileURL": "https://www.linkedin.com/in/dovidazerad",
            "dataId": "urn:li:comment:(activity:7294724315969716246,7294777346509733888)"
          }
        ],
        "commentAdded": "Inspiring journey! Acknowledging our challenges is the first step toward growth. Thanks for sharing your valuable insights and the free guide! 🌟"
      },
      {
        "postId": "urn:li:activity:7294778731288543232",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294778731288543232",
        "url": "https://www.linkedin.com/in/deemah-alyahya?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAVhbSsBl13rxsVgU6obFQBgYbEhG_JP1i8",
        "name": "Deemah AlYahya\nDeemah AlYahya",
        "content": "Few countries have transformed their digital landscape as boldly as Estonia. From leading in e-governance to ranking #1 in Europe for digital public services, Estonia has built a thriving digital-first society.\n\nI had the privilege of meeting H.EMinister of Justice and Digital Affairs of Estonia 🇪🇪 , to strengthen DCO-Estonia ties and collaboration to accelerate digital transformation across borders and share expertise beyond boarders looking at\n\n 62.6% of Estonians have at least basic digital skills—well above the EU average.\n Estonia is a pioneer in AI, digital identity, and cybersecurity, shaping the future of public services.\n With 26.8% of its ICT specialists being women, Estonia is a leader in driving gender diversity in tech.\n\nTo further this collaboration, we signed an MoU withformalizing a commitment to joint research, capacity-building, and knowledge exchange—bridging digital divides and empowering startups across DCO Member States.\nThis partnership goes beyond cooperation—it scales impact, shares expertise, and shapes the digital economy of tomorrow. Excited for what’s ahead!",
        "reactions": {
          "likes": "35\nGene Yoo and 34 others",
          "comments": "2 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Estonia is awesome for tech start-ups. ",
            "userName": "Gene Yoo",
            "userProfileURL": "https://www.linkedin.com/in/resecurity001",
            "dataId": "urn:li:comment:(ugcPost:7294777851944259584,7294778709813706752)"
          }
        ],
        "commentAdded": "Inspiring collaboration! Excited to see how this partnership will drive digital innovation and empower communities across borders! 🌍🚀"
      },
      {
        "postId": "urn:li:activity:7294780072622731264",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294780072622731264",
        "url": "https://www.linkedin.com/in/sanarasul?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAE76IAB4aOjtWoXK4rttnGnOiwQp7YWWwA",
        "name": "⚡⚡ Saná (Rasul) Walker, SHRM-CP, DEIB Advocate\n⚡⚡ Saná (Rasul) Walker, SHRM-CP, DEIB Advocate",
        "content": " Virtual meetings should be productive—not painful. But let’s be real… we’ve all sat through a meeting that could have been an email. \n\nSo how do you run an online meeting that actually keeps people engaged and gets things done?\n\n Set clear objectives\n Keep it concise\n Engage your attendees (no more silent Zoom screens!)\n\nWant more tips to make your virtual meetings a success?\nRead more here>>",
        "reactions": {
          "likes": "0",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Great insights! Engaging attendees is key to productive meetings—lets make them worthwhile! Looking forward to reading more tips!"
      },
      {
        "postId": "urn:li:activity:7294769850181201920",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294769850181201920",
        "url": "https://www.linkedin.com/in/premprakashrimcollian?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACwixtkBGVNMIdErvCjjjjcWN9wstNYLQAQ",
        "name": "Prem Prakash\nPrem Prakash",
        "content": "Passionate About Education!\n\nI chanced this snap during traffic halt! Someone has mentioned about education on the rear windscreen and the importance that it holds. Indeed education is empowering and makes you confident.\nHe says “education is like the milk of lioness and whosoever will drink will roar like one”. He quotes Dr BR Ambedkar!\n\nThere are many quotes related to education but this one was new for me. As an educator I loved it and photographed it. Also Dr Ambedkar has an important significance. In a way this is also a clarion call for people to educate themselves. Possibly we can play an important role in promoting the spirit behind the passion of this vehicle owner! Public at large should be encouraged I am sure.",
        "reactions": {
          "likes": "13\nBalavignesh Sampathkumar and 12 others",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "What an inspiring quote! Education truly transforms lives. Lets continue to champion learning and empower others to roar with knowledge! 📚💪"
      },
      {
        "postId": "urn:li:activity:7294780270535168004",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294780270535168004",
        "url": "https://www.linkedin.com/in/sebastianwulff?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAANsn2sBKB5Z8pdcoMZQ0oChYYnSpJYRQvE",
        "name": "Sebastian Wulff\nSebastian Wulff",
        "content": "𝗠&𝗔 𝗨𝗽𝗱𝗮𝘁𝗲: 𝗤𝘂𝗮𝗿𝘁𝗲𝗿𝗺𝗮𝘀𝘁 𝗔𝗱𝘃𝗶𝘀𝗼𝗿𝘀 𝘄𝗶𝗹𝗹 𝗵𝗲𝗹𝗽 𝗩𝗲𝗿𝘁𝗶𝗾𝗮𝗹 𝗦𝘁𝘂𝗱𝗶𝗼𝘀 𝗲𝘅𝗽𝗮𝗻𝗱 𝘁𝗵𝗿𝗼𝘂𝗴𝗵 𝘀𝘁𝗿𝗮𝘁𝗲𝗴𝗶𝗰 𝗮𝗰𝗾𝘂𝗶𝘀𝗶𝘁𝗶𝗼𝗻𝘀!  \n\nWe’re thrilled to help the Vertiqal Studios team identify and acquire Facebook publishers and other social media properties. If you’re considering selling or exploring strategic opportunities, let’s connect via DM!\n\nis one of North America’s largest owners of gaming and lifestyle social media channels. They’ve previously acquired Offbeat Studios and a portfolio of social properties from Viral Nation. Now, we’re supporting their next phase of growth as their M&A advisors.\n\nRead the full press release here:",
        "reactions": {
          "likes": "2",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Exciting times ahead for Vertiqal Studios! 🚀 Looking forward to seeing the growth and innovation that comes from these strategic acquisitions!"
      },
      {
        "postId": "urn:li:activity:7294777606766215170",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294777606766215170",
        "url": "https://www.linkedin.com/in/smpositivevibes?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACixR-EBqwN2b-QNMuAltZmud5ZFjn66J74",
        "name": "Swati Mathur\nSwati Mathur",
        "content": "I've noticed people who believe using abusive language makes them appear cool. \n\nThey try hard to fit in with their friend circle, where they feel pressured to use bad words, smoke, drink, and mock other genders just to be accepted.\n\nIf you're compromising your values to befriend these people, remember that they're not truly your friends. Friendship shouldn't force you to completely change your personality or adopt bad habits.\n\nIn today's digital age, it's easy to consume content that we enjoy. When we see a video with a large number of views, it can be tempting to click and watch.\n\nHowever, just because a video is popular doesn't mean we should mindlessly consume its content.\n\nJust as we take care of our physical health by eating nutritious food, we should also prioritize our mental health by consuming good content.\n\nInsulting others, mocking our parents, partners, and friends, and using abusive language are not ways to appear cool.\n\nI hope you understand my message and are mindful of what you consume. It's easy to blame others for their actions, but it's our responsibility to take care of our own mental health.",
        "reactions": {
          "likes": "136",
          "comments": "27 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Completely agree. In today's world, many adults believe that using abusive language helps them appear tough or confident, but in reality, it often makes them seem unpleasant or disrespectful.",
            "userName": "Vaishali Chauhan",
            "userProfileURL": "https://www.linkedin.com/in/vaishali-chauhan-9b86831bb",
            "dataId": "urn:li:comment:(activity:7294749161361485824,7294765101046239232)"
          },
          {
            "commentText": "Vaishali Chauhan Exactly \nThank you for sharing your views. ",
            "userName": "Swati Mathur",
            "userProfileURL": "https://www.linkedin.com/in/smpositivevibes",
            "dataId": "urn:li:comment:(activity:7294749161361485824,7294767463437606912)"
          },
          {
            "commentText": "True coolness isn't about fitting in by dumbing down, Swati it's about standing out by lifting others up",
            "userName": "Jayesh Marathe",
            "userProfileURL": "https://www.linkedin.com/in/jayeshmarathe2011",
            "dataId": "urn:li:comment:(activity:7294749161361485824,7294751959083798528)"
          },
          {
            "commentText": "Jayesh Marathe I completely agree with you.",
            "userName": "Swati Mathur",
            "userProfileURL": "https://www.linkedin.com/in/smpositivevibes",
            "dataId": "urn:li:comment:(activity:7294749161361485824,7294753753881030657)"
          }
        ],
        "commentAdded": "Well said! True friendships uplift us rather than change us. Lets prioritize positivity and surround ourselves with the right influences. 🌟"
      }
    ],
    "errors": [
      {
        "postId": "urn:li:activity:7294749041890902018",
        "url": "https://www.linkedin.com/in/melanie-paris-jones?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAHer6EBKr7dOkbnZxo4fwi1oA_ONGJvCBU",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294738317290393601",
        "url": "https://www.linkedin.com/in/jnando82?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAACfbcYB5KtgXpUrgMeAwPG8MEfAiRXX3wU",
        "errors": [
          "Failed to fetch reactions.",
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294771140864978945",
        "url": "https://www.linkedin.com/groups/102939?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A102939-7294771139933798400",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294780845465165825",
        "url": "https://www.linkedin.com/groups/1850284?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A1850284-7294769059345149954",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294771891691552770",
        "url": "https://www.linkedin.com/in/dovidazerad?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAC_NGwkBeoSizPUiIeb1jhaq4PR5Ul44jWA",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294778731288543232",
        "url": "https://www.linkedin.com/in/deemah-alyahya?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAVhbSsBl13rxsVgU6obFQBgYbEhG_JP1i8",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294780072622731264",
        "url": "https://www.linkedin.com/in/sanarasul?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAE76IAB4aOjtWoXK4rttnGnOiwQp7YWWwA",
        "errors": [
          "Failed to fetch reactions.",
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294769850181201920",
        "url": "https://www.linkedin.com/in/premprakashrimcollian?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACwixtkBGVNMIdErvCjjjjcWN9wstNYLQAQ",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294780270535168004",
        "url": "https://www.linkedin.com/in/sebastianwulff?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAANsn2sBKB5Z8pdcoMZQ0oChYYnSpJYRQvE",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294777606766215170",
        "url": "https://www.linkedin.com/in/smpositivevibes?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACixR-EBqwN2b-QNMuAltZmud5ZFjn66J74",
        "errors": [
          "Failed to fetch media URL."
        ]
      }
    ]
  },
  {
    "postsData": [
      {
        "postId": "urn:li:activity:7294764675756437506",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294764675756437506",
        "url": "https://www.linkedin.com/in/dereksalyers?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAB1Q2jsBC5a37DJsMBh5iChE4PbOkcBKM-0",
        "name": "Derek Salyers\nDerek Salyers",
        "content": "Analytics shouldn't dictate your creativity.\n\nBut they should inform it.\n\nFind the overlap between what you love creating and what performs best.\n\nThat's your sweet spot.",
        "reactions": {
          "likes": "0",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Absolutely! Balancing analytics with creativity can unlock innovation. Its all about finding that perfect intersection. Great insight!"
      },
      {
        "postId": "urn:li:activity:7294698233040187392",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294698233040187392",
        "url": "https://www.linkedin.com/in/laraacostar?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADf4bgUB_SYYxrCCxXN6bqAhLp0S6YOWpWU",
        "name": "Lara Acosta\nLara Acosta",
        "content": "My favorite life cheat code:\n\nTake thought out of any equation.\nBecause small actions deliver the fastest results.\n\nEvery morning I try to plan my day ahead.\n\nRun a marathon? Run 10k that day.\nGrow my account? Post and engage that day.\nGet new clients? Solve a new problem that day.\n\nBig goals = small daily actions.\n\nEven when I feel like I can't do it, I have to.\n\nThis year, stop overthinking and do the \"thing\".\nPut the actions on your calendar and do them.\n\nYou'll become more confident when you do.\n\nIf you want to take action today...\n\nI made a FREE 7 day LinkedIn growth course for you here:\n\nRepost ️ if this is the year you'll overcome imposter syndrome.",
        "reactions": {
          "likes": "1,557",
          "comments": "1,011 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Overthinking kills momentum, but small daily actions build it. The less we debate, the faster we grow.",
            "userName": "Sven Elstermann",
            "userProfileURL": "https://www.linkedin.com/in/svensf",
            "dataId": "urn:li:comment:(activity:7294693744140845056,7294698208507703296)"
          }
        ],
        "commentAdded": "Love this perspective! 🚀 Consistent small actions truly build momentum. Excited to take on the challenge and kickstart my growth this year!"
      },
      {
        "postId": "urn:li:activity:7294736770515054595",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294736770515054595",
        "url": "https://www.linkedin.com/in/talha-nasir-831371168?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACfrpmUBPmokWWk1IltNOrF-QFbvtg2Ne04",
        "name": "Talha Nasir\nTalha Nasir",
        "content": "The #1 Money Habit That Can Transform Finances\n\nMany people believe that building wealth is about earning more money. But the real game-changer isn’t just income... it’s how money is managed. One simple habit can make all the difference:\n\nTrack Every Rupee Spent\n\nThis small shift brings clarity, control, and better financial decisions. Here’s how this small habit leads to massive results:\n\n Awareness Leads to Smarter Spending\n\nMost people underestimate how much they spend on small, unnecessary expenses. Tracking expenses helps identify wasteful spending and redirect money toward meaningful goals.\n\n Saves Before Spending, Not After\n\nA common mistake is spending first and saving what’s left. Instead, setting aside savings before spending ensures financial security and long-term growth.\n\n Prevents Lifestyle Creep\n\nAs income grows, so do expenses; unless spending is monitored. Tracking expenses helps maintain discipline, ensuring that a higher income leads to more wealth, not just higher bills.\n\n Makes Budgeting Easy\n\nA clear record of spending makes it simple to set a realistic budget. It helps allocate funds efficiently, balancing necessities, savings, and enjoyment.\n\nHow to Start Toda\n\n1️⃣ Use an App or Notebook\nTrack every expense, no matter how small.\n\n2️⃣ Review Weekly\nIdentify areas to cut back or optimize.\n\n3️⃣ Set Spending Limits\nCreate categories and stick to a budget.\n\n4️⃣ Automate Savings\nTransfer a portion of income to savings before spending.\n\n\"Take the 30-Day Challenge\"\n\nFor one month, track every expense. The insights gained can lead to better financial decisions and long-term wealth.\n\nHave you ever tracked your spending? What did you learn? Share your experience in the comments.",
        "reactions": {
          "likes": "18",
          "comments": "8 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Totally agree! Small expenses add up fast. This habit makes a huge difference.",
            "userName": "Think Beyond Research",
            "userProfileURL": "https://www.linkedin.com/company/think-beyond-research/posts",
            "dataId": "urn:li:comment:(activity:7294710081001066496,7294736587882422273)"
          },
          {
            "commentText": "Saving before spending is a golden rule! Need to be more consistent with this. Thanks for the reminder! ",
            "userName": "Digital Lab",
            "userProfileURL": "https://www.linkedin.com/company/digtal-lab/posts",
            "dataId": "urn:li:comment:(activity:7294710081001066496,7294736704966463489)"
          }
        ],
        "commentAdded": "Absolutely agree! Tracking expenses truly opens your eyes to spending habits. Excited to take on the 30-day challenge! 💪💰 #FinancialWellness"
      },
      {
        "postId": "urn:li:activity:7294763378034536448",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294763378034536448",
        "url": "https://www.linkedin.com/in/ford-coleman-hirecollegestudents?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAB-j8SoBBkxNM_nTBIXyTBYbOcZq2blzfaw",
        "name": "Ford Coleman\nFord Coleman",
        "content": "Great onboarding isn't about perfect paperwork.\n\nOr fancy welcome packages.\nOr loaded MacBooks.\n\nIt's about making new hires feel at home.\n\nMaking them believe they belong here.\nShowing them they made the right choice.\n\nBut most companies get it wrong.\n\nThey overwhelm. They rush. They forget.\nThen wonder why great talent walks away.\n\nHere's your 90-day blueprint to keep the talent you worked so hard to find:\n\n First 30 Days: Getting You Started Right\n\n1/ Set Up For Success\n2/ Break Down The Basics\n3/ Break the ice, build the trust\n\n Days 31-60: Now You're Ready for the Fun Stuff\n\n1/ Turn Theory Into Practice\n2/ Create Learning Loops\n3/ Build Connections\n\n Days 61-90: Show Us What You've Got\n\n1/ Test Drive Leadership\n2/ Open Growth Doors\n3/ Measure Progress\n\n Pro Tip: New hires remember how you made them feel, not what you taught them.\n\nStop overwhelming new talent.\nStart building their confidence.\n\nWhat's your best onboarding tip?\nLet me know in the comments below ⬇\n\n Repost if you found this insightful!\n Followfor more!",
        "reactions": {
          "likes": "242",
          "comments": "174 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Onboarding isn’t just training—it’s culture in action.\n\nConfidence builds when people feel valued early on. Ford Coleman",
            "userName": "Matt Schnuck",
            "userProfileURL": "https://www.linkedin.com/in/mattschnuck",
            "dataId": "urn:li:comment:(activity:7294759370389635072,7294760670565212160)"
          },
          {
            "commentText": "Matt Schnuck totally! Culture sets the tone for everything. ",
            "userName": "Ford Coleman",
            "userProfileURL": "https://www.linkedin.com/in/ford-coleman-hirecollegestudents",
            "dataId": "urn:li:comment:(activity:7294759370389635072,7294762978267025410)"
          },
          {
            "commentText": "Matt Schnuck Absolutely! A strong onboarding experience isn’t just about knowledge—it’s about belonging. When people feel valued from the start, they’re set up for success. ",
            "userName": "Shan A. Rajpoot",
            "userProfileURL": "https://www.linkedin.com/in/shanalirajpoot",
            "dataId": "urn:li:comment:(activity:7294759370389635072,7294771303448784897)"
          },
          {
            "commentText": "Not only new hires but everyone remembers how you made them feel.",
            "userName": "Abhishek Kumar",
            "userProfileURL": "https://www.linkedin.com/in/abhishek-singh-obroy",
            "dataId": "urn:li:comment:(activity:7294759370389635072,7294762030270480384)"
          },
          {
            "commentText": "Abhishek Kumar so true! How you make people feel sticks. ",
            "userName": "Ford Coleman",
            "userProfileURL": "https://www.linkedin.com/in/ford-coleman-hirecollegestudents",
            "dataId": "urn:li:comment:(activity:7294759370389635072,7294764507728400387)"
          }
        ],
        "commentAdded": "Absolutely agree! Onboarding is all about connection and support. A strong start builds confidence and retention. Great tips here! 🌟"
      },
      {
        "postId": "urn:li:activity:7294611270526222336",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294611270526222336",
        "url": "https://www.linkedin.com/in/koenstam87?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAU5coEB2DP3X847hxxjTn2xkmgxxrYPqjI",
        "name": "Koen Stam\nKoen Stam",
        "content": "Last week, I spoke with a VP Sales at a $25M ARR company about RFPs. We both agreed: We should stop wasting our time.\n\nI’ve participated in so many RFPs, but lately, I don’t want to participate in any.\n\nI had this same feeling in my previous Head of Sales role selling into Banks & Government.\n\nAnd I feel it again now as a cross-functional revenue leader selling into several industries.\n\nWhy?\n\nBecause my teams have wasted months of execution power filling out RFPs—only to realize we had no real shot at winning.\n\nRFPs are a trap for most sellers.\n\nHere’s the harsh truth about RFPs:\n\n• You’re late to the party. If you weren’t engaged before the RFP dropped, you’re just filling a procurement requirement.\n• The customer already has a vendor in mind. Most RFPs aren’t an “open competition”—they’re a validation exercise to justify a decision that’s already been made.\n• You’re wasting weeks (or months) on a lost cause. The opportunity cost is massive: instead of chasing an unwinnable RFP, you could be closing real deals.\n\nThe best sellers know when to walk away.\n\nWhen to Walk Away From an RFP\n• No equal playing field—another vendor shaped the RFP.\n• No internal criteria process to validate RFP feasibility.\n• Vague, inconsistent RFP documentation.\n• Decision criteria & timelines are unclear.\n\nIf you check any of these, walk away.\n\nWhen to Consider Competing\n• You’ve built champions and have executive buy-in.\n• You’ve identified clear differentiators tied to customer priorities.\n• You helped shape the RFP or had meaningful conversations beforehand.\n\nEven though I’m not a fan, buyers still buy through RFPs.\n\nIf you can validate feasibility, go for it. Otherwise, withdraw.\n\n5 RFP Strategies from GTM Experts in my Notion library:\n\n1. Multithread & Stay Connected to the Executive\n\"I stayed close to an SVP via text during an RFP. It gave me inside access to influence the process—even when procurement tried to shut it down.\"\n\n2. Turn the RFP Against Your Competition\n\"We asked key questions in front of the buying team to highlight our differentiators. Our competitor realized they couldn’t compete—and quit.\"\n\n3. Help the Buyer Write the RFP\n\"The best way to win an RFP? Write it yourself. We did this for 2 out of 3 of our biggest RFP wins.\"\n\n4. Challenge the Process\n\"If procurement shuts you down, you’re pushing the right way. If they kick you out, you were never going to win anyway.\"\n\n5. Make Competitors Tap Out\n\"We structured our Q&A session to highlight our key differentiators. Our competitor couldn’t keep up and withdrew from the process entirely.\"\n\nThe best sellers know when to say no.\n\nRFPs inflate pipelines, drain team morale, and pull resources from real, winnable deals.\n\nUnless you’ve influenced the process, the dice are loaded against you.\n\nTime is your most valuable asset.\n\nUse it wisely.\n\nWhat’s your take on RFPs?\n\nPS. Today, In my newsletter , I will break down how experts run RFPs. Consider subscribing to improve your RFP process.",
        "reactions": {
          "likes": "109",
          "comments": "37 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "If my sales team don't know the RFP is coming, ah Nah Thanks.\nIf our tech specs is not on the RFP, ah Nah Thanks.\nif there is no specs and it's almost like an RFI, Maybe!",
            "userName": "Ren Saguil",
            "userProfileURL": "https://www.linkedin.com/in/rensaguil",
            "dataId": "urn:li:comment:(activity:7294611270526222336,7294612199619104769)"
          },
          {
            "commentText": "Kevin, I have seen a similar trend of deals we won back. However, RFPs we won back I can count on 1 hand. \n\nIf if if you go IN for an RFP you need to really make sure you show the best version of yourself, so indeed they will remind you as runner up when the initial selected vendors fails or when after 3 yrs they come back for a new RFP round.",
            "userName": "Koen Stam",
            "userProfileURL": "https://www.linkedin.com/in/koenstam87",
            "dataId": "urn:li:comment:(activity:7294611270526222336,7294625020784377857)"
          },
          {
            "commentText": "Jerry Graman ",
            "userName": "Twan Stoppelenburg",
            "userProfileURL": "https://www.linkedin.com/in/twanstoppelenburg",
            "dataId": "urn:li:comment:(activity:7294611270526222336,7294613996429557760)"
          },
          {
            "commentText": "Thanks for sharing, Twan. Anything valuable for your internal RFP process? ",
            "userName": "Koen Stam",
            "userProfileURL": "https://www.linkedin.com/in/koenstam87",
            "dataId": "urn:li:comment:(activity:7294611270526222336,7294625512381898753)"
          },
          {
            "commentText": "Definitely. ''Boarding'' too late is often a waste time. Defining your targets and being ahead of the RFI is the goal. ",
            "userName": "Twan Stoppelenburg",
            "userProfileURL": "https://www.linkedin.com/in/twanstoppelenburg",
            "dataId": "urn:li:comment:(activity:7294611270526222336,7294632592786554880)"
          }
        ],
        "commentAdded": "Great insights! Knowing when to walk away from RFPs is vital. Its all about prioritizing resources on winnable opportunities. Time is indeed precious!"
      },
      {
        "postId": "urn:li:activity:7294777442697691137",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294777442697691137",
        "url": "https://www.linkedin.com/groups/3416532?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A3416532-7294777441586163712",
        "name": "Digital Marketing Group - #1 Internet Online Advertising SEO Social Media Mobile\nDigital Marketing Group - #1 Internet Online Advertising SEO Social Media Mobile",
        "content": "Fact: AI is not just a tool—it’s a revolution.\nThe rules of business are being rewritten. \nEntrepreneurs and business owners who choose \n\nto ignore this shift\n\nrisk falling behind.\n\n\nBut those who seize the opportunity,\n\nmaster the tools,\n\nand harness AI to their advantage?\n\n\nThey won’t just survive—they’ll dominate.\n\n\nHere’s the truth:\n\n• AI can automate tasks you never thought possible.\n• It can analyze data faster than any human.\n• It can unlock creativity, innovation, and efficiency at levels we’ve never seen before.\n\n\nBut the key isn’t just having access to AI.\n\nIt’s knowing how to use it.\n\n\n\nThe winners will be the ones\n\nwho are fearless learners,\n\nthe ones who embrace change\n\ninstead of resisting it.\n\n\nSo ask yourself:\nAre you leveraging AI\n\nto grow your business—or are you\n\nletting your competitors take the lead?\n\nThe choice is yours.",
        "reactions": {
          "likes": "5\nMarianna Outsia and 4 others",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Absolutely agree! Embracing AI is no longer optional; its essential for staying competitive and driving innovation. Let’s lead the charge! 🚀"
      },
      {
        "postId": "urn:li:activity:7294740867062341634",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294740867062341634",
        "url": "https://www.linkedin.com/in/martinwir?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAFNO3ekB0Z9YZYBpWY0u2AKiZzizbChID8k",
        "name": "Martin Wirtschafter\nMartin Wirtschafter",
        "content": "Think \"tough leadership\" is the only way to drive results?\n\nHere's the counterintuitive truth:\nYour greatest untapped leadership advantage isn't authority...it's genuine kindness.\n\nIn a world obsessed with \"command and control\" leadership, research reveals a surprising reality:\n\nkind and supportive leaders consistently outperform their peers.\n\nCompanies with empathetic leaders have:\n\n• 60% lower employee turnover in teams\n• 76% higher engagement\n• 4x higher employee satisfaction\n• 54% stronger collaboration\n• 40% higher productivity\n\n15 Transformative Phrases used by kind leaders:\n\n1. \"What support do you need to succeed?\"\n(Shows you want to help them grow)\n\n2. \"I see your potential in this area\"\n(Tells them you believe in their abilities)\n\n3. \"Let's learn from this together\"\n(Makes learning a team effort)\n\n4. \"I trust your judgment on this\"\n(Shows you believe in their choices)\n\n5. \"Your perspective matters to me\"\n(Makes them feel heard and valued)\n\n6. \"Thank you for bringing this to my attention\"\n(Encourages them to speak up)\n\n7. \"How would you approach this?\"\n(Lets them solve problems their way)\n\n8. \"I'd love to hear your ideas\"\n(Shows you value their thoughts)\n\n9. \"You're ready to lead this project\"\n(Gives them a chance to step up)\n\n10. \"Your work on that project made a real difference\"\n(Points out their real impact)\n\n11. \"I noticed how you handled that situation\"\n(Shows you see their good work)\n\n12. \"Your growth has been impressive\"\n(Recognizes how far they've come)\n\n13. \"Take the time you need\"\n(Shows you care about their wellbeing)\n\n14. \"How can I help you succeed?\"\n(Offers real support)\n\n15. \"What obstacles can I help remove?\"\n(Shows you'll help clear their path)\n\nKind leadership isn't about being \"soft\",\nit's about being smart.\n\nWhich phrase will you try first?\nLet me know below\n\n️ Share this to help someone in your community\n Follow memore leadership tips",
        "reactions": {
          "likes": "47",
          "comments": "68 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "As an introvert, I resonate with how powerful kindness can be in leadership. It’s not about loud commands, but about genuinely connecting with and supporting your team. Empathy creates trust, and when people feel heard and valued, they perform at their best.",
            "userName": "Sven Elstermann",
            "userProfileURL": "https://www.linkedin.com/in/svensf",
            "dataId": "urn:li:comment:(ugcPost:7293729211301675009,7294740856333316096)"
          },
          {
            "commentText": "I love this Sven. It's not about Loud Command, it about empaty and love",
            "userName": "Martin Wirtschafter",
            "userProfileURL": "https://www.linkedin.com/in/martinwir",
            "dataId": "urn:li:comment:(ugcPost:7293729211301675009,7294747663462199297)"
          }
        ],
        "commentAdded": "Absolutely agree! Kindness in leadership fosters trust and collaboration. Excited to try out these transformative phrases! 🙌 #LeadershipDevelopment"
      },
      {
        "postId": "urn:li:activity:7294527248013893634",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294527248013893634",
        "url": "https://www.linkedin.com/in/wellness-coach-shefali-80314b15a?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACYbvsMBMLMIPqLKPhjsMTTux4wAX4_aPr8",
        "name": "Wellness Coach Shefali\nWellness Coach Shefali",
        "content": "The Japanese secret to a long, healthy life!\n\n\n What is it? A Japanese practice of eating until you're 80% full, preventing overeating.\n\n Why does it matter?\n\nLinked to longevity and better overall health\n\nSupports digestion and prevents bloating\n\nHelps in weight management naturally\n\nReduces inflammation and improves metabolism\n\nPromotes mindful eating and enhances enjoyment of food\n\nBoosts mental clarity and reduces food-related fatigue\n\n\n How to practice it?\n\nEat slowly and chew well\n\nListen to your hunger cues\n\nStop eating when you feel satisfied, not stuffed\n\nUse smaller plates for better portion control\n\nAvoid distractions like screens while eating\n\nStay hydrated—often thirst is mistaken for hunger\n\n\nBy practicing Hara Hachi Bu, you’re not just eating less, you're choosing a healthier, longer life.\n\n-----------\nI'm a Certified Wellness Coach dedicated to empowering your body, mind and soul, through personalized sessions. I can help you achieve holistic health. DM 'Wellness' and let's walk this journey together.",
        "reactions": {
          "likes": "18",
          "comments": "17 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Mindful eating is very important Wellness Coach Shefali. \nWe generally binge-eat or over-eat, not understanding the side effects that it may create.\nThe 6 points as mentioned by you is a go to rule for healthy habits. Thank you for sharing.",
            "userName": "Sourish Bujarbaruah 📌",
            "userProfileURL": "https://www.linkedin.com/in/sourish-bujarbaruah-%F0%9F%93%8C-358151292",
            "dataId": "urn:li:comment:(activity:7294227872678916097,7294527221833052160)"
          },
          {
            "commentText": "True!\n\nIt's important to eat with awareness, it saves us from overeating and post- eating issues.\n\nThanks for sharing your perspective.\n\nIt's my pleasure to share",
            "userName": "Wellness Coach Shefali",
            "userProfileURL": "https://www.linkedin.com/in/wellness-coach-shefali-80314b15a",
            "dataId": "urn:li:comment:(activity:7294227872678916097,7294562556210229248)"
          }
        ],
        "commentAdded": "Such a simple yet powerful practice! Embracing Hara Hachi Bu can truly transform our approach to food and overall health. Great insights! 🌱"
      },
      {
        "postId": "urn:li:activity:7294628524135497728",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294628524135497728",
        "url": "https://www.linkedin.com/in/nadja-fromm?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAvvscsB24982t2WlpSCF43JolF0xIt3TF0",
        "name": "Nadja Fromm\nNadja Fromm",
        "content": "The difference between a leader and a follower? \n\n\n Innovation\n\n It’s not about following the path\n It’s about creating your own\n\nLeaders don’t wait for opportunities- they make them.\n\nThey embrace change and adapt.\n\n To lead, you must think differently\n Be open to new ideas\n Stay curious\n\nAlways innovate, even when the world tells you to settle.\n\nIt’s not easy, but it’s worth it.\n\nYour ability to innovate will define your success.\n\nDon't follow the crowd. Be the one that leads.\n\nSo, are you ready to innovate and lead your own way?",
        "reactions": {
          "likes": "76",
          "comments": "55 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "That's right, Nadja Fromm. The leaders who dare to think differently today are the ones others will follow tomorrow.",
            "userName": "Damesha Craig, Leadership Coach and Startup Advisor",
            "userProfileURL": "https://www.linkedin.com/in/dameshacraig",
            "dataId": "urn:li:comment:(activity:7294611971230892032,7294629578654814208)"
          },
          {
            "commentText": "Thanks for sharing",
            "userName": "Kris Kluver",
            "userProfileURL": "https://www.linkedin.com/in/kriskluver",
            "dataId": "urn:li:comment:(activity:7294611971230892032,7294613325152202752)"
          },
          {
            "commentText": "Kris Kluver Appreciate you checking it out!",
            "userName": "Nadja Fromm",
            "userProfileURL": "https://www.linkedin.com/in/nadja-fromm",
            "dataId": "urn:li:comment:(activity:7294611971230892032,7294614411925745664)"
          }
        ],
        "commentAdded": "Absolutely! Innovation is key to leadership. Lets embrace change and forge our own paths for success. Ready to lead and inspire! 🚀"
      },
      {
        "postId": "urn:li:activity:7294659408138006528",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294659408138006528",
        "url": "https://www.linkedin.com/groups/13927028?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A13927028-7294631922163470336",
        "name": "Brain Expansion Group\nBrain Expansion Group",
        "content": "𝗪𝗮𝘁𝗲𝗿 𝗣𝗼𝗹𝗹𝘂𝘁𝗶𝗼𝗻: 𝗔 𝗧𝗲𝗰𝗵𝗻𝗶𝗰𝗮𝗹 𝗣𝗿𝗼𝗯𝗹𝗲𝗺 𝗼𝗿 𝗮 𝗛𝘂𝗺𝗮𝗻 𝗠𝗶𝗻𝗱𝘀𝗲𝘁 𝗜𝘀𝘀𝘂𝗲?\n\n\nOur rivers, lakes, and oceans are drowning in pollution. From plastic waste to industrial runoff, water pollution threatens ecosystems, wildlife, and ultimately, human health.\n\n𝗧𝗵𝗲 𝗴𝗼𝗼𝗱 𝗻𝗲𝘄𝘀:\nWe already have a wealth of technological solutions to combat it - advanced filtration systems, AI-driven monitoring, biodegradable materials, and innovative waste management strategies. Science and engineering have provided us with powerful tools to clean our waters.\n\n𝗧𝗵𝗲 𝗯𝗮𝗱 𝗻𝗲𝘄𝘀:\nYet, despite all these advancements, pollution persists. Why?\nBecause technology alone cannot solve a problem rooted in human behavior. Real change begins with a shift in mindset. We must rethink our relationship with nature, embrace responsibility, and act with greater awareness.\nWithout a cultural and behavioral transformation, even the most sophisticated solutions will only be a temporary fix. If we truly want to protect our waters, we need to change not just our methods, but our mindset.\n\n\nI wish everyone a positive start to the week. Deseo a todos un comienzo de semana positivo. मैं सभी को एक सकारात्मक सप्ताह की शुरुआत की शुभकामनाएं देता हूँ।  أتمنى للجميع بداية إيجابية لهذا الأسبوع.  Je souhaite à tous un début de semaine positif. Auguro a tutti un inizio di settimana positivo. Desejo a todos um início de semana positivo.Ich wünsche allen einen positiven Wochenstart.",
        "reactions": {
          "likes": "37",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/38dc78a4-5218-4073-94c5-e4ce44b4cc7b",
        "comments": [],
        "commentAdded": "Absolutely agree! Combating water pollution requires both innovative tech and a fundamental shift in our mindset. Lets lead the change! 🌍💧"
      }
    ],
    "errors": [
      {
        "postId": "urn:li:activity:7294764675756437506",
        "url": "https://www.linkedin.com/in/dereksalyers?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAB1Q2jsBC5a37DJsMBh5iChE4PbOkcBKM-0",
        "errors": [
          "Failed to fetch reactions.",
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294698233040187392",
        "url": "https://www.linkedin.com/in/laraacostar?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADf4bgUB_SYYxrCCxXN6bqAhLp0S6YOWpWU",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294736770515054595",
        "url": "https://www.linkedin.com/in/talha-nasir-831371168?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACfrpmUBPmokWWk1IltNOrF-QFbvtg2Ne04",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294763378034536448",
        "url": "https://www.linkedin.com/in/ford-coleman-hirecollegestudents?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAB-j8SoBBkxNM_nTBIXyTBYbOcZq2blzfaw",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294611270526222336",
        "url": "https://www.linkedin.com/in/koenstam87?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAU5coEB2DP3X847hxxjTn2xkmgxxrYPqjI",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294777442697691137",
        "url": "https://www.linkedin.com/groups/3416532?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A3416532-7294777441586163712",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294740867062341634",
        "url": "https://www.linkedin.com/in/martinwir?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAFNO3ekB0Z9YZYBpWY0u2AKiZzizbChID8k",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294527248013893634",
        "url": "https://www.linkedin.com/in/wellness-coach-shefali-80314b15a?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACYbvsMBMLMIPqLKPhjsMTTux4wAX4_aPr8",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294628524135497728",
        "url": "https://www.linkedin.com/in/nadja-fromm?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAvvscsB24982t2WlpSCF43JolF0xIt3TF0",
        "errors": [
          "Failed to fetch media URL."
        ]
      }
    ]
  },
  {
    "postsData": [
      {
        "postId": "urn:li:activity:7294714855180169216",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294714855180169216",
        "url": "https://www.linkedin.com/in/pjsayswedontridekangaroos?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAJFh10BQ0ERHySEXhv7vGejpMsz6wc7CdI",
        "name": "Paul “PJ” Jackson\nPaul “PJ” Jackson",
        "content": "𝗜𝗳 𝘆𝗼𝘂 𝗰𝗮𝗻’𝘁 𝗺𝗲𝗮𝘀𝘂𝗿𝗲 𝗶𝘁, 𝘆𝗼𝘂 𝗰𝗮𝗻’𝘁 𝗶𝗺𝗽𝗿𝗼𝘃𝗲 𝗶𝘁. \n\nThough, what if AI could reveal exactly where to start, eliminate bottlenecks, and help you scale faster with precision?\n\nThink of your Go-to-Market strategy as a bowtie.\n\nOn one side: 𝗮𝗰𝗾𝘂𝗶𝘀𝗶𝘁𝗶𝗼𝗻 𝘀𝘁𝗿𝘂𝗴𝗴𝗹𝗲𝘀 like awareness, education, and prioritizing leads.\n\nOn the other: 𝗿𝗲𝘁𝗲𝗻𝘁𝗶𝗼𝗻 𝗮𝗻𝗱 𝗲𝘅𝗽𝗮𝗻𝘀𝗶𝗼𝗻 𝗼𝗽𝗽𝗼𝗿𝘁𝘂𝗻𝗶𝘁𝗶𝗲𝘀, such as onboarding, adoption, and driving usage.\n\nThe middle?\n𝗠𝘂𝘁𝘂𝗮𝗹 𝗰𝗼𝗺𝗺𝗶𝘁𝗺𝗲𝗻𝘁—where deals are sealed, and the potential for exponential impact begins.\n\n𝗛𝗲𝗿𝗲’𝘀 𝘄𝗵𝗮𝘁 𝗜𝘃𝗲 𝘀𝗲𝗲𝗻, most teams drown in complexity, chasing too many priorities.\n\nOne fast-growing SaaS startup broke through by reimagining their GTM with AI.\n\nThey started small: identifying onboarding as the biggest hurdle. With AI, they tailored the experience, turning confusion into clarity.\n\nThe result?\n\nA 30% increase in customer activation in just 60 days—a clear, measurable win.\n\n𝗧𝗵𝗲 𝗰𝗵𝗮𝗹𝗹𝗲𝗻𝗴𝗲 𝗺𝗮𝗻𝘆 𝗵𝗮𝘃𝗲: Are you still guessing where AI fits into your GTM?\n\n𝗦𝘁𝗿𝗮𝘁𝗲𝗴𝘆:\n1️⃣ 𝗜𝗱𝗲𝗻𝘁𝗶𝗳𝘆 𝗯𝗼𝘁𝘁𝗹𝗲𝗻𝗲𝗰𝗸𝘀. Where does your process break down and create friction?\n2️⃣ 𝗠𝗮𝗽 𝗮𝗻 𝗔𝗜 𝗿𝗼𝗮𝗱𝗺𝗮𝗽. Focus on KPIs and prioritize actions for maximum impact.\n3️⃣ 𝗙𝗼𝗰𝘂𝘀 𝗮𝗻𝗱 𝗿𝗲𝗳𝗶𝗻𝗲. Train teams on high-value skills, measure progress weekly, and iterate rapidly.\n\n AI isn’t just a tool—it’s your your gateway to reducing costs, driving efficiencies and scalable success.\n\n𝗛𝗶, 𝗜𝗺 𝗣𝗝\nIf you enjoy my content, follow me for more.\n GTM Advisor\n Business Growth Coach\n Revenue Enablement\n 1o1 Mentor",
        "reactions": {
          "likes": "14",
          "comments": "12 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "The SaaS company I speak about above is a software platform for Publishers & Media in case anyone would like to know. ",
            "userName": "Paul “PJ” Jackson",
            "userProfileURL": "https://www.linkedin.com/in/pjsayswedontridekangaroos",
            "dataId": "urn:li:comment:(activity:7294701675196366849,7294767020925964288)"
          },
          {
            "commentText": "I would like to know Paul “PJ” Jackson. :-)",
            "userName": "Ragna Ghoreishi",
            "userProfileURL": "https://www.linkedin.com/in/ragnaghoreishi",
            "dataId": "urn:li:comment:(activity:7294701675196366849,7294776631548624896)"
          },
          {
            "commentText": "It's really challenging to measure things like company culture, customer satisfaction, etc., but I still think we can and should drive to improve them. \n\nSometimes the most important improvements can't be simplified down to a single metric.\n\nDisagree?",
            "userName": "Jason Silver",
            "userProfileURL": "https://www.linkedin.com/in/silverjay",
            "dataId": "urn:li:comment:(activity:7294701675196366849,7294760122050891776)"
          },
          {
            "commentText": "I do believe and work to measure the points you mentioned Jason partly this way...\nCompany Culture - Employee churn and ask for feedback\nCustomer Satisfaction - Funny today I had a 2 hr conversation on this very point and one way is feedback and engagement metrics and also speak with the customers.\n\nI do agree with you also on simplifying the metrics, leaders do over complicate the process and then the data gets lost and or unused. Nothing changes if nothing changes. ",
            "userName": "Paul “PJ” Jackson",
            "userProfileURL": "https://www.linkedin.com/in/pjsayswedontridekangaroos",
            "dataId": "urn:li:comment:(activity:7294701675196366849,7294766564929654785)"
          },
          {
            "commentText": "Paul “PJ” Jackson and Jason Silver - the best way (I am aware of) to measure customer centricity is the MRI Benchmark. it is a holistic model to look at the various dimension collecting employee feedback and makes a lot of sense.",
            "userName": "Ragna Ghoreishi",
            "userProfileURL": "https://www.linkedin.com/in/ragnaghoreishi",
            "dataId": "urn:li:comment:(activity:7294701675196366849,7294777939563327490)"
          }
        ],
        "commentAdded": "Great insights, PJ! AI can truly transform GTM strategies. Excited to see how teams harness its power for greater efficiency and growth! 🚀"
      },
      {
        "postId": "urn:li:activity:7294771576602836996",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294771576602836996",
        "url": "https://www.linkedin.com/in/lance-kaplan-17972811?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAJrvO0BfdwoJ3l9KiWHCsz5SPuBiHjFjjc",
        "name": "Lance Kaplan\nLance Kaplan",
        "content": "I am thrilled by Fragomen’s latest office opening in Pittsburgh and am pleased to welcome a distinguished group of immigration professionals to our firm: Partners,, Larry Lebowitz andand Counsel John Brendel and.\n\nThis accomplished team brings a wealth of experience across industries important to our clients and their businesses. Their insights and expertise will bolster our ability to provide strategic immigration and global mobility solutions to clients in Pittsburgh and beyond, and I look forward to seeing the impact they’ll have as part of Fragomen’s growing global team.",
        "reactions": {
          "likes": "9",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/372391cd-3d1f-45e1-9878-ebf282333de6",
        "comments": [],
        "commentAdded": "Congratulations on the new office opening! Excited to see how this talented team will enhance immigration solutions in Pittsburgh and beyond! 🎉"
      },
      {
        "postId": "urn:li:activity:7294763413161787392",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294763413161787392",
        "url": "https://www.linkedin.com/in/richnazzaro?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABAVBQB8OhNY7JT_ybSOxLhK9n_RybtFrc",
        "name": "Rich Nazzaro\nRich Nazzaro",
        "content": " Super Bowl Leadership: Game-Changing Strategies for Business Success\nChampions Aren’t Born—They’re Built\n\nLast night, the Philadelphia Eagles returned to the Super Bowl, seeking redemption after their loss to the Kansas City Chiefs two years ago. Throughout the season, both teams demonstrated unwavering determination to reach the championship game. Despite a challenging journey, they succeeded. Although the Chiefs were favored to win, the Eagles had other plans.\n\nHow does the big game mirror the business world? Being an underdog doesn't equate to being out of the game. The lessons we learn from winning teams can be invaluable in business.\n\nWinning the Super Bowl isn’t solely about talent—it encompasses strategy, execution, and an unshakable mindset. The same holds true in business. Whether you're leading a startup or an established company, the landscape is ever-changing:\n\nMarket conditions shift.\nCompetitors evolve.\nNew challenges emerge.\n\nOnce the game begins, prior circumstances become irrelevant. Success hinges on preparation, leadership, and the ability to adapt under pressure. In business, you might be entering a competitive market or guiding a team through uncertainty. Regardless of expectations, the key is to:\n\nRemain humble.\nPrioritize your team.\nExecute with precision.\n\nThe best leaders, like the best teams, don’t just show up—they play to win. Here’s how you can apply Super Bowl-level leadership to build a business that thrives under any conditions.\n\nIn our latest blog, I explore several parallels between championship sports teams and successful businesses.",
        "reactions": {
          "likes": "1",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Great insights! The parallels between sports and business are striking—preparation and teamwork truly are key to success in any arena! 🏆"
      },
      {
        "postId": "urn:li:activity:7294603407783292928",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294603407783292928",
        "url": "https://www.linkedin.com/in/preciousemuka?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAD5wceEB94soGaz_L0IuILnMSvh8enq2kVk",
        "name": "Precious Emuka\nPrecious Emuka",
        "content": "Last week, one of my posts went mini viral\n\nAnd here’s what happened:\n\n1000+ engagements\n200+ new followers\n2 calls booked\n\nThe craziest part?\nIt was a short post on lessons LinkedIn taught me.\nAnd I wrote it in less than 10mins.\n\nBut the truth is: It wasn’t always like this.\n\nWhen I started on LinkedIn, I was just posting.\n\nNo stories.\nNo personality.\nJust… words on screen.\n\nGrowth felt so impossible for me.\n\nThat changed when I started sharing my story.\n\nIt was scary putting myself out there. But it worked.\n\nWhy? Because people connect with real stories.\n\nThey want to know YOU.\n\nYour experiences\nYour wins/losses\nYour mistakes\n\nSo if you’re struggling with what to post\n\nJust tell your story.\nAnd it doesn’t need to be perfect.\n\n P.S. Do you share your stories on LinkedIn?\n\n Seeing my post for the first time?\n\nI’mI write content that\nturns your brand into an authority.",
        "reactions": {
          "likes": "283",
          "comments": "199 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "People don't need a post with a lot of big words Precious Emuka\n\nThey just need a post they can relate to",
            "userName": "Blessing Ikpia",
            "userProfileURL": "https://www.linkedin.com/in/blessing-ikpia-54b790244",
            "dataId": "urn:li:comment:(ugcPost:7294591872675594240,7294603348962402304)"
          }
        ],
        "commentAdded": "Inspiring journey!🎉 Sharing your story truly resonates with others. Excited to see what you’ll share next! #Authenticity #LinkedInGrowth"
      },
      {
        "postId": "urn:li:activity:7294748808645619714",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294748808645619714",
        "url": "https://www.linkedin.com/in/elwandab?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAygUMBQiFEXLKqp1sw4ikwiGIzt_9EZ-c",
        "name": "Dr. Elwanda Bennett, MEDP, PMP\nDr. Elwanda Bennett, MEDP, PMP",
        "content": "Authentic Leadership - Unlocking Opportunities & Building Success\n\nEmpowering Leaders | Driving Innovation | Creating Impact\n\nDesigned for professionals who aspire to lead, innovate, and make a difference, this visual identity reflects ambition, strategic thinking, and forward motion**. Whether you're scaling new heights in business, technology, or leadership—this is your time to shine!\n\n Unlock your next big move. Build success. Shape the future.",
        "reactions": {
          "likes": "0",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "“Absolutely inspiring! Authentic leadership truly paves the way for innovation and success. Let’s shape the future together! 🚀”"
      },
      {
        "postId": "urn:li:activity:7294746670284627970",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294746670284627970",
        "url": "https://www.linkedin.com/in/kevin-evans-704847141?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACJ5ZzQBaruZnje0VBDB8x4LX2T_6fTiX2Y",
        "name": "Kevin Evans\nKevin Evans",
        "content": " Crisis Alert: Surging Electricity Demand Is Putting Grids Under Pressure—Are Leaders Ready to Respond?\nThe world’s energy needs are growing faster than our infrastructure can handle:\n Data centers are expanding\n Electric vehicles are becoming mainstream\n Grid failures are becoming more common\nBut here’s the truth: Grid modernization isn’t just about upgrading infrastructure—it’s about leadership. Leaders who wait for failure will pay the price. Those who act now will drive innovation and resilience.\n 3 things leaders must focus on:\n1️⃣ Invest in resilient infrastructure.\n2️⃣ Facilitate collaboration across industries.\n3️⃣ Empower consumers through energy efficiency programs.\nThe opportunity is clear: Proactive leaders will not only solve today’s energy challenges—they’ll build the foundation for sustainable growth.\n What’s the most important step leaders should take to stabilize our grids and meet future demand? Let’s discuss below.",
        "reactions": {
          "likes": "2",
          "comments": "2 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Kevin Evans Very interesting. Thank you for sharing",
            "userName": "Woodley B. Preucil, CFA",
            "userProfileURL": "https://www.linkedin.com/in/woodley-b-preucil-cfa-5926b010",
            "dataId": "urn:li:comment:(activity:7294734716694405120,7294746622033338370)"
          },
          {
            "commentText": "Woodley B. Preucil, CFA, Thank you! The energy crisis is definitely a complex issue, and leadership will play a crucial role in determining whether we address it effectively or react too late. I’d be curious to hear your perspective—what do you think is the most urgent action leaders should take to stabilize grid infrastructure and meet future demand?",
            "userName": "Kevin Evans",
            "userProfileURL": "https://www.linkedin.com/in/kevin-evans-704847141",
            "dataId": "urn:li:comment:(activity:7294734716694405120,7294748218343493632)"
          }
        ],
        "commentAdded": "Investing in resilient infrastructure is crucial! Leaders must act now to ensure a sustainable future and prevent costly grid failures. What’s your take?"
      },
      {
        "postId": "urn:li:activity:7294769734745497600",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294769734745497600",
        "url": "https://www.linkedin.com/groups/4702266?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A4702266-7294766698748911616",
        "name": "Marketing Communication: Digital Advertising Online SEO/SEM Internet Search Mobile Apps Social Media\nMarketing Communication: Digital Advertising Online SEO/SEM Internet Search Mobile Apps Social Media",
        "content": "Maekersuite: The Ultimate AI Tool to Boost YouTube Growth-25\nhttps://lnkd.in/dCXFDaAw\nhashtag\nhashtag\nhashtag",
        "reactions": {
          "likes": "2",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Guest Posting, Link Building, SEO, SMO, or Content Writing! https://www.linkedin.com/feed/update/urn:li:activity:7294243381180780544",
            "userName": "Bhagay Shri",
            "userProfileURL": "https://www.linkedin.com/in/bhagay-shri-317307209",
            "dataId": "urn:li:comment:(groupPost:4702266-7294766698748911616,7294769693083545602)"
          }
        ],
        "commentAdded": "Excited to see how Maekersuite can revolutionize YouTube growth! 🚀 Cant wait to explore this powerful AI tool! #YouTubeGrowth #AIMarketing"
      },
      {
        "postId": "urn:li:activity:7294780913500966912",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294780913500966912",
        "url": "https://www.linkedin.com/in/gokulrajaram1?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAA0PfwB8J0xffl-dBGVjsS5HMwKGgOlY_0",
        "name": "Gokul Rajaram\nGokul Rajaram",
        "content": "Besides their global ambition, one of the unique characteristics of this new generation of Indian founders is their willingness to drop out of college or grad school (even the very best ones) in the US, to start a company, something that was unthinkable in prior generations.\n\nIn the past couple of weeks, I've met entrepreneurs from India who dropped out from Stanford, UCSD, and Georgia Tech. Coming to the US on a student visa and dropping out to start a company requires extreme fearlessness, self-confidence and belief in the problem they're solving.",
        "reactions": {
          "likes": "81",
          "comments": "6 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Also, Financial support back home Gokul Rajaram. Back in the 90s, most of us came to the US taking loans/with very little financial support. Infact for lot of girls like me, we didn't even have family support to come to US or pursue engineering. I am glad to see the shift in the mindset. The bigger question is why are kids coming to undergrad to the US and then dropping out  ...seriously why ?",
            "userName": "Savita Kini",
            "userProfileURL": "https://www.linkedin.com/in/savitakini",
            "dataId": "urn:li:comment:(activity:7294772360807686147,7294778095243247618)"
          },
          {
            "commentText": "Is that a cultural shift driven by the view that they have a global platform to experiment not constrained to opportunities just in US?",
            "userName": "Kamal Srinivasan",
            "userProfileURL": "https://www.linkedin.com/in/kamalsrinivasan",
            "dataId": "urn:li:comment:(activity:7294772360807686147,7294777164132950016)"
          }
        ],
        "commentAdded": "Inspiring to see such bold moves! This generations fearless approach to entrepreneurship is reshaping the startup landscape. 🚀 #Innovation"
      },
      {
        "postId": "urn:li:activity:7294707731288993793",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294707731288993793",
        "url": "https://www.linkedin.com/in/ai-sales-guy?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACi2-U0BjCyq8E4MkJ4MBSpczuF49Yf_Yoc",
        "name": "Ash Smith\nAsh Smith",
        "content": "Get ready for some top-quality CRINGE!\n\nThis was what I was sending when I first got on LI 5 years ago\n\nBut did it work?\n\nNo, of course not, it's RUBBISH!\n\nSo here's what I do now to book calls consistently on LinkedIn using cold DMs\n\n1. Send a slightly strange but funny connection message\n2. Respond with Voicenotes (Bonus points if you're doing some in the background, like cooking or cleaning the bathroom)\n3. Be curious and ask questions\n4. Pretend you're on Tv Gameshow 'Catchphrase' - Say what you see\n5. Don't overthink it, you're just having a chat.\n\nAnd that's it\n\nI wish it was more complicated\n\nThat way I could make money selling the secret sauce\n\nMaybe I'll add an extra 30 unnecessary steps and sell a course for $5997 called \"LinkedIn DM Mastery for the severely socially inept\"\n\nAny takers?",
        "reactions": {
          "likes": "6\nG. Brent Barkin and 5 others",
          "comments": "5 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Now that's what I call a DM Ash",
            "userName": "Dana Daskalova 🟠",
            "userProfileURL": "https://www.linkedin.com/in/dana-daskalova",
            "dataId": "urn:li:comment:(activity:7294695810829615106,7294699865433886720)"
          },
          {
            "commentText": "Dana Daskalova 🟠 People still send stuff like this tho EVERYDAY! ",
            "userName": "Ash Smith",
            "userProfileURL": "https://www.linkedin.com/in/ai-sales-guy",
            "dataId": "urn:li:comment:(activity:7294695810829615106,7294702175513919488)"
          },
          {
            "commentText": "The connection message is good, it’s the follow up that didn’t do you any favours",
            "userName": "Kas Andz",
            "userProfileURL": "https://www.linkedin.com/in/kas-andz",
            "dataId": "urn:li:comment:(activity:7294695810829615106,7294700184129728513)"
          },
          {
            "commentText": "Kas Andz LinkedIn was different back then...",
            "userName": "Ash Smith",
            "userProfileURL": "https://www.linkedin.com/in/ai-sales-guy",
            "dataId": "urn:li:comment:(activity:7294695810829615106,7294701885314195456)"
          }
        ],
        "commentAdded": "Love the humorous take on cold DMs! Simplicity is key—connecting authentically beats overcomplicating any day. Keep it up!"
      },
      {
        "postId": "urn:li:activity:7294745115510611973",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294745115510611973",
        "url": "https://www.linkedin.com/in/kimorlesky?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAALCZbwBGqMh6afE_I9wALf4WQy6dFTvhi4",
        "name": "Kim Orlesky\nKim Orlesky",
        "content": "Monday morning thoughts",
        "reactions": {
          "likes": "20",
          "comments": "2 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "oooooh I’ve always like this one! Thank you for sharing.",
            "userName": "Sheilagh Heron",
            "userProfileURL": "https://www.linkedin.com/in/sheilagh-heron-ba402512",
            "dataId": "urn:li:comment:(activity:7294745115510611973,7294757951305588737)"
          },
          {
            "commentText": "I like this one too. It gives a nice pause and reflection. Am I doing something my younger self would be super excited and proud of me for. Am I living the life that upon reflection I would be proud of the impact I made",
            "userName": "Kim Orlesky",
            "userProfileURL": "https://www.linkedin.com/in/kimorlesky",
            "dataId": "urn:li:comment:(activity:7294745115510611973,7294765241756786688)"
          }
        ],
        "commentAdded": "Great way to kick off the week! 💪 Embracing fresh perspectives on Mondays sets the tone for success ahead. Lets make it a productive one!"
      }
    ],
    "errors": [
      {
        "postId": "urn:li:activity:7294714855180169216",
        "url": "https://www.linkedin.com/in/pjsayswedontridekangaroos?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAJFh10BQ0ERHySEXhv7vGejpMsz6wc7CdI",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294763413161787392",
        "url": "https://www.linkedin.com/in/richnazzaro?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABAVBQB8OhNY7JT_ybSOxLhK9n_RybtFrc",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294603407783292928",
        "url": "https://www.linkedin.com/in/preciousemuka?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAD5wceEB94soGaz_L0IuILnMSvh8enq2kVk",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294748808645619714",
        "url": "https://www.linkedin.com/in/elwandab?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAygUMBQiFEXLKqp1sw4ikwiGIzt_9EZ-c",
        "errors": [
          "Failed to fetch reactions.",
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294746670284627970",
        "url": "https://www.linkedin.com/in/kevin-evans-704847141?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACJ5ZzQBaruZnje0VBDB8x4LX2T_6fTiX2Y",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294769734745497600",
        "url": "https://www.linkedin.com/groups/4702266?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A4702266-7294766698748911616",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294780913500966912",
        "url": "https://www.linkedin.com/in/gokulrajaram1?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAA0PfwB8J0xffl-dBGVjsS5HMwKGgOlY_0",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294707731288993793",
        "url": "https://www.linkedin.com/in/ai-sales-guy?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACi2-U0BjCyq8E4MkJ4MBSpczuF49Yf_Yoc",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294745115510611973",
        "url": "https://www.linkedin.com/in/kimorlesky?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAALCZbwBGqMh6afE_I9wALf4WQy6dFTvhi4",
        "errors": [
          "Failed to fetch media URL."
        ]
      }
    ]
  },
  {
    "postsData": [
      {
        "postId": "urn:li:activity:7294628123659137024",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294628123659137024",
        "url": "https://www.linkedin.com/groups/13927028?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A13927028-7294628122434367488",
        "name": "Brain Expansion Group\nBrain Expansion Group",
        "content": "In a world where resumes are similar, \nhow you use \nhashtag\n#LinkedIn could make all the difference.\nA \nhashtag\n#CV is no longer enough. In today’s \nhashtag\n#competitive job market,\n\nresumes often look the same—similar degrees,\n\ncomparable roles, and overlapping\n.\n\nWhen everyone’s CV tells a similar story,\n\nhow do you stand out?\n\n\nWhy It’s a Problem:\nRecruiters and decision-makers\n\naren’t just looking at what’s on paper anymore.\n\nThey want to know who you are,\n\nwhat you stand for,\n\nand how you think.\n\nAll that before an interview…\n\n\nTraits like\n,\n\nhunger to learn,\n\nand a sense of urgency\n\nare not always visible on a CV,\n\nbut are the deciding factor\n\nin whether you get the job or not.\n\n\nThe Solution:\nThis is where LinkedIn becomes\n\nmore than just a platform…\n\nit’s your personal stage to showcase what your CV cannot.\n\n\n→ Share your perspectives and insights.\n→ Highlight your problem-solving skills through\n.\n→ Build a\nthat reflects your values and work ethic.\n→\nwith others to demonstrate\nand\n.\n\n\nLinkedIn is no longer optional;\n\nit’s essential.\n\n\nIt gives you the power\n\nto go beyond your CV\n\nand show potential employers\n\nwhy you’re the right fit—not just for the role,\n\nbut for the\nand vision of their company.\n\n\n\nYour CV gets you noticed if you get lucky ,\n\nbut your activity on LinkedIn\n\ncan make you unforgettable.\n\nIn a world where resumes are similar,\n\nhow you use LinkedIn\n\ndoes make all the difference.",
        "reactions": {
          "likes": "19\nMarianna Outsia and 18 others",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Absolutely! Your LinkedIn presence can truly set you apart in todays job market. Its all about showcasing your unique value! #StandOut"
      },
      {
        "postId": "urn:li:activity:7294723473870856192",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294723473870856192",
        "url": "https://www.linkedin.com/in/jennifer-brener-seay?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAFATMBC3sNamLU1pt_8UWhxG6HYajV4bs",
        "name": "Jennifer Brener Seay\nJennifer Brener Seay",
        "content": "Luxury retail + AI in the world’s most beautiful city!\n\nTiffany & Co.'s fusion of tech with tradition in Venice is pure magic!\n\nHere's what makes this a visual Masterpiece:\n\nLOCATION GENIUS\n Historic Venetian Gothic backdrop\nTiffany blue  pops against ancient stone\n\nAI INNOVATION\n Interactive holograms\nAR jewelry try-ons\n\nEXPERIENCE PARADIGM\n A visual masterpiece!Celebrates cultural roots with flair\n Tech doesn’t eclipse, it prevails\n\nTradition + innovation = timeless experience!\n\nTiffany & Co. fuses the past with the future in an unforgettable way!\n\nPlease ️ repost to share a Dopamine Dose of Art!\n\nFollowfor more content on the intersection of art, real estate, and business!",
        "reactions": {
          "likes": "35",
          "comments": "34 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/272acb63-c6d7-464c-9dd8-3ccc24910433",
        "comments": [
          {
            "commentText": "Agreed with you! Jennifer Brener Seay\n\nBlending heritage with tech creates a timeless shopping experience.\n\nAI enhances, not replaces, luxury’s rich storytelling tradition.",
            "userName": "Holly Moe",
            "userProfileURL": "https://www.linkedin.com/in/hollyamoe",
            "dataId": "urn:li:comment:(ugcPost:7294437806590898176,7294723465398341632)"
          },
          {
            "commentText": "Holly I love the modern elevation of Tiffany’s classic brand! It is going to receive a ton of exposure through social posts alone.",
            "userName": "Jennifer Brener Seay",
            "userProfileURL": "https://www.linkedin.com/in/jennifer-brener-seay",
            "dataId": "urn:li:comment:(ugcPost:7294437806590898176,7294723992140029953)"
          }
        ],
        "commentAdded": "Absolutely mesmerizing! Tiffany & Co. truly sets the bar for blending tradition and innovation. A stunning experience in a stunning location! 🌟✨"
      },
      {
        "postId": "urn:li:activity:7294746585454800898",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294746585454800898",
        "url": "https://www.linkedin.com/in/sadika-kebbi?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAP84ZIBmyc4GHX-fNpAZSsPuVu3TJ0LAQQ",
        "name": "Sadika Kebbi\nSadika Kebbi",
        "content": "Monday Leadership series!\n\nVision isn’t taught, it’s shared...\n\nGreat leaders turn dreams into collective missions.\n\nHere’s how it works:\n\n→ A true vision sparks unity, not division.\n→ It’s more than words, it’s a shared belief.\n→ People follow when they see the greater good.\n\nWhat does inspiring a shared vision look like?\n\n→ Painting a vivid future everyone can see.\n→ Aligning the vision with the team’s purpose and goals.\n→ Connecting emotionally to individual hopes and dreams.\n\nWhen leaders share their vision:\n\n→ Passion turns into action.\n→ Momentum builds naturally.\n→ Teams achieve the extraordinary together.\n\nYour vision is only as powerful as the people who believe in it.\n\nPS - How are you bringing others into your vision? Share your thoughts in the comments.\n\n\n\n️ Follow me for more insights.\n Repost to inspire your network.\n Comment to spark a meaningful conversation.",
        "reactions": {
          "likes": "20",
          "comments": "4 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Sadika Kebbi Very interesting. Thank you for sharing",
            "userName": "Woodley B. Preucil, CFA",
            "userProfileURL": "https://www.linkedin.com/in/woodley-b-preucil-cfa-5926b010",
            "dataId": "urn:li:comment:(activity:7294595975958953984,7294746577775030272)"
          }
        ],
        "commentAdded": "Absolutely! A shared vision truly transforms potential into achievement. Excited to see how others are bringing their teams along on this journey! 🌟"
      },
      {
        "postId": "urn:li:activity:7294763369016836097",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294763369016836097",
        "url": "https://www.linkedin.com/in/akanksha-buchke?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAEvSEWoBM0l3EuJuZVvFOZ4vxP5mBZ1lkJc",
        "name": "Akanksha Buchke\nAkanksha Buchke",
        "content": "0.99³⁶⁵ = 0.03 \n1.01³⁶⁵ = 37.8 \n\nSmall habits → HUGE results. ",
        "reactions": {
          "likes": "85",
          "comments": "4 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Very helpful",
            "userName": "Suresh Bishnoi",
            "userProfileURL": "https://www.linkedin.com/in/bishnoisuresh",
            "dataId": "urn:li:comment:(activity:7294757787887181825,7294769709978112002)"
          },
          {
            "commentText": "That's TRUE indeed.",
            "userName": "Tuhin Mitra",
            "userProfileURL": "https://www.linkedin.com/in/tuhin-mitra",
            "dataId": "urn:li:comment:(activity:7294757787887181825,7294765251525251075)"
          }
        ],
        "commentAdded": "Absolutely! Its amazing how small, consistent actions can compound over time to create significant impact. Lets commit to those positive habits!"
      },
      {
        "postId": "urn:li:activity:7294754911290875904",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294754911290875904",
        "url": "https://www.linkedin.com/groups/3990648?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A3990648-7294681371501858816",
        "name": "Artificial Intelligence, Machine Learning, Data Science & Robotics\nArtificial Intelligence, Machine Learning, Data Science & Robotics",
        "content": "This is on demand post I got request from my LinkedIn family members who are Preparing for PySpark Interviews this pdf will help you to Master PySpark \n•••••••••••••••••••••••••••••••••••••••••••••••••••••\n\nIn Today's world Data is Most important For the business to Grow and if you want some insights from the Data Spark is Best Option\n\nPySpark is used in many data engineering, data science, and machine learning applications.\n\nIf You Are preparing for Data Engineering Interview then this Document is for you guys it contains PySpark functions which are useful in day to day life for transformation\n\n\n•••••••••••••••••••••••••••••••••••••••••••••••••••••\nFor More Such Content Follow Me\n\nDISCLAIMER \nThis Document is not my work or I'm not trying to frame it as Mine just sharing this to help Students or professional who are preparing for interview or exam.\n\n️️ Credit : Respected Owner ️️\n\n\n••••••••••••••••••••••••••••••••••••••••••••••••••••••",
        "reactions": {
          "likes": "48",
          "comments": "2 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Useful tips",
            "userName": "Jiaen K.",
            "userProfileURL": "https://www.linkedin.com/in/jiaen-k-6a9630225",
            "dataId": "urn:li:comment:(groupPost:3990648-7294681371501858816,7294754897353216000)"
          },
          {
            "commentText": "Jiaen K. Thanks for your support and if you find this post helpfull then consider following me for regular updates and notes like this ",
            "userName": "Allauddin Khan Pathan",
            "userProfileURL": "https://www.linkedin.com/in/allauddin-khan-pathan",
            "dataId": "urn:li:comment:(groupPost:3990648-7294681371501858816,7294772368256733184)"
          }
        ],
        "commentAdded": "Great resource! Mastering PySpark is essential for success in data roles. Thanks for sharing this valuable document with the community! 🚀"
      },
      {
        "postId": "urn:li:activity:7294744136618754048",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294744136618754048",
        "url": null,
        "name": null,
        "content": null,
        "reactions": {
          "likes": "2",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Congrats Samiya! ",
            "userName": "Aastha Soin",
            "userProfileURL": "https://www.linkedin.com/in/aastha-soin-a99b28215",
            "dataId": "urn:li:comment:(activity:7294744136618754048,7294774182616211456)"
          }
        ]
      },
      {
        "postId": "urn:li:activity:7294775111323115520",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294775111323115520",
        "url": "https://www.linkedin.com/in/anthony-camacho-3a143777?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABBChGkB2Md8fBANE3YN5rvHNInESVtwQj4",
        "name": "Anthony Camacho\nAnthony Camacho",
        "content": "Bump bars are an essential part of any Kitchen Display System. And with top-quality parts and obsessive engineering, our Bump Bars remain the industry's best when it comes to function, durability, and value.",
        "reactions": {
          "likes": "3\nChad Horn and 2 others",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Absolutely agree! Investing in quality Bump Bars can elevate kitchen efficiency and performance. Excited to see the innovative solutions you’re creating!"
      },
      {
        "postId": "urn:li:activity:7294692948649095169",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294692948649095169",
        "url": "https://www.linkedin.com/in/dereksalyers?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAB1Q2jsBC5a37DJsMBh5iChE4PbOkcBKM-0",
        "name": "Derek Salyers\nDerek Salyers",
        "content": "Marketing and analytics turn guessing into knowing.\n\nStrategic decisions backed by data crush those solely based on intuition.\n\nDon't trust gut feelings; Trust the numbers.",
        "reactions": {
          "likes": "0",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Absolutely! Leveraging data empowers us to make informed decisions that drive results. Numbers truly don’t lie! 📊💡"
      },
      {
        "postId": "urn:li:activity:7294754623679041537",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294754623679041537",
        "url": "https://www.linkedin.com/groups/762547?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A762547-7294754623175700482",
        "name": "Big Data 🟥 Data Science | Machine Learning | Deep Learning | Artificial Intelligence\nBig Data 🟥 Data Science | Machine Learning | Deep Learning | Artificial Intelligence",
        "content": "I’m \nhashtag\n#hiring. Know anyone who might be interested?",
        "reactions": {
          "likes": "0",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Exciting opportunity! Ill keep an eye out and share with my network. Good luck with the search! 🚀 #TalentAcquisition"
      },
      {
        "postId": "urn:li:activity:7294746183170715648",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294746183170715648",
        "url": "https://www.linkedin.com/in/rickwilliams100?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABIADQBL41w4p9tC6HfWrsxhK2TmbapqG8",
        "name": "Rick Williams\nRick Williams",
        "content": "Create the Future is Making an Impact: \n \n'Certain to inspire, Create The Future is a masterclass in innovative leadership. This book, with its practical insights and transformative strategies, is an essential read for modern leaders. Williams’ expertise guides you from establishing a visionary mindset to executing impactful decisions. A concise, powerful tool for anyone ready to lead their organization into a successful future.' —, Managing Director, Launchpad Venture Group, Cohost, On Boards Podcast and, President, Varuna Strategies, Cohost, On Boards Podcast\n\nLeadership is about shaping what’s next. Create The Future provides a strategic blueprint for navigating complexity, driving innovation, and leading transformative change. Whether you’re scaling a startup or steering an established organization, this book equips you to make bold decisions that define long-term success.\n\nHow are you positioning your organization for innovation and transformation in an evolving world? Comment \n\n Followfor insights on leadership, strategy, and building the future.",
        "reactions": {
          "likes": "140",
          "comments": "39 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Rick Williams Very insightful. Thank you for sharing",
            "userName": "Woodley B. Preucil, CFA",
            "userProfileURL": "https://www.linkedin.com/in/woodley-b-preucil-cfa-5926b010",
            "dataId": "urn:li:comment:(activity:7294742500446019585,7294746171418304512)"
          }
        ],
        "commentAdded": "Excited to explore Create The Future! Its essential for leaders to embrace innovation and shape impactful strategies. What’s your take on its insights?"
      }
    ],
    "errors": [
      {
        "postId": "urn:li:activity:7294628123659137024",
        "url": "https://www.linkedin.com/groups/13927028?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A13927028-7294628122434367488",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294746585454800898",
        "url": "https://www.linkedin.com/in/sadika-kebbi?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAP84ZIBmyc4GHX-fNpAZSsPuVu3TJ0LAQQ",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294763369016836097",
        "url": "https://www.linkedin.com/in/akanksha-buchke?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAEvSEWoBM0l3EuJuZVvFOZ4vxP5mBZ1lkJc",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294754911290875904",
        "url": "https://www.linkedin.com/groups/3990648?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A3990648-7294681371501858816",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294744136618754048",
        "url": "unknown",
        "errors": [
          "Failed to fetch post URL.",
          "Failed to fetch name.",
          "Failed to fetch content.",
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294775111323115520",
        "url": "https://www.linkedin.com/in/anthony-camacho-3a143777?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABBChGkB2Md8fBANE3YN5rvHNInESVtwQj4",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294692948649095169",
        "url": "https://www.linkedin.com/in/dereksalyers?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAB1Q2jsBC5a37DJsMBh5iChE4PbOkcBKM-0",
        "errors": [
          "Failed to fetch reactions.",
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294754623679041537",
        "url": "https://www.linkedin.com/groups/762547?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A762547-7294754623175700482",
        "errors": [
          "Failed to fetch reactions.",
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294746183170715648",
        "url": "https://www.linkedin.com/in/rickwilliams100?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABIADQBL41w4p9tC6HfWrsxhK2TmbapqG8",
        "errors": [
          "Failed to fetch media URL."
        ]
      }
    ]
  },
  {
    "postsData": [
      {
        "postId": "urn:li:activity:7294720153638846464",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294720153638846464",
        "url": "https://www.linkedin.com/in/jordanwilson04?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAF2EO0BaXka5PmlTSX3i8IwsUXlKIDb8ik",
        "name": "Jordan Wilson\nJordan Wilson",
        "content": "Could your company get fined $100 million for using DeepSeek?  \n\nIs OpenAI coming for Salesforce AND Google? \n\nWhat's new in Gemini 2.0? \n\nAI advancements are on fire.\n\nDon't waste hours a day trying to keep up.\n\nJust join us (almost) every Monday as we bring you the AI news that matters.\n\n\nU.S. lawmakers may criminalize Chinese AI tech, OpenAI demos an AI sales agent, Google drops Gemini 2.0 and more -- An Everyday AI chat with Jordan Wilson\n\n==",
        "reactions": {
          "likes": "18",
          "comments": "57 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/2ada8923-dc1a-4d0a-b77a-950c79a71eb0",
        "comments": [
          {
            "commentText": "Zulfiya Forsythe (Akbarova) CPA 300m weekly but looks like 124m daily as of jan 2025",
            "userName": "Zulfiya Forsythe (Akbarova) CPA",
            "userProfileURL": "https://www.linkedin.com/in/zulfiya-forsythe-akbarova-cpa-0214b98",
            "dataId": "urn:li:comment:(ugcPost:7294578983537451010,7294720147460620288)"
          }
        ],
        "commentAdded": "Exciting times in AI! Ready to dive deeper and stay updated each week. Looking forward to the insights from Jordan Wilson! 🚀 #AInews"
      },
      {
        "postId": "urn:li:activity:7294744463166320642",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294744463166320642",
        "url": "https://www.linkedin.com/in/joy-sceizina?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABJmnSYBLWxewdjglOKvp4MuHJ0vFkw0sIk",
        "name": "Joy Sceizina\nJoy Sceizina",
        "content": " You don’t need a certain number of friends, just a number of friends you can be certain of. \n\nIsn’t it funny that for a lot of adults, that popularity-contest-high-school mentality never goes away? Some people tend to think that the number of friends you have correlates to your status. More friends = more popular.\n\nFriends, that wasn’t true in high school and it’s definitely not true in adulthood. Let’s break down a couple myths about that belief.\n\nFirst, popularity and status are absolutely not real. Think back to the popular crowd in high school. Did everyone like them? Probably not. Were they more respected than everyone else? Again, that’s unlikely. It was just a group of people that felt like they had more clout than everyone else. Popularity is such a subjective thing, it should never be the end goal we’re striving for.\n\nSecond, quality over quantity has never been more true than in regards to friendship. It might feel great to have 20 people you can go clubbing with, but that’s pretty meaningless if you don’t have a single person you can talk to about your struggles or life goals.\n\nHere’s my advice for you. Spend your time and energy building a few meaningful friendships with a small circle of people. I’m not saying that you can’t build friendly relationships with a large number of people- because, seriously, what would LinkedIn be without the chance to get to know so many amazing people?! What I am saying is that you need to make sure you have a few close friends that are your go-to people, the ones who are happy to be your emergency contact or go-to phone call when you’ve had a terrible day at work.\n\nBuild a small community of friends who are always there for each other, and I promise, it will change your life.",
        "reactions": {
          "likes": "368",
          "comments": "92 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Absolutely love this post beautiful Joy! Definitely quality friends over quantity! A small circle of TRUE friends is better any day than the choas of a crowd! “A real friend is one who walks in when the rest of the world walks out.” We need to treasure these friendships! Much love always! ️",
            "userName": "Marsha Belote",
            "userProfileURL": "https://www.linkedin.com/in/marshabelote",
            "dataId": "urn:li:comment:(activity:7294730911227514881,7294734394689290241)"
          },
          {
            "commentText": "Marsha Belote isn’t this the gospel truth?",
            "userName": "Joy Sceizina",
            "userProfileURL": "https://www.linkedin.com/in/joy-sceizina",
            "dataId": "urn:li:comment:(activity:7294730911227514881,7294735079421984768)"
          },
          {
            "commentText": "Marsha Belote !! Having selective good friends is like having treasure!!!",
            "userName": "Ken Otuoke",
            "userProfileURL": "https://www.linkedin.com/in/ken-otuoke-ab153214a",
            "dataId": "urn:li:comment:(activity:7294730911227514881,7294757784766590976)"
          },
          {
            "commentText": "Great share, Joy! \n\nThis is so true - popularity is like the wind, it can change in an instant. \n\nWe truly are better off \"building a few meaningful friendships with a small circle of people.\"\n\nThese are the people that you can count on, no matter what.\n\nThese are the people that you could call at 2:00 a.m. in the middle of winter and say that you have a flat tire and need help and they would gladly come help you.\n\nTrue close friends are more than worth their weight in gold.\n\nFriendships like this take time, work and transparency. These are the people that you can trust with your innermost thoughts and struggles.\n\nThese are the ones that you can trust that once you have shared your secrets, you know that information will go no further.\n\nHappy Monday to you! Have a phenomenal day! ",
            "userName": "Mike Darling",
            "userProfileURL": "https://www.linkedin.com/in/mike-darling-darling4n6",
            "dataId": "urn:li:comment:(activity:7294730911227514881,7294769023706112003)"
          },
          {
            "commentText": "Mike Darling thanks so much. Have a wonderful week ahead. I keep my circle small",
            "userName": "Joy Sceizina",
            "userProfileURL": "https://www.linkedin.com/in/joy-sceizina",
            "dataId": "urn:li:comment:(activity:7294730911227514881,7294769833370361856)"
          }
        ],
        "commentAdded": "Absolutely agree! Quality friendships are invaluable. A strong support system can truly transform our personal and professional lives. Lets connect!"
      },
      {
        "postId": "urn:li:activity:7294777558108160004",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294777558108160004",
        "url": "https://www.linkedin.com/groups/13927028?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A13927028-7294777557072195584",
        "name": "Brain Expansion Group\nBrain Expansion Group",
        "content": "Fact: AI is not just a tool—it’s a revolution.\nThe rules of business are being rewritten. \nEntrepreneurs and business owners who choose \n\nto ignore this shift\n\nrisk falling behind.\n\n\nBut those who seize the opportunity,\n\nmaster the tools,\n\nand harness AI to their advantage?\n\n\nThey won’t just survive—they’ll dominate.\n\n\nHere’s the truth:\n\n• AI can automate tasks you never thought possible.\n• It can analyze data faster than any human.\n• It can unlock creativity, innovation, and efficiency at levels we’ve never seen before.\n\n\nBut the key isn’t just having access to AI.\n\nIt’s knowing how to use it.\n\n\n\nThe winners will be the ones\n\nwho are fearless learners,\n\nthe ones who embrace change\n\ninstead of resisting it.\n\n\nSo ask yourself:\nAre you leveraging AI\n\nto grow your business—or are you\n\nletting your competitors take the lead?\n\nThe choice is yours.",
        "reactions": {
          "likes": "3\nMarianna Outsia and 2 others",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Absolutely! Embracing AI is essential for success. Lets leverage its potential to drive innovation and stay ahead in the game! 💡🚀 #AIRevolution"
      },
      {
        "postId": "urn:li:activity:7294733958783610880",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294733958783610880",
        "url": "https://www.linkedin.com/in/nandanmullakara?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABvEZABJR0Jzx_8rmw-qR4xldptcwf7pqg",
        "name": "Nandan Mullakara\nNandan Mullakara",
        "content": " Are you ready for the agentic revolution in automation?\n\nAs I delve deeper into discussions with various providers, a clear pattern emerges: agentic capabilities are becoming the cornerstone of all digital automation.\n\n Cloud, BPM, RPA, IPaaS, IDP, and process mining providers are aligning toward agentic capabilities. This convergence isn't just a trend; it's a survival strategy. The past is no longer a predictor of future success.\n\n The future belongs to those who pivot and agilely enable Agentic solutions.\n\nNew products such as Microsoft's Copilot Studio, Palantir AIP, BM's Watsonx, Automation Anywhere's Agent Studio, and UiPath Agent Builder evidence this convergence.\n\n The blurring lines between Intelligent Automation (IA), Digital Process Automation (DPA), Integration Platforms (iPaaS), IDP, and Process Mining signal an inevitable shift towards Agentic Process Automation now & autonomous AI agents in the future.\n\n This isn't just an evolution; it's a revolution. The world of automation is transforming, and those who adapt will thrive.\n\nJoin our APA session this week where we dive deeper:\n\n\nWhat do you think?\n\n----\n\n Follow for Agentic AI, Gen AI & RPA trends:",
        "reactions": {
          "likes": "72",
          "comments": "7 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Join our APA session this week where we dive deeper:\n\nhttps://share.botnirvana.org/Tl6w",
            "userName": "Nandan Mullakara",
            "userProfileURL": "https://www.linkedin.com/in/nandanmullakara",
            "dataId": "urn:li:comment:(activity:7294716994933702657,7294717469456248833)"
          },
          {
            "commentText": "At Ensylon, we're excited to be part of this revolution, where innovation and autonomy are shaping the future.",
            "userName": "Ensylon",
            "userProfileURL": "https://www.linkedin.com/company/ensylon/posts",
            "dataId": "urn:li:comment:(activity:7294716994933702657,7294725915488530432)"
          },
          {
            "commentText": "Ensylon Awesome! ",
            "userName": "Nandan Mullakara",
            "userProfileURL": "https://www.linkedin.com/in/nandanmullakara",
            "dataId": "urn:li:comment:(activity:7294716994933702657,7294755626704850945)"
          }
        ],
        "commentAdded": "Absolutely agree! Embracing agentic capabilities is essential for future success in automation. Excited to explore this shift further! 🚀"
      },
      {
        "postId": "urn:li:activity:7294696743990878208",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294696743990878208",
        "url": "https://www.linkedin.com/company/seceon/posts",
        "name": "Seceon Inc.\nSeceon Inc.",
        "content": "We're \nhashtag\n#hiring a new Senior Software Security Engineer in Varanasi, Uttar Pradesh. Apply today or share this post with your network.",
        "reactions": {
          "likes": "6",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Exciting opportunity! 🌟 If you have a passion for software security, dont miss out. Lets build a safer tech future together! #JobOpportunity"
      },
      {
        "postId": "urn:li:activity:7294732403405668354",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294732403405668354",
        "url": "https://www.linkedin.com/in/thomasmilana?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAqHmA0BpxhVHFv2PHgdQSI1fVbtwb5sdR8",
        "name": "Tom R. Milana\nTom R. Milana",
        "content": "By capitalizing on these opportunities, entrepreneurs can leverage the Baby Boomer retirement wave to acquire established businesses with proven track records and built-in customer bases.\n\n\n\nReady to buy a business? Contact us today!",
        "reactions": {
          "likes": "2",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Tom, Great insights! The Baby Boomer retirement wave truly presents a unique opportunity for entrepreneurs to step into well-established businesses with loyal customer bases. It's exciting to think about the potential for growth and innovation in these ventures. For anyone ready to take the plunge, reaching out to you seems like a fantastic first step. Best of luck to all the future business owners out there! ",
            "userName": "Deborah Thompson",
            "userProfileURL": "https://www.linkedin.com/in/deborah-thompson-leadership-coach",
            "dataId": "urn:li:comment:(activity:7294732403405668354,7294767317043798018)"
          }
        ],
        "commentAdded": "Great insights! This is a fantastic opportunity for entrepreneurs to build on established successes. Excited to see the next wave of ventures!"
      },
      {
        "postId": "urn:li:activity:7294754300939935744",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294754300939935744",
        "url": "https://www.linkedin.com/groups/4702266?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A4702266-7294754278936657921",
        "name": "Marketing Communication: Digital Advertising Online SEO/SEM Internet Search Mobile Apps Social Media\nMarketing Communication: Digital Advertising Online SEO/SEM Internet Search Mobile Apps Social Media",
        "content": "Product link: https://lnkd.in/dsE3wKKW \n\nProtect your furniture from scratches with this cat scratcher\n\nRedirect your cat’s natural scratching instincts to this toy, saving your couches and rugs from damage.\n\nEngage your furry friend with an interactive toy that never gets boring. The rolling ball and honeycomb design ensure endless fun as your cat bats, chases, and explores.",
        "reactions": {
          "likes": "8",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/83c94999-870a-43ad-9476-cbb5d66a6f8e",
        "comments": [],
        "commentAdded": "Love this idea! Protecting furniture while keeping our cats engaged is a win-win. Cant wait to see my furball enjoy this! 🐾"
      },
      {
        "postId": "urn:li:activity:7294582279375396864",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294582279375396864",
        "url": "https://www.linkedin.com/in/rajan-luthra?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACSQaLYBJklQJuhYwmuAySHAL2NdauDCCg0",
        "name": "Rajan Luthra\nRajan Luthra",
        "content": "If you are in HR then you shouldn’t miss this \n\nThe first five hires can define a startup’s success. As a Founder, I know this firsthand—which is why I understand the critical role HR plays in shaping a business.\n\nBut with startups navigating M&As, layoffs, and a stronger focus on diversity, HR leaders today need to go beyond traditional practices. They must embrace GenAI, automation, and strategic workforce planning to stay ahead.\n\nThat’s why we’re launching the CHRO Fellowship a program designed to equip HR leaders with the skills of tomorrow, in partnership with top mentors like:\n\n\nAnd we’re thrilled to have exceptional fellows likein our founding cohort.\n\nThis is your last chance to be part of this exclusive first batch and learn from the best.\n\nApply now -\n\nJoin us in shaping the future of HR. ",
        "reactions": {
          "likes": "211",
          "comments": "35 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Wow! Rajan Luthra ",
            "userName": "Tejaswee Tripathy",
            "userProfileURL": "https://www.linkedin.com/in/tejaswee-tripathy",
            "dataId": "urn:li:comment:(activity:7294573303623491584,7294582241937014785)"
          },
          {
            "commentText": "Tejaswee Tripathy yeahhh",
            "userName": "Rajan Luthra",
            "userProfileURL": "https://www.linkedin.com/in/rajan-luthra",
            "dataId": "urn:li:comment:(activity:7294573303623491584,7294587608137879553)"
          }
        ],
        "commentAdded": "Exciting initiative! Transforming HR with innovation and strategic skills is essential for startup success. Best of luck to all applicants! 🌟"
      },
      {
        "postId": "urn:li:activity:7294736464309825538",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294736464309825538",
        "url": "https://www.linkedin.com/in/dr-julie-gurner?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAG2cF8BEwiZDUr3CO8_L-dsaKkIOsepJPY",
        "name": "Dr. Julie Gurner\nDr. Julie Gurner",
        "content": "A very real, and very important question to ask yourself:\nHow are you thinking about & planning for AI to continue to move into your business and work?\n\nWhile no one knows what the future holds, I wrote briefly about what I’ve seen in the top 1% that makes them less likely to be disrupted in the near future…\n\n...and how you can position yourself to be undisruptable.\n\nHere's how to start thinking about this now.",
        "reactions": {
          "likes": "9\nKenneth Holley and 8 others",
          "comments": "2 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "No doubt. AI isn’t coming—it’s here. The top 1% adapt fast, integrate smarter, and stay ahead. If you’re not planning for it now, you’re already behind.",
            "userName": "Ryan Ray 🦏",
            "userProfileURL": "https://www.linkedin.com/in/ryanraysr",
            "dataId": "urn:li:comment:(activity:7294704535925587969,7294785791937925120)"
          },
          {
            "commentText": "the ai wave is exciting, but it's our adaptability and unique human insights that will keep us ahead. ",
            "userName": "Wolfgang Kriesel",
            "userProfileURL": "https://www.linkedin.com/in/wolfgang-kriesel",
            "dataId": "urn:li:comment:(activity:7294704535925587969,7294708728505782272)"
          }
        ],
        "commentAdded": "Great insights! Embracing AI strategically will be crucial for staying ahead. Excited to learn more about your thoughts on this!"
      },
      {
        "postId": "urn:li:activity:7294761010861617152",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294761010861617152",
        "url": "https://www.linkedin.com/in/staciesussman?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAC7VrQB5GhC13FmkYFoyPH2YFcNDVrGzgI",
        "name": "Stacie Sussman\nStacie Sussman",
        "content": "We’re always chasing \nthe next milestone, \nthe next goal, \nthe next version of success.\n\nAnd that’s a really good thing.\n\nBeing surrounded by ambitious\npeople who push forward\nis what fuels growth.\n\nAnd we’re all in on that!\n\nBut here’s what we\ndon’t do often enough,\nlook back.\n\n—> Look back at where\nwe started.\n\n—> Look back at the challenges\nwe overcame.\n\n—> Look back at the moments\nwe thought we wouldn’t make it,\nbut did.\n\nGrowth of course is reaching\nthe next level.\n\nBut it’s also about recognizing\nhow many levels we’ve\nalready climbed.\n\nJust look at the Philadelphia Eagles.\n\nAfter losing to the Kansas City Chiefs\nin the Super Bowl two years ago,\nthey fought their way back and\nsecured a 40-22 win.\n\nThey didn’t just redeem themselves,\nthey proved their resilience,\nlearned from their losses,\nand came back stronger.\n\nSo today, take a second.\n\nLook ahead at where you’re going.\n\nThen turn around and appreciate\njust how far you’ve come.\n\nBecause that progress?\n\nThat resilience?\n\nThat’s the real win.",
        "reactions": {
          "likes": "8\nDaren Lauda and 7 others",
          "comments": "2 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Such a powerful reminder to celebrate our journeys and the lessons learned along the way. ",
            "userName": "TeeProud",
            "userProfileURL": "https://www.linkedin.com/company/teeproud/posts",
            "dataId": "urn:li:comment:(activity:7294701669844484096,7294703693084467201)"
          },
          {
            "commentText": "Comparing ourselves is oftentimes a trap for being not-so-nice to ourselves... except when we compare ourselves today to our previous selves. \n\nI've trained my mind to reflect this way and it feels great to think of my own progress... and it's also fuel to keep going!",
            "userName": "Greg Garunov",
            "userProfileURL": "https://www.linkedin.com/in/greggarunov",
            "dataId": "urn:li:comment:(activity:7294701669844484096,7294742637008285697)"
          }
        ],
        "commentAdded": "What an inspiring perspective! Celebrating our journey and resilience fuels future success. Here’s to recognizing every step weve taken! 🌟"
      }
    ],
    "errors": [
      {
        "postId": "urn:li:activity:7294744463166320642",
        "url": "https://www.linkedin.com/in/joy-sceizina?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABJmnSYBLWxewdjglOKvp4MuHJ0vFkw0sIk",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294777558108160004",
        "url": "https://www.linkedin.com/groups/13927028?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A13927028-7294777557072195584",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294733958783610880",
        "url": "https://www.linkedin.com/in/nandanmullakara?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABvEZABJR0Jzx_8rmw-qR4xldptcwf7pqg",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294696743990878208",
        "url": "https://www.linkedin.com/company/seceon/posts",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294732403405668354",
        "url": "https://www.linkedin.com/in/thomasmilana?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAqHmA0BpxhVHFv2PHgdQSI1fVbtwb5sdR8",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294582279375396864",
        "url": "https://www.linkedin.com/in/rajan-luthra?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACSQaLYBJklQJuhYwmuAySHAL2NdauDCCg0",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294736464309825538",
        "url": "https://www.linkedin.com/in/dr-julie-gurner?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAG2cF8BEwiZDUr3CO8_L-dsaKkIOsepJPY",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294761010861617152",
        "url": "https://www.linkedin.com/in/staciesussman?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAC7VrQB5GhC13FmkYFoyPH2YFcNDVrGzgI",
        "errors": [
          "Failed to fetch media URL."
        ]
      }
    ]
  }
]