{
  "posts": [
    {
      "postId": "urn:li:activity:7287465213849751552",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287465213849751552",
      "url": "https://www.linkedin.com/in/theadampboyd?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAACKocEBPj0z4uEHAzd013N-f5ty27yCiIM",
      "name": "Adam P. Boyd\nAdam P. Boyd",
      "content": "In the middle of a 0-10 football season in high school. \n\nOne of our coaches said:  “Everyone says you suck. Just don’t suck.”\n\nTo which one of our players responded, “Thanks for the inspiration, Lombardi.” \n\nSometimes, having success doesn’t mean being great. It does mean being a little better than we are.\n\nIn sales, sometimes, YOU are the problem.\n\nSince May of ‘22, one of our clients (who we trained) has seen:\n\nA (near) doubling of their conversion (closing) rate without cutting price\nA 2.5x on their annual billing run rate\nImproved cash flow by 70%\nPrice increases of 15% WHILE increasing closing rates\n\nHere are two massive mistakes the sales reps were making that wrecked their close rates (before working with me):\n\nOvereducating\nNot listening\n\nI tell my clients: “If someone is talking to you, there’s a reason. Job #1 is to find out why. Stop assuming.”\n\nThe structure of a consult is then something like this:\n\nUnderstand the need (stated)\nFind the compelling reason driving this person to take action\nQuantify what’s at stake\nDetermine if they’re committed to solving the problem\nAnd then uncover how they’re going to select a solution/partner/etc.\n\n\nAt the end of the day, if you’re not closing, it’s most likely you.\n\nTry to find ways to suck a little less.\n\n------------------------------------------------------------------\nLooking to make your team suck a little less, and sell a little more?\nDM me. Maybe I can help, maybe I can't. We can find out together.",
      "reactions": {
        "likes": "7",
        "comments": "1 comment",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "I totally would have said that quip and would have had to run gassers after practice. Hehehe",
          "userName": "Doug Lawson",
          "userProfileURL": "https://www.linkedin.com/in/doug-lawson-marketing",
          "dataId": "urn:li:comment:(activity:7287465213849751552,7287480921744621569)"
        }
      ],
      "commentAdded": "Great insights! It’s all about continuous improvement. Focusing on listening and understanding can truly transform sales success! 🚀"
    },
    {
      "postId": "urn:li:activity:7287507677461598209",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287507677461598209",
      "url": "https://www.linkedin.com/in/casilver?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABOvi8BpDolSdNlztZC6JkVCnsL8NBpO1w",
      "name": "Claude Silver\nClaude Silver",
      "content": "The workplace isn’t a factory—it’s an ecosystem. It’s not about rigid processes, assembly lines, or control mechanisms. It’s a living, dynamic network of people, relationships, and shared goals. Like any ecosystem, it thrives when there’s balance, trust, and alignment.\n\nTrust is the soil. It’s where growth begins. Without it, collaboration withers, creativity stalls, and teams struggle to adapt. Trust is the foundation that nourishes the ecosystem.\n\nPurpose is the sunlight. It gives energy and direction, helping everything grow toward a common goal. Purpose aligns the ecosystem, connecting individual contributions to a larger mission and creating a shared sense of meaning.\n\nWhen the environment is right, we don’t need to force outcomes. The results will follow.\n\nHealthy ecosystems don’t just survive—they thrive, grow, and sustain everyone within them. That’s the future of work. ",
      "reactions": {
        "likes": "10",
        "comments": "3 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Love this. Happy Tuesday to you, Claude.",
          "userName": "Jason Politte",
          "userProfileURL": "https://www.linkedin.com/in/jason-politte",
          "dataId": "urn:li:comment:(activity:7287506013497278464,7287506522597703681)"
        },
        {
          "commentText": "What a great analogy Claude! Thanks for posting :-)",
          "userName": "Karin Volo",
          "userProfileURL": "https://www.linkedin.com/in/karinvolo",
          "dataId": "urn:li:comment:(activity:7287506013497278464,7287506788487245825)"
        }
      ],
      "commentAdded": "Absolutely! A thriving workplace ecosystem fosters collaboration and innovation. Trust and purpose truly make all the difference! 🌱✨"
    },
    {
      "postId": "urn:li:activity:7287495864971919360",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287495864971919360",
      "url": "https://www.linkedin.com/in/matthewbuchalski?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAHq5rcBUODCOiAZTTtYH3Xvrex0EdMFjpA",
      "name": "Matthew Buchalski\nMatthew Buchalski",
      "content": "Investing in multifamily real estate? You need to understand return metrics.\n\nBut if you're not a financial analyst, it can be overwhelming.\n\nSo, let's keep it simple.\n\nThere are two key return metrics you need to understand:\n\n1. Cash-on-Cash Return\n2. Internal Rate of Return (IRR)\n\nCash-on-cash return is easy to understand. It's the percentage of cash generated by the property relative to the amount you invested.\n\nIRR is a more detailed metric that accounts for the time value of money and factors in the length of the investment, cash flows, and the terminal value of the property.\n\nBoth these metrics, when analyzed together, can give you a comprehensive understanding of how an investment property will perform over the investment horizon.\n\nSo, when making investment decisions, make sure these metrics are analyzed.\n\nInvest smart and enjoy the returns!\n\nWant to learn more about Multifamily Investing? Sign up for our newsletter and create your Investor Profile here -",
      "reactions": {
        "likes": "0",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": "blob:https://www.linkedin.com/a4f6efa0-94b4-4fc3-b482-133579449839",
      "comments": [],
      "commentAdded": "Great breakdown of these key metrics! Understanding Cash-on-Cash and IRR is vital for smart multifamily investment decisions. Thanks for sharing!"
    },
    {
      "postId": "urn:li:activity:7287468997942411265",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287468997942411265",
      "url": "https://www.linkedin.com/in/alex-turnbull-1ab9992?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAACAYtMB_ahNSSaY_yym6KikVRWc-UeBn6s",
      "name": "Alex Turnbull\nAlex Turnbull",
      "content": "Last night, I saw a Jason M. Lemkin post about \"founder regrets\" that irritated the hell out me. Jason listed all the things founders would ‘regret\":\n\n- Not paying up for top hires\n- Under-hiring\n- Not raising more money\n- Not being closer to customers\n- Not doing enough biz dev\n- Having too high burn rate\n- Founder conflict\n\nYou know what's ironic?\n\nI had just spoken to a founder who followed Jason's playbook to the letter.\n\nRaised $40M, landed that sweet $25M Series B at a $200M valuation in 2021.\n\nHe thought he was on the SaaStr success path.\n\nNow? Total zombie company.\n\nAfter drinking the VC kool-aid, he went on the exact hiring and spending spree Jason preaches.\n\nBuilt out a bloated \"enterprise platform\", spent millions on those \"can't-miss top hires\" that Jason insists you'll regret not overpaying for.\n\nFor 6 months, it looked like the SaaStr formula was working.\n\nARR climbing, logos landing, VCs applauding.\n\nThe last 18 months?\n\nA masterclass in why this advice is stuck in the past.\n\nLayoffs, toxic culture, customers fleeing.\n\nHere's what Jason won't tell you:\n\nBefore that Series B, when they were ignoring the VC wisdom, they were lean, focused, product-driven, with actual product-market fit.\n\nThe real kicker?\n\nTheir ARR today is right back to pre-Series B levels.\n\nBefore all that \"smart money\" came in.\n\nBut now instead of being capital efficient, they're burning cash.\n\nInstead of a focused product solving real problems, they've got a bloated platform chasing the enterprise dreams Jason is talking about.\n\nThe last 8 quarters have been brutal. No way out.\n\nThey burned through runway following the SaaStr playbook.\n\nNo path to the 10x return their investors expected.\n\nI almost fell for it too.\n\nIn 2016, I nearly killed Groove trying to play by these rules–chasing VC validation, forcing growth, building for potential investors instead of customers.\n\nBut unlike my friend who's stuck with a zombie company...\n\nAs a bootstrapped founder, I could ignore the VC \"wisdom\". Focus on actual customer value.\n\nWe cut waste. Double down on product. Listen to customers, not conference keynotes.\n\nHit rough patches sure, but built something real that I fully control.\n\nWhat's next for my VC-backed friend? It hurts to watch.\n\nWhat's next for us? Building real value at our own pace.\n\nHere's my 2025 regret list for founders:\n\n-If you can bootstrap (hint: you can)... bootstrap.\n\nLet’s stop selling founders the 2015 playbook.\n\nThe game has changed.",
      "reactions": {
        "likes": "30",
        "comments": "14 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Been a fan of your writing for a long time Alex Turnbull and this one sure hits hard. Well written again! What an irony that founders still crave for large ticket deals instead of making their product the best out there.",
          "userName": "Karthik Subramanian",
          "userProfileURL": "https://www.linkedin.com/in/karthiksmanian",
          "dataId": "urn:li:comment:(activity:7287468997942411265,7287470438539018240)"
        },
        {
          "commentText": "Karthik Subramanian Thank you Karthik :) \n\nIt definitely has been an inverted reality many founders have been living in.",
          "userName": "Alex Turnbull",
          "userProfileURL": "https://www.linkedin.com/in/alex-turnbull-1ab9992",
          "dataId": "urn:li:comment:(activity:7287468997942411265,7287501397665673216)"
        },
        {
          "commentText": "Keep these coming, Alex. Super super helpful. Mainstream tech media won't tell these stories :)",
          "userName": "Victor Ijidola",
          "userProfileURL": "https://www.linkedin.com/in/content-strategist-victor",
          "dataId": "urn:li:comment:(activity:7287468997942411265,7287484324084391936)"
        },
        {
          "commentText": "Victor Ijidola Thanks Victor :)",
          "userName": "Alex Turnbull",
          "userProfileURL": "https://www.linkedin.com/in/alex-turnbull-1ab9992",
          "dataId": "urn:li:comment:(activity:7287468997942411265,7287501690071572480)"
        }
      ],
      "commentAdded": "A powerful reminder that sometimes, less is more! Focusing on customer value and sustainable growth can lead to lasting success. 💡 #FounderWisdom"
    },
    {
      "postId": "urn:li:activity:7287204949782839297",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287204949782839297",
      "url": "https://www.linkedin.com/in/westmcdonaldco?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAEvxMQBQ77AN3_0OXUHuUpKcY6AMaxm8us",
      "name": "West McDonald\nWest McDonald",
      "content": "Lesley Stratford and I have had a few days to digest all the incredible sessions from \nhashtag\n#ECS25, and here are GoWest.ai's \nhashtag\n#top5 take aways!\n\n\n\n\n,,,,,,,,,,,,,,,,,,",
      "reactions": {
        "likes": "15",
        "comments": "2 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "This event gets better each year \nhashtag\n#ECS Thanks for all the great insights \nhashtag\n#GoWestAI We have a lot to digest and act on in 2025!!",
          "userName": "Rick Penney",
          "userProfileURL": "https://www.linkedin.com/in/rick-penney22",
          "dataId": "urn:li:comment:(activity:7287204949782839297,7287214163158794241)"
        },
        {
          "commentText": "So great to see you and Lesley - and to celebrate your birthday! ",
          "userName": "Laura Blackmer",
          "userProfileURL": "https://www.linkedin.com/in/laura-blackmer-5176973",
          "dataId": "urn:li:comment:(activity:7287204949782839297,7287499677510324224)"
        }
      ],
      "commentAdded": "Great insights! Excited to hear about the top takeaways from #ECS25. Looking forward to seeing how GoWest.ai will implement these ideas!👏"
    },
    {
      "postId": "urn:li:activity:7284835786028408833",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7284835786028408833",
      "url": "https://www.linkedin.com/in/blessing-ikpia-54b790244?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADygsAsBE3EnPxCYA_zzPihIYwYLIfwhOQg",
      "name": "Blessing Ikpia\nBlessing Ikpia",
      "content": "Land your dream job in 30 days \n\nby using this formula \n\nNETWORKING \n\nDear Young/Aspiring professional, have you heard the saying that your network is your NET WORTH ?\n\nNetworking has been the key to so many of the opportunities I’ve had throughout my career (not just in terms of landing jobs). It has helped me grow my knowledge, meet incredible people and find mentors who’ve guided me through the ups and downs.\n\nIf you’re not networking, you’re missing out. But networking isn’t just about attending events or exchanging business cards, it’s about forming real, genuine relationships with people in your industry. It’s about supporting others, sharing insights and collaborating.\n\nTo build a network that will help you grow, start by:\n\n Engaging online: Join groups on LinkedIn, Twitter, and Facebook. Participate in discussions and offer value where you can.\n\n Attending events: Webinars, meetups, and conferences (whether in-person or virtual), are great ways to meet like-minded people.\n\n Reaching out: Don’t be afraid to send a message to someone you admire or someone working in your dream company.\n\nIn truth, Networking is a long-term investment in your career. It’s about building relationships that will support you through the highs and lows of your journey.\n\nBut you can get ahead in 30 days by intentionally reaching out to people you admire, connect with them on linkedin, send them a mail... just get started\n\nAre you in? Let me know in the comment section.\n\nI'm, a Growth Marketer. I share my professional journey and resources like Free courses, job vacancies, Mentorship program to young and aspiring professionals seeking global opportunities in their career. If this resonates with you, welcome onboard",
      "reactions": {
        "likes": "44",
        "comments": "21 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "The opportunities that networking with people has brought my way is just out of this world\n\nnetworking should be a necessity",
          "userName": "Brenda Blanche",
          "userProfileURL": "https://www.linkedin.com/in/brendablanche",
          "dataId": "urn:li:comment:(ugcPost:7284835782589042690,7284910853441683459)"
        }
      ],
      "commentAdded": "Absolutely agree! Networking is key to career growth. Let’s connect and support each other on this journey! #CareerGrowth #Networking"
    },
    {
      "postId": "urn:li:activity:7287506759303249921",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287506759303249921",
      "url": "https://www.linkedin.com/in/bsulka?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAWXnUB8D7lyzCft7sqGtCcJB4wtmVOwk0",
      "name": "Brian Sulka\nBrian Sulka",
      "content": "The Accountability Gap: Bridging Strategy and Execution\n\n\"Plans are only good intentions unless they immediately degenerate into hard work.\" — Peter Drucker, The Effective Executive\n\nSometimes I see leadership teams frustrated because, despite having a strong strategy, they struggle to turn it into meaningful action. This disconnect can lead to stalled progress and unmet goals, even when the effort is there.\n\nThe Scorecard, a cornerstone of EOS, helps solve this by making accountability visible and measurable. Recently, a leadership team I worked with struggled to hit their sales goals because follow-ups were slipping through the cracks. With a weekly Scorecard, they identified the problem, adjusted their process, and saw a 25% increase in sales within a quarter.\n\nEOS turns plans into progress by bringing clarity and focus to execution.\n\nAre you ready to make your strategy actionable? Let’s talk about how a Scorecard can help your team gain traction and accountability.",
      "reactions": {
        "likes": "3\nJon W. Lassiter and 2 others",
        "comments": "2 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Accountability is essential for turning strategy into action, and the Scorecard is a powerful tool to make that happen.",
          "userName": "Jon W. Lassiter",
          "userProfileURL": "https://www.linkedin.com/in/jon-w-lassiter",
          "dataId": "urn:li:comment:(activity:7287484077962588162,7287506748641292288)"
        }
      ],
      "commentAdded": "Great insights! Transforming strategy into action is crucial. A Scorecard truly makes accountability achievable. Excited to see teams thrive!"
    },
    {
      "postId": "urn:li:activity:7287505651570819074",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287505651570819074",
      "url": "https://www.linkedin.com/in/marcrandolph?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAESBRABM_oNqcEYjHrVQLl74riMx8N9Sd0",
      "name": "Marc Randolph\nMarc Randolph",
      "content": "When was the last time you fired someone from your family?\n\n“Son, your mother and I have been talking, and we’ve decided to outsource ‘taking out the trash’. I’m afraid we’re going to have to let you go.”\n\nAt Netflix, for example, we never thought of ourselves as a family. We always considered ourselves more like a sports team. And not a Little League team, where everyone gets to play and at the end of the season everyone gets a trophy.\n\nNo, we were a professional team playing at the highest level, and my responsibility as manager wasn’t to make sure everyone got playing time. It was to make sure I put the best possible team on the field for every game. I did that because I owed that to the team owners. I owed it to the fans. And most importantly, I owed it to the other players.\n\nI learned a long time ago that what the best players want is not just a friendly attitude in the locker room. They want to know that everyone excels at their position. They want to know that everyone will be trying as hard as they can. They want to win.\n\nThat’s why a manager’s job is not just to hire well and motivate your team to be the best they can be. It’s also to make sure that when someone isn’t holding their end, you’re the person who sits them down and explains why you’re sending them down to the minors.\n\nThis is especially hard in a startup, because in almost every case, the players you start with aren’t going to be the ones you finish with. At the beginning, you’re looking for generalists. Since you don’t yet know what they will need to be great at, you want people who are good at a lot of things. You want people who are comfortable with the fact that their job description is going to change weekly. You want people who are motivated by the adventure, rather than by stability.\n\nThat first team is going to give you everything they have. They’ll leave better paying jobs with great benefits to work for a fraction of their salary. They’ll work nights and weekends. They’ll do everything you ask—and then some.\nSo it’s especially brutal when your company is just starting to take off, and you have to sit someone down and tell them that they won’t be coming with you on the next stage of the journey. Or that you’re bringing in a more experienced executive over them.\n\nThat part is neither easy nor fun. But it’s the job. And if I can’t do that, I don’t deserve to be in my position either.",
      "reactions": {
        "likes": "906",
        "comments": "77 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Ive had a few disciplinary hearings from my parents back in my teenage years.",
          "userName": "Will Koning",
          "userProfileURL": "https://www.linkedin.com/in/willmeritt",
          "dataId": "urn:li:comment:(activity:7287493247906562049,7287507130423660545)"
        }
      ],
      "commentAdded": "Insightful perspective! Balancing team dynamics and performance is tough but essential for success. Tough decisions lead to stronger teams! 💪🎯"
    },
    {
      "postId": "urn:li:activity:7287506060662255617",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287506060662255617",
      "url": "https://www.linkedin.com/in/colinsteele?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADZAsMBQtvHNKAfr_reyc96CUMa32sp5zo",
      "name": "Colin Steele\nColin Steele",
      "content": "\"Maybe I can go out on my own.\"\n\nThis was one of my first thoughts when I lost my job in September.\n\nBut I quickly shot it down.\n\nI needed a stable job, I told myself. Besides, I figured it would take a long time to find enough work to make up for a full-time salary.\n\nSo I picked up some work here and there while I focused on my job search.\n\nThen, in December, a couple things happened:\n\n1. A job opportunity I thought I had — one that I was really looking forward to — fell through. And I didn't have any other prospects on the horizon.\n\n2. I looked at the list of freelance assignments I had on my plate and realized, \"This is more than 'some work here and there.' Maybe I can actually do this now.\"\n\nAfter crunching the numbers, having lots of conversations with my extremely supportive family and talking with some of my freelancer friends, I decided:\n\nI'm going into business for myself.\n\nSo far I've been doing a little bit of everything: content writing and editing, website copywriting, PR and social media. I'm going to keep doing that.\n\nBut my long-term vision is to focus on helping B2B tech founders and execs build their brands through thought leadership. That's something I've enjoyed doing a lot of at my past jobs and had a lot of success with.\n\nAm I scared? Yes — but not any more scared than I'd be if I were starting a new job or continuing to navigate this horrible job market.\n\nThere are no guarantees that any of those paths will work out.\n\nSo I'm picking the one that I have control over.",
      "reactions": {
        "likes": "10",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Inspiring journey! Embracing uncertainty takes courage. Excited to see you thrive in your new venture and support B2B tech leaders!"
    },
    {
      "postId": "urn:li:activity:7287266755612225536",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287266755612225536",
      "url": "https://www.linkedin.com/in/lukewilsonsignpostceo?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAfuI5kBl2qBFzTl1Tb5LL34gufpdEd9q-c",
      "name": "Lucas Wilson\nLucas Wilson",
      "content": "Please take a look at this opportunity. \n1. This will develop your skills and get you to the next level professionally. \n2. One of the few high velocity experts. Be apart of something great.",
      "reactions": {
        "likes": "4",
        "comments": "1 comment",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Thanks Lucas Wilson! ",
          "userName": "A.J. Mahar",
          "userProfileURL": "https://www.linkedin.com/in/alanmaharjr",
          "dataId": "urn:li:comment:(activity:7287266755612225536,7287273227540660224)"
        }
      ],
      "commentAdded": "Exciting opportunity! 🚀 Elevating your skills with top experts can truly transform your career. Don’t miss out on being part of something great!"
    }
  ],
  "errors": [
    {
      "postId": "urn:li:activity:7287465213849751552",
      "url": "https://www.linkedin.com/in/theadampboyd?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAACKocEBPj0z4uEHAzd013N-f5ty27yCiIM",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287507677461598209",
      "url": "https://www.linkedin.com/in/casilver?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABOvi8BpDolSdNlztZC6JkVCnsL8NBpO1w",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287495864971919360",
      "url": "https://www.linkedin.com/in/matthewbuchalski?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAHq5rcBUODCOiAZTTtYH3Xvrex0EdMFjpA",
      "errors": [
        "Failed to fetch reactions."
      ]
    },
    {
      "postId": "urn:li:activity:7287468997942411265",
      "url": "https://www.linkedin.com/in/alex-turnbull-1ab9992?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAACAYtMB_ahNSSaY_yym6KikVRWc-UeBn6s",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287204949782839297",
      "url": "https://www.linkedin.com/in/westmcdonaldco?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAEvxMQBQ77AN3_0OXUHuUpKcY6AMaxm8us",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7284835786028408833",
      "url": "https://www.linkedin.com/in/blessing-ikpia-54b790244?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADygsAsBE3EnPxCYA_zzPihIYwYLIfwhOQg",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287506759303249921",
      "url": "https://www.linkedin.com/in/bsulka?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAWXnUB8D7lyzCft7sqGtCcJB4wtmVOwk0",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287505651570819074",
      "url": "https://www.linkedin.com/in/marcrandolph?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAESBRABM_oNqcEYjHrVQLl74riMx8N9Sd0",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287506060662255617",
      "url": "https://www.linkedin.com/in/colinsteele?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADZAsMBQtvHNKAfr_reyc96CUMa32sp5zo",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287266755612225536",
      "url": "https://www.linkedin.com/in/lukewilsonsignpostceo?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAfuI5kBl2qBFzTl1Tb5LL34gufpdEd9q-c",
      "errors": [
        "Failed to fetch media URL."
      ]
    }
  ]
}