{
  "posts": [
    {
      "postId": "urn:li:activity:7286076167130894336",
      "url": "https://www.linkedin.com/in/rickconlowservantleadership?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAPUxFwB6p1p6ESvdwgOkdRMuNdW3KDrJTU",
      "name": "Richard A. Conlow\nRichard A. Conlow",
      "content": "Have you shared a smile or helping hand today? https://buff.ly/2MVRHo1\nhashtag\n#leadership \nhashtag\n#management \nhashtag\n#servantleadership \nhashtag",
      "reactions": {
        "likes": "0",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": []
    },
    {
      "postId": "urn:li:activity:7286075793233850368",
      "url": "https://www.linkedin.com/in/richkingrecruiter?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAM_kegBOwf-CNSjl-e9pZc_VECLU27iUzM",
      "name": "Richard King\nRichard King",
      "content": "The \"official\" data from the Bureau of Labor and Statistics (BLS) is 6 months. 6 months to find a new job. \n\nMy advice? Plan for 9-12 months. Maybe even longer if you're targeting remote roles.\n\nIt is a marathon! It is a long, arduous journey!! Please plan effectively. Mentally, physically, and financially!!\n\nFellowship and community will get us through this storm ",
      "reactions": {
        "likes": "2",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": []
    },
    {
      "postId": "urn:li:activity:7285622903088336896",
      "url": "https://www.linkedin.com/in/ychowdhury?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACaawXcBYYg0wn5Vr6gmk98Pheyl7k_znN8",
      "name": "Yash Chowdhury\nYash Chowdhury",
      "content": "We had one of customers go from \n\n1 to 5 to 25 \n\nFully Managed SDRs with us with full customisation",
      "reactions": {
        "likes": "13",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": []
    },
    {
      "postId": "urn:li:activity:7286030136087400448",
      "url": "https://www.linkedin.com/in/leslievenetz?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADPju4B9I-KSyVAlH2xAmiN72f5wsayOtM",
      "name": "Leslie Venetz\nLeslie Venetz",
      "content": "Me: '2025 is going to be THE year!'\n\nAlso me: Staring at my empty pipeline after every 'call me next year' prospect said, 'Actually, we’re good for now.'\n\nIt’s fine. I’m fine.\n\n\nOkay but FR, I've already invoiced $92,550 in 2025.\n\nBEST YEAR YET.\n\n\n How are your January pipeline dreams looking?",
      "reactions": {
        "likes": "49",
        "comments": "20 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": " How are your January pipeline dreams looking?",
          "userName": "Leslie Venetz",
          "userProfileURL": "https://www.linkedin.com/in/leslievenetz",
          "dataId": "urn:li:comment:(activity:7286021755213594624,7286022056545075200)"
        },
        {
          "commentText": "Brad Jarvie dang!!! That is a GREAT start to the year. Congrats!!!",
          "userName": "Leslie Venetz",
          "userProfileURL": "https://www.linkedin.com/in/leslievenetz",
          "dataId": "urn:li:comment:(activity:7286021755213594624,7286028648317366273)"
        },
        {
          "commentText": "Leslie Venetz thank you very much my friend    ",
          "userName": "Brad Jarvie",
          "userProfileURL": "https://www.linkedin.com/in/brad-jarvie-06532212b",
          "dataId": "urn:li:comment:(activity:7286021755213594624,7286029731588636673)"
        },
        {
          "commentText": "Thanks for sharing your journey and achievements. ",
          "userName": "Alex D",
          "userProfileURL": "https://www.linkedin.com/in/alexdanylenko",
          "dataId": "urn:li:comment:(activity:7286021755213594624,7286031492613390338)"
        },
        {
          "commentText": "Alex D trying to be a little serious and a little silly!!",
          "userName": "Leslie Venetz",
          "userProfileURL": "https://www.linkedin.com/in/leslievenetz",
          "dataId": "urn:li:comment:(activity:7286021755213594624,7286034978382004224)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7286023852256636929",
      "url": "https://www.linkedin.com/in/stevelitzow?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAOjBwBP9nWnY_-6KWhJLV-EzTXeRDsxTg",
      "name": "Steve Litzow\nSteve Litzow",
      "content": "Big deal about to close... but it’s not the ICP?\n\nWhen I work on refining sales strategies for scale ups, I always include a validation step.\n\nIt comes after the proposal and negotiation.\n\nIt’s an internal step for:\n– The CEO or VP of Sales to review the deal.\n– The SDR or sales manager to self-analyze.\n– An item to discuss during weekly or monthly deal reviews.\n\nThe key focus of validation?\n\nDouble-check the customer still fits your ICP.\n\nIt’s overlooked because:\n– The SDR wants to hit quota.\n– The sales manager wants to hit quota.\n– Or simply, the revenue is too tempting to resist.\n\nBut if you’re serious about scaling to 8 or 9 figures, you must take this step.\n\nYou must reconsider going ahead if the ICP isn’t the right fit.\n\nHere’s why…\n\nI recently read a story from Jake Fuentes, co-founder of Cascade, about why he shut his startup down.\n\nHe admitted that “ICP fray” was a key factor.\n\nCascade initially defined their ICP as “nontechnical business analysts using Excel to crunch big data sets”.\n\nThe definition was too broad.\n\nThey ended up chasing customers with wildly different use cases:\n– A scooter company managing location data.\n– An HR team managing employee data.\n\nThey didn’t have a framework to accept or reject opportunities, so they tried to support them all.\n\nJake described this as “a slow death of a thousand cuts.”\n\nSupporting anyone and everyone pulled the company in a million directions, ultimately diluting their focus and stunting growth.\n\nIf you want to scale successfully, rejecting deals from prospects who don’t fit your ICP is the tough but necessary way forward.\n\nValidate every deal.\n\nStick to your guns.\n\nKeep closing.\n\nLike what you read? ️ Repost it to your network and follow Steve Litzow for more.\n\nWant to accelerate your sales? Join our community of CEOs & Sales Leaders subscribers today:",
      "reactions": {
        "likes": "16",
        "comments": "8 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Staying true to your ICP is crucial for growth. Misaligned deals might boost short-term revenue but often lead to inefficiencies and lost focus. Discipline here pays dividends!",
          "userName": "Neil Sarkar",
          "userProfileURL": "https://www.linkedin.com/in/neil-sarkar",
          "dataId": "urn:li:comment:(activity:7286008448524107776,7286023806983225345)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7286015580480888833",
      "url": "https://www.linkedin.com/in/michaelocean?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABRkVVcBdJXrbHnrLNPe5NG3L1FNnS_LDdw",
      "name": "Michael Ocean\nMichael Ocean",
      "content": "Want better results as an enabler? \nGet out of your office and into the trenches.\n\n\nMy guest(Engineering Enablement Leader at OpenText, ex-Salesforce) shared a powerful truth about leadership that many enablement professionals miss: Being present with your teams isn't just about checking boxes – it's about creating real impact through small interactions.\n\n\nHere are key questions every enablement leader should reflect on:\n\n- When was the last time you sat in the sales pit and actually listened to what frustrates your team?\n- How often do you join team meetings as an observer before building your programs?\n- Are you waiting for permission to get involved, or are you proactively seeking ways to understand your audience?\n\n\nIn the full episode, we covered:\n\n- How to measure success when traditional metrics don't apply\n- Building trust through \"controlled failure\" and supportive leadership\n- Creating impact in large organizations while maintaining startup agility\n- Why being hands-on as a leader never goes out of style\n\n\nCheck out the full conversation in the comments ",
      "reactions": {
        "likes": "15",
        "comments": "2 comments",
        "shares": "0"
      },
      "mediaUrl": "blob:https://www.linkedin.com/c4455046-91a3-49f3-9f8c-3f582655094a",
      "comments": [
        {
          "commentText": "Full episode here: https://youtu.be/TG8pN_AZzvA",
          "userName": "Michael Ocean",
          "userProfileURL": "https://www.linkedin.com/in/michaelocean",
          "dataId": "urn:li:comment:(ugcPost:7286015361810923520,7286015707555770369)"
        },
        {
          "commentText": "Mi hermana…150%…I’m definitely a hands on enabler, regardless of title. I want to build relationships and trust and the only way you do that is get in their day to day, create feedback loops, get your ear to the ground….otherwise you’re left with not knowing what the hell is going on!",
          "userName": "Crystal Nikosey",
          "userProfileURL": "https://www.linkedin.com/in/crystalnikosey",
          "dataId": "urn:li:comment:(ugcPost:7286015361810923520,7286072525636153346)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7283482720561721344",
      "url": "https://www.linkedin.com/in/jakedunlap?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAENCicB0qY59ybik0DUN4FzM8lk0Rq6bjk",
      "name": "Jake Dunlap\nJake Dunlap",
      "content": "It's that time of year for the \"what I did and didn't get done in 2024 post\"\n\nAlright....dunking update and more from my personal/professional 2024 Goals\n\n2024 was a full of highs and lows but overall....I'll give myself about a B/B+\n\nI built a few great habits (workout routine, one month in Costa Rica, paying myself an appropriate amount)\n\nI wrote a National Best Seller and hit #22 on the USA Today List in all books (beating the Taylor Swift bio book and almost passing Atomic Habits for a week)\n\nI set a goal last year to speak to an audience over 500 people and accomplished that, in Brazil too, which was really amazing...and my family in the front row \n\nI'm making a BIG shift for 2025 to how I do goal setting and will revaluate in April\n\n Moving away from 6 month goal setting with micro targets to 3 months goals with micro targets\n\nI think having goals 6 months out allowed me to slip into \"I still have 4 months....\" mindset. Everyone knows what I mean and going to try something new for 2025.\n\nI will keep doing a weekly review, every Thursday morning, on how I am pacing but am shrinking it to 15 minutes and committing to not moving it. 8am Thursday on the dot and keep it blocked\n\nNo...I did not dunk a basketball in 2024\n\nThis one is annoying because I know this possible but I just couldn't get my weight down far enough. Talking to my trainer, this is probably what will have the biggest impact. It's like losing a 20lb weight vest.\n\nPlan to adjust for 2025? Shorter term weight/BMI goals and post two posts a month with progress. Rain or shine, I'll post an update next week (I hate this immediately but know it's good for how my brain works)\n\nIf you didn't hit everything you set out to achieve last year...don't worry about it...neither did anyone else\n\nThe key is to keep trying and keep looking for new ways that work for you ",
      "reactions": {
        "likes": "74",
        "comments": "16 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "While the author's shift to 3-month goals seems logical, renowned psychologist Dr. Angela Duckworth argues that grit and long-term commitment are better predictors of success. Her research shows that people who maintain 12-month or longer goals typically achieve more significant results because they develop deeper resilience and stay focused on the bigger picture.\n\nThe weekly 15-minute check-ins might be too brief to create meaningful accountability. Performance coach Tony Robbins suggests spending at least 30-45 minutes on progress reviews to properly assess obstacles and adjust strategies.",
          "userName": "Mark Donnigan",
          "userProfileURL": "https://www.linkedin.com/in/markdonnigan",
          "dataId": "urn:li:comment:(ugcPost:7283147163214192640,7284619665635495937)"
        },
        {
          "commentText": "Mark Donnigan Great insights. I think the key is to find a process that works for you. If my new strategy doesn't work, this makes sense",
          "userName": "Jake Dunlap",
          "userProfileURL": "https://www.linkedin.com/in/jakedunlap",
          "dataId": "urn:li:comment:(ugcPost:7283147163214192640,7284634420274176002)"
        },
        {
          "commentText": "Amazing work beating out T-Swift bio book. I think that’s #1  \n\nGreat update Jake Dunlap— I’m running a lean version of EOS. All about 90-day rocks. Good content on there via YouTube and in the book “Traction”.",
          "userName": "Andrew Kappel",
          "userProfileURL": "https://www.linkedin.com/in/andrewkappel",
          "dataId": "urn:li:comment:(ugcPost:7283147163214192640,7283491740966092801)"
        },
        {
          "commentText": "EOS is amazing. We started implementing it about 6 months ago and game changer",
          "userName": "Jake Dunlap",
          "userProfileURL": "https://www.linkedin.com/in/jakedunlap",
          "dataId": "urn:li:comment:(ugcPost:7283147163214192640,7283519966753050624)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7286027840813166594",
      "url": "https://www.linkedin.com/in/davidlorango?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADIXfsBjASfnTRxRgIxkqXGR-KsDN_c3wk",
      "name": "David Lorango\nDavid Lorango",
      "content": "This is why I said - don't panic.",
      "reactions": {
        "likes": "1",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": []
    },
    {
      "postId": "urn:li:activity:7286031925981425664",
      "url": "https://www.linkedin.com/in/amir-tabch?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACtovxcBQFgProDaob15jIuBjp9gl70BoRA",
      "name": "Amir Tabch\nAmir Tabch",
      "content": "Ever meet a \nhashtag\n#CEO who thrives on making others miserable? Let me save you some time: they’re an idiot. Yes, I said it. If cruelty is their calling card, you don’t need a 20-point\nassessment to know they’ve failed the most basic test of humanity. Allow me to explain.\n\nWhen we encounter someone who doesn’t look, sound, or act like us, our brains have a knack for throwing up caution signs faster than a malfunctioning stoplight. It’s not because we’re bad people—it’s because evolution taught us to be wary of the unfamiliar. Back in the day, that cautious instinct kept our ancestors alive when the \"unfamiliar\" might have had claws, fangs, or a serious attitude problem.\n\nHere’s the twist:\nisn’t something that comes naturally in those moments. It’s a deliberate act of pushing past our instinctive reactions to see the human being on the other side. Being kind means choosing to rewrite our gut reactions, ditching the “fight or flight” response for a more thoughtful, empathetic approach. It’s not the path of least resistance; it’s the path of most growth.\n\nA cruel CEO isn’t just stuck in this primal loop—they’re setting up camp there. Research from U-M has shown that cruelty, even in small doses, poisons organizational culture, driving down employee morale, productivity, & even health. People don’t just hate working for cruel bosses—they actively underperform to escape them. Translation: Cruelty isn’t just morally bankrupt; it’s also terrible for business.\n\nYou might think, “But wait, aren’t cruel CEOs just hyper-driven, high performers?” Nope. The truth is, cruelty usually masks insecurity or incompetence. According to a study by Stanford, leaders who rely on dominance & intimidation often lack the emotional intelligence needed to inspire trust & loyalty. In other words, they’re all bark & no brain.\n\nNow let’s get down to numbers. Companies led by kind, empathetic CEOs consistently outperform those helmed by jerks. A study by HBR found that organizations with empathetic leadership saw 17% higher productivity, 20% better employee retention, & 50% fewer sick days. The bottom line? Kindness pays, & cruelty costs.\n\nisn’t a sign of weakness; it’s a marker of strength. It takes courage to rise above primal instincts, to make the hard decisions while treating others with dignity. In fact, Kindness is classified as a strength within the virtue category of humanity, according to the VIA Institute of Character. So, the next time someone says, “Kindness is weakness” feel free to whip out your psychological receipts & let them know they’re objectively wrong. A CEO who can’t pass the kindness test is failing at leadership, plain & simple.\n\nIf you spot cruelty in a CEO, don’t stick around for the performance review—run. Great leaders build bridges, not burn them. They leave people better than they found them, & they inspire others to do the same. Cruel\n? They’re not just unfit to lead—they’re unfit to represent humanity at its best.",
      "reactions": {
        "likes": "462\nJason Bramble and 461 others",
        "comments": "8 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "I'm curious to know what experience you had Amir Tabch in regards to this! I faced something similar few months ago and I totally get your thoughts.",
          "userName": "Jean Kalfayan",
          "userProfileURL": "https://www.linkedin.com/in/jeankalfayan",
          "dataId": "urn:li:comment:(activity:7285981639468306433,7285995859840765952)"
        },
        {
          "commentText": "Jean Kalfayan, experience? You mean experiences! Oh, I’ve had plenty—enough to fill a book, though the title might be unprintable. I’ve crossed paths with my share of these so-called “leaders” and even worked alongside some, which taught me exactly one thing: I never, ever want to be like them.\n\nHere’s the kicker: in my post, I’m not suggesting you be nice. Nice is polite, superficial, and often spineless. Kindness, on the other hand, requires strength, clarity, and yes, a backbone.\n\nAs for the actual stories—well, those are best shared over virtual coffee, not in a LinkedIn comment section. Let me know when you’re free. I’ve got tales.",
          "userName": "Amir Tabch",
          "userProfileURL": "https://www.linkedin.com/in/amir-tabch",
          "dataId": "urn:li:comment:(activity:7285981639468306433,7285998696628957185)"
        },
        {
          "commentText": "Amir Tabch for sure! Let’s hop on the chat",
          "userName": "Jean Kalfayan",
          "userProfileURL": "https://www.linkedin.com/in/jeankalfayan",
          "dataId": "urn:li:comment:(activity:7285981639468306433,7286021452846292992)"
        },
        {
          "commentText": "Absolutely agree! Integrating AI with human empathy can revolutionize leadership, fostering a more authentic and impactful organizational culture. Let's prioritize emotional intelligence alongside technological advancements.",
          "userName": "SMB Solutions HelpDesk",
          "userProfileURL": "https://www.linkedin.com/company/smb-solutions-helpdesk/posts",
          "dataId": "urn:li:comment:(activity:7285981639468306433,7285991685552005120)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7286042086628282368",
      "url": "https://www.linkedin.com/in/theangelngele?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADIlBjgBCu33RaaiWkBet0oUaLRthBR64R8",
      "name": "Angel Ngele\nAngel Ngele",
      "content": "Good communication isn’t just about talking. It’s about connecting.\n\nHere are 7 simple ways to become a better communicator:\n\n1. Listen first – People want to feel heard.\n2. Speak clearly – Simple words are stronger than fancy ones.\n3. Be confident – Believe in what you’re saying.\n4. Ask questions – It shows you care.\n5. Adapt to your audience – Speak their language (not literally, but you get it).\n6. Use body language – A smile can say more than words.\n7. Practice storytelling – Stories stick with people.\n\nThe key?\n\nCommunication isn’t about sounding smart. It’s about making others feel understood.\n\nRepost this if you’ll try one of these tips. ️\n\nNow it’s your turn…\n\nP.S. Which one will you focus on improving this week? Share in the comments, I’d love to hear.",
      "reactions": {
        "likes": "14",
        "comments": "6 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Love this post! Communication truly is the bridge to understanding, and your tips are spot-on. Listening first is such a powerful reminder, it’s amazing how much we can learn when we pause to truly hear others. \n\nI’ll be working on storytelling this week; it’s such a compelling way to connect.",
          "userName": "Yehia EL HOURI",
          "userProfileURL": "https://www.linkedin.com/in/yehia-el-houri",
          "dataId": "urn:li:comment:(activity:7286042086628282368,7286053330013802496)"
        },
        {
          "commentText": "Communication is like a bridge - both sides must meet halfway.  ",
          "userName": "George Khoshtaria",
          "userProfileURL": "https://www.linkedin.com/in/georgekhoshtaria",
          "dataId": "urn:li:comment:(activity:7286042086628282368,7286070351208271872)"
        }
      ]
    }
  ],
  "errors": [
    {
      "postId": "urn:li:activity:7286076167130894336",
      "url": "https://www.linkedin.com/in/rickconlowservantleadership?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAPUxFwB6p1p6ESvdwgOkdRMuNdW3KDrJTU",
      "errors": [
        "Failed to fetch reactions.",
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7286075793233850368",
      "url": "https://www.linkedin.com/in/richkingrecruiter?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAM_kegBOwf-CNSjl-e9pZc_VECLU27iUzM",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285622903088336896",
      "url": "https://www.linkedin.com/in/ychowdhury?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACaawXcBYYg0wn5Vr6gmk98Pheyl7k_znN8",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7286030136087400448",
      "url": "https://www.linkedin.com/in/leslievenetz?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADPju4B9I-KSyVAlH2xAmiN72f5wsayOtM",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7286023852256636929",
      "url": "https://www.linkedin.com/in/stevelitzow?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAOjBwBP9nWnY_-6KWhJLV-EzTXeRDsxTg",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7283482720561721344",
      "url": "https://www.linkedin.com/in/jakedunlap?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAENCicB0qY59ybik0DUN4FzM8lk0Rq6bjk",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7286027840813166594",
      "url": "https://www.linkedin.com/in/davidlorango?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADIXfsBjASfnTRxRgIxkqXGR-KsDN_c3wk",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7286031925981425664",
      "url": "https://www.linkedin.com/in/amir-tabch?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACtovxcBQFgProDaob15jIuBjp9gl70BoRA",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7286042086628282368",
      "url": "https://www.linkedin.com/in/theangelngele?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADIlBjgBCu33RaaiWkBet0oUaLRthBR64R8",
      "errors": [
        "Failed to fetch media URL."
      ]
    }
  ]
}