{
  "posts": [
    {
      "postId": "urn:li:activity:7284630683992363010",
      "url": "https://www.linkedin.com/in/yuriiveremchuk?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABwJlYABf1pwmgqAZCzukF9kE0FQOHvI9NI",
      "name": "Yurii Veremchuk\nYurii Veremchuk",
      "content": "Don't send a LinkedIn DM that starts with: \"Hope this message finds you well”\n\nWhy so serious?... Try doing this instead:\n\n1 Relevant + Good Timing + Personalised\n• 2-3 sentences max. Make it look like a text, not an email.\n• Let your “why” stand out in the 1st line of a DM.\n\n2. Value + Social Proof\n• Show that the Status QUO is not desirable by focusing on Cost of Inaction\n• Infuse social proof = build trust faster\n\n3. End strongly\n• End with ONE clear call-to-action.\n• Be super specific about what you’re asking for\n\nUse this formula if you want\n\nName - <observation>, <value>. <social proof> + <risk reversal>. <CTA>.\n\n Personalized + relevant + direct-to-the-point DMs are evergreen.\n\nWhat would you add?",
      "reactions": {
        "likes": "1,210\nJeff Roberts and 1,209 others",
        "comments": "204 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "In 99 % their message does not find me well.  ",
          "userName": "Daria P.",
          "userProfileURL": "https://www.linkedin.com/in/daria-p-663545221",
          "dataId": "urn:li:comment:(activity:7284552789358206977,7284563155937054720)"
        },
        {
          "commentText": "Daria P. Haha same here",
          "userName": "Yurii Veremchuk",
          "userProfileURL": "https://www.linkedin.com/in/yuriiveremchuk",
          "dataId": "urn:li:comment:(activity:7284552789358206977,7284572117935792129)"
        },
        {
          "commentText": "Daria P. That sucks. I'm well at the very least 50% of the time. If you're genuinely not well 99% of the time I think your problems are bigger than LinkedIn. ",
          "userName": "Oliver Gateley",
          "userProfileURL": "https://www.linkedin.com/in/olivergateley",
          "dataId": "urn:li:comment:(activity:7284552789358206977,7284573928629366785)"
        },
        {
          "commentText": "I love your humor. do you have a good example to share?",
          "userName": "Berna Geylani",
          "userProfileURL": "https://www.linkedin.com/in/demandgenerationleader",
          "dataId": "urn:li:comment:(activity:7284552789358206977,7284623365586259969)"
        },
        {
          "commentText": "Berna Geylani good example of a joke? :) or a DM?",
          "userName": "Yurii Veremchuk",
          "userProfileURL": "https://www.linkedin.com/in/yuriiveremchuk",
          "dataId": "urn:li:comment:(activity:7284552789358206977,7284627238078091264)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7284560572396765185",
      "url": "https://www.linkedin.com/in/daniel-goodman2001?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAeS6L0BdHsGXRto-nWwwPVPt8hNYJ4niZI",
      "name": "Dan Goodman\nDan Goodman",
      "content": "Write the check. \n\nWriting a $100k commission check to a top rep should be a dream come true for any organization.\n\nIf you built a comp plan and you’re paying a rep a $100k commission against your plan, you should be celebrating. Literally. You both won massively.\n\nPay the $100k and send the rep and their spouse on a trip. Encourage them to post about it and shout it from the rooftops.\n\nDon’t fire them and steal from them. How it ever became an option never mind a consideration is beyond me.\n\nTake the opportunity to throw a company-wide celebration. Get a blown-up check (2’ x 4’) and present it to the rep in front of the entire company. Nothing will be more motivating for everyone.\n\nTalk about building corporate culture, trust, and camaraderie. This is how you attract and retain top talent. Pay them for what they are, rock stars that drive your revenue.\n\nThat $100k check is attached to a $1m deal. Which could add $10m in enterprise value to an early stage company. Think about it.\n\nDon't let your ego get in the way of running and growing your company. It is OK to pay a top rep more than the c-suite earns. They have the equity. They have the big, fat year-end bonuses earned off the backs of their reps.\n\nLet's all win together. Do the right thing. It will cost you a lot more in the long run than any savings today.\n\nLong-term view > short-term view every day.\n\nWrite the check, you owe it to your rep and your company.",
      "reactions": {
        "likes": "213\nDoug Landis and 212 others",
        "comments": "29 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Dan Goodman are you saying don’t celebrate a salesperson taking the company to a revenue milestone never seen before in all hands and then let them go an hour later offering peanuts severance? \n\nYes would agree",
          "userName": "Darin Alpert",
          "userProfileURL": "https://www.linkedin.com/in/darinalpert",
          "dataId": "urn:li:comment:(activity:7284560572396765185,7284587632750116865)"
        },
        {
          "commentText": "I love it when you bring the east coast sarcasm my friend. Yes, that is exactly what I mean. Darin Alpert",
          "userName": "Dan Goodman",
          "userProfileURL": "https://www.linkedin.com/in/daniel-goodman2001",
          "dataId": "urn:li:comment:(activity:7284560572396765185,7284608463727427584)"
        },
        {
          "commentText": "I had a situation like this with a previous employer. Hard fought renewal that initially looked like there would be significant revenue churn. The chief commerical officer wanted to accept it vs losing the client. I persisted and we were successful in renewing the client with a 5% increase in fees. A deal worth over $1,400,000.\n\nWe hadn’t received comp plans for the year but under the previous plan it would have been a five figure commission. After the deal was closed the new plans rolled out and the commission was reduced to $4,500. Then we were laid off anyway and told we wouldn’t be paid anything.",
          "userName": "David Kaduk",
          "userProfileURL": "https://www.linkedin.com/in/davidkaduk",
          "dataId": "urn:li:comment:(activity:7284560572396765185,7284565267911753728)"
        },
        {
          "commentText": "David Kaduk sadly it sounds like you dodged a bullet there. I hope they learned their lesson, although I imagine they may not have. This kind of behavior is totally unacceptable.",
          "userName": "Lisa Glenn Nobles 🐘",
          "userProfileURL": "https://www.linkedin.com/in/lisa-glenn-nobles",
          "dataId": "urn:li:comment:(activity:7284560572396765185,7284572827158999041)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7283342380420747266",
      "url": "https://www.linkedin.com/in/nehakpuri?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABGodB8BA9dl53tV5WM3sxhIEFyYMsgf0ck",
      "name": "Neha K Puri\nNeha K Puri",
      "content": "Why wait until employees leave to understand what matters to them? Instead of conducting exit interviews to understand why people LEFT, let's start doing \"stay interviews\" to understand why they STAY.\n\nCompanies like,, and(yes, this platform!) have already embraced this proactive approach.\n\nThe results? Higher retention rates and more engaged teams.\n\nWhat makes stay interviews different?\n\n• They focus on what's working, not what failed\n\n• They give you time to act on feedback\n\n• They make employees feel valued NOW\n\nKey questions smart leaders are asking:\n\n1. \"What growth opportunities are you seeking?\"\n\n2. \"How can we better support your career goals?\"\n\n3. \"What's one thing we could change to make your experience better?\"\n\nStudies show that by the time an employee gives notice, they've been mentally checked out for an average of 6-8 months. Why wait that long?\n\nI recently spoke with a tech lead who said, \"Exit interviews are like asking for relationship advice after the divorce.\" Ouch, but true!\n\nDon't wait until it's too late. The best time to understand what keeps your top talent engaged is while they're still passionate about their work.\n\nHas your company tried conducting stay interviews?",
      "reactions": {
        "likes": "10,886\nRahul Thakur and 10,885 others",
        "comments": "733 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Every organization should have anonymous quarterly ‘Employee Satisfaction’ surveys to gauge employees job satisfaction. Anonymous because in my experience when people give feedback on the workplace negatives and area for improvement, it’s often taken in the wrong way. Some might argue, ‘ideally a workplace environment should be open enough to allow and value team input’, however if the culture is already toxic or there are toxic managers, people won’t share their feedback.",
          "userName": "Muhammad Faheem Francis",
          "userProfileURL": "https://www.linkedin.com/in/muhammad-faheem-francis-70792a25",
          "dataId": "urn:li:comment:(activity:7283342380420747266,7284619166647537664)"
        },
        {
          "commentText": "Muhammad Faheem Francis انا شكلي مش هنفع معاكم في اي شغل في الوظيفه اللي انتم عاوزيني فيها عشان انتم بتتكلموا بطريقه علميه شويه ما فيهاش بساطه تمام فانا مش هنفع معاكم انا انا انسان دغري وبحب الصراحه ما احبش حد يلف ويدور عليا",
          "userName": "Sayed Elnagar",
          "userProfileURL": "https://www.linkedin.com/in/sayed-elnagar-99ba8a346",
          "dataId": "urn:li:comment:(activity:7283342380420747266,7284631264505040896)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7284601141236035585",
      "url": "https://www.linkedin.com/in/scottleese?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADGy5cBVXZTLZ8eNXz17x3ThAGT-5ckscg",
      "name": "🏄‍♂️ Scott Leese\n🏄‍♂️ Scott Leese",
      "content": "Rough start to the year? What is delayed is not denied.\n\n________________________________\n\n\n“From time to time in the years to come, I hope you will be treated unfairly, so that you will come to know the value of justice.\n\nI hope that you will suffer betrayal because that will teach you the importance of loyalty.\n\nSorry to say, but I hope you will be lonely from time to time so that you don’t take friends for granted.\n\nI wish you bad luck, again, from time to time so that you will be conscious of the role of chance in life and understand that your success is not completely deserved and that the failure of others is not completely deserved either.\n\nAnd when you lose, as you will from time to time, I hope every now and then, your opponent will gloat over your failure. It is a way for you to understand the importance of sportsmanship.\n\nI hope you’ll be ignored so you know the importance of listening to others, and I hope you will have just enough pain to learn compassion.\n\nWhether I wish these things or not, they’re going to happen.\n\nAnd whether you benefit from them or not will depend upon your ability to see the message in your misfortunes.”\n\n_______________________________\n\nIn my experience, everybody's lives are some form of a \"mess\", and it's simply the ones who translate the messages into energy and fuel and wisdom who succeed.\n\nTell yourself a story - reframe suffering into a superpower.",
      "reactions": {
        "likes": "69",
        "comments": "32 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "100% struggles and setbacks are inevitable but they hold valuable lessons that shape growth and resilience",
          "userName": "Ronen R. Pessar",
          "userProfileURL": "https://www.linkedin.com/in/rpessar",
          "dataId": "urn:li:comment:(activity:7284585049650311168,7284601088119365632)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7284580890242957313",
      "url": "https://www.linkedin.com/in/ashleycouto?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAEccLyEBUpfQ6KkLVKs9rteW3Yoz2qpufOU",
      "name": "Ashley Couto\nAshley Couto",
      "content": "10 ways to stay sane during your job search \n\n(And not let it take over your whole life)\n\nThe job search can feel like a full-time job.\nExcept... there's no paycheck or clear feedback.\nAnd somehow... there's even more meetings.\n\nTo quote Maddy Perez:\nFirst of all... ew.\nSecond of all... ew.\n\nIn all seriousness... job searches are the worst.\nThey're basically guaranteed to stress you out.\nEven if you do it while you have a job.\n\nIf you're feeling stressed in your search, I get it.\nI help people with their job search every single day.\nBut I recently went through a job search myself...\n\nAnd I still did the post-interview email hyper refresh.\n\nHere's how I (mostly) kept my cool & you can, too:\n\n1/ Create a structured \"job search schedule\"\n↳ Treat it like a project, not your whole life.\n\n2/ Set weekly action-based goals\n↳ Use SMART goals to help you.\n\n3/ Track your progress visually\n↳ See your momentum, not just outcomes.\n\n4/ Prep for your interviews\n↳ They're the final exams of adulthood.\n\n5/ Lean into your skill development\n↳ Use the opportunity to grow.\n\n6/ Limit negative self-talk\n↳ Give yourself grace in the process.\n\n7/ Develop a post-rejection ritual\n↳ Process, learn, then release.\n\n8/ Journal & practice gratitude\n↳ Ground yourself before you open the laptop.\n\n9/ Rely on your support system\n↳ But don't listen to every bit of their advice.\n\n10/ Touch grass (literally)\n↳ Get some fresh air & connect to nature.\n\nKeep your head up. You've got this.\n\nQ: How did you celebrate your last job offer?\n\n️ Repost to help a job seeker\n Followfor daily career insights",
      "reactions": {
        "likes": "286",
        "comments": "177 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "I have somebody I’m sending this too immediately. \n\nI remember an early job search where I was applying for jobs I didn’t even want, then they’d say I was overqualified and reject me and then I’d be even more sad/angry/overwhelmed and worked myself into a little spiral. I needed to read this at the time.",
          "userName": "Leslie Venetz",
          "userProfileURL": "https://www.linkedin.com/in/leslievenetz",
          "dataId": "urn:li:comment:(ugcPost:7284531961501483009,7284572677292400641)"
        },
        {
          "commentText": "Glad you had someone in mind for this, Leslie. I have made the same mistake and paid the emotional toll for it earlier.",
          "userName": "Ashley Couto",
          "userProfileURL": "https://www.linkedin.com/in/ashleycouto",
          "dataId": "urn:li:comment:(ugcPost:7284531961501483009,7284579056010817536)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7284602764075143168",
      "url": "https://www.linkedin.com/in/matthewbuchalski?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAHq5rcBUODCOiAZTTtYH3Xvrex0EdMFjpA",
      "name": "Matthew Buchalski\nMatthew Buchalski",
      "content": "The best people I’ve ever hired all have one thing in common: they show up prepared and take the process seriously.\n\nThey treat the interview like the single most important sale they’ll make—because it is.\n\nThink about it: you’re selling yourself.\n\nThe best candidates:\n● Demonstrate knowledge of the company, the opportunity, and the market.\n● Research the hiring manager and the team they’ll be joining.\n● Backchannel information where they can, digging deeper to understand the culture and how they’ll fit.\n● Show up ready to speak the language of the role they’re pursuing.\n\nToo many people take interviewing too lightly.\n\nThey don’t prepare or give it a second thought once the Zoom invite is sent.\n\nBut a great candidate knows this is their chance to close the deal on their future.\n\nA perfect example?\n\nWhen I hired Matt, at RealPage, he came to the interview with all the details dialed in.\n\nHe knew about me, my background, my social media presence, and even that I had a family.\n\nHe did his homework.\n\nHe knew his stuff. He wasn’t just selling himself—he was proving that he’d done the work to win the opportunity. Most importantly, he showed me that he not only knew the right steps but that he could teach them to others.\n\nMost candidates skip this step.\n\nThey come in blind and hope for the best.\n\nThey wing it.\n\nBut the best hires? They leave nothing to chance.\n\nIf you’re looking for your next role, treat the interview process like a sales cycle.\n\nResearch, prepare, and close.\n\nBecause in a competitive market, being prepared isn’t optional—it’s how you win.",
      "reactions": {
        "likes": "12",
        "comments": "4 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "The hard part was figuring out how to slip \"Booch Nasty\" into my interview answers  ",
          "userName": "Matt Reuter",
          "userProfileURL": "https://www.linkedin.com/in/matt-reuter",
          "dataId": "urn:li:comment:(activity:7284602764075143168,7284608540164444162)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7284605122100215809",
      "url": "https://www.linkedin.com/in/jakedunlap?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAENCicB0qY59ybik0DUN4FzM8lk0Rq6bjk",
      "name": "Jake Dunlap\nJake Dunlap",
      "content": "The days of sticking to outdated buyer models where we expect buyers to just adapt to our process are long behind us\n\nOur new reality is buyers who want us to show up already understanding their challenges and goals. They’re not here to explain their “need” or jump through a bunch of qualification hoops\n\nIt’s on us to do the work upfront\n\nOur ability to connect as humans not just sellers has never been more critical than it is right now\n\nAnd here’s the kicker: AI isn’t replacing that connection. It’s actually a tool we can use to enhance it. So when you’re faced with the question “Does AI know your buyer better than you?” you won’t be afraid of the answer\n\nThis isn’t about competing with AI. It’s about learning from it and using it to be better. Better personas. Better outreach. Stronger connections\n\nIn today’s episode of Innovative Seller, we’re breaking it all down: the death of generic outreach, the rise of AI, and how to create buyer models that actually work in 2025\n\nToday's episode is live now over on YouTube. Give it a watch and let me know your thoughts in the comments",
      "reactions": {
        "likes": "8",
        "comments": "2 comments",
        "shares": "0"
      },
      "mediaUrl": "blob:https://www.linkedin.com/b8aef873-e1f1-445e-947a-abde7fee762e",
      "comments": [
        {
          "commentText": "Truly loving your content.....by the way, love your communication cadence, tempo etc. I recognize the intentional hard work there, it's not easy Jake Dunlap",
          "userName": "Albert Ramos Jr.",
          "userProfileURL": "https://www.linkedin.com/in/albertramosjr",
          "dataId": "urn:li:comment:(ugcPost:7284605079469355009,7284605773366620160)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7284618936137011201",
      "url": "https://www.linkedin.com/in/patelchinmay?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAKtDjUB3hxj4XyYpaaJWU-_CHM3S4Aptwc",
      "name": "Chinmay Patel ☀️\nChinmay Patel ☀️",
      "content": "I'm cancelling my ChatGPT subscription after 18 months of paying for it. \n\nAsk me anything.",
      "reactions": {
        "likes": "1",
        "comments": "3 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Why?  Found a better option?",
          "userName": "Alex Popovic",
          "userProfileURL": "https://www.linkedin.com/in/apopovic-facelesslabs",
          "dataId": "urn:li:comment:(activity:7284618936137011201,7284625246723166209)"
        },
        {
          "commentText": "If you count https://labs.google/ , there are so many more experiments that are way more useful. ",
          "userName": "Chinmay Patel ☀️",
          "userProfileURL": "https://www.linkedin.com/in/patelchinmay",
          "dataId": "urn:li:comment:(activity:7284618936137011201,7284625888325914624)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7284599391070388224",
      "url": "https://www.linkedin.com/groups/66325?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A66325-7284598003439390722",
      "name": "The Social Media Marketing Group\nThe Social Media Marketing Group",
      "content": "Today, I read a WSJ story about someone who applied to over 260 jobs. After facing rejection after rejection, her big break came when someone she knew stepped up and vouched for her.\n\nThis story hits home for anyone who’s been ignored by clients, companies, or people they’re trying to impress. The truth is that success often comes from building real connections. Networking isn’t about quick wins—it’s about trust and relationships.\n\nYour network can open doors, but it takes effort to grow it. Did you know 81% of people say trust is the main reason they choose to work with someone? That’s why building a personal brand is so important. It’s not just about being seen—it’s about being trusted. When you’re intentional about your personal brand, you can show off your strengths and connect with people in a real way.\n\nDon’t let your reputation just “happen.” Start working on your personal brand now—it’s one of your greatest strengths in a competitive world.\n\nThis Personal Branding Balanced Scorecard is here to help you get started in 2025. Let me know what you think!",
      "reactions": {
        "likes": "21",
        "comments": "4 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "However, every species on this planet needs 3 things to thrive: \n- Adaptability\n- Ingenuity\n- A helping hand from others.\nGreat post",
          "userName": "Ana Uzanovic",
          "userProfileURL": "https://www.linkedin.com/in/ana-uzanovic-94070a7a",
          "dataId": "urn:li:comment:(groupPost:66325-7284598003439390722,7284599371113902080)"
        },
        {
          "commentText": "Ana Uzanovic thanks for the props and take on the post!",
          "userName": "Gerry Moran",
          "userProfileURL": "https://www.linkedin.com/in/gerrymoran",
          "dataId": "urn:li:comment:(groupPost:66325-7284598003439390722,7284602675541790721)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7284570546707595264",
      "url": "https://www.linkedin.com/in/danschawbel?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABGGoABtGGICKdFwALCrSipphlV7r54Mlo",
      "name": "Dan Schawbel\nDan Schawbel",
      "content": "For this week's \n#WorkplaceIntelligenceWeekly newsletter, I share the 4 most important employee experience (EX) investments you should make based on new data from isolved.\n\nSubscribe to the Workplace Intelligence Insider Newsletter for the full article:",
      "reactions": {
        "likes": "27",
        "comments": "11 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Excited to see our data featured in this week's \n#WorkplaceIntelligenceWeekly newsletter!  ",
          "userName": "isolved",
          "userProfileURL": "https://www.linkedin.com/company/isolved/posts",
          "dataId": "urn:li:comment:(ugcPost:7284570546179039249,7284589681759899648)"
        },
        {
          "commentText": "Thanks for sharing such great data!",
          "userName": "Dan Schawbel",
          "userProfileURL": "https://www.linkedin.com/in/danschawbel",
          "dataId": "urn:li:comment:(ugcPost:7284570546179039249,7284593213040922624)"
        },
        {
          "commentText": "Dan Schawbel, thank you for sharing these valuable insights on employee experience investments. ",
          "userName": "Sheibban Pervez",
          "userProfileURL": "https://www.linkedin.com/in/sheibban",
          "dataId": "urn:li:comment:(ugcPost:7284570546179039249,7284576186368696320)"
        },
        {
          "commentText": "Sheibban Pervez Your welcome",
          "userName": "Dan Schawbel",
          "userProfileURL": "https://www.linkedin.com/in/danschawbel",
          "dataId": "urn:li:comment:(ugcPost:7284570546179039249,7284593177250963456)"
        }
      ]
    }
  ],
  "errors": [
    {
      "postId": "urn:li:activity:7284630683992363010",
      "url": "https://www.linkedin.com/in/yuriiveremchuk?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABwJlYABf1pwmgqAZCzukF9kE0FQOHvI9NI",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7284560572396765185",
      "url": "https://www.linkedin.com/in/daniel-goodman2001?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAeS6L0BdHsGXRto-nWwwPVPt8hNYJ4niZI",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7283342380420747266",
      "url": "https://www.linkedin.com/in/nehakpuri?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABGodB8BA9dl53tV5WM3sxhIEFyYMsgf0ck",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7284601141236035585",
      "url": "https://www.linkedin.com/in/scottleese?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADGy5cBVXZTLZ8eNXz17x3ThAGT-5ckscg",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7284580890242957313",
      "url": "https://www.linkedin.com/in/ashleycouto?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAEccLyEBUpfQ6KkLVKs9rteW3Yoz2qpufOU",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7284602764075143168",
      "url": "https://www.linkedin.com/in/matthewbuchalski?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAHq5rcBUODCOiAZTTtYH3Xvrex0EdMFjpA",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7284618936137011201",
      "url": "https://www.linkedin.com/in/patelchinmay?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAKtDjUB3hxj4XyYpaaJWU-_CHM3S4Aptwc",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7284599391070388224",
      "url": "https://www.linkedin.com/groups/66325?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A66325-7284598003439390722",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7284570546707595264",
      "url": "https://www.linkedin.com/in/danschawbel?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABGGoABtGGICKdFwALCrSipphlV7r54Mlo",
      "errors": [
        "Failed to fetch media URL."
      ]
    }
  ]
}