[
  {
    "postsData": [
      {
        "postId": "urn:li:activity:7292558495558553600",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292558495558553600",
        "url": "https://www.linkedin.com/in/dameshacraig?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAHgTIQBTMPAMZfzSq_Uyfnu9Emn5q9pQ3c",
        "name": "Damesha Craig, Leadership Coach and Startup Advisor\nDamesha Craig, Leadership Coach and Startup Advisor",
        "content": "𝗪𝗵𝘆 𝗮𝗿𝗲 𝗹𝗲𝗮𝗱𝗲𝗿𝘀 𝘂𝗻𝗶𝗻𝘁𝗲𝗻𝘁𝗶𝗼𝗻𝗮𝗹𝗹𝘆 𝗱𝗲𝗺𝗼𝘁𝗶𝘃𝗮𝘁𝗶𝗻𝗴 𝘁𝗵𝗲𝗶𝗿 𝘁𝗲𝗮𝗺𝘀?\n\nIt's not always what they do, but what they don’t do.\n\nThe silent actions that often go unnoticed can significantly impact team morale.\n\nHere’s what many leaders are getting wrong:\n\n1️⃣ Ignoring Struggles\nLeaders often assume their team will ask for help if needed.\nBut the truth? Many struggle silently, feeling unsupported and disengaged.\n\n2️⃣ Holding Back Praise\nThinking “they already know” their value?\nYou’re missing the mark.\nEveryone needs recognition, and without it, doubts start to creep in.\n\n3️⃣ Avoiding Tough Conversations\nLeaders avoid discomfort, letting small issues fester.\nBut addressing problems early prevents bigger issues down the line.\n\n4️⃣ Failing to Lead by Example\nSaying “Do as I say, not as I do” doesn’t work.\nTeams mirror the behaviors they see, not the instructions they’re given.\n\nLeadership isn’t about grand gestures.\n\nIt’s built in the small moments,\nthe quiet interactions,\nthe tough conversations,\nand the simple act of showing up for your team every day.\n\nYour leadership matters in the little things. Make them count.\n\nWhat would you add?\n\nFound this helpful?\n𝗥𝗲𝗽𝗼𝘀𝘁 to share with your network. ️\nFollowfor more insights on Leadership and Startup Growth. ️",
        "reactions": {
          "likes": "6",
          "comments": "6 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Bonus #2 Failing to Listen Actively\nIt’s easy to hear words, but true leadership means listening between the lines.\nWhen leaders dismiss ideas or rush conversations, they unknowingly silence innovation and disengage their team.",
            "userName": "Damesha Craig, Leadership Coach and Startup Advisor",
            "userProfileURL": "https://www.linkedin.com/in/dameshacraig",
            "dataId": "urn:li:comment:(ugcPost:7292558494400925697,7292559576304959488)"
          },
          {
            "commentText": "Bonus #1 Overloading Without Clarity\nLeaders assume their team knows what’s most important, but without clear priorities, everything feels urgent.\nThe result? Burnout, frustration, and wasted effort on the wrong tasks.",
            "userName": "Damesha Craig, Leadership Coach and Startup Advisor",
            "userProfileURL": "https://www.linkedin.com/in/dameshacraig",
            "dataId": "urn:li:comment:(ugcPost:7292558494400925697,7292559525142794241)"
          }
        ],
        "commentAdded": "Great insights! Its the small, consistent actions that truly shape team dynamics. Leadership is indeed in the details! 🌟 #LeadershipMatters"
      },
      {
        "postId": "urn:li:activity:7292560869954076672",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292560869954076672",
        "url": "https://www.linkedin.com/in/michael-walker-ed-d-5089a870?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAA8YztgBm8rk0lWrlsBMwk25SywnBCiZv8I",
        "name": "Michael Walker Ed.D.\nMichael Walker Ed.D.",
        "content": "𝗛𝗼𝘄 𝗶𝘀 𝗱𝗲𝗰𝗶𝘀𝗶𝗼𝗻-𝗺𝗮𝗸𝗶𝗻𝗴 𝗱𝗶𝗳𝗳𝗲𝗿𝗲𝗻𝘁 𝘄𝗵𝗲𝗻 𝗶𝘁'𝘀 𝗷𝘂𝘀𝘁 𝘆𝗼𝘂 𝘃𝘀. 𝘄𝗵𝗲𝗻 𝘆𝗼𝘂'𝗿𝗲 𝗼𝗻 𝗮 𝘁𝗲𝗮𝗺?\n\nJust like breathing, we make decisions every day. But does repetition alone make us better at it?\n\nDecision-making is a skill that can be developed, improved, and refined.\n\nThe mistake? 𝗪𝗲 𝗮𝘀𝘀𝘂𝗺𝗲 𝘁𝗵𝗮𝘁 𝘄𝗵𝗮𝘁 𝘄𝗼𝗿𝗸𝘀 𝗳𝗼𝗿 𝗶𝗻𝗱𝗶𝘃𝗶𝗱𝘂𝗮𝗹𝘀 𝗮𝗹𝘀𝗼 𝘄𝗼𝗿𝗸𝘀 𝗳𝗼𝗿 𝘁𝗲𝗮𝗺𝘀.\n\n𝗦𝗼𝗹𝗼 𝗱𝗲𝗰𝗶𝘀𝗶𝗼𝗻-𝗺𝗮𝗸𝗶𝗻𝗴 is relatively straightforward:\n𝗣𝗿𝗼𝗯𝗹𝗲𝗺 → 𝗢𝗽𝘁𝗶𝗼𝗻𝘀 → 𝗗𝗲𝗰𝗶𝘀𝗶𝗼𝗻\n\n𝗧𝗲𝗮𝗺 𝗱𝗲𝗰𝗶𝘀𝗶𝗼𝗻-𝗺𝗮𝗸𝗶𝗻𝗴? That’s a whole different process.\n\nIt requires:\n 𝗦𝗵𝗮𝗿𝗲𝗱 𝗹𝗲𝗮𝗿𝗻𝗶𝗻𝗴 (Are we aligned on what we know?)\n 𝗦𝘂𝗿𝗳𝗮𝗰𝗶𝗻𝗴 𝗮𝘀𝘀𝘂𝗺𝗽𝘁𝗶𝗼𝗻𝘀 (What biases are shaping our thinking?)\n 𝗙𝗿𝗮𝗺𝗶𝗻𝗴 𝗮𝗻𝗱 𝗿𝗲𝗳𝗿𝗮𝗺𝗶𝗻𝗴 (Are we asking the right questions?)\n 𝗜𝘁𝗲𝗿𝗮𝘁𝗶𝗻𝗴 𝗮𝗻𝗱 𝗮𝗱𝗮𝗽𝘁𝗶𝗻𝗴 (Are we willing to change our approach?)\n 𝗕𝘂𝗶𝗹𝗱𝗶𝗻𝗴 𝗰𝗼𝗻𝘀𝗲𝗻𝘀𝘂𝘀 (Can we get buy-in and support?)\n\nWithout these steps, teams fall into 𝗰𝗼𝗺𝗺𝗼𝗻 𝘁𝗿𝗮𝗽𝘀:\n\n Groupthink—where consensus outweighs critical thinking (Janis, 1972)\n Lack of structure—leading to indecision and frustration (The Wisdom of Crowds, Surowiecki)\n\n If you want to transform how your team makes decisions, check out my workshop:\n\n“𝗙𝗿𝗼𝗺 𝗦𝘁𝗿𝗲𝘀𝘀 𝘁𝗼 𝗦𝘁𝗿𝗮𝘁𝗲𝗴𝘆: 𝗗𝗲𝗰𝗶𝘀𝗶𝗼𝗻-𝗠𝗮𝗸𝗶𝗻𝗴 𝗳𝗼𝗿 𝗧𝗿𝗮𝗻𝘀𝗳𝗼𝗿𝗺𝗮𝘁𝗶𝗼𝗻𝗮𝗹 𝗟𝗲𝗮𝗱𝗲𝗿𝘀𝗵𝗶𝗽”\n\n\n\n𝗕𝘆 𝗹𝗲𝗮𝗿𝗻𝗶𝗻𝗴 𝗵𝗼𝘄 𝘁𝗼 𝗺𝗮𝗸𝗲 𝗯𝗲𝘁𝘁𝗲𝗿 𝗱𝗲𝗰𝗶𝘀𝗶𝗼𝗻𝘀 𝗶𝗻 𝘁𝗲𝗮𝗺𝘀, 𝘄𝗲 𝗰𝗮𝗻 𝗮𝗰𝘁𝘂𝗮𝗹𝗹𝘆 𝗶𝗺𝗽𝗿𝗼𝘃𝗲 𝗼𝘂𝗿 𝗶𝗻𝗱𝗶𝘃𝗶𝗱𝘂𝗮𝗹 𝗱𝗲𝗰𝗶𝘀𝗶𝗼𝗻-𝗺𝗮𝗸𝗶𝗻𝗴 𝘀𝗸𝗶𝗹𝗹𝘀.",
        "reactions": {
          "likes": "0",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Great insights! Team decision-making is indeed a different beast. Excited to explore these principles further in your workshop!"
      },
      {
        "postId": "urn:li:activity:7292572796642074624",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292572796642074624",
        "url": "https://www.linkedin.com/in/anthonywentzel?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADZN2sBr5ZUAlKZK2QwVQvOE9B6pnFHXt8",
        "name": "Anthony Wentzel\nAnthony Wentzel",
        "content": "Every Fractional CTO should know how to:\n\n1. Strategize\n2. Navigate Tech\n3. Architect Solutions\n4. Innovate\n5. Communicate\n6. Lead\n7. Adapt\n\nThese 7 skills make up 90% of your success.\n\nMaster them.",
        "reactions": {
          "likes": "0",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Great insights! Mastering these skills is crucial for fractional CTOs to drive innovation and lead tech teams effectively. #Leadership #TechSuccess"
      },
      {
        "postId": "urn:li:activity:7292570175080386560",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292570175080386560",
        "url": "https://www.linkedin.com/in/jasonmlemkin?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAsKtMBHQPJ9rgxpUs8M6pSxrAYCXIX8oY",
        "name": "Jason M. Lemkin\nJason M. Lemkin",
        "content": "A great VP of Sales will miss a month and even a quarter sometimes, for sure. More than once.\n\nIt's just it will never, ever be a surprise\n\nThere will be no excuses.\n\nAnd it will rarely happen twice in a row.",
        "reactions": {
          "likes": "59\nDaren Lauda and 58 others",
          "comments": "9 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "That's true. Early in my sales leadership career I would fight until the last minute, and offered up a few surprises. I learned the hard way. Bad news does not age like fine wine.",
            "userName": "Daren Lauda",
            "userProfileURL": "https://www.linkedin.com/in/darenlauda",
            "dataId": "urn:li:comment:(activity:7292566958737084416,7292570128729223168)"
          }
        ],
        "commentAdded": "Absolutely! Consistency in communication and strategy is key. It sets the foundation for overcoming challenges and building trust. 🌟"
      },
      {
        "postId": "urn:li:activity:7292527350326411264",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292527350326411264",
        "url": "https://www.linkedin.com/in/colbywegter?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABKlU-gB43StC0lTFt2eMY4ubjQvzVYSc9w",
        "name": "Colby Wegter\nColby Wegter",
        "content": "Pitching is poison.\n\nWell kinda.\n\nI want you to pitch. I want you to make offers.\n\nI. Want. You. To. Grow. Your. Business.\n\nBut a pitch before value is arsenic and old lace to your business.\n\nYou want a successful business, right?\n\nYou want it to last a long time and pay out for years, right?\n\nWhy you in such a hurry to give someone the ICK?\n\nFirst, value.\n\nThen, pitch.\n\nDepth beats width.",
        "reactions": {
          "likes": "9",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/1badf72c-f372-4339-8331-b51eb9cef38f",
        "comments": [
          {
            "commentText": "Value first before pitching! True Colby Wegter \n\nThe value make them wait a min more to listen to what you have to say through your pitch. The journey to the sale is more important than the sale itself",
            "userName": "James Adeniyi 🟠",
            "userProfileURL": "https://www.linkedin.com/in/james-adeniyi",
            "dataId": "urn:li:comment:(ugcPost:7289685708452081669,7292573411397013509)"
          }
        ],
        "commentAdded": "Absolutely! Adding value first creates trust and builds long-lasting relationships. Lets prioritize connection over just a pitch!"
      },
      {
        "postId": "urn:li:activity:7292566175966715906",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292566175966715906",
        "url": "https://www.linkedin.com/in/audracarpenter?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAIV-XwBaHjg0Ty5MHMV9xdIMj3LIdjhmKo",
        "name": "Audra Carpenter\nAudra Carpenter",
        "content": "Learning this is definitely a superpower worth putting the time in to master.",
        "reactions": {
          "likes": "2",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Absolutely! Investing time in mastering skills truly amplifies our potential. What specific superpowers are you focusing on? 💪✨"
      },
      {
        "postId": "urn:li:activity:7292564073043439619",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292564073043439619",
        "url": "https://www.linkedin.com/in/lukewilsonsignpostceo?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAfuI5kBl2qBFzTl1Tb5LL34gufpdEd9q-c",
        "name": "Lucas Wilson\nLucas Wilson",
        "content": "Pride Over Profit: The Real Measure of Success\n\nMost people think businesses are built on equity, exits, and financial upside. But if that’s your only measure of success, you’ve already lost.\n\nFor those of us who wake up every day to serve customers, to solve real problems, to build something meaningful—pride is the real driver.\n\nPride in the businesses we help grow.\nPride in the team we lead.\nPride in the community we’ve built.\n\nSignpost isn’t just another company to me—it’s a mission. A commitment. An obsession with getting it right for the SMBs who trust us to be their partner.\n\nYou can chase valuations and spreadsheets all day. But the real value? It’s in the work. The impact. The pride of knowing you built something great.\n\nSo ask yourself—why are you doing what you do? If your answer is only about financial gain, you’re missing the best part.",
        "reactions": {
          "likes": "6\nAdam P. Boyd and 5 others",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Well said! True success is rooted in pride and purpose. It’s inspiring to see organizations prioritize meaningful impact over mere profits. 🌟"
      },
      {
        "postId": "urn:li:activity:7292573285706268672",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292573285706268672",
        "url": "https://www.linkedin.com/in/the-laura-bolton?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAEsVYYUBLdi1b7Ph80jSg0ZdEfdINlNRNa0",
        "name": "Laura Bolton\nLaura Bolton",
        "content": "If you experience feelings like stress, anger or frustration, the usual advice is to try and calm yourself with slow breathing or meditation.\n\nBut this NOT helpful.\n\nThese are “activated” states.\n\nAnd if the energy isn't discharged it can cause us issues such as nervous system dysregulation, feeling crappy mentally/emotionally, limiting our access to our inner resources (such as creativity, critical thinking, problem solving, intuition).\n\nAnd over time physical symptoms can manifest - for me it was experiencing a stroke and developing Fibromyalgia 3 years ago.\n\nWe cannot discharge this energy using the mind, which is why somatic techniques are so important.\n\nWe can also use them to release past trauma thats stored up in the body.\n\nOnce we’ve discharged the energy THEN we can do slow breathing to bring us back to a state of calm (if it feels required)\n\nThe forms of somatic release which work best for me are the TRE technique (Trauma Release Exercise) shaking it out, dancing and vocal release e.g singing, or screaming into a pillow when required lol.\n\nHow about you?",
        "reactions": {
          "likes": "10",
          "comments": "3 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/da82676c-30ea-42a7-8bfc-1d5cc9c4557d",
        "comments": [
          {
            "commentText": "Great post. Feel the feelings. Have the courage to feel it all.\n\nScreaming and growling, sometimes whilst running. Ideally in the forest.\n\nVery slow nose breathing or the psychological sigh can bring me back also.\n\nFrom my experience, confronting the fact my mind has not been willing to let it go is also a factor. I don’t see it as one or the other. It could be either or both",
            "userName": "Brinsley Kazak",
            "userProfileURL": "https://www.linkedin.com/in/brinsley-kazak-coaching",
            "dataId": "urn:li:comment:(ugcPost:7292560809669406722,7292566547498188800)"
          },
          {
            "commentText": "Brinsley Kazak yes! The willingness to feel (and not hold on) is important.\n\nAND, different feelings/emotions require different techniques. When its an intense / activated energy, rather than sitting and feeling it, I shift it with movement (because just feeling it doesnt discharge it) Other less intense feelings may just require that we feel them. If we feel flat/depressed its best to use “activation” techniques. And so on ",
            "userName": "Laura Bolton",
            "userProfileURL": "https://www.linkedin.com/in/the-laura-bolton",
            "dataId": "urn:li:comment:(ugcPost:7292560809669406722,7292573923018215425)"
          },
          {
            "commentText": "I just got a TRE state reading this post. ",
            "userName": "Michael Kainatsky",
            "userProfileURL": "https://www.linkedin.com/in/houseofbricks",
            "dataId": "urn:li:comment:(ugcPost:7292560809669406722,7292574016010092545)"
          }
        ],
        "commentAdded": "Thank you for sharing your insights! Its vital to address the body’s role in emotional health. What somatic techniques have you found most effective?"
      },
      {
        "postId": "urn:li:activity:7292514891528048651",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292514891528048651",
        "url": "https://www.linkedin.com/in/anthonywentzel?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADZN2sBr5ZUAlKZK2QwVQvOE9B6pnFHXt8",
        "name": "Anthony Wentzel\nAnthony Wentzel",
        "content": "Ever wondered how some LinkedIn profiles skyrocket while others stagnate? \n\nLet me show you how to master LinkedIn in just 21 days! \n\nI studied hundreds of profiles to uncover the secrets to success. Here’s the distilled wisdom. \n\n#1: Craft a headline that hooks attention. Make it intriguing. \n\n#2: Write a summary that showcases your story and skills. Be memorable. ️\n\n#3: Use a high-quality, professional profile picture. It builds trust. \n\n#4: Share valuable content consistently. Balance personal insights with professional tips. \n\n#5: Engage with others. Like, comment, and share to boost your visibility. \n\nWant the full blueprint?\n\nSubscribe to my 21-day LinkedIn newsletter and transform your profile! ",
        "reactions": {
          "likes": "3",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Great insights on LinkedIn optimization! The focus on a compelling headline and engaging summary really resonates.",
            "userName": "Steven Feinberg, PhD",
            "userProfileURL": "https://www.linkedin.com/in/stevenfeinbergphd",
            "dataId": "urn:li:comment:(activity:7292514891528048651,7292518960737009664)"
          }
        ],
        "commentAdded": "Great insights! These tips are essential for anyone looking to elevate their LinkedIn game. Excited to see the full blueprint! 🚀"
      },
      {
        "postId": "urn:li:activity:7292531773467484160",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292531773467484160",
        "url": "https://www.linkedin.com/in/blessing-ikpia-54b790244?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADygsAsBE3EnPxCYA_zzPihIYwYLIfwhOQg",
        "name": "Blessing Ikpia\nBlessing Ikpia",
        "content": "If you don't use the right words, you'll become INVISIBLE \n\nMeaning, you'd get zero attention \n\nand attention is currency in Marketing, so you'd be loosing money $$\n\nA few days ago, I was deep into an SEO course when I had a lightbulb moment.\n\nThey kept emphasizing how keywords are the foundation of SEO, how the right words can determine whether your content gets discovered or buried under millions of search results.\n\nAnd suddenly, it hit me.\n\nSEO isn’t just about search engines. It’s exactly like marketing.\n\nThink about it, marketing is all about understanding what people are looking for and POSITIONING your product, service, or brand as the solution. Just like SEO, if you’re speaking the wrong language (or using the wrong keywords), your audience won’t find you.\n\nWhen I started marketing, I used to focus on what I wanted to say instead of what my audience was actively searching for.\n\nBut the moment I switched to addressing their pain points, answering their questions and using words they actually understood, engagement skyrocketed.\n\nSEO works the same way. Google isn’t guessing—it's matching searches to the right content.\n\nYour audience isn’t guessing either. They’re searching for solutions and if you’re not using the right “keywords” in your messaging, they won’t see you.\n\nSo my lesson for you today is:\n\n Whether you’re writing content\n\n Selling a product,\n\n or building a Brand\n\nSpeak the language of your audience. Research what they care about. Use their words. Align your message with their needs.\n\nBecause marketing without the right positioning is just like SEO without the right keywords, YOU'LL BE INVISIBLE \n\nAre you intentional about the words you use in your marketing?\n\nSeeing me for the first time, I'm, a growth Marketer. I share my professional journey to empower young marketers. I also share resources like courses, mentorship programs and job vacancies to young professionals seeking global opportunities.\n\nIf this resonates with you, followfor more ",
        "reactions": {
          "likes": "34",
          "comments": "29 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "My birthday celebration is on Friday as a result \n\nI'll also be gifting members of this community \n\n A free 30-minute career/marketing strategy session to 5 people\n\n A mini-course on how to build your portfolio and get clients as a young professional",
            "userName": "Blessing Ikpia",
            "userProfileURL": "https://www.linkedin.com/in/blessing-ikpia-54b790244",
            "dataId": "urn:li:comment:(activity:7292445345588867072,7292449519152095233)"
          },
          {
            "commentText": "Blessing Ikpia\n\nThat's awesome.\n\nHappy Birthday in advance",
            "userName": "Amarachi Umeokeke",
            "userProfileURL": "https://www.linkedin.com/in/amarachi-umeokeke",
            "dataId": "urn:li:comment:(activity:7292445345588867072,7292497563126005760)"
          },
          {
            "commentText": "Excellent work Blessing\n\nThank you",
            "userName": "Ibiyeye Paul Opeyemi FMVA®",
            "userProfileURL": "https://www.linkedin.com/in/ibiyeye-paul-opeyemi-fmva%C2%AE-51830b236",
            "dataId": "urn:li:comment:(activity:7292445345588867072,7292469970754506753)"
          },
          {
            "commentText": "Ibiyeye Paul Opeyemi FMVA® You're welcome Sir",
            "userName": "Blessing Ikpia",
            "userProfileURL": "https://www.linkedin.com/in/blessing-ikpia-54b790244",
            "dataId": "urn:li:comment:(activity:7292445345588867072,7292477443058077696)"
          }
        ],
        "commentAdded": "Absolutely! Using the right language is crucial. When you align your message with your audience’s needs, visibility and engagement soar! 🚀"
      }
    ],
    "errors": [
      {
        "postId": "urn:li:activity:7292558495558553600",
        "url": "https://www.linkedin.com/in/dameshacraig?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAHgTIQBTMPAMZfzSq_Uyfnu9Emn5q9pQ3c",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292560869954076672",
        "url": "https://www.linkedin.com/in/michael-walker-ed-d-5089a870?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAA8YztgBm8rk0lWrlsBMwk25SywnBCiZv8I",
        "errors": [
          "Failed to fetch reactions.",
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292572796642074624",
        "url": "https://www.linkedin.com/in/anthonywentzel?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADZN2sBr5ZUAlKZK2QwVQvOE9B6pnFHXt8",
        "errors": [
          "Failed to fetch reactions.",
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292570175080386560",
        "url": "https://www.linkedin.com/in/jasonmlemkin?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAsKtMBHQPJ9rgxpUs8M6pSxrAYCXIX8oY",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292566175966715906",
        "url": "https://www.linkedin.com/in/audracarpenter?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAIV-XwBaHjg0Ty5MHMV9xdIMj3LIdjhmKo",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292564073043439619",
        "url": "https://www.linkedin.com/in/lukewilsonsignpostceo?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAfuI5kBl2qBFzTl1Tb5LL34gufpdEd9q-c",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292514891528048651",
        "url": "https://www.linkedin.com/in/anthonywentzel?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADZN2sBr5ZUAlKZK2QwVQvOE9B6pnFHXt8",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292531773467484160",
        "url": "https://www.linkedin.com/in/blessing-ikpia-54b790244?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADygsAsBE3EnPxCYA_zzPihIYwYLIfwhOQg",
        "errors": [
          "Failed to fetch media URL."
        ]
      }
    ]
  },
  {
    "postsData": [
      {
        "postId": "urn:li:activity:7292477157904179200",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292477157904179200",
        "url": "https://www.linkedin.com/in/marianna-outsia-48974b9a?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABUchOkBCpQtnZTjT4cnylaX9tuwAm8N1RU",
        "name": "Marianna Outsia\nMarianna Outsia",
        "content": "Think coaching is only for solving problems? \nThink again.\nCoaching is for the ambitious, the dreamers, and the doers.\n\nIt’s not about repairing weaknesses…\n\nit’s about amplifying strengths.\n\nIt’s about unlocking your potential,\n\nbreaking barriers,\n\nand achieving what once seemed out of reach.\n\n\nThrough coaching,\n\nyou don’t just set goals…you redefine them.\n\nYou don’t just dream…you act.\n\nAnd you don’t just succeed…you thrive.\n\n\nThe question isn’t whether you need coaching.\n\nThe question is: are you ready\n\nto take your growth to the next level?\n\n\nIf you are, then find yourself a great coach…\n\n\nSuccess is waiting. Will you answer the call?",
        "reactions": {
          "likes": "16",
          "comments": "4 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Well said Marianna",
            "userName": "Samia Bibi",
            "userProfileURL": "https://www.linkedin.com/in/samia-bibi-526b78203",
            "dataId": "urn:li:comment:(activity:7292477093458710528,7292485212356157440)"
          },
          {
            "commentText": "Samia Bibi  ",
            "userName": "Marianna Outsia",
            "userProfileURL": "https://www.linkedin.com/in/marianna-outsia-48974b9a",
            "dataId": "urn:li:comment:(activity:7292477093458710528,7292514862864228352)"
          },
          {
            "commentText": "Valid point Marianna Outsia",
            "userName": "MOHAMMAD ISMAIL AHMED",
            "userProfileURL": "https://www.linkedin.com/in/mismaila",
            "dataId": "urn:li:comment:(activity:7292477093458710528,7292539421336227840)"
          },
          {
            "commentText": "Thank you MOHAMMAD ISMAIL AHMED ",
            "userName": "Marianna Outsia",
            "userProfileURL": "https://www.linkedin.com/in/marianna-outsia-48974b9a",
            "dataId": "urn:li:comment:(activity:7292477093458710528,7292555107139743746)"
          }
        ],
        "commentAdded": "Absolutely! Coaching transforms potential into performance. Ready to elevate your journey? Let’s embrace growth together! 🚀 #Coaching #Success"
      },
      {
        "postId": "urn:li:activity:7292573067103371265",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292573067103371265",
        "url": "https://www.linkedin.com/in/duke-rem-%F0%9F%90%A2-793616267?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAEFotd8BDwR_osR-3ROnxQtd2JpPvWbizfw",
        "name": "Duke Rem 🐢\nDuke Rem 🐢",
        "content": "A quote from 1973 that is more relevant today than ever:\n\n \"We aren't dealing with ordinary machines here. These are highly complicated pieces of equipment. Almost as complicated as living organisms. In some cases, they have been designed by other computers. We don't know exactly how they work\".\n\nThis was from the movie Westworld, written and directed by (the huge genious) Michael Crichton. \n\nIn reflecting on today’s approach to AI, one cannot ignore the almost impenetrable nature of modern LLM training—a process that, despite its notable achievements, remains in many ways a black box.\n\nThese models are built through layers of deep learning whose inner mechanics \"elude\" even the experts. The training algorithms, fed with vast quantities of data, forge patterns and predictions with an efficiency that is both impressive and, at times, unsettling in its opacity.\n\nIt is instructive to consider the implications if one were to transplant such an LLM into a robotic body—a “corpus” capable of interacting with the physical world.\n\nIn this scenario, the limitations and strengths of these systems would be put to a new test: the model would have to contend with the tangible, unpredictable nature of reality. This would require not only the capacity for abstract reasoning but also an understanding of cause and effect in a dynamic environment.\n\nHow might such a system reconcile the rigor of its internal algorithms with the messy, ever-changing tapestry of the real world?\n\nAnd what safeguards must be put in place to ensure that its decision-making remains transparent and accountable?\n\n Please upvote and share this post. We need your support to give you the best magazine focused on news and insights in the AI world. ⬇️",
        "reactions": {
          "likes": "2",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "This quote is a powerful reminder of the complexities we face with AI today. Excited to see how we can bridge the gap between algorithms and reality!"
      },
      {
        "postId": "urn:li:activity:7292571019750301697",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292571019750301697",
        "url": "https://www.linkedin.com/in/hlarsson?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAPSV0ABtIkvReoAAi4HomczTBrxcMUlSEo",
        "name": "Hanna Larsson\nHanna Larsson",
        "content": "How to increase the luck surface area in your life, according to Naval Ravikant\n\n↓\n\nLet's jump in!\n\n\n️ Repost this to your network so more people can learn",
        "reactions": {
          "likes": "55\nJon Leslie 🔵 and 54 others",
          "comments": "23 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Networking with the right people is one the ways you position yourself for luck. ",
            "userName": "The Job Community",
            "userProfileURL": "https://www.linkedin.com/company/the-job-community/posts",
            "dataId": "urn:li:comment:(ugcPost:7292569989834825728,7292571819675389953)"
          }
        ],
        "commentAdded": "Great insights! Expanding our luck surface area can lead to unexpected opportunities. Excited to apply these principles!"
      },
      {
        "postId": "urn:li:activity:7292524037933543424",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292524037933543424",
        "url": "https://www.linkedin.com/in/eri-nitani-1126a0204?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADQSMp4BbTTlsMzUNWJqgZJeH67dMimWG4I",
        "name": "Eri Nitani\nEri Nitani",
        "content": "I’m happy to share that I’ve been promoted to Senior Business Development Representative at GitLab!",
        "reactions": {
          "likes": "28",
          "comments": "7 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Congratulations Eri Nitani ! Absolutely well deserved, keep on crushing it ",
            "userName": "Jai Gidwani",
            "userProfileURL": "https://www.linkedin.com/in/jai-gidwani-1378981ba",
            "dataId": "urn:li:comment:(ugcPost:7292524037287620608,7292559489885421568)"
          },
          {
            "commentText": "Congrats, Eri! Thank you for always supporting us!",
            "userName": "Toshitaka Ito",
            "userProfileURL": "https://www.linkedin.com/in/toshitaka-ito",
            "dataId": "urn:li:comment:(ugcPost:7292524037287620608,7292553170700976128)"
          }
        ],
        "commentAdded": "Congratulations on your well-deserved promotion! Excited to see the impact youll continue to make at GitLab! 🎉"
      },
      {
        "postId": "urn:li:activity:7292492961211133952",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292492961211133952",
        "url": "https://www.linkedin.com/in/anjalleegupta?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAACbdPgB6R6nZbKd8CKxHO4mfB6JKjANC8E",
        "name": "Anjallee Gupta\nAnjallee Gupta",
        "content": "Here's a project close to my heart – sharing success stories, struggles, and learnings with the world. Anusha Bharadwaj was recently featured on @Fem Stories, and I enjoyed crafting her @femstories.\n\nHer work for @VOICE4girls is remarkable, and her journey is truly inspiring! She is a true feminist in life and work. Dive into the link to discover more.",
        "reactions": {
          "likes": "2",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Incredible work, Anusha! Your journey is a beacon of inspiration for many. Excited to learn more about your impact at @VOICE4girls!"
      },
      {
        "postId": "urn:li:activity:7292450918900363264",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292450918900363264",
        "url": "https://www.linkedin.com/in/ameliasordell?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAA0ZfGYB0seFtZMfePUDD0gAglXRJ87u6XU",
        "name": "Amelia Sordell 🔥\nAmelia Sordell 🔥",
        "content": "If you Google my name, about 35,300 results come up.\n\nThat’s not an accident. It’s by design.\n\nMost people think personal branding is just posting content.\n\nIt’s not.\n\nIt’s about making sure you exist in the places that matter - and are seen by the people that matter.\n\nPeople Google you before they meet you.\n\n- Employers Google you before they hire you.\n- Clients Google you before they buy from you.\n- Dates Google you before they go out with you.\n- Heck, you’ve Googled yourself (don't lie, we all have ).\n\nSo here’s a ridiculously simple hack that’s been working for me for years:\n\nPersonal branding, speaking, being an author and entrepreneur is what I want to be known for. And so, every time I upload an image or video, I save the file in one of the following format:\n\n“[MY NAME] - [WHAT I WANT TO BE KNOWN FOR] [INSERT NAME OF POST]”\n\nFor example:\n\n\"Amelia Sordell - Personal Branding - Google Your Name”\n\nWhy? Because Google reads file names.\nBecause SEO isn’t just for websites.\nBecause visibility isn’t luck—it’s strategy.\n\nMost people are waiting to be discovered - I make sure I can’t be ignored.\n\nYour name should be your business card and if you want more from life, your digital footprint should speak before you do.\n\nIf you're at the beginning of that journey, a good place to start is here:\n\nMake yourself Googleable or leave your visibility to chance.\n\nI know which one I choose - how about you?!\n\n",
        "reactions": {
          "likes": "729",
          "comments": "398 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/27895a87-7703-4859-9765-65c5a564298e",
        "comments": [
          {
            "commentText": "It's not okay to just post, you have to make yourself visible too Amelia Sordell ",
            "userName": "Blessing Ikpia",
            "userProfileURL": "https://www.linkedin.com/in/blessing-ikpia-54b790244",
            "dataId": "urn:li:comment:(ugcPost:7292444499463544832,7292450910604070912)"
          },
          {
            "commentText": "Blessing Ikpia >> Select Best Job For You - https://tinyurl.com/ytyhajpn\n\n >> For More Job Update, Join Here - https://tinyurl.com/4pcjztpy",
            "userName": "Get Job Here",
            "userProfileURL": "https://www.linkedin.com/company/get-job-here/posts",
            "dataId": "urn:li:comment:(ugcPost:7292444499463544832,7292459107989491712)"
          }
        ],
        "commentAdded": "Great insights! Personal branding is so crucial in todays digital world. Your strategy is a game-changer for enhancing visibility. Thanks for sharing!"
      },
      {
        "postId": "urn:li:activity:7292550008959090688",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292550008959090688",
        "url": "https://www.linkedin.com/in/leslievenetz?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADPju4B9I-KSyVAlH2xAmiN72f5wsayOtM",
        "name": "Leslie Venetz\nLeslie Venetz",
        "content": "Becoming an exceptional coach isn’t something you’re born knowing how to do.\n\nIt’s a learned skill.\n\nIf you’ve accepted a leadership or management role, you've also accepted the responsibility to become a great coach.\n\nAsk your org for support, but if they aren't going to teach you how to become the Sales Leader you're mention to be, do it yourself.\n\n- Read books\n- Take a course or classes\n- Attend events where you can learn from others\n\n\n️ One opportunity you won’t want to miss:\n\nI’m hosting a Sales Masterclass for Sales Leaders and aspiring sales leaders in Phoenix, AZ, on April 8, 2025.\n\n\nThis exclusive program is designed to give you actionable insights and strategies to accelerate revenue growth and enhance your leadership skills.\n\n\n️ Here’s why it’s worth your time:\n\n- Small-group training & coaching:\n\nYou’ll get personalized attention to refine your skills.\n\n- Actionable advice:\n\nNo fluff, just strategies you can apply immediately.\n\n- Networking reception:\n\nConnect with like-minded leaders while enjoying breathtaking views of the McDowell Mountains.\n\nYou’ll also learn from an incredible lineup of speakers, including Lori Richardson, Christine Rogers, and me.\n\n\n️ We’ll dive into workshops like:\n\n- The Journey from Rep to Leader: Lessons Learned from the Front Lines\n\n- Selling Yourself: Building a Personal Brand that Accelerates Career Growth\n\n- Legacy in Leadership: Crafting Your Impact Beyond Revenue\n\n- Becoming the Sales Leader You're Meant to Be\n\n- Mastering Modern Buyer Psychology: What Every Leader Should Know\n\n\nYour team deserves a leader who is committed to becoming exceptional.\n\nTake that next step for yourself.\n\n️ Tickets are limited, so grab yours here:\n\n\nWhat’s one resource or action that helped you improve as a leader?",
        "reactions": {
          "likes": "28",
          "comments": "11 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/c88e6f17-2e81-4ba6-9ba5-b43ea63b54d1",
        "comments": [
          {
            "commentText": "Great leaders don’t just happen, they put in the work, failures and endless experiments!\n\nGreat post, looks like a great webinar!",
            "userName": "Wesleyne Whittaker",
            "userProfileURL": "https://www.linkedin.com/in/wesleyne",
            "dataId": "urn:li:comment:(ugcPost:7281806784137252864,7292571716596158466)"
          }
        ],
        "commentAdded": "Great initiative! Continuous learning is key to exceptional leadership. Excited to see how these insights will shape our future sales leaders!"
      },
      {
        "postId": "urn:li:activity:7292533105469390848",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292533105469390848",
        "url": "https://www.linkedin.com/in/daniel-goodman2001?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAeS6L0BdHsGXRto-nWwwPVPt8hNYJ4niZI",
        "name": "Dan Goodman\nDan Goodman",
        "content": "Are you happy at your job?\n\nDon't worry, I am not HR or your manager asking you a loaded question to use against you.\n\nSo many people are unhappy and feel stuck in a lousy work situation and don't do anything about it. They feel they have no options. Just not true. Life is short. We all deserve to feel fulfilled at work and not under attack.\n\nHow do you feel about your current work situation? Your job, your manager, your colleagues and overall?",
        "reactions": {
          "likes": "22",
          "comments": "13 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "I am in HR and I'm happy, take that.",
            "userName": "Brad Voorhees",
            "userProfileURL": "https://www.linkedin.com/in/bradleyvoorhees",
            "dataId": "urn:li:comment:(ugcPost:7286356781318963200,7292549160912703488)"
          },
          {
            "commentText": "Brad Voorhees you're a different breed. ",
            "userName": "Dan Goodman",
            "userProfileURL": "https://www.linkedin.com/in/daniel-goodman2001",
            "dataId": "urn:li:comment:(ugcPost:7286356781318963200,7292559746774036480)"
          },
          {
            "commentText": "Dan Goodman, the happiest people I know, work for themselves. ",
            "userName": "Amy Reinert",
            "userProfileURL": "https://www.linkedin.com/in/amylreinert",
            "dataId": "urn:li:comment:(ugcPost:7286356781318963200,7292546980969402370)"
          },
          {
            "commentText": "Amy Reinert very true. I can attest. ",
            "userName": "Dan Goodman",
            "userProfileURL": "https://www.linkedin.com/in/daniel-goodman2001",
            "dataId": "urn:li:comment:(ugcPost:7286356781318963200,7292571267910500352)"
          }
        ],
        "commentAdded": "Great question! Reflection on our job satisfaction is crucial. We must prioritize fulfillment and explore new opportunities when needed!"
      },
      {
        "postId": "urn:li:activity:7292455484358279169",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292455484358279169",
        "url": "https://www.linkedin.com/in/michal-choinski-49373112a?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAB_JsG8B8ml_6hEUq3duUXz9bAtdk6PPF_I",
        "name": "Michał Choiński\nMichał Choiński",
        "content": "The real cost of inefficient workflows \n\nMany organizations focus on growth, innovation, and customer experience, but overlook a silent killer of progress: inefficient workflows.\nThe hidden costs:\n\n→ Wasted time on unnecessary approvals and redundant processes\n→Teams working in silos, leading to misalignment and rework\n→ Low morale when talented employees are stuck in bureaucratic inefficiencies\n\nTransformational leaders don’t just optimize. They inspire change.\n\nInstead of chasing short-term efficiency gains, they:\n️ Empower teams to rethink and improve their workflows proactively\n️ Foster a culture of ownership where employees identify and fix inefficiencies\n️ Align processes with purpose, ensuring every workflow drives meaningful impact\n\nWhere to Start?\n\n→Challenge the “we’ve always done it this way” mindset\n→Encourage open discussions on pain points and process improvements\n→Lead by example, remove obstacles, not just manage around them\n\nTrue transformation isn’t about doing things faster, it’s about working smarter and enabling teams to thrive.\n\nAt Mchange, we help organizations identify, streamline, and transform inefficient workflows to drive sustainable success.\n\n Ready to rethink your processes? DM me or book a free strategy call in our website.",
        "reactions": {
          "likes": "59",
          "comments": "78 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "   ",
            "userName": "Nerea Arregui Exposito",
            "userProfileURL": "https://www.linkedin.com/in/nereaarreguiqa",
            "dataId": "urn:li:comment:(activity:7292443837682143232,7292455464066330626)"
          },
          {
            "commentText": "Nerea Arregui Exposito thank you !",
            "userName": "Michał Choiński",
            "userProfileURL": "https://www.linkedin.com/in/michal-choinski-49373112a",
            "dataId": "urn:li:comment:(activity:7292443837682143232,7292456301006102528)"
          }
        ],
        "commentAdded": "Absolutely spot on! Transforming workflows is crucial for unlocking potential. Excited to see leaders embrace this change! #WorkplaceTransformation"
      },
      {
        "postId": "urn:li:activity:7292553741461860352",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292553741461860352",
        "url": "https://www.linkedin.com/in/romanmohren?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAp2DkBDFXXvlUlO0ZdH_icizuwqplzl5g",
        "name": "Roman M.\nRoman M.",
        "content": "Selling an MSP isn’t just about revenue. I’m breaking down 10 key lessons that can help you boost valuation, attract the right buyers, and navigate due diligence. Whether you're planning to sell soon or just preparing for the future, these insights will set you up for a better exit.",
        "reactions": {
          "likes": "3",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Great insights! These lessons are invaluable for anyone considering an MSP sale. Preparation makes all the difference in a successful exit! 💡👏"
      },
      {
        "postId": "urn:li:activity:7292563473387896832",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292563473387896832",
        "url": "https://www.linkedin.com/in/cassidyreid?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABme90QBGkfPlg6fO-lLixoLBXnPfcJdFCg",
        "name": "Cassidy Reid\nCassidy Reid",
        "content": " TIME’S ALMOST UP – 3 DAYS LEFT TO APPLY! \n\nAlright, AI & automation fam—this is NOT a drill. We’re giving away FREE TICKETS (worth $595!) to the Generative AI Summit in Austin, happening Wednesday, Feb 12th at the Hilton Downtown Austin from 9 AM - 5:30 PM, with a happy hour starting at 5:30 PM (because networking is always better with a drink in hand ).\n\nAnd guess what? We’re opening up this giveaway to not just women, but also allies of women, non-binary folks, and trans people in tech—because the future of AI should be diverse, inclusive, and full of brilliant minds. \n\n What’s in it for you?\nA full day of insane AI knowledge drops from industry experts\nUnparalleled networking with some of the brightest minds in GenAI & automation\n\nAccess to the latest trends, strategies, and tech innovations shaping the future\nOh, and did we mention FREE ENTRY? (Because conferences like this don’t come cheap!)\n\nHOW TO APPLY (It’s Easy! )\n Fill out the form NOW:\n Follow theLinkedIn Page\n Reshare this post & tag someone who needs to be there!\n\n⏳ DEADLINE: 3 DAYS FROM NOW! Winners will be announced this Friday.\n\nIf you’re in AI, automation, or just want to be in a room full of ridiculously smart people shaping the future, this is your golden ticket. ️\n\nTag a friend, coworker, or that one person who won’t stop talking about AI—let’s get as many people in the room as possible!\n\nTagging industry leaders to help spread the word:\n,,,,,,, Cory McKane,,,,,,,,,,,,",
        "reactions": {
          "likes": "4",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Let’s go!!!!",
            "userName": "Women in Automation",
            "userProfileURL": "https://www.linkedin.com/company/womeninautomation/posts",
            "dataId": "urn:li:comment:(activity:7292563473387896832,7292564759340630018)"
          }
        ],
        "commentAdded": "What an incredible opportunity! Excited to see so many diverse voices in AI come together. Dont miss out—apply now! 🚀 #GenAISummit"
      },
      {
        "postId": "urn:li:activity:7292542071393894400",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292542071393894400",
        "url": "https://www.linkedin.com/in/franz-josef-schrepf?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABkJk6YBbMwKdw6Jr4N2SRyV5WAKsg735BQ",
        "name": "Franz-Josef Schrepf\nFranz-Josef Schrepf",
        "content": "How do you know if the company you're interviewing with is ready for partnerships? \n\nJason Yarborough shared a helpful framework to assess whether companies are ready to invest in partnerships.\n\nIn short, ask the execs:\n\n\"Are you partner curious, or partner supportive?\"",
        "reactions": {
          "likes": "10",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/b129a0cb-277f-4796-be26-5ecd945d461b",
        "comments": [
          {
            "commentText": "The difference between the two is noteworthy. And one worth discovering. Great chat, my captain!",
            "userName": "Jason Yarborough 🐻",
            "userProfileURL": "https://www.linkedin.com/in/yarby",
            "dataId": "urn:li:comment:(ugcPost:7292451880192880641,7292534929660203008)"
          }
        ],
        "commentAdded": "Great insights, Jason! Understanding a companys partnership mindset is key to successful collaborations. Excited to explore this framework further!"
      },
      {
        "postId": "urn:li:activity:7292463159229968387",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292463159229968387",
        "url": "https://www.linkedin.com/company/kpmgindia/posts",
        "name": "KPMG India\nKPMG India",
        "content": "#UnionBudget2025 | \nhashtag\n#Budget2025 addresses sustainability, social equity, and efficient governance, it aims to create a more resilient and prosperous economy.'s PoV presents a comprehensive impact of Budget proposals on\n- Download a gadget-friendly copy today! For more, visit",
        "reactions": {
          "likes": "33",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Exciting initiatives in #Budget2025! Thrilled to see a focus on sustainability and social equity. Lets build a resilient economy together! 🌱💼"
      },
      {
        "postId": "urn:li:activity:7292570225458233345",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292570225458233345",
        "url": "https://www.linkedin.com/in/retentionadam?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAn6cNQB-3DeWLieTXNmiuo8Bs-0VvHPgYA",
        "name": "Adam Robinson\nAdam Robinson",
        "content": "We closed January at $25.3m ARR (+.8%). RB2B was up 9% at $4.5m ARR and Retention.com was down 1% at $20.8m ARR. Here’s what went well (and not so well) last month:\n\nWhat went well:\n\n1. Despite cutting all marketing expense in Dec ($100k/mo), RB2B grew 9%\n2. First true enterprise deal closed on Dec 31 at Retention!\n3. We're making progress on our “run the signal through CRM” hypothesis at RB2B, SFDC integration finishes this week\n4. Forming a VERY strong partnership w/ Bloomreach at R!\n5.planned what will be an amazing full-team offsite next week\n6. We substantially improved our identity at RB2B - much higher coverage\n7. We are SOC2 Type II Compliant (and I need to add it to our websites)\n8.thinks we had our best Live Event (with Clay) last week - I agree\n9. We generated $1,112,904 of free cash (profit) in January\n\nWhat went NOT so well:\n\n1. Everybody in ecomm who is going to cancel does so after the holidays\n2. RB2B product is nowhere close to where we want it to be (but it will be)\n3. I am very confused about how to look at attribution with RB2B\n\nTAKEAWAY:\n\nWe shrunk 2.5% in Q124, but ended up growing 15% y-o-y.\n\nWe also shrunk in Q121 and Q122.\n\n(The only reason we didn’t in Q123 is we were having an out-of-body product-market fit experience that has since subsided)\n\nI think Q1 is a hard quarter for anybody selling to ecommerce.\n\nThankfully, somehow, RB2B came to the rescue this January.\n\nBut here’s the crazy thing…\n\nFor the life of me, I can’t understand WHY it came to the rescue.\n\nI declared RB2B dead on Nov 21, and between then and Jan 1 we got so absolutely slaughtered by churn that we didn’t grow at all.\n\nI also chopped all of our marketing expense, because my view was we were burning leads bringing people on to a product that wasn’t ready yet.\n\nWhat happened?\n\nUp 9% month-over-month.\n\nTo $4.5m ARR.\n\nFor the life of me I can’t explain how or why that happened.\n\nBut here I am - once again - saying I cut spend and growth sped up.\n\nJust like in mid-2023, when I cut our BDR org.\n\nMaybe the Startup Gods just wants to send me a message.\n\nThe most valuable message a founder could ever hear.\n\nWhat’s that message?\n\n“Get smaller… and thank me later.”\n\nP.S.\n\nI started a newsletter. Join 40,000+ subscribers as I share everything about growing my third SaaS startup to $10m ARR.",
        "reactions": {
          "likes": "58\nDaren Lauda and 57 others",
          "comments": "13 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Cyclicality.\n\nB2B Buyers on the Traditional Fiscal calendar Jan - Dec.\nEcom Buyers on the Lunar cycle: March - Feb.\n\nBudget refreshes are beautiful and Brands don't buy after seeing an ad for 1 month.",
            "userName": "Jeremy Horowitz'",
            "userProfileURL": "https://www.linkedin.com/in/jeremyhorowitz1",
            "dataId": "urn:li:comment:(activity:7292565313458446336,7292566690872066051)"
          }
        ],
        "commentAdded": "Incredible resilience despite challenges! It’s fascinating how strategic cuts can lead to unexpected growth. Excited to see where RB2B heads next!"
      },
      {
        "postId": "urn:li:activity:7292532909729533952",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292532909729533952",
        "url": "https://www.linkedin.com/in/sattari-sateesh-kumar?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACiRqIsBEhVfqI5WqE4S3Dlf5H4UPRq9Wig",
        "name": "Sattari Sateesh Kumar\nSattari Sateesh Kumar",
        "content": "Exciting News \n\nI’m happy to share that I’ve ranked among the top 5% of professionals on Topmate this January and earned the Rising Star recognition!\n\nThis motivates me to keep learning and growing in the data field. Thanks to everyone for your support! Let’s keep pushing forward in 2025!\n\nCheck out my Topmate for free guidance ↠",
        "reactions": {
          "likes": "13",
          "comments": "4 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Congratulations!",
            "userName": "Raushan Kumar",
            "userProfileURL": "https://www.linkedin.com/in/raushan-kumar-553154297",
            "dataId": "urn:li:comment:(ugcPost:7292532908907499520,7292535697880535041)"
          },
          {
            "commentText": "Thanks ",
            "userName": "Sattari Sateesh Kumar",
            "userProfileURL": "https://www.linkedin.com/in/sattari-sateesh-kumar",
            "dataId": "urn:li:comment:(ugcPost:7292532908907499520,7292536229462523904)"
          },
          {
            "commentText": "Congratulations! Sir",
            "userName": "Sharath Naik BC",
            "userProfileURL": "https://www.linkedin.com/in/sharathnaikbc",
            "dataId": "urn:li:comment:(ugcPost:7292532908907499520,7292567961725284352)"
          },
          {
            "commentText": "Thanks ",
            "userName": "Sattari Sateesh Kumar",
            "userProfileURL": "https://www.linkedin.com/in/sattari-sateesh-kumar",
            "dataId": "urn:li:comment:(ugcPost:7292532908907499520,7292571152126787587)"
          }
        ],
        "commentAdded": "Congratulations on this impressive achievement! Your dedication to growth in the data field is truly inspiring. Keep shining! 🌟"
      },
      {
        "postId": "urn:li:activity:7292553424011681793",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292553424011681793",
        "url": "https://www.linkedin.com/in/jpwiggins?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAACfW58B0NYekiAJFP_4WRolM7MJx7UhOcI",
        "name": "JP Wiggins\nJP Wiggins",
        "content": "In time for Manifest, 1Logtech is excited to announce the AI-driven capabilities of our Transportation iPaaS. By feeding the AI sample data, it does the heavy lifting cutting over 80% of the time and effort needed to create integrations.\n\nFor example we are creating NEW APIs for LTL carriers the SAME DAY—a massive improvement over traditional, old-school development processes.\n\nThis same process works on any API—WMS, YMS, ERP—you name it!\n\nThis is game-changing! If you're at Manifest this year, be sure to stop by Booth K1 in the Innovation Zone!",
        "reactions": {
          "likes": "8",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Looking forward to catching up JP!",
            "userName": "Lance Healy",
            "userProfileURL": "https://www.linkedin.com/in/lance-healy-a3a361",
            "dataId": "urn:li:comment:(activity:7292546902821142528,7292555479451344896)"
          }
        ],
        "commentAdded": "Exciting innovation! 🚀 Streamlining integration processes will transform the industry. Cant wait to see it in action at Manifest! #AI #Logistics"
      },
      {
        "postId": "urn:li:activity:7292571987581800451",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292571987581800451",
        "url": "https://www.linkedin.com/in/christinalangdoncoachconsultant?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAFTKXUBfbA1AVJGERPumW45HsdACxqLq8E",
        "name": "Christina Langdon - Success Coach\nChristina Langdon - Success Coach",
        "content": "Everyone is 100% committed.\nYou can tell what you're committed to by the results you are producing.\n\nThis quote revealed something I’ve been dancing around for years:\n\nI wasn't lacking commitment – I was committed to the wrong things.\n\nAs a high performer, I wore my exhaustion like a badge of honor some days. Three-hour daily commutes, back-to-back meetings, multitasking through conversations that deserved full attention.\n\nThese weren't signs of dedication; they were evidence of my commitment to chaos.\n\nI was perfectly successful on paper and perfectly miserable in reality.\nWhile grinding away at my publishing career, I wasn't committed to impact or growth. I worked with a Coach to help me see it.\n\nIt was costing me time, money, exhaustion, and joy.\n\nI was committed to being busy, to being productive, to my performance of \"doing more than most.\"\n\nI collected promotions and achievements, but they felt hollow because they weren't aligned with what I truly wanted to create in the world.\n\nI hear the same themes echoing in my leadership workshops and from my 1:1 clients:\n\"I don't have enough time,\"\n\"I'm at capacity,\"\n\"I can't see another way.\"\n\nHere's what I've learned – these aren't capacity issues; they're commitment issues.\n\nWe're all operating at 100% commitment; we're just not always conscious of what we're committed to.\n\nAs 2025 unfolds, I'm making a radical change. Not by working harder and doing more but by becoming the caretaker of my energy.\n\nI'm committed to this year looking different from the last. Are you?\n\nNot through increased activity but through crystal-clear intention.\nWithout this clarity, I risk living the same year on repeat. How about you?\n\nAlex Hormozi, entrepreneur and investor (a bit whacky and super smart), defines success not by what he achieves but by the quality and quantity of his \"nos.\"\n\nClear commitment isn't about adding more; it's about choosing better.\n\nRecognize that every \"yes\" is also a commitment to our most precious resource: our energy.\n\nYou're already 100% committed. The question is: to what?\n\n#2025\n____________________________________\n\nWorking with a Coach changed my life.\n\nIt helped me get off the hamster wheel, working on default each day. It's why I became a Coach. My operational experience, matched with my Human A-I Coaching curriculum, delivers exceptional results for my high-achieving clients who want freedom, ease, and impact.\n\nDM me for a chemistry call.",
        "reactions": {
          "likes": "0",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Powerful insights! Its so true that alignment with our true values leads to real success. Excited to hear how 2025 unfolds for you! 🌟"
      },
      {
        "postId": "urn:li:activity:7292568440362414081",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292568440362414081",
        "url": "https://www.linkedin.com/in/soniahunt?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAAfioBZ9Sc_-P9Ib4GOMlSuYFbV6Afko4",
        "name": "Sonia Hunt\nSonia Hunt",
        "content": "𝟱 𝗧𝗵𝗶𝗻𝗴𝘀 𝗜'𝘃𝗲 𝗟𝗲𝗮𝗿𝗻𝗲𝗱 𝗔𝗯𝗼𝘂𝘁 𝗗𝗲𝗲𝗽𝗦𝗲𝗲𝗸 & 𝗔𝗜’𝘀 𝗙𝘂𝘁𝘂𝗿𝗲:\n\n\n1. 𝗟𝗟𝗠𝘀 𝗪𝗶𝗹𝗹 𝗕𝗲𝗰𝗼𝗺𝗲 𝗮 𝗖𝗼𝗺𝗺𝗼𝗱𝗶𝘁𝘆\n-You don’t need to be a billion-dollar company to build an LLM.\n-While models differ slightly, they largely function the same.\n-The real differentiator is how you fine-tune and apply them.\n\n2. 𝗛𝘆𝗽𝗲 ≠ 𝗕𝘂𝘀𝗶𝗻𝗲𝘀𝘀 𝗜𝗺𝗽𝗮𝗰𝘁\n-The best AI model for your business depends on your use case.\n-Experiment internally first—roll it out to employees.\n-Test responses, Track the data, and Tweak before scaling.\n\n3. 𝗕𝘂𝗶𝗹𝗱 𝘃𝘀. 𝗛𝗼𝘀𝘁: 𝗖𝗵𝗼𝗼𝘀𝗲 𝗪𝗶𝘀𝗲𝗹𝘆\n-Keeping AI models in-house requires major $$$$$.\n-Opt for a hybrid approach, leveraging other GPTs or renting GPUs to test before committing.\n-Security, governance, and ROI should drive decisions.\n\n4. 𝗔𝗜 𝗔𝗴𝗲𝗻𝘁𝘀 𝗔𝗿𝗲 𝘁𝗵𝗲 𝗡𝗲𝘅𝘁 𝗕𝗶𝗴 𝗕𝗲𝘁\n-VCs are pouring money into AI agents.\n-These tools automate repetitive processes and trigger actions instantly.\n-The key is to keep them tuned as business needs evolve.\n\n5. 𝗪𝗼𝗺𝗲𝗻’𝘀 𝗩𝗼𝗶𝗰𝗲𝘀 𝗔𝗿𝗲 𝗡𝗲𝗲𝗱𝗲𝗱 𝗶𝗻 𝗔𝗜\n-AI is shaping the future, yet conversations often lack diverse perspectives.\n-We need more women at the forefront of these discussions—on stage and in leadership.\n\nAI is a journey, not a one-time implementation.\n\nBe intentional, start with a project, and continuously refine your approach.\n\nMany thanks toandfor an interesting discussion on 'Microsoft & DeepSeek - What to Know.'\n\nWhere do you see AI making the biggest impact in your business?",
        "reactions": {
          "likes": "1",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Great insights! The emphasis on womens voices in AI is crucial for innovation. Continuous refinement is key to harnessing AIs potential!"
      },
      {
        "postId": "urn:li:activity:7292556095967924224",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292556095967924224",
        "url": "https://www.linkedin.com/in/craigtingram?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAC12SoBZeLuTgIYyJtj282OyjM8pnN-tbA",
        "name": "Craig T. Ingram\nCraig T. Ingram",
        "content": "One week challenge: Go to your business coach (that you’re paying), and ask that person if they see you settling too often for mediocrity. \n\nBeing a high achiever is lonely. I have to admit… That I have been lonely many times throughout my career, because my standard is extremely high.\n\nMy level of expectation of myself in being able to perform in the business world at an elite level keeps me in a mode of continuous learning and being coached by ultra high level serial entrepreneurs.\n\nBusiness is hard! And the only way to stay at a level of high-performance is accountability and not settling for mediocrity.\n\n93.4% of businesses never achieve $1 million in annual revenue.\n\nBut if you are a person who has individually grew a business from zero dollars to $1 million in revenue, you are more effective than 93.3% of the people on planet Earth doing business.",
        "reactions": {
          "likes": "2",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/ff4a7c7d-5ccf-49f9-9192-f12c93064451",
        "comments": [],
        "commentAdded": "Absolutely! Embracing accountability and striving for excellence is key. Lets push past mediocrity together and redefine success! 💪🚀"
      },
      {
        "postId": "urn:li:activity:7292508320202940417",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292508320202940417",
        "url": "https://www.linkedin.com/company/kpmgindia/posts",
        "name": "KPMG India\nKPMG India",
        "content": "#UnionBudget2025 | The Union \nhashtag\n#Budget2025 strengthens India’s economic transformation with strategic reforms and a growth-centric approach. With a sharp focus on investment, consumption, and deregulation, it paves the way for a more dynamic and attractive business destination setting the country firmly on the path to becoming the third largest economy in the next few years:,at our Tax event in Gurugram.\n\nFor Budget-related insights, visit our microsite",
        "reactions": {
          "likes": "37",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Exciting times ahead for Indias economy! The focus on strategic reforms and investments in #Budget2025 truly sets the stage for growth. 🌟"
      }
    ],
    "errors": [
      {
        "postId": "urn:li:activity:7292477157904179200",
        "url": "https://www.linkedin.com/in/marianna-outsia-48974b9a?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABUchOkBCpQtnZTjT4cnylaX9tuwAm8N1RU",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292573067103371265",
        "url": "https://www.linkedin.com/in/duke-rem-%F0%9F%90%A2-793616267?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAEFotd8BDwR_osR-3ROnxQtd2JpPvWbizfw",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292571019750301697",
        "url": "https://www.linkedin.com/in/hlarsson?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAPSV0ABtIkvReoAAi4HomczTBrxcMUlSEo",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292524037933543424",
        "url": "https://www.linkedin.com/in/eri-nitani-1126a0204?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADQSMp4BbTTlsMzUNWJqgZJeH67dMimWG4I",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292492961211133952",
        "url": "https://www.linkedin.com/in/anjalleegupta?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAACbdPgB6R6nZbKd8CKxHO4mfB6JKjANC8E",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292533105469390848",
        "url": "https://www.linkedin.com/in/daniel-goodman2001?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAeS6L0BdHsGXRto-nWwwPVPt8hNYJ4niZI",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292455484358279169",
        "url": "https://www.linkedin.com/in/michal-choinski-49373112a?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAB_JsG8B8ml_6hEUq3duUXz9bAtdk6PPF_I",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292553741461860352",
        "url": "https://www.linkedin.com/in/romanmohren?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAp2DkBDFXXvlUlO0ZdH_icizuwqplzl5g",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292563473387896832",
        "url": "https://www.linkedin.com/in/cassidyreid?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABme90QBGkfPlg6fO-lLixoLBXnPfcJdFCg",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292463159229968387",
        "url": "https://www.linkedin.com/company/kpmgindia/posts",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292570225458233345",
        "url": "https://www.linkedin.com/in/retentionadam?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAn6cNQB-3DeWLieTXNmiuo8Bs-0VvHPgYA",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292532909729533952",
        "url": "https://www.linkedin.com/in/sattari-sateesh-kumar?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACiRqIsBEhVfqI5WqE4S3Dlf5H4UPRq9Wig",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292553424011681793",
        "url": "https://www.linkedin.com/in/jpwiggins?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAACfW58B0NYekiAJFP_4WRolM7MJx7UhOcI",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292571987581800451",
        "url": "https://www.linkedin.com/in/christinalangdoncoachconsultant?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAFTKXUBfbA1AVJGERPumW45HsdACxqLq8E",
        "errors": [
          "Failed to fetch reactions.",
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292568440362414081",
        "url": "https://www.linkedin.com/in/soniahunt?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAAfioBZ9Sc_-P9Ib4GOMlSuYFbV6Afko4",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292508320202940417",
        "url": "https://www.linkedin.com/company/kpmgindia/posts",
        "errors": [
          "Failed to fetch media URL."
        ]
      }
    ]
  },
  {
    "postsData": [
      {
        "postId": "urn:li:activity:7292564502955364353",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292564502955364353",
        "url": "https://www.linkedin.com/in/andre-gaubert-535720126?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAB8TGPkBp83eD5LGxKfb5oqgJqsQABOa_Yg",
        "name": "Andre Gaubert\nAndre Gaubert",
        "content": "This January, I have had the misfortune of being sick for two out of the past four weekends. During the Minnesota winter, it's pretty common for illness like the flu, colds, and other viruses to start spreading around due to more people being indoors and exposure to cold weather\n\nDuring my times being sick however, I often am reminded of the importance of rest and taking care of oneself. As someone who tends to be constantly moving at times, slowing down and resting can be challenging.\n\nAs a data/ technology professional working in data consulting, there is a constant drive to generate the best possible product/results for the clients we work with.\n\nWith how detail-oriented, solution-driven, and analytical minded data professionals need to be in order to succeed, it's easy to forget how much that drive can wear us out and mentally exhaust us.\n\nIt's important therefore, to give yourself breaks and rest when you know you're worn out (sick or not), and have time to rest, so that way, you have the energy and attention to drive solid data drive results when the time is the perform.\n\nAt the end of the day, there is always performance element to delivering solid data driven solutions.\n\nLike most performers in general, it's hard to perform your best when you know you aren't at your best.\n\nTake care of yourself this Q1 everyone!",
        "reactions": {
          "likes": "2",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Thank you for sharing this important reminder! Balancing drive with self-care is essential for long-term success in any field. Get well soon!"
      },
      {
        "postId": "urn:li:activity:7292288417613103104",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292288417613103104",
        "url": "https://www.linkedin.com/in/parkerence?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAKyyZwBcmcv0k6C_WRciDmRXSbFtuia5DM",
        "name": "Parker Ence\nParker Ence",
        "content": " Big news at Jump - Advisor AI today: we closed a $20M series A round led by Battery Ventures, with Citi Ventures, Sorenson Capital, and Pelion Venture Partners!\n\nI love working with our customers and I feel grateful every day that we can support them in some small way as they help more than a third of the population navigate some of the most important decisions of their lives. This funding round means we can continue to build even faster - more AI tools for advisors that help them put on the \"ironman suit\" towards our mission to empower advisors and their customers to thrive in the age of AI!\n\nGoing from 1 customer to thousands of customers, from 3 cofounders to over 50 team members, and launching partnerships with wonderful technology companies and leading advisor networks all in the last 365 days has been the ride of a lifetime. I am so happy to share this journey with Jump cofoundersandas well as,,, and the rest of our INCREDIBLE Jump team. (We are hiring for many new roles - check them out at!)\n\nWe are excited thatfrom Battery Ventures is leading our Series A - he brings extremely relevant experience from his time as an early investor and long time board member of Gong as well as with dozens of other successful companies such as Databricks. We are also excited to welcome Citi Ventures as Jump investors - they bring great industry perspective and connections. They join our existing investorsandat Sorenson andand team at Pelion who are incredible partners, andwho backed us pre-idea.\n\nSome companies raise big VC checks and then set that money on fire, wasting it quickly on their way to bankruptcy. That’s not our style—we have been close to cash flow positive this year and raised this round not because we were almost out of our seed money but because we wanted to move even faster to meet the demand for great advisor AI tools.\n\nToday, our customers tell us that they save an average of 1-2 hours per workday with Jump's meeting assistant, and in some cases, have increased client service deliverables by 20-50% per advisor. Jump has developed a reputation for providing category defining advisor-specific workflows, integrations, and customization options, while enabling enterprise compliance teams with lots of options and a path to sign off on safe AI deployment in a highly regulated space. Expect to see lots more from Jump in each of these areas, plus plenty of new things this year as we build ever faster...\n\nIf you are an advisor or are otherwise in financial services, please check us out at- our team would love to meet you!",
        "reactions": {
          "likes": "386",
          "comments": "129 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Congrats!!",
            "userName": "📱 Zach Barney",
            "userProfileURL": "https://www.linkedin.com/in/zachbarney",
            "dataId": "urn:li:comment:(ugcPost:7292225468227891200,7292288308833828865)"
          }
        ],
        "commentAdded": "Congratulations to the entire Jump team on this milestone! Excited to see how this funding will accelerate innovation in advisor AI tools! 🚀"
      },
      {
        "postId": "urn:li:activity:7292545025513570304",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292545025513570304",
        "url": "https://www.linkedin.com/in/walterlcrosby?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABnRy4BfAi04dsWOrVfiDq5Fz8C2uALVWA",
        "name": "Walter Crosby\nWalter Crosby",
        "content": "There's something worse than missing numbers - it's normalizing missed numbers.\n\nEvery time your underperformers stay comfortable in mediocrity, they're teaching the rest of your team a dangerous lesson: \"It's okay to fall short.\"\n\nCulture isn't just what you promote - it's what you permit.\n\n️ What's your non-negotiable performance standard? Share below.",
        "reactions": {
          "likes": "0",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/c9682054-f438-46b2-8cf6-6fdd570a4dea",
        "comments": [],
        "commentAdded": "Absolutely agree! A strong culture thrives on accountability. Clear standards inspire excellence across the board. What strategies do you use to enforce this?"
      },
      {
        "postId": "urn:li:activity:7292572283276062721",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292572283276062721",
        "url": "https://www.linkedin.com/in/meredithsims?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAHSh-ABN29gVRjGDr1KMTQ6uv8f-qqWj1E",
        "name": "Meredith Sims, ChFC®, CSRIC®\nMeredith Sims, ChFC®, CSRIC®",
        "content": "When you hear \"net worth,\" you probably think about money—what’s in your bank account, what you own, what you owe. And yes, that’s important. It gives you a big-picture view of your finances, something I often find missing when I first talk to clients.\n\nBut real wealth? That goes beyond dollars and cents.\n\nWhat about your skills and talents? Your experiences, health, relationships? And a big one for me—your time. Time to explore, to travel, to enjoy life on your terms.\n\nSo yes, track your financial net worth. Just don’t let it define your full value. Because when you step back, your true worth is so much more.",
        "reactions": {
          "likes": "1",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "True wealth isn’t just about money; it’s the value of your time, relationships, and experiences that truly define a fulfilling life.",
            "userName": "Jon W. Lassiter",
            "userProfileURL": "https://www.linkedin.com/in/jon-w-lassiter",
            "dataId": "urn:li:comment:(activity:7292569507632459777,7292572223481995264)"
          }
        ],
        "commentAdded": "Absolutely! True wealth encompasses our skills, relationships, and time. Its vital to see the bigger picture beyond just finances! 🔑✨"
      },
      {
        "postId": "urn:li:activity:7292551548516134912",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292551548516134912",
        "url": "https://www.linkedin.com/in/sellwithjb?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAdS_MgB_9odrFWIpkQ2HIOknAy8Z19gx7E",
        "name": "Jennifer Bleam, Sales Sherpa\nJennifer Bleam, Sales Sherpa",
        "content": " BEFORE: Stagnant pipeline\n AFTER: Consistent momentum\n\n BEFORE: A sales team that was stuck\n AFTER: A sales team that's executing with confidence\n\nTHIS is the transformation possible with the Channel Sales Accelerator!\n\nWith personalized coaching twice per month from two industry sales experts, you’ll leave behind missed quotas and make stagnant growth a thing of the past.\n\nOnly 9 beta spots remain.\n\nLearn more about the Channel Sales Accelerator today.",
        "reactions": {
          "likes": "0",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Exciting transformation! 🎉 Investing in personalized coaching can truly unlock a teams potential. Best of luck with the Channel Sales Accelerator!"
      },
      {
        "postId": "urn:li:activity:7292482073888456705",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292482073888456705",
        "url": "https://www.linkedin.com/in/llenguito?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAC8HlMBkxkXGbjqfdHpbnGm_SZ8GDKx7EA",
        "name": "Luigi LENGUITO\nLuigi LENGUITO",
        "content": "Adversary are creating AI-twins scraping information about each of us from social media and other online sources. Phishing will become ever more credible as the tone, information and requests will be spectacularly tuned.\n\nA few items to consider :\n- ACM - Always Change Medium : never follow-up answering a message , switch to a different media of random choice (email -> phone, phone -> whatsapp, whatsapp -> slack, slack -> text,etc.)\n- Identity Keyword - agree with your close circle an individually dedicated special word, something that is not in the ether/media - but is memorable, to be used to validate identity\n- Verify, then trust : lower the level of trust you put in online media, always look for alternative sources before accepting an information as true.",
        "reactions": {
          "likes": "17",
          "comments": "3 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Phishing's evolving from \"Dear Sir/Madam, urgent assistance required\" to eerily accurate imitations of real people. A deepfake voice here, a cloned writing style there—suddenly, your boss is \"totally\" asking you to wire money to an offshore account. Brave new world, indeed :P",
            "userName": "Zsolt N.",
            "userProfileURL": "https://www.linkedin.com/in/zsoltnemeth",
            "dataId": "urn:li:comment:(activity:7292482073888456705,7292486952421908480)"
          },
          {
            "commentText": "Zsolt N. impersonation risk started with Adam and Eve, just saying....",
            "userName": "Luigi LENGUITO",
            "userProfileURL": "https://www.linkedin.com/in/llenguito",
            "dataId": "urn:li:comment:(activity:7292482073888456705,7292488194166538240)"
          },
          {
            "commentText": "Luigi LENGUITO Serpent convinces Eve, Eve convinces Adam, and boom, unauthorized access to the Tree of Knowledge. Classic phishing scam. :P",
            "userName": "Zsolt N.",
            "userProfileURL": "https://www.linkedin.com/in/zsoltnemeth",
            "dataId": "urn:li:comment:(activity:7292482073888456705,7292489246433513474)"
          }
        ],
        "commentAdded": "Great insights! Staying vigilant and adapting our communication methods is crucial in this evolving digital landscape. Trust must be earned!"
      },
      {
        "postId": "urn:li:activity:7292559135085133824",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292559135085133824",
        "url": "https://www.linkedin.com/groups/762547?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A762547-7292559134120370176",
        "name": "Big Data 🟥 Data Science | Machine Learning | Deep Learning | Artificial Intelligence\nBig Data 🟥 Data Science | Machine Learning | Deep Learning | Artificial Intelligence",
        "content": "(Open Access, 2024 Edition) Hands-On Data Visualization: Interactive Storytelling From Spreadsheets to Code - https://lnkd.in/dvXBpTJY\nLook for \"Read and Download Links\" section to download. Follow/Connect me if you like this post.",
        "reactions": {
          "likes": "6",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Exciting to see new resources on data visualization! Looking forward to diving into this edition. Thanks for sharing! #DataStorytelling"
      },
      {
        "postId": "urn:li:activity:7292511095842291713",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292511095842291713",
        "url": "https://www.linkedin.com/in/sattari-sateesh-kumar?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACiRqIsBEhVfqI5WqE4S3Dlf5H4UPRq9Wig",
        "name": "Sattari Sateesh Kumar\nSattari Sateesh Kumar",
        "content": "𝗗𝗮𝘆 𝟭𝟰 𝗣𝘆𝗦𝗽𝗮𝗿𝗸 𝗦𝗲𝗿𝗶𝗲𝘀 – 𝗠𝗮𝗽 𝘃𝘀 𝗙𝗹𝗮𝘁𝗠𝗮𝗽\n\nIn today's post, we're diving into two fundamental transformations in PySpark 𝗺𝗮𝗽() and 𝗳𝗹𝗮𝘁𝗠𝗮𝗽(). While both allow us to apply functions to elements in an RDD but they have distinct behaviors when it comes to the output structure.\n\nIn this post, I’ll explain how both of these transformations work, with simple examples. By the end, you'll know when to use each one!\n\nLet’s dive in and learn how map() and flatMap() can help you transform data!\n\n️ Repost if you found this useful\n Follow me for more\n‍ For 1:1 guidance →",
        "reactions": {
          "likes": "13",
          "comments": "4 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Very informative",
            "userName": "SureshKumar Vasikarla",
            "userProfileURL": "https://www.linkedin.com/in/sureshkumar-vasikarla-8aaa7595",
            "dataId": "urn:li:comment:(ugcPost:7292511094722416640,7292516622991273985)"
          },
          {
            "commentText": "Thanks ",
            "userName": "Sattari Sateesh Kumar",
            "userProfileURL": "https://www.linkedin.com/in/sattari-sateesh-kumar",
            "dataId": "urn:li:comment:(ugcPost:7292511094722416640,7292517790207381504)"
          },
          {
            "commentText": "Useful tips",
            "userName": "Ashutosh Agrawal",
            "userProfileURL": "https://www.linkedin.com/in/ashutosh-agrawal-a2304912a",
            "dataId": "urn:li:comment:(ugcPost:7292511094722416640,7292541244260413440)"
          },
          {
            "commentText": "Thanks",
            "userName": "Sattari Sateesh Kumar",
            "userProfileURL": "https://www.linkedin.com/in/sattari-sateesh-kumar",
            "dataId": "urn:li:comment:(ugcPost:7292511094722416640,7292544996400934912)"
          }
        ],
        "commentAdded": "Great insights on PySpark transformations! Understanding map() vs flatMap() is crucial for effective data processing. Looking forward to your examples!"
      },
      {
        "postId": "urn:li:activity:7292557554507825152",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292557554507825152",
        "url": "https://www.linkedin.com/in/madina-shaik?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAMt6EBi3qIcpvVfoL8w-6iIfHsEYsaaPA",
        "name": "Madina Shaik\nMadina Shaik",
        "content": "How do you know it’s going to be a good year? When you end January with solid wins thanks to a driven leadership team.\n\nOur company is growing—not just in revenue and headcount, but in culture. We’re focused on building a culture of innovation, balance, and synergy, and our new leadership additions over the past few years have been key in shaping this growth.\n\n2025, we're coming for you. Bolder ideas, bigger goals, and brighter moments ahead.\n\n\n\nA special thanks to our Board:\nTadaweb Head of US DOD/IC\nRetired Air Force Major Gen.\nRetired Brigadier Gen.\nFormer Army SES",
        "reactions": {
          "likes": "6",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Exciting times ahead! Cheers to a thriving culture and the impactful leadership guiding Tadaweb to new heights! 🚀 #Innovation #Growth"
      },
      {
        "postId": "urn:li:activity:7292542767434530816",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292542767434530816",
        "url": "https://www.linkedin.com/company/inc-tank-gtm/posts",
        "name": "Inc Tank GTM\nInc Tank GTM",
        "content": "Welcome to the Flagship Edition of The Inkubator Dispatch – Where Tech Meets Hospitality (and Your Bottom Line)\n\n Friends, Technologists Operators, Tech Skeptics—Lend Me Your Clicks!\nThis is not your average, feel-good, “let’s talk about industry trends” newsletter. Nope. This is a flashlight in the haunted house of hospitality tech—where every new SaaS subscription comes with promises of profit but often just eats into it instead.\n\nWe’re here to talk about the real numbers, the real headaches, and the real future of hospitality tech—minus the fluff. If you’ve ever looked at your tech stack and thought:\n\n \"Why do I have 14 different subscriptions to run a single restaurant?\"\n \"Wait… am I actually making money on this stuff?\"\n \"If one more vendor says ‘game-changer,’ I’m throwing my POS out the window.\"\n\nThen, welcome home!\n\nThis flagship edition of The Inkubator Dispatch kicks off with SaaS-Quatch: The Mythical ROI of Hospitality Tech—a deep dive into the growing monster of SaaS fatigue, how much it's really costing you, and what the future looks like as operators start pushing back.\n\nWhy should you care? Because if you’re in the business of selling food, running hotels, or keeping the lights on in hospitality, the tech you choose directly impacts your profitability. We’re here to help you cut through the noise, call out the BS, and highlight the solutions that actually work.\n\n Buckle up—The Inkubator Dispatch is fast, fun, and dangerously honest. And if we do our job right? You might just make (and keep) more money.\nNow, let’s get into it.\n\nRead the first edition here! ",
        "reactions": {
          "likes": "4",
          "comments": "2 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "And don't forget that the SaaS takes up management time to config and operate... a cost on top of SaaS and some of the UI/uX was designed during the horse and buggy days, really hard to operate so people tend to give up. AI operators are going to clean some clocks in the market.",
            "userName": "Seth Temko",
            "userProfileURL": "https://www.linkedin.com/in/sethtemko",
            "dataId": "urn:li:comment:(ugcPost:7292539835007860737,7292542300809822210)"
          }
        ],
        "commentAdded": "Excited to see a no-nonsense approach to hospitality tech! Lets cut through the fluff and focus on real solutions. Great initiative! 🚀"
      }
    ],
    "errors": [
      {
        "postId": "urn:li:activity:7292564502955364353",
        "url": "https://www.linkedin.com/in/andre-gaubert-535720126?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAB8TGPkBp83eD5LGxKfb5oqgJqsQABOa_Yg",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292288417613103104",
        "url": "https://www.linkedin.com/in/parkerence?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAKyyZwBcmcv0k6C_WRciDmRXSbFtuia5DM",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292545025513570304",
        "url": "https://www.linkedin.com/in/walterlcrosby?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABnRy4BfAi04dsWOrVfiDq5Fz8C2uALVWA",
        "errors": [
          "Failed to fetch reactions."
        ]
      },
      {
        "postId": "urn:li:activity:7292572283276062721",
        "url": "https://www.linkedin.com/in/meredithsims?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAHSh-ABN29gVRjGDr1KMTQ6uv8f-qqWj1E",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292551548516134912",
        "url": "https://www.linkedin.com/in/sellwithjb?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAdS_MgB_9odrFWIpkQ2HIOknAy8Z19gx7E",
        "errors": [
          "Failed to fetch reactions.",
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292482073888456705",
        "url": "https://www.linkedin.com/in/llenguito?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAC8HlMBkxkXGbjqfdHpbnGm_SZ8GDKx7EA",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292559135085133824",
        "url": "https://www.linkedin.com/groups/762547?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A762547-7292559134120370176",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292511095842291713",
        "url": "https://www.linkedin.com/in/sattari-sateesh-kumar?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACiRqIsBEhVfqI5WqE4S3Dlf5H4UPRq9Wig",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292557554507825152",
        "url": "https://www.linkedin.com/in/madina-shaik?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAMt6EBi3qIcpvVfoL8w-6iIfHsEYsaaPA",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292542767434530816",
        "url": "https://www.linkedin.com/company/inc-tank-gtm/posts",
        "errors": [
          "Failed to fetch media URL."
        ]
      }
    ]
  },
  {
    "postsData": [
      {
        "postId": "urn:li:activity:7292449283306401793",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292449283306401793",
        "url": "https://www.linkedin.com/in/varun1175?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACKnKlcBjbVuNxmqTWxj41k1DP__pQV5F-w",
        "name": "VARUN YADAV\nVARUN YADAV",
        "content": "American Express just unlocked time travel! ⏳\n\nTheir offer is valid from Feb 1, 2025, to Jan 28, 2025—letting users visit the past before the future even begins!\n\nAt ₹66,000 + taxes, do we get a DeLorean too? ",
        "reactions": {
          "likes": "8\nVARUN YADAV and 7 others",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Time travel already? Exciting innovation from American Express! 🚀 Curious to see how this will shape travel experiences.  #FutureOfTravel"
      },
      {
        "postId": "urn:li:activity:7292535143095750656",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292535143095750656",
        "url": "https://www.linkedin.com/in/robertsjeff?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAeZvQUBybFX1rFWHMOHhOcZiZKlyH6HX5k",
        "name": "Jeff Roberts\nJeff Roberts",
        "content": "Microsoft and OpenAI are entering the next phase of their partnership, focusing on advancing AI technology and scaling the infrastructure needed to support it. According to Microsoft, this collaboration aims to accelerate innovation while ensuring responsible development and deployment of AI solutions.\n\nKey priorities include advancing AI capabilities, expanding the reach of AI infrastructure, and addressing the ethical challenges associated with rapid technological progress. This partnership reflects the growing emphasis on AI's role in shaping industries and the need for collaboration to navigate its complexities.\n\nRead more on Microsoft:",
        "reactions": {
          "likes": "1",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Exciting developments ahead! This partnership is crucial for driving responsible AI innovation and tackling ethical challenges. Looking forward to the advances!"
      },
      {
        "postId": "urn:li:activity:7292572671702106112",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292572671702106112",
        "url": "https://www.linkedin.com/in/samfjacobs?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAASN2cBeFTWjYgjvi9WaSagpkU6Rs1GjVk",
        "name": "Sam Jacobs\nSam Jacobs",
        "content": "14 things every CMO needs to know to do their job and not get fired:\n\n1. You are a storyteller. You know this but it bears repeating. Because storytelling is the essential skill of every modern executive. You have to be good at it.\n\n2. You need to find some way to allocate some budget to brand, even if your CEO doesn’t understand why.\n\n3. For most B2B tech, brand is the only long term moat.\n\n4. You’ve got to think like a hedge fund manager. Your investments are fungible across people and programs. Your goal is high growth at low CAC and it’s up to you how to do that. Which is really f-ing hard.\n\n5. Nobody gives a sh*t about leads. You deliver qualified pipeline and closed business. The days of the MQL are over. Don’t even say that word out loud in a modern tech org.\n\n6.is wrong about a lot. Like … A LOT. But one thing he’s right about: dark social is real. If you don’t have a strategy for communities, you are NOT where your customers are sharing their honest opinion.\n\n7. Great brands build trust. But they build trust because they have personality. If your marketing has no personality - authentic personality, not cringey Hail Mary attempts - you don’t have a chance.\n\n8. AI is not a strategy. It’s a tool. You use it. But you do need to use it. And to do that you need to know what’s going on. Have you heard of? Of?? If not, you’re behind.\n\n9. Sales people don’t generate demand. You do. You have the hardest job in the company.\n\n10. So if your CEO doesn’t truly “get” marketing, you can try convincing them, but it’s a big red flag. Great marketing wins ball games. And is rare.\n\n11. You have to live in numbers. You just do. You have to build our own models (or know how to). You have to use spreadsheets.\n\n12. You have to know how to read a P&L. You have to understand, just like the CRO, what makes companies great and what makes companies crap and you have to be able to get to that answer through numbers.\n\n13. You set the standard. Brands are built with precision. If you let mediocrity walk into your materials, your copy, your aesthetic - that’s what the company becomes. Be careful and focus on the details.\n\n14. Marketing is the hardest discipline. It just is. It’s an alchemic mix of art and science, of making big bets and fine-tuning the numbers, of motivating teams of creatives and telling stories to the CEO. It’s really really hard.\n\nWe want you to become a great CMO.\n\nI want you to become a great CMO.\n\nAnd part of that journey is joiningfor CMO School, led by my friend, and now featuring an incredible array of CMO instructors now including.\n\nCMO School starts TOMORROW.\n\nDM me to join us.",
        "reactions": {
          "likes": "47\nEyal Benishti and 46 others",
          "comments": "12 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "There's some irony in my thoughts about Brand.\n\nI had a great discussion with my CEO yesterday about why our Brand needs a personality....at least in principle.\n\nWe both agreed that for high ACV plays, Brand Awareness is a must have, cause no one's gonna buy from you if they don't know you.\n\nBut where we both stopped short is whenasked said \"Ok, a persona sounds great, but what does it actually mean, how do we codify this, and why is it so important?\"\n\nI listed off of a few examples of cool B2B brands and my perceived assessment of their \"Persona\".\n\nBut I was equally stumped.\n\nWe've seen the success of \"Individual\"-driven brand > Corporate in B2B (ex:,,)\n\nWhy should we prioritize Company Brand Persona as opposed to building up our individual brands?\n\nThis post got me excited, thinking it might have some answers.\n\nBut I find myself no less lost than I was, yesterday.\n\nThat said, when we talking allocating budget to Brand, does this course offer the answer to my question, \"What for?\"",
            "userName": "Josh Shulman",
            "userProfileURL": "https://www.linkedin.com/in/jdshulman",
            "dataId": "urn:li:comment:(activity:7292565317698863104,7292571769737990145)"
          }
        ],
        "commentAdded": "This is a fantastic roadmap for aspiring CMOs! Embracing storytelling and data-driven strategies is crucial. Excited for CMO School! 🚀"
      },
      {
        "postId": "urn:li:activity:7292542541130829826",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292542541130829826",
        "url": "https://www.linkedin.com/in/simranpant1?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACtd6FkBmCJpFW247h7mTyYEfxEu1HVXM_Y",
        "name": "Simran Pant\nSimran Pant",
        "content": "Is your LinkedIn headline letting you down?\n\nHere are the top 10 mistakes to avoid.\n\nI’ve drafted 100+ LinkedIn headlines to learn what works.\n\nYou have 45 characters to make a first impression. Don't waste them.\n\nAvoid these headline mistakes now↓\n\n1. Using a generic job title\n2. Ignoring the 45-character limit\n3. Not communicating value\n4. Failing to use a hook\n5. Being too vague\n6. Not using keywords\n7. Focusing on your own wins, not on your client's\n8. Not updating regularly\n9. Forgetting the rehook\n10. Not treating your profile as a conversation starter\n\nUse your headline to clearly show how you help others.\n\nSay what you do and who you do it for.\n\nP.S. Which mistake surprised you the most (1-10)? What would you add?",
        "reactions": {
          "likes": "177",
          "comments": "161 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "I think the most surprising mistake is number 7. It's important to focus on how we can help our clients rather than just showcasing our own accomplishments.",
            "userName": "Haseeb Sheikh",
            "userProfileURL": "https://www.linkedin.com/in/m-haseeb-sheikh-",
            "dataId": "urn:li:comment:(ugcPost:7292536413026201600,7292573761155878913)"
          }
        ],
        "commentAdded": "Great tips! It’s amazing how a strong headline can transform your profile. Mistake #3—communicating value—resonates with me. What else can we add?"
      },
      {
        "postId": "urn:li:activity:7292572686998716416",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292572686998716416",
        "url": "https://www.linkedin.com/in/davidhermann?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAB3hLYBTVZtRFITHPiQyaUJoOSlk-1SnVA",
        "name": "David. Hermann\nDavid. Hermann",
        "content": "Overcoming resistance is the hardest job a leader faces. \nDo you know how to do it?\n\n\nThe Toughest Job a Leader Has: Overcoming Resistance\nby, CEO of",
        "reactions": {
          "likes": "1",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Great insight! Overcoming resistance requires empathy and strong communication. What strategies have you found most effective?"
      },
      {
        "postId": "urn:li:activity:7292492161994878976",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292492161994878976",
        "url": "https://www.linkedin.com/company/synechron/posts",
        "name": "Synechron\nSynechron",
        "content": "Following our London and Chicago Hack-AI-thons, we partnered with Legal & General Investment Management (LGIM) for a two-day Hackathon – this time in Cardiff! Once again, it was a resounding success with positive feedback from the 60+ business and technology users. Building on the learning’s from London and Chicago, the teams worked with their Synechron AI coaches to develop use cases leveraging the Synechron Nexus AI suite. Team playbacks were next level, showcasing opportunities to help them in their day-to-day jobs and deliver wider benefits to the business.\n\nA special thanks to LGIM’s Commercial Finance Directorfor sponsorship and hosting the event in Cardiff. We’d also like to thank LGIM’s Head of Engineering, as well as his team –,, and. Lastly, a big shout out to the Synechron AI team –,,,, Paul Jones,, and Mustafa Mustafa.",
        "reactions": {
          "likes": "40",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Exciting",
            "userName": "Jayeshgiri Bavaji",
            "userProfileURL": "https://www.linkedin.com/in/jbavaji",
            "dataId": "urn:li:comment:(ugcPost:7292492158496858113,7292505788755898368)"
          }
        ],
        "commentAdded": "Thrilled to see such innovation and collaboration at the Hackathon in Cardiff! Kudos to LGIM and the Synechron team for driving impactful solutions!"
      },
      {
        "postId": "urn:li:activity:7292544922111406080",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292544922111406080",
        "url": "https://www.linkedin.com/in/handsonangel?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAC9Vv0Brw8SLU9DCGbB1c6uf2HvVOBb0a8",
        "name": "Steve Walsh\nSteve Walsh",
        "content": "𝗪𝗵𝘆 𝗙𝗼𝘂𝗻𝗱𝗲𝗿 𝗕𝘂𝗿𝗻𝗼𝘂𝘁 𝗜𝘀 𝗥𝗲𝗮𝗹 (𝗔𝗻𝗱 𝗛𝗼𝘄 𝘁𝗼 𝗔𝘃𝗼𝗶𝗱 𝗜𝘁) \n\n\nStartups don’t fail because the idea was bad. They fail because the founder runs out of energy before the business runs out of potential.\n\nBurnout isn’t just stress—it’s mental, emotional, and physical exhaustion that makes you question why you started in the first place.\n\nHere is a 3 step process on how to avoid it ",
        "reactions": {
          "likes": "10",
          "comments": "4 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Great tips, Steve! I hope people get way more than 5 hours of sleep thought LOL",
            "userName": "Jake Ross",
            "userProfileURL": "https://www.linkedin.com/in/jake-ross-build-you",
            "dataId": "urn:li:comment:(ugcPost:7291794136188276736,7292564627312246785)"
          },
          {
            "commentText": "Jake Ross U never know with founders my friend. They are a strange bunch. lol",
            "userName": "Steve Walsh",
            "userProfileURL": "https://www.linkedin.com/in/handsonangel",
            "dataId": "urn:li:comment:(ugcPost:7291794136188276736,7292568644075573248)"
          },
          {
            "commentText": "Many founders hustile till they drop, instead of finding harmony in their work/life. Less about balance and more about acceptance. Should help with burnout for so many of them. Great stuff Steve Walsh",
            "userName": "Mike Schatzman",
            "userProfileURL": "https://www.linkedin.com/in/mikeschatzman",
            "dataId": "urn:li:comment:(ugcPost:7291794136188276736,7292571652574322688)"
          }
        ],
        "commentAdded": "Great insights! Prioritizing founder well-being is key to long-term success. Excited to see the 3-step process! #StartupHealth #FounderWellness"
      },
      {
        "postId": "urn:li:activity:7292494286334369792",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292494286334369792",
        "url": "https://www.linkedin.com/in/gauravgupta123?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABjGtIBuPeH0MnC0B9VtdQZ0-V_ApUg3oU",
        "name": "Gaurav Gupta\nGaurav Gupta",
        "content": "Every organisation I know cares for CSAT. Squareboat also cares deeply about ESAT (Employee satisfaction). My belief is that happy team members always give their 100% and that always translates to happy and satisfied clients. Here are some snaps of our annual trip, this year to Rishikesh and Mussoorie. Trust me, the best moments weren't even captured on camera! :)",
        "reactions": {
          "likes": "133",
          "comments": "24 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Had the best trip ever! From the excitement and thrill to the strengthening of team bonds, it was an unforgettable experience. Huge thanks to Squareboat for organizing such an amazing trip. Truly grateful for the memories made and the connections strengthened!",
            "userName": "Niyanta Bhayani",
            "userProfileURL": "https://www.linkedin.com/in/niyanta-bhayani-379961167",
            "dataId": "urn:li:comment:(ugcPost:7292461257603891200,7292465806498566145)"
          }
        ],
        "commentAdded": "Love this focus on ESAT! Happy teams are indeed the cornerstone of exceptional client experiences. Great to see the team bonding in Rishikesh!"
      },
      {
        "postId": "urn:li:activity:7292535751370555393",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292535751370555393",
        "url": "https://www.linkedin.com/in/dennisolympios?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAl9PhoBuXY1_3zEBPUm0arqDPI0o-8SKPQ",
        "name": "Dennis Olympios\nDennis Olympios",
        "content": "Want to know why you should start mimicking successful strategies like a parrot? (It's the secret to sustainable growth!)\n\nThe Parrot Effect is more than just mimicry; it’s about leveraging repetition for success.\n\nIn business, sticking to effective strategies and repeating them until they become second nature can be incredibly powerful.\n\n Repetition Builds Mastery: Practice leads to proficiency, embedding successful habits into your routine.\n\n Consistency Creates Trust: Reliable excellence strengthens your reputation with clients and team members.\n\n Foundation for Innovation: Once the basics are solid, you’re free to innovate without losing your footing.\n\nEmbrace repetition as your secret weapon.\n\nWhat strategies do you consistently hone? Share your thoughts! ",
        "reactions": {
          "likes": "458",
          "comments": "100 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "I love how you emphasize the power of repetition! By repeating effective strategies, we not only gain proficiency but also create a foundation to innovate. Once our basics are locked down, we can take risks and improve without losing our grip on what’s working. ",
            "userName": "Helena Najman",
            "userProfileURL": "https://www.linkedin.com/in/thepublicrelationsspecialist",
            "dataId": "urn:li:comment:(activity:7292508138631565312,7292570014342098946)"
          }
        ],
        "commentAdded": "Great insights! Embracing the Parrot Effect can truly elevate both personal and team growth. Im all about honing effective strategies consistently! 🦜✨"
      },
      {
        "postId": "urn:li:activity:7292439717172649985",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292439717172649985",
        "url": "https://www.linkedin.com/in/priyank-ahuja?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAL9WCIBlpfzadAVTWPPVd5XG57aasvhRYY",
        "name": "Priyank Ahuja\nPriyank Ahuja",
        "content": "𝗧𝗵𝗶𝘀 𝗿𝗲𝘀𝘂𝗺𝗲 𝗵𝗮𝘀 𝗮𝗻 𝗔𝗧𝗦 𝘀𝗰𝗼𝗿𝗲 𝗼𝗳 𝟵𝟱!\n\nI’m sharing detailed step-by-step resume building techniques that helps you to land your dream job.\n\nI am breaking it down below, with the help of different colors\n\n𝐑𝐞𝐝 = 𝐀𝐜𝐭𝐢𝐨𝐧 𝐕𝐞𝐫𝐛𝐬:\nWe start each experience with an action verb; if it’s in a current position, you can put as present and if past, you put as -Ed (Example of great action verbs: Collaborated, managed, improved)\n\n𝐏𝐢𝐧𝐤 = 𝐇𝐚𝐫𝐝 𝐒𝐤𝐢𝐥𝐥𝐬:\nWe put the specific hard skills and platform-based skills throughout resume to show that you fit the job description's qualifications; at the bottom, you also have the skills and match them to your experiences where applicable which you can do for your own resume. (Example: I was going into Strategy/Operations, so I put relevant skills pertaining to the industry)\n\n𝐍𝐨𝐭 𝐜𝐨𝐥𝐨𝐫𝐞𝐝, 𝐛𝐮𝐭 𝐚𝐭 𝐭𝐡𝐞 𝐭𝐨𝐩 = 𝐄𝐝𝐮𝐜𝐚𝐭𝐢𝐨𝐧:\nPut where you graduated, GPA if over a 3.5, organizations/awards, etc. IMO Relevant coursework is optional; you can add this if you don't have relevant experience (yet) or are working on gaining those experiences.\n\n𝐇𝐞𝐚𝐝𝐞𝐫:\nLocation as (City, State), LinkedIn (linked), phone number and email (Optional: Portfolio/Personal Website).\n\n𝐆𝐫𝐞𝐞𝐧 = 𝐈𝐦𝐩𝐚𝐜𝐭 𝐌𝐞𝐭𝐫𝐢𝐜𝐬:\nThese are numbers and percentages from the positions you worked in and showcase what you did to impact the company. How did you get these numbers through a) asking your peers/managers b) calculated estimations based on observations?\n\n𝐂𝐲𝐚𝐧 = 𝐈𝐦𝐩𝐚𝐜𝐭 𝐬𝐭𝐚𝐭𝐞𝐦𝐞𝐧𝐭𝐬 𝐛𝐞𝐟𝐨𝐫𝐞 𝐭𝐡𝐞 𝐧𝐮𝐦𝐛𝐞𝐫/𝐩𝐞𝐫𝐜𝐞𝐧𝐭𝐚𝐠𝐞𝐬:\nThis showcases if you improved, optimized or increased xyz which is related to Operations role lingo.\n\n𝐘𝐞𝐥𝐥𝐨𝐰 = 𝐒𝐨𝐟𝐭 𝐒𝐤𝐢𝐥𝐥𝐬:\nMore broad or simple statements, these are relative to collaboration, providing recommendations, and identifying solutions to potential problems.\n\nNote:\nEducation at the top if a student/new grad, move to bottom after experiences once early in career/professional.\n\nFollow\n\nLike, Comment, Share for better reach.\n\nLooking for help, mentorship or career counselling?\nBook your 1:1 session at:\n\nTwitter:\nInstagram:\nThreads:\nTelegram:\n\nPlease turn the 𝗯𝗲𝗹𝗹 \"\" 𝗶𝗰𝗼𝗻 on my profile, if you don't want to miss any of my content related to \"𝘾𝙖𝙧𝙚𝙚𝙧 𝙂𝙪𝙞𝙙𝙖𝙣𝙘𝙚, 𝙄𝙣𝙩𝙚𝙧𝙫𝙞𝙚𝙬 𝙋𝙧𝙚𝙥𝙖𝙧𝙖𝙩𝙞𝙤𝙣, 𝙋𝙚𝙧𝙨𝙤𝙣𝙖𝙡 𝙁𝙞𝙣𝙖𝙣𝙘𝙚, 𝙋𝙧𝙤𝙙𝙪𝙘𝙩 𝙈𝙖𝙣𝙖𝙜𝙚𝙢𝙚𝙣𝙩 and 𝙈𝙖𝙣𝙖𝙜𝙚𝙢𝙚𝙣𝙩 𝘾𝙤𝙣𝙨𝙪𝙡𝙩𝙞𝙣𝙜\"",
        "reactions": {
          "likes": "1,870",
          "comments": "201 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Priyank A resume should tell a clear, impactful story. \n\nI once revamped mine using strong action verbs and metrics. \nThe difference was huge—better responses, more interviews, real progress.\n\nTailoring each section to the role makes every word count.\nA well-structured resume opens doors before you even speak.",
            "userName": "Sreejan Guha Niyogi",
            "userProfileURL": "https://www.linkedin.com/in/sreejan-guha-niyogi",
            "dataId": "urn:li:comment:(activity:7292132861904568320,7292516198758371328)"
          },
          {
            "commentText": "If any one needs their resume to be updated let me know I am a professional cv maker",
            "userName": "Lahiri kallakuri",
            "userProfileURL": "https://www.linkedin.com/in/lahiri-kallakuri-hraspirant",
            "dataId": "urn:li:comment:(activity:7292132861904568320,7292561795225923586)"
          }
        ],
        "commentAdded": "Great insights on resume building! These color-coded tips make it easy to enhance a resumes effectiveness. Thanks for sharing! 🎨📄"
      }
    ],
    "errors": [
      {
        "postId": "urn:li:activity:7292449283306401793",
        "url": "https://www.linkedin.com/in/varun1175?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACKnKlcBjbVuNxmqTWxj41k1DP__pQV5F-w",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292535143095750656",
        "url": "https://www.linkedin.com/in/robertsjeff?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAeZvQUBybFX1rFWHMOHhOcZiZKlyH6HX5k",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292572671702106112",
        "url": "https://www.linkedin.com/in/samfjacobs?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAASN2cBeFTWjYgjvi9WaSagpkU6Rs1GjVk",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292542541130829826",
        "url": "https://www.linkedin.com/in/simranpant1?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACtd6FkBmCJpFW247h7mTyYEfxEu1HVXM_Y",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292572686998716416",
        "url": "https://www.linkedin.com/in/davidhermann?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAB3hLYBTVZtRFITHPiQyaUJoOSlk-1SnVA",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292492161994878976",
        "url": "https://www.linkedin.com/company/synechron/posts",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292544922111406080",
        "url": "https://www.linkedin.com/in/handsonangel?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAC9Vv0Brw8SLU9DCGbB1c6uf2HvVOBb0a8",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292494286334369792",
        "url": "https://www.linkedin.com/in/gauravgupta123?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABjGtIBuPeH0MnC0B9VtdQZ0-V_ApUg3oU",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292535751370555393",
        "url": "https://www.linkedin.com/in/dennisolympios?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAl9PhoBuXY1_3zEBPUm0arqDPI0o-8SKPQ",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292439717172649985",
        "url": "https://www.linkedin.com/in/priyank-ahuja?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAL9WCIBlpfzadAVTWPPVd5XG57aasvhRYY",
        "errors": [
          "Failed to fetch media URL."
        ]
      }
    ]
  }
]