{
  "postsData": [
    {
      "postId": "urn:li:activity:7287404256091856897",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287404256091856897",
      "url": "https://www.linkedin.com/in/nereaarreguiqa?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAEHgTbsBKHMzatlhgCsnqQX4ohcNYmxBmz8",
      "name": "Nerea Arregui Exposito\nNerea Arregui Exposito",
      "content": "Climbing the AI ladder: a framework for enterprise success \n\n Did you know? There’s no AI without IA (Information Architecture). It’s the foundation every enterprise needs to unlock the true potential of AI. Without it, your data is just noise.\n\nSo, how does the AI Ladder help businesses?\n\n→Collect: Gather data from every corner of your business,IoT sensors, traffic cameras, even handwritten notes,and make it accessible. Data is your most valuable commodity.\n→Organize: Trustworthy, cataloged, and compliant data is a game-changer. With strong governance, businesses can turn a \"roadblock\" into an \"accelerant.\"\n→Analyze: From building unbiased, scalable AI models to ensuring transparency, this step is where data transforms into actionable insights.\n→Infuse: Operationalize AI across departments, automate processes, and unlock new business models.\n\n As Forrester aptly put it:\n\n\"All data originates in real time, but most decisions are made on stale data.\"\n\nWith the AI Ladder, businesses can change that.\n\n Modernizing your information architecture isn’t just a tech upgrade,it’s a business imperative. Start building smarter, faster, and more trustworthy AI-driven operations today.\n\n What’s holding your organization back from embracing AI? Visit Mchange atto learn how we can help you climb the AI Ladder.",
      "reactions": {
        "likes": "8",
        "comments": "8 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Great insights! Emphasizing IA as the foundation for AI is crucial. Excited to see how organizations will leverage the AI Ladder for success!"
    },
    {
      "postId": "urn:li:activity:7288300128967274498",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7288300128967274498",
      "url": "https://www.linkedin.com/in/jasonbramble-revcarto?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABQ_gTEBQxoseSKiiYMeftV9QrMfHofdIJ8",
      "name": "Jason Bramble\nJason Bramble",
      "content": "Do you know where the name Revcarto came from? \n\nFunny story...someone told me that Revcarto would never work because it sounded too much like Ricky Ricardo. That was almost 5 years ago to the date. I might email them just to say LUCCYYY IM STILL HEREEEEE  However, they weren't wrong.\n\nAnyways, check out the team's recent blog post to find out where the name actually came from",
      "reactions": {
        "likes": "7",
        "comments": "1 comment",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "\"Revenue and cartographer. It captures our mission perfectly: to be the revenue map makers for businesses, helping them navigate their unique journey to revenue optimization and growth.\"\n\nThat's really good,!",
          "userName": "Andrew Jax",
          "userProfileURL": "https://www.linkedin.com/in/weight-loss-coach-andrew-jax",
          "dataId": "urn:li:comment:(activity:7288300128967274498,7288487295324721153)"
        }
      ],
      "commentAdded": "Love the journey behind the name Revcarto! Its amazing how a catchy name can spark conversation. Looking forward to the blog post! 🚀"
    },
    {
      "postId": "urn:li:activity:7288926095154855937",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7288926095154855937",
      "url": "https://www.linkedin.com/in/leslievenetz?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADPju4B9I-KSyVAlH2xAmiN72f5wsayOtM",
      "name": "Leslie Venetz\nLeslie Venetz",
      "content": "The # 1 change you need to make to your outbound emails in 2025 if you expect your prospects to reply. \n\n\n\nMake your emails shorter.\n\nMake your LinkedIn messages EVEN shorter.\n\n\n️ 3 reasons why this is a MUST if you expect to\nto your prospect's attention:\n\n\n1. Optimize for mobile\n\nDepending on who you ask, the optimal length of a cold outbound sales email is 16-130 words.\n\nRegardless of the source, the consensus is shorter emails get better results.\n\nOne reason is that shorter emails can be read on a mobile device without having to scroll.\n\nIf your prospect can read your CTA without having to scroll you are significantly more likely to get a reply.\n\n\n2. Reduce mental load\n\nShorter emails, especially those that utilize spacing between sentences get higher reply rates.\n\nShort, simple sentences are easier for prospects to scan and quickly absorb.\n\nBy writing short, simple emails with ample spacing, you're making it easier for your prospect to engage with your email.\n\n\n3. Make a point that matters TO THEM\n\nShorter emails force you to get to the point!\n\nWrite straightforward emails that focus on what matters to your prospect (HINT: eliminate as much I, We, Our language as you can) and you'll see an increase in your reply rates within the week.\n\n\n What word or character count do you aim for when writing sales emails?",
      "reactions": {
        "likes": "43",
        "comments": "23 comments",
        "shares": "0"
      },
      "mediaUrl": "blob:https://www.linkedin.com/4bfe10cc-b457-426d-b449-27474b2577ed",
      "comments": [
        {
          "commentText": "i wonder if our attention span will keep getting shorter and shorter until every time an email comes in we just pelt our phone against the wall and roar in anger",
          "userName": "Mohan Muthoo 💬 🇬🇧 🌍",
          "userProfileURL": "https://www.linkedin.com/in/mohankm1",
          "dataId": "urn:li:comment:(ugcPost:7280668381651841025,7288930453409988609)"
        },
        {
          "commentText": "Mohan Muthoo  🇬🇧  I think some of our buyers are already there",
          "userName": "Leslie Venetz",
          "userProfileURL": "https://www.linkedin.com/in/leslievenetz",
          "dataId": "urn:li:comment:(ugcPost:7280668381651841025,7288973684541734913)"
        },
        {
          "commentText": "Relevance ≠ Personalization. Messaging can be \"un-personalized\" but very relevant with the right message to the right group. I've seen it first-hand with a few clients. Great post Leslie",
          "userName": "Franc Berrones",
          "userProfileURL": "https://www.linkedin.com/in/francberrones",
          "dataId": "urn:li:comment:(ugcPost:7280668381651841025,7288927927965040640)"
        },
        {
          "commentText": "Franc Berrones THIS ",
          "userName": "Leslie Venetz",
          "userProfileURL": "https://www.linkedin.com/in/leslievenetz",
          "dataId": "urn:li:comment:(ugcPost:7280668381651841025,7288974424295251968)"
        }
      ],
      "commentAdded": "Great insights! Shorter, focused emails truly enhance engagement. Im excited to see how this approach boosts reply rates in 2025!"
    },
    {
      "postId": "urn:li:activity:7288716357662085120",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7288716357662085120",
      "url": "https://www.linkedin.com/in/rpessar?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAwcjW4BvCJUAK0fWiSBca-E80oRWsQF_oI",
      "name": "Ronen R. Pessar\nRonen R. Pessar",
      "content": "$42,000 was my first year SDR salary\nI made more this month (10yrs later)…\nb/c of 2 consistent attitudes since 2015\n\n1) Treat my job like a paid MBA.\n\n2) Work for the company, not the paycheck.\n\nReminds me of this story Zig tells\n\n“Several years ago on an extremely hot day, a crew of men were working on the road bed of the railroad when they were interrupted by a slow moving train.\n\nThe train ground to a stop and a window in the last car— which incidentally was custom made and air conditioned—was raised.\n\nA booming, friendly voice called out, “Dave, is that you?” Dave Anderson, the crew chief called back, “Sure is, Jim, and it’s really good to see you.”\n\nWith that pleasant exchange, Dave Anderson was invited to join Jim Murphy, the president of the railroad, for a visit.\n\nFor over an hour the men exchanged pleasantries and then shook hands warmly as the train pulled out.\n\nDave Anderson’s crew immediately surrounded him and expressed astonishment that he knew Jim Murphy, the president of the railroad, as a personal friend.\n\nDave then explained that twenty-three years earlier he and Jim Murphy had started work at the railroad on the same day.\n\nOne of the men, half jokingly and half seriously, asked Dave why he was still working out in the hot sun and Jim Murphy had gotten to be president.\n\nRather wistfully, Dave explained, “Twenty-three years ago I went to work for $1.75 an hour and Jim Murphy went to work for the railroad.”\n\n- Zig Ziglar, See You at the Top\n\n\nThere aren’t “secrets” to success\n\nThere are those who choose to do what they’re paid to do, and that’s all.\n\nAnd others who go to work for the railroad.\n\n",
      "reactions": {
        "likes": "52",
        "comments": "8 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "What does \"Work for the company, not the paycheck.\" mean? How do you maintain that attitude when even the smallest studio apartment in your city costs more than you make a month? ",
          "userName": "Daniel Berkowitz, Ph.D.",
          "userProfileURL": "https://www.linkedin.com/in/cosmiccollegeconsulting",
          "dataId": "urn:li:comment:(activity:7288716357662085120,7288992098366676992)"
        },
        {
          "commentText": "I love the \"work for the company, not the paycheck\" mindset. How do you maintain this focus amidst day-to-day challenges and pressures?",
          "userName": "D. Langston",
          "userProfileURL": "https://www.linkedin.com/in/dlangstonx",
          "dataId": "urn:li:comment:(activity:7288716357662085120,7288815247954518016)"
        }
      ],
      "commentAdded": "Great perspective! Treating your role as an investment in yourself makes all the difference. Heres to continuous growth and genuine dedication! 🚀"
    },
    {
      "postId": "urn:li:activity:7288195821651550208",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7288195821651550208",
      "url": "https://www.linkedin.com/in/kunalpandya?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAACL0_MB79gEt9NILd9av4JZlHjtcFSiKmo",
      "name": "Kunal Pandya\nKunal Pandya",
      "content": "Most sales kickoffs are a waste of time.\n\n\nIf they aren't done right.\n\nIf they're packed with overhyped fluff, endless slideshows and an overload of product features - sales reps will forget everything the second they walk out of the room. And can you even blame them?\n\nYour SKO's should be focused on setting your teams up to close more deals and driving revenue.\n\nHere’s how to make sure you get yours right on the money...\n\n1️⃣ Kill the fluff and focus on strategy.\n\nYour SKO is a game plan. If you’re not giving sales reps clarity on how to win in today's market, what is even the point? Here's what you should be focusing on:\n\n What’s the revenue gap this year?\n What specific behaviours do reps need to adopt to close it?\n How are leadership, sales, marketing, ops, customer success, and enablement going to make it happen together?\n\n2️⃣ Align EVERYONE - not just sales.\n\nIf you’re only talking to sales, you’re already behind. Sales doesn’t succeed alone. It takes an entire team, and everyone working together.\n\n Get marketing, sales, customer success and ops in the same room and give everyone a voice.\n\n Fix the bottlenecks that slow deals down - work together to solve problems, instead of playing the blame game.\n\n3️⃣ Don’t let the SKO end when the event does.\n\nDon’t let the motivation and learning stop the moment the SKO is over. Make sure you continue to:\n\n Reinforce key takeaways with follow-ups, coaching, and real-time feedback.\n\n Track your results. Tie your SKO activities directly to win rates, pipeline growth, and shorter sales cycles.\n\nHere’s the bottom line: Reps should leave your SKO knowing exactly how they’re going to hit their number this year - and what you’re doing to help them get there. If they don't, you risk your SKO being branded as \"a waste of time\".\n\nWhat’s the best thing you’ve seen at an SKO? Let’s hear it ",
      "reactions": {
        "likes": "74",
        "comments": "22 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "I respect the message to make SKOs valuable, but wildly disagree that most sales kickoffs are a waste of time, and think it's dangerous and damaging to say so.\n\nHow many crappy SKOs have you attended that you didn't organize? Is there a study you're referencing?\n\nWords matter - especially when you have 4k followers.",
          "userName": "Aimee Roberson",
          "userProfileURL": "https://www.linkedin.com/in/aimeealidaroberson1978",
          "dataId": "urn:li:comment:(activity:7288186249058623488,7288252609293860864)"
        },
        {
          "commentText": "Aimee Roberson Yeh, I’m not sure if you read the second line and below?",
          "userName": "Kunal Pandya",
          "userProfileURL": "https://www.linkedin.com/in/kunalpandya",
          "dataId": "urn:li:comment:(activity:7288186249058623488,7288265902796509184)"
        },
        {
          "commentText": "Yes, I did. Your first line grabs attention...",
          "userName": "Aimee Roberson",
          "userProfileURL": "https://www.linkedin.com/in/aimeealidaroberson1978",
          "dataId": "urn:li:comment:(activity:7288186249058623488,7288268681019604992)"
        },
        {
          "commentText": "3 is the KEY! If teams invested half as much energy into reinforcing SKO, as they did in producing it, we wouldn’t need to spend so much time training in the first place.",
          "userName": "Lawrence Wayne O'Connor",
          "userProfileURL": "https://www.linkedin.com/in/sirlawrencewayne",
          "dataId": "urn:li:comment:(activity:7288186249058623488,7288187888603656192)"
        },
        {
          "commentText": "Lawrence Wayne O'Connor say it louder!\n\nIt’s all about the follow-through. We know there’s only so much a human can absorb during an event, so the real value is actually after the event.\n\nSo often overlooked - or as we see a lot, focus just diverts to other priorities.",
          "userName": "Kunal Pandya",
          "userProfileURL": "https://www.linkedin.com/in/kunalpandya",
          "dataId": "urn:li:comment:(activity:7288186249058623488,7288219369833148416)"
        }
      ],
      "commentAdded": "Absolutely agree! A focused, engaging SKO can empower teams and drive results. Lets ditch the fluff and prioritize actionable strategies! 💪"
    },
    {
      "postId": "urn:li:activity:7288950556356710401",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7288950556356710401",
      "url": "https://www.linkedin.com/in/johnkraski?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABkbm-0Be4xxSTDslQoX9c9qcRoExoNAGWk",
      "name": "John Kraski\nJohn Kraski",
      "content": "One of the big reasons I left Google is because they didn’t hire me.\n\nI must admit when I showed up one day for work and asked where my desk was and they didn’t know who I was it was weird. Shortly thereafter, security chased me around the office and out of the building.\n\nBut we take this as a learning lesson of why working for Google is extremely challenging.\n\nThey apparently don’t like people they don’t hire to be showing up there for work.\n\nHope this helps.",
      "reactions": {
        "likes": "226",
        "comments": "145 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Fascinating story! You should give it another try! Maybe more luck next time? ",
          "userName": "Tomasz Boinski",
          "userProfileURL": "https://www.linkedin.com/in/tomaszboinski",
          "dataId": "urn:li:comment:(activity:7288939425768636416,7288950541903183873)"
        }
      ],
      "commentAdded": "What a memorable experience! It’s a great reminder that every setback can lead to valuable lessons and new opportunities. Keep pushing forward!"
    },
    {
      "postId": "urn:li:activity:7287620526062157826",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287620526062157826",
      "url": "https://www.linkedin.com/in/reubenholdaway?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACCPcCcBi8oFaoQlXwrvciQQjsNhjXHTo3s",
      "name": "Reuben Holdaway\nReuben Holdaway",
      "content": "3 years ago, I had a call with Trent Mano that would change the course of my career.\n\nHe and Scott Paul had just launched a fund 2 weeks prior with a thesis I was obsessed with: Utah only, first check.\n\nWhat started as a casual conversation about startups eventually turned into joining the team asfirst hire.\n\nThe last 3 years have been the most challenging, rewarding, and honestly downright fun years of my professional life. And we’re just getting started.\n\nWe’re determined to find Utah’s next great founders. We’re proud investors in 40+ startups going after the most ambitious problems, and we don’t take that responsibility lightly.\n\nI’m excited to continue my journey with Convoi Ventures—now as a senior associate!\n\nThe best is yet to come for Utah’s startups, and we’re committed to being a driving force behind that growth.\n\nIf you’re a founder hellbent on building something massive, let’s chat!",
      "reactions": {
        "likes": "327",
        "comments": "82 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Congrats Reuben! ",
          "userName": "steven kamensky",
          "userProfileURL": "https://www.linkedin.com/in/stevenkamensky",
          "dataId": "urn:li:comment:(ugcPost:7287550783657594880,7287620508961947649)"
        }
      ],
      "commentAdded": "Congratulations on your journey! Excited to see how Convoi Ventures continues to impact Utahs startup ecosystem. Here’s to even greater success ahead! 🚀"
    },
    {
      "postId": "urn:li:activity:7288982796927164417",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7288982796927164417",
      "url": "https://www.linkedin.com/in/leilahormozi?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABZU1dIBQs0EayRru0YoZ-Ro_0mXO5dZTC4",
      "name": "Leila Hormozi\nLeila Hormozi",
      "content": "In the absence of trust, conversations turn into calculations.\n\nLeaders who can't build trust, create environments where fear replaces collaboration and potential is stifled by doubt.",
      "reactions": {
        "likes": "386",
        "comments": "67 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Leila Hormozi, why is it that you constantly talk about fear?\n\nFear nothing! ",
          "userName": "Congo Business Network",
          "userProfileURL": "https://www.linkedin.com/company/congobusinessnetwork/posts",
          "dataId": "urn:li:comment:(activity:7288967612812734465,7288992153479905281)"
        },
        {
          "commentText": " so well worded  concise and touches on the essential elements of the importance of building from the solid foundation of TRUST because once it’s broken it’s very hard to repair and the repercussions are usually devastating and costly",
          "userName": "Timea B.",
          "userProfileURL": "https://www.linkedin.com/in/timeabradley",
          "dataId": "urn:li:comment:(activity:7288967612812734465,7288990426596827137)"
        }
      ],
      "commentAdded": "Absolutely! Trust is the cornerstone of effective leadership. Without it, collaboration suffers, and innovation stagnates. Lets prioritize trust-building!"
    },
    {
      "postId": "urn:li:activity:7288727465164738561",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7288727465164738561",
      "url": "https://www.linkedin.com/in/hwilson3?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABkQ4eQBVV61aa6L6wnZtFX7vckEmZjEXoI",
      "name": "Heather Wilson, CMP, CITI\nHeather Wilson, CMP, CITI",
      "content": "Why in the world would I share a photo of myself in a hospital gown waiting on my echocardiogram to get started? I’m a business owner. I’m a professional, after all! Yeah, yeah. Newsflash: I’m a human first and foremost. And so are you, your colleagues, your clients, your leaders and your teams.\n\nOver the holiday I presented to the emergency room with suspicious symptoms, so my medical team is proactively making sure all is well. No need to hide it or worry that it affects others’ perception of my abilities.\n\nLet’s normalize self care, please. We thrive when we place our own oxygen masks first. Literally and figuratively. By the way, have you scheduled your annual checkup? \n\nThanks for coming to my TEDTalk.",
      "reactions": {
        "likes": "13",
        "comments": "6 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "I hope they were able to find out what was going on. ",
          "userName": "Guillermo Mairena",
          "userProfileURL": "https://www.linkedin.com/in/guillermomairena",
          "dataId": "urn:li:comment:(activity:7288727465164738561,7288729329893613568)"
        },
        {
          "commentText": "Guillermo Mairena thank you. I’ll know what they find (or don’t) in about a week.",
          "userName": "Heather Wilson, CMP, CITI",
          "userProfileURL": "https://www.linkedin.com/in/hwilson3",
          "dataId": "urn:li:comment:(activity:7288727465164738561,7288738073192935424)"
        },
        {
          "commentText": "Sharing this serves as a powerful reminder to take care of ourselves first, both for our health and the example we set. Hope all is well with you! ",
          "userName": "Stacy Prokopa",
          "userProfileURL": "https://www.linkedin.com/in/stacy-prokopa",
          "dataId": "urn:li:comment:(activity:7288727465164738561,7288878150392918017)"
        }
      ],
      "commentAdded": "Thank you for sharing such a personal moment! Normalizing self-care is crucial for our well-being and professional success. Stay strong! 🌟"
    },
    {
      "postId": "urn:li:activity:7288559491686490116",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7288559491686490116",
      "url": "https://www.linkedin.com/in/syed-nyamathullah?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABUrsMcB2JTD0RlU8cw3yJFX2-TFx9sQoCY",
      "name": "Syed Nyamathullah ↗️\nSyed Nyamathullah ↗️",
      "content": "A Mistake in the OT Can Cost a Life. \n\nA Mistake in Branding Can Cost a Career.\n\nEvery medical student makes mistakes in the OT.\n\n Holding the scalpel wrong.\n Not knowing how to wear scrubs.\n Forgetting a step in the procedure.\n Hesitating under pressure.\n\nThat’s why they train under seniors. They practice. They learn.\n\nNow, think about this—\nWhat if senior doctors never corrected their mistakes?\nWhat if they never guided them?\n\nMany careers would fail before they even start.\n\nThe same goes for medical marketing and personal branding.\n\nDoctors who don’t market themselves properly:\n Struggle to get recognized.\n Lose patients to less-skilled competitors.\n Fail to build trust online.\n\nIn today’s world, medical skills alone are not enough.\nYour reputation is your brand. Your brand is your power.\n\nThe best doctors don’t just master surgeries.\nThey also master communication.\n\n𝗟𝗲𝗮𝗿𝗻. 𝗔𝗱𝗮𝗽𝘁. 𝗕𝘂𝗶𝗹𝗱 𝘆𝗼𝘂𝗿 𝗯𝗿𝗮𝗻𝗱.\n\nBecause in medicine and marketing—\nMistakes cost more than just opportunities.\n\n\"𝙔𝙤𝙪𝙧 𝙨𝙠𝙞𝙡𝙡𝙨 𝙨𝙖𝙫𝙚 𝙡𝙞𝙫𝙚𝙨. 𝙔𝙤𝙪𝙧 𝙗𝙧𝙖𝙣𝙙 𝙗𝙪𝙞𝙡𝙙𝙨 𝙩𝙧𝙪𝙨𝙩.\"\n\nFeel free to DM me to start building your personal brand.\n\nWhat’s your take on medical branding? Let’s discuss. ",
      "reactions": {
        "likes": "480",
        "comments": "26 comments",
        "shares": "0"
      },
      "mediaUrl": "blob:https://www.linkedin.com/f4b5d4cf-975a-42be-8dae-3fdac7d71a3d",
      "comments": [
        {
          "commentText": "A medical student in the OT learns through mistakes, corrections, and practice. Without guidance, errors become habits. The same applies to personal branding; without strategy, you risk being invisible. 𝗔 𝘀𝗸𝗶𝗹𝗹𝗲𝗱 𝗱𝗼𝗰𝘁𝗼𝗿 𝘄𝗶𝘁𝗵𝗼𝘂𝘁 𝗮 𝗯𝗿𝗮𝗻𝗱 𝗶𝘀 𝗹𝗶𝗸𝗲 𝗮 𝘀𝘂𝗿𝗴𝗲𝗼𝗻 𝘄𝗶𝘁𝗵𝗼𝘂𝘁 𝗮 𝘀𝗰𝗮𝗹𝗽𝗲𝗹—𝗰𝗮𝗽𝗮𝗯𝗹𝗲, 𝘆𝗲𝘁 𝘂𝗻𝗻𝗼𝘁𝗶𝗰𝗲𝗱.",
          "userName": "Syed Nyamathullah ↗️",
          "userProfileURL": "https://www.linkedin.com/in/syed-nyamathullah",
          "dataId": "urn:li:comment:(ugcPost:7288510371819139073,7288511015187582977)"
        },
        {
          "commentText": "Every surgeon was once a student making mistakes in the OT. Learning from those errors builds expertise. But in today’s world, expertise alone isn’t enough. \n\nA doctor’s impact extends beyond the hospital—through marketing, they educate, build trust, and connect with patients before they even step into the clinic.",
          "userName": "Syed Nyamathullah ↗️",
          "userProfileURL": "https://www.linkedin.com/in/syed-nyamathullah",
          "dataId": "urn:li:comment:(ugcPost:7288510371819139073,7288511337394016257)"
        }
      ],
      "commentAdded": "Absolutely! Building a strong personal brand is vital for medical professionals. It not only enhances visibility but also fosters trust. Let’s connect and explore this further!"
    },
    {
      "postId": "urn:li:activity:7288624104377597952",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7288624104377597952",
      "url": "https://www.linkedin.com/in/mkoesterer?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAJ9iiAB5bh6NL9kMz59hr5JCHi31nuQIM8",
      "name": "Mark R. Koesterer\nMark R. Koesterer",
      "content": "Creating fans requires great storytelling.\n\nTake a listen\n\nFor more of my thoughts, listen to Day 13 of the\nchallenge on the value of great storytelling. HERE:\n\n@paulcarcaterra",
      "reactions": {
        "likes": "4",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Absolutely agree! Great storytelling not only captivates but also builds lasting connections. Looking forward to listening to your insights! 🎧✨"
    },
    {
      "postId": "urn:li:activity:7288609995779158016",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7288609995779158016",
      "url": "https://www.linkedin.com/in/llenguito?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAC8HlMBkxkXGbjqfdHpbnGm_SZ8GDKx7EA",
      "name": "Luigi LENGUITO\nLuigi LENGUITO",
      "content": "Day 4 at \n#WEF2025 in \n#Davos: the sides!\n\nToday, I took an alternative route and visited side events unrelated to the main conference, and on alternative topics, nonetheless very engaging!\n\n- Breakfast with 50 women CEOs talking about brand legacy and team mental health, exploring how innovation and company culture intertwine\n\n- went to a first for a crypto conference, indeed\nconversation were common during the week, and I found a great community of investors, entrepreneurs a d plain smart people. I am even more convinced blockchain technology is the only solution to preserve trust in a ever growing trustless society.\n\n- invited as guest to a panel at, talking of human capital and how\ncompany enable access to people in remote areas and great new opportunity also thanks to augmented learning with Ai agents\n\n- went to a great event held byloads of conversation around disinformation and new cybercrime\n\nFinally closed on a high note with a great party!\n\nAnother fantastic day! Follow for the wrap-up.",
      "reactions": {
        "likes": "10",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": "blob:https://www.linkedin.com/632a5851-07bd-45aa-bd1c-f9703468324b",
      "comments": [],
      "commentAdded": "Sounds like an enriching day! Exciting to see diverse topics and discussions shaping the future of business and technology. Looking forward to more insights!"
    },
    {
      "postId": "urn:li:activity:7285744303618891781",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7285744303618891781",
      "url": "https://www.linkedin.com/in/manujaggarwal?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAMY_wBiA538UlzNcv3ls30NXdjZZ2cT2c",
      "name": "Manuj Aggarwal\nManuj Aggarwal",
      "content": "Ask me anything about AI !\n\nOn January 23rd at 2 PM PST, I’m hosting a live AMA session, and you’re invited.\n\nNo cost, no barriers, just value-packed insights to help you thrive in a tech-driven world.\n\nHere’s what you’ll gain:\n\n Clear answers to your AI questions, yes, even the “basic” ones.\n\n Practical ways AI can save you time, boost efficiency, and grow your business.\n\n Strategies to stay ahead in a world where tech is transforming everything.\n\n No fluff, no limits, just actionable insights.\n\nWhether you're an AI beginner, a business leader, or someone balancing success with meaning, this session is for you.\n\n Don’t miss out, grab your free spot now and start building your tech-powered future.",
      "reactions": {
        "likes": "16",
        "comments": "1 comment",
        "shares": "0"
      },
      "mediaUrl": "blob:https://www.linkedin.com/188701c0-8182-454c-9827-554b5305bdd9",
      "comments": [],
      "commentAdded": "Excited for this AMA! AI is reshaping our future, and I can’t wait to dive into practical strategies with everyone. Count me in! 🚀✨"
    },
    {
      "postId": "urn:li:activity:7288679359173799936",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7288679359173799936",
      "url": "https://www.linkedin.com/in/pspielmann?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAOQ7vQBNR4ikJ_-2CAg0Qzf-1XpVrCX8gM",
      "name": "Patrick Spielmann\nPatrick Spielmann",
      "content": "AI & Machine Learning Cold Email Campaigns: LeadEngine Demo\nhttps://lnkd.in/g-ZcRwj3",
      "reactions": {
        "likes": "4",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Excited to see how AI & Machine Learning can transform cold email campaigns! Looking forward to the demo and innovative insights! 🌟"
    },
    {
      "postId": "urn:li:activity:7288989401462775808",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7288989401462775808",
      "url": "https://www.linkedin.com/in/thomassjohnston?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAChCJsBrEidBhbt9Yg4O33bsyZ7Nuze4Y0",
      "name": "Tom Johnston\nTom Johnston",
      "content": " Why Can’t You Find Good People?\nIt’s not just you—hiring great candidates is harder than ever.\n\nHere’s the truth: most hiring processes rely on guesswork. A strong resume doesn’t guarantee a strong hire.\n\nManagers feel frustrated and overwhelmed by an endless stream of unqualified candidates, struggling to find the right fit.\n\nBut what if you could validate every hire before making an offer?\n️ Use data-backed assessments to match candidates to job behavior requirements to measure skills, not just credentials.\n Structure interviews to ensure you identify candidates who meet the needs of the role, not just check boxes.\n Align candidates with your company culture from day one.\n\nStop wasting time and money on hires that don’t fit. Let’s build a hiring process you can trust.\n\nDM me for a free consultation.",
      "reactions": {
        "likes": "4",
        "comments": "1 comment",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Good question - attracting great people is a fundamental aspect of building any great organization. ",
          "userName": "Bryan K. O'Rourke",
          "userProfileURL": "https://www.linkedin.com/in/bryankorourke",
          "dataId": "urn:li:comment:(activity:7288981761508659201,7288986502414450688)"
        }
      ],
      "commentAdded": "Great insights! Data-driven hiring can truly transform the process and lead to better fits. Lets elevate our recruitment strategies!"
    },
    {
      "postId": "urn:li:activity:7288569634205638656",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7288569634205638656",
      "url": "https://www.linkedin.com/in/leslievenetz?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADPju4B9I-KSyVAlH2xAmiN72f5wsayOtM",
      "name": "Leslie Venetz\nLeslie Venetz",
      "content": "Only you can prevent \"I hope you're well\" emails. \n\nWhy are people so emotionally attached to this opener?\n\nWhen I train sales teams, I hear the same reasons every time:\n\n- It’s polite\n- It's a cultural thing\n- I don’t want to seem rude\n- It softens the intrusion of a cold email\n\nI get it.\n\nWriting a cold email can feel uncomfortable. You’re reaching out to someone you don’t know, hoping for a response.\n\nAdding “I hope this finds you well” might *feel* like the safer, friendlier choice.\n\n\n️ But here’s the reality:\n\nYour prospects don’t find this phrase warm or thoughtful.\n\nThey see it as filler.\n\nIt triggers their mental spam filters.\n\nIn a world of overflowing inboxes, filler is the first thing to get ignored.\n\n\n️ Here’s the truth:\n\nYou don’t need an empty opener to prove you’re kind or respectful.\n\nThe real way to make a cold email feel less intrusive is to focus on preview text.\n\nPreview text is the first 10(ish) words of your email INCLUDING the subject line.\n\nIt’s your first impression, your chance to stand out, and what decides whether your email gets opened, or skipped.\n\nIf your preview text starts with “I hope this finds you well,” you’ve wasted that moment.\n\n\n Cold emails don’t have to feel intrusive.\n\nWhen you make every word count - starting with preview text - you earn the attention you need to start a conversation.\n\nWhat is one common email practice you want to see die in 2025?",
      "reactions": {
        "likes": "135",
        "comments": "61 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "HAPPY FRIDAY Y'ALL!!!",
          "userName": "Leslie Venetz",
          "userProfileURL": "https://www.linkedin.com/in/leslievenetz",
          "dataId": "urn:li:comment:(activity:7288563716655104001,7288569621153030144)"
        }
      ],
      "commentAdded": "Great insights! Focusing on meaningful openers can truly transform cold emails. Lets elevate our communication and cut out the filler!"
    },
    {
      "postId": "urn:li:activity:7287439346054430720",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287439346054430720",
      "url": "https://www.linkedin.com/in/emmiefaust?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABQG94BQKmqEq872V85cvMOJzJ5W3arrYY",
      "name": "Emmie Faust\nEmmie Faust",
      "content": "82% of people are more likely to trust a company whose leader engages on social media.\n\nIn 2025, consumers want to see a face behind the company.\n\n↳ It builds trust\n↳ It humanises a brand\n↳ It fosters more business\n\nSo stop being invisible—it's time to get noticed.\n\nHere are 7 ways to start:\n\n1. Upgrade your LinkedIn profile\n↳ A strong profile attracts more connections.\n→ Craft a clear, compelling, and optimised profile.\n\n2. Get comfortable being seen\n↳ Overcome fear to build consistent visibility.\n→ Start small, and embrace the imperfection.\n\n3. Find a support community\n↳ Growing with others expands your reach.\n→ Find communities & collaborate with others.\n\n4. Post thought leadership content\n↳ Regular content increases visibility & authority.\n→ Post weekly insights, encourage engagement.\n\n5. Tell stories, not just facts\n↳ Stories create deeper, lasting connections.\n→ Share personal anecdotes & career moments.\n\n6. Focus on quality over virality\n↳ Depth matters more than short-term virality.\n→ Focus on value, not vanity metrics.\n\n7. Start a newsletter\n↳ Newsletters create more authority & loyalty.\n→ Provide high-value content in a regular newsletter.\n\nYou don’t need to be perfect, just present.\nYour business success could depend on it.\n\nHow are you building your personal brand this year?\nShare and inspire others \n\nJoin our FFR 30-day Personal Branding Challenge for community support as you grow your brand on LinkedIn.\nIt starts this week:\n\n️ Repost to help your network build their brand.\n\nFollowfor more",
      "reactions": {
        "likes": "1,022",
        "comments": "305 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Here’s a bonus tip to complement your list:\n\n8. Engage in meaningful conversations\n\n↳ Don’t just post—interact.\n→ Thoughtful comments on others’ posts demonstrate expertise, build relationships, and expand your network organically.\n\nAlso, consistency is key. Even small, regular steps toward visibility can snowball into significant impact over time.\n\nThis year, I’m focusing on authentic storytelling and fostering genuine connections in my personal brand journey.",
          "userName": "Ishita K",
          "userProfileURL": "https://www.linkedin.com/in/marketerishita",
          "dataId": "urn:li:comment:(ugcPost:7287439344603181056,7287446672203268096)"
        },
        {
          "commentText": "Ishita K yes building meaningful relationships is what it's all about!",
          "userName": "Emmie Faust",
          "userProfileURL": "https://www.linkedin.com/in/emmiefaust",
          "dataId": "urn:li:comment:(ugcPost:7287439344603181056,7287449673898811392)"
        },
        {
          "commentText": "Ishita K interactions, is the key",
          "userName": "Heena S.",
          "userProfileURL": "https://www.linkedin.com/in/heena-singh0717",
          "dataId": "urn:li:comment:(ugcPost:7287439344603181056,7287761633362264064)"
        },
        {
          "commentText": "Emmie Faust This is the nudge so many leaders need! Look in 2025, being the ‘invisible CEO’ is literally like running a company without a sign on the door: no trust, no connection, and zero opportunities.\nOne thing I’d add to this amazing list: engage with others as much as you post. And no need for it to be a thought piece. Just engage thoughtfully on industry topics or amplify someone else’s insights.",
          "userName": "Dr. Jane Ebot-Bish",
          "userProfileURL": "https://www.linkedin.com/in/janeebotbish",
          "dataId": "urn:li:comment:(ugcPost:7287439344603181056,7287862339381391361)"
        },
        {
          "commentText": "Dr. Jane Ebot-Bish brilliant love that - engaging with others is a key part of the process ",
          "userName": "Emmie Faust",
          "userProfileURL": "https://www.linkedin.com/in/emmiefaust",
          "dataId": "urn:li:comment:(ugcPost:7287439344603181056,7287864353054179328)"
        }
      ],
      "commentAdded": "Great insights! 🌟 Embracing visibility is key to building trust. Excited to see how many will join the Personal Branding Challenge! #BrandBuilding"
    },
    {
      "postId": "urn:li:activity:7288896397406265344",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7288896397406265344",
      "url": "https://www.linkedin.com/in/josephplazo?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAijs4BM-6R4sEkObXeyhUy9vP4ligyY1g",
      "name": "Joseph Riñoza Plazo\nJoseph Riñoza Plazo",
      "content": "8 Forbidden Sales Secrets That Unlock Mind-Blowing Results\n\n\nDedicated to two of the top closers in my industry: Courtney Bissett and Sandy Mertz-Brady",
      "reactions": {
        "likes": "391",
        "comments": "70 comments",
        "shares": "0"
      },
      "mediaUrl": "blob:https://www.linkedin.com/931ba614-258b-4b3a-b974-cef537900c8b",
      "comments": [
        {
          "commentText": "Great, Joseph! Difficult, painful emotions: really helpful messages delivered in really unhelpful ways. Our job is to receive, accurately translate and effectively respond.",
          "userName": "Mark Evans",
          "userProfileURL": "https://www.linkedin.com/in/mark-evans-uk",
          "dataId": "urn:li:comment:(ugcPost:7288825322517454848,7288839918062108672)"
        },
        {
          "commentText": "Mark Evans evolution - the only way to escape the rut",
          "userName": "Joseph Riñoza Plazo",
          "userProfileURL": "https://www.linkedin.com/in/josephplazo",
          "dataId": "urn:li:comment:(ugcPost:7288825322517454848,7288862030869000192)"
        },
        {
          "commentText": "Couldn’t agree more with this",
          "userName": "Joshua Da Costa",
          "userProfileURL": "https://www.linkedin.com/in/joshua-da-costa-56a666199",
          "dataId": "urn:li:comment:(ugcPost:7288825322517454848,7288829921538244608)"
        },
        {
          "commentText": "thank you",
          "userName": "Joseph Riñoza Plazo",
          "userProfileURL": "https://www.linkedin.com/in/josephplazo",
          "dataId": "urn:li:comment:(ugcPost:7288825322517454848,7288842761921851392)"
        }
      ],
      "commentAdded": "Absolutely love this! 🔑 Unlocking these secrets can transform our approach to sales. Cheers to Courtney and Sandy for their inspiration! 🚀"
    },
    {
      "postId": "urn:li:activity:7288976861596987393",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7288976861596987393",
      "url": "https://www.linkedin.com/in/curtismay?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAACOW7YBirTXZs5yzFIG1rLENx49lU4WhIc",
      "name": "Curtis May\nCurtis May",
      "content": "Small steps lead to big changes! Here are 5 quick tips for improving your cashflow today.",
      "reactions": {
        "likes": "2",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Great tips! Taking small, actionable steps is key to financial success. Excited to implement these strategies for better cash flow! 💡💰"
    },
    {
      "postId": "urn:li:activity:7288860719498833920",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7288860719498833920",
      "url": "https://www.linkedin.com/in/ayush-kaushal-1a147b228?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADkFskkBfudZl9ImS2SRfPxkexpaVyZf2ks",
      "name": "Ayush Kaushal\nAyush Kaushal",
      "content": "GEEKS FOR GEEKS 160 DAYS CODING CHALLENGE\n\nBONUS PROBLEMS:\n->CLOSEST THREE SUM\n->FOUR SUM\n->SUBARRAYS WITH AT MOST K DISTINCT ELEMENTS\n->SUBARRAYS WITH K DISTINCT ELEMENTS\n->PAIR SUM IN SORTED AND ROTATED ARRAY",
      "reactions": {
        "likes": "1",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Exciting challenge! Tackling these problems will definitely sharpen our coding skills. Thanks for the inspiration, GEEKS FOR GEEKS! 💻✨"
    },
    {
      "postId": "urn:li:activity:7288603481341407232",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7288603481341407232",
      "url": "https://www.linkedin.com/in/ukstopsalestrainer1?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABonWnABFmam2K6LQCm7UvKhDCGJCr8foDI",
      "name": "Steve Burton.\nSteve Burton.",
      "content": "Forget Predictions it's boring: Here’s What I see working for us and our clients in #2025\n\nSorry to disappoint it's not throwing tech and AI at stuff (Yet)\nEveryone loves to predict the future, but I’m not here to join that bandwagon. Instead, I’ll tell you what’s working based on real experience.\nStrangely for us in the age of\nold school seems to be making a massive comeback\n\nwill continue to be the best city in the World. Prove me Wrong !!\n\nMeetings: Yep, you heard that right. Building communities and asking for referrals is the top way we have been growing. Shaking hands , kissing babies , eating steaks , building trust .\n\nWho knew that\nwas important? My number one prediction? This isn’t going out of style anytime soon; however, you do need the skill set to do it and since COVID people's competency has dropped off a cliff.\n\n: Believe it or not, cold-calling the right people at the right time with the right message is making a massive impact. Again You need the skills to do it, and it’s working wonders. use an Agency like\n, or get training from my mateor failing that just do something.\n\n-\n: Make it easy for your customers to purchase. We’ve lost our way with all the sales tactics, sales tech and sales pipeline stages. What used to work and always did was working collaboratively to help buyers purchase.\n\nGive them all the information they need, and when they need it make it easy to find it and progress again dont make things hard for your champion or potential customers to make the deal.\n\nI useteam at's digital sales room to make this happen. Not expensive, easy to use and has a decent impact on deal velocity and close rate. EASY\n\nHere are some stats that back up what I'm saying I've no idea how credible they are or who said them but they agree with me.\n\n-95% of professionals believe that face-to-face meetings are essential for long-term business relationships.\n\n-65% of businesses said that in-person trade shows were an invaluable part of their marketing strategy.\n\n-80% of B2B sales interactions between suppliers and buyers are expected to occur in digital channels by 20251.\n\n-Digital sales rooms can accelerate deal cycles by up to 50% by providing a centralized space for all sales-related interactions and documents.\n\n49% of buyers prefer that initial contact be made via cold call.\n\n57% of C-level executives and VPs list cold calling as their preferred method of being contacted.\n\nSo, there you have it. No crystal ball, no sympathy posts, no story out of tragedy, no\nlists, no comment to get a free download, and no what's dead.\n\nJust tried and true methods that are delivering results.\n\nLet's have a good one, get out, meet people, sell stuff and save the Economy",
      "reactions": {
        "likes": "37",
        "comments": "27 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Trust is the most valuable commodity period. It will be come more and more valuable moving forward. Anyway you can earn trust - focus on that. It will be an invaluable asset.",
          "userName": "Manuj Aggarwal",
          "userProfileURL": "https://www.linkedin.com/in/manujaggarwal",
          "dataId": "urn:li:comment:(ugcPost:7288567081460006913,7288603429113843713)"
        },
        {
          "commentText": "Manuj Aggarwal I, agree how do we package trust as a service?",
          "userName": "Steve Burton.",
          "userProfileURL": "https://www.linkedin.com/in/ukstopsalestrainer1",
          "dataId": "urn:li:comment:(ugcPost:7288567081460006913,7288608194686320642)"
        },
        {
          "commentText": "Steve Burton. Come talk to me  I have been researching this very topic for the last 30 years. And now I have a tried and tested methods to convert AI and compute power into trust. A sort of trust factory if you will",
          "userName": "Manuj Aggarwal",
          "userProfileURL": "https://www.linkedin.com/in/manujaggarwal",
          "dataId": "urn:li:comment:(ugcPost:7288567081460006913,7288611785643868161)"
        }
      ],
      "commentAdded": "Absolutely refreshing to see a return to basics! Building genuine relationships is the real key to success. Let’s get out there and connect! 💼🤝"
    },
    {
      "postId": "urn:li:activity:7288211662740865025",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7288211662740865025",
      "url": "https://www.linkedin.com/in/nona-prather-b5663010a?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABuAYXIBi7sSvrYjNrRn52Kia7vOCxjVrRM",
      "name": "Nona Prather\nNona Prather",
      "content": "Feeling stuck on where to speak in 2025?\nHere’s a tip: Think local first! \nResearch community events, schools, and small business groups.\nLocal speaking gigs can build momentum for larger stages later on.",
      "reactions": {
        "likes": "6",
        "comments": "3 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Great advice for speakers starting out and growing!",
          "userName": "Brandon Williams",
          "userProfileURL": "https://www.linkedin.com/in/brandon-williams-speaker",
          "dataId": "urn:li:comment:(activity:7288211662740865025,7288215366411948034)"
        },
        {
          "commentText": "Brandon Williams Thank you!",
          "userName": "Nona Prather",
          "userProfileURL": "https://www.linkedin.com/in/nona-prather-b5663010a",
          "dataId": "urn:li:comment:(activity:7288211662740865025,7288260165168992256)"
        },
        {
          "commentText": "",
          "userName": "Jesse Cruz",
          "userProfileURL": "https://www.linkedin.com/in/jesse-cruz-133714164",
          "dataId": "urn:li:comment:(activity:7288211662740865025,7288242003329396736)"
        }
      ],
      "commentAdded": "Great advice! Starting local not only builds confidence but also fosters valuable community connections. Lets elevate our voices together!"
    },
    {
      "postId": "urn:li:activity:7287237130307665921",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287237130307665921",
      "url": "https://www.linkedin.com/in/rickconlowservantleadership?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAPUxFwB6p1p6ESvdwgOkdRMuNdW3KDrJTU",
      "name": "Richard A. Conlow\nRichard A. Conlow",
      "content": "THE 5 DYNAMICS OF SERVANT LEADERSHIP VIDEO TRAINING: https://buff.ly/3NZJbSG \n#leadership \n#management \n#servantleadership ",
      "reactions": {
        "likes": "4",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Excited to dive into these dynamics! Servant leadership truly transforms teams and fosters a culture of growth. 🌱 #LeadershipJourney"
    },
    {
      "postId": "urn:li:activity:7288638486562160640",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7288638486562160640",
      "url": "https://www.linkedin.com/in/brookedukes?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAFRMn4B6yO6EujhcsWvYFFz5CM53uCHoxo",
      "name": "Brooke M. Dukes\nBrooke M. Dukes",
      "content": "Are you ready to uncover your true potential and start living in alignment with your purpose?\n\nDownload your FREE Human Design Chart now and gain insights into:\n\n️ Your strengths and talents\n️ How to make better decisions\n️ The key to unlocking your energy flow\n\nYour Human Design chart is the ultimate tool for understanding yourself and stepping into your best life.\n\n Click the link below to get your FREE Human Design Chart and start your journey of self-discovery today!",
      "reactions": {
        "likes": "2",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": "blob:https://www.linkedin.com/7b0929ba-f0f2-4d29-9437-e5cbb94a47a2",
      "comments": [],
      "commentAdded": "Exciting opportunity! 🌟 Understanding our design can truly transform our lives. Ready to embrace your unique path? Lets dive in! 🌈✨"
    },
    {
      "postId": "urn:li:activity:7288651836377481216",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7288651836377481216",
      "url": "https://www.linkedin.com/company/keithsconiers/posts",
      "name": "Keith Sconiers\nKeith Sconiers",
      "content": "I’ve always WORRIED about sharing my story online.\n\nI NEVER want to come off as having all the answers.\n\nI feel like I’m NOT winning probably as much as you do.\n\nI need to APOLOGIZE as much if not more than you do.\n\nI make MISTAKES just like you do.\n\nSTILL do.\n\nLOTS of room for growth for me.\n\nI ALSO know this.\n\nYou don’t NEED advice on how to be successful.\n\nNot from ME anyway.\n\nThere are people FAR more qualified than I am to teach you how to do that.\n\nI’m just here to pick YOU back up.\n\nWhen you come HOME to changed locks.\n\nWhen the business is going BACKWARDS.\n\nWhen your bank account is NEGATIVE.\n\nWhen you DON’T feel loved.\n\nWhen you feel like QUITTING.\n\nWhen you feel OVERCOME with…\n\nFAILURE.\n\nLet’s Talk:",
      "reactions": {
        "likes": "4",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Thank you for your honesty! Its refreshing to hear that vulnerability can lead to growth. Were all in this together—lets lift each other up!"
    },
    {
      "postId": "urn:li:activity:7288978320396890112",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7288978320396890112",
      "url": "https://www.linkedin.com/in/romimahajan?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAlYZuQBDEZNbNuEzy5tczl-rn6tmbfIonY",
      "name": "Romi Mahajan\nRomi Mahajan",
      "content": "Death threats for Budde. I mean, come on. Is this the society we want?",
      "reactions": {
        "likes": "2",
        "comments": "3 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "I'm worried about her and Dr. Fauci, whose protection they just remove.",
          "userName": "Tatiana Becker",
          "userProfileURL": "https://www.linkedin.com/in/tatianabecker",
          "dataId": "urn:li:comment:(activity:7288978320396890112,7288979517333745666)"
        },
        {
          "commentText": "Absolutely. What a time in the land of the free and home of the brave.... ",
          "userName": "Romi Mahajan",
          "userProfileURL": "https://www.linkedin.com/in/romimahajan",
          "dataId": "urn:li:comment:(activity:7288978320396890112,7288979909262069761)"
        },
        {
          "commentText": "Despicable. Dystopian. I fear for our world and peace loving people everywhere.",
          "userName": "Michael Levin",
          "userProfileURL": "https://www.linkedin.com/in/michael-levin-673b7a225",
          "dataId": "urn:li:comment:(activity:7288978320396890112,7288991624242642944)"
        }
      ],
      "commentAdded": "Absolutely unacceptable! We must foster a culture of respect and dialogue, not threats. Its time to stand against such behavior."
    },
    {
      "postId": "urn:li:activity:7287820625912463360",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287820625912463360",
      "url": "https://www.linkedin.com/in/henrylovecrypto?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAnt7msB9Inngljm39OC1beppZTooRP3nyk",
      "name": "Henry Love\nHenry Love",
      "content": "China wants to Build a 1 kilometer wide solar power station in space that will generate more energy in one year than all the oil on Earth.\n\nXi’s China is already winning the renewable energy race and has currently made about 70 times more solar panels than the United States.\n\nThanks to China, the cost of electricity from solar has dropped by more than 90% since 2010.\n\nNow China is taking the race to space, the solar panel array will orbit 36,000km above Earth, collecting uninterrupted energy and beaming it down to Earth.\n\nThis is going to reshape the global energy market especially at a time where AI and Blockchain both require mass amount of energy to be sustainable. Remarkable.",
      "reactions": {
        "likes": "99",
        "comments": "23 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Japan Space Agency did the most recent attempt at this in 2009. They achieved 0.01% efficiency. They sent 10 Watts from the satellite and received Milliwats on Earth. \n\nWith a 1 square km array you might produce 400 MW. If you assume the same efficiency ( which probably wouldn't be the case ) you get 40 kW on Earth's receiver.\n\nFor perspective, you can power maybe 30/40 houses with that.",
          "userName": "Mattia Spinelli",
          "userProfileURL": "https://www.linkedin.com/in/mattia-spinelli-029044a8",
          "dataId": "urn:li:comment:(ugcPost:7287454291588472834,7288122898152656897)"
        },
        {
          "commentText": "Mattia Spinelli but the efficiency of solar panels have improved quite a bit since 2009 no?",
          "userName": "Henry Love",
          "userProfileURL": "https://www.linkedin.com/in/henrylovecrypto",
          "dataId": "urn:li:comment:(ugcPost:7287454291588472834,7288896960315482113)"
        },
        {
          "commentText": "Henry Love no, solar cells are a mature technology they are between 20% and 30% efficiency. But even if you had impossible 100% efficient cells, you can take the calculation I made and multiply it by 3. So instead of 30 houses you would be powering 100 houses. It's a transport problem.",
          "userName": "Mattia Spinelli",
          "userProfileURL": "https://www.linkedin.com/in/mattia-spinelli-029044a8",
          "dataId": "urn:li:comment:(ugcPost:7287454291588472834,7288935708231098368)"
        },
        {
          "commentText": "Whilst I applaud the investment in solar (and think North Africa and Saudi Arabia should consider the same) I am not convinced about beaming energy to Earth. My simple logic is that physical transfer of power would be a net energy cost given gravity. So it’s a bean as you mention. But is it’s too diffuse then it cannot be collected and if it’s too focussed then is it not more like a destructive laser seen in comic books.\n\nPlease can some explain to a layman how this works.",
          "userName": "Stuart Thomson",
          "userProfileURL": "https://www.linkedin.com/in/jstuartthomson",
          "dataId": "urn:li:comment:(ugcPost:7287454291588472834,7288875414565879808)"
        },
        {
          "commentText": "Stuart Thomson this is great insights",
          "userName": "Henry Love",
          "userProfileURL": "https://www.linkedin.com/in/henrylovecrypto",
          "dataId": "urn:li:comment:(ugcPost:7287454291588472834,7288896810868203520)"
        }
      ],
      "commentAdded": "Incredible vision! Chinas solar power initiative could redefine energy accessibility and sustainability on Earth while paving the way for future innovations. 🌍🔆"
    },
    {
      "postId": "urn:li:activity:7288939802517803008",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7288939802517803008",
      "url": "https://www.linkedin.com/in/dennisolympios?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAl9PhoBuXY1_3zEBPUm0arqDPI0o-8SKPQ",
      "name": "Dennis Olympios\nDennis Olympios",
      "content": " Leave Your Mark - Chalk Your Own Path  \n\nTrue leaders don’t just follow the map—they create new roads.\n\nThe world needs pioneers unafraid to sketch their unique journeys, showcasing values and visions that make a difference.\n\nEver wonder what it takes to differentiate yourself and carve out a path that's genuinely yours?\n\nHere’s the playbook:\n\n Celebrate Your Uniqueness (Don't be a Copycat): That quirky, distinct perspective of yours? It's your superpower. Let it radiate in all you do because with all the copycats out there, the world craves originality now more than ever!\n\n Innovate Fearlessly (Stretch beyond the Box): Break the chains of the conventional and shake up the status quo. Innovation isn't just an idea; it’s a lifestyle that propels you beyond the ordinary and into the extraordinary!\n\n Forge Genuine Connections (while removing those that pull you down): It's not just about what you know but about who resonates with your journey. Seek out those who will elevate you to new heights and remove those who block your progress either intentionally or unintentionally. Networking isn’t about exchanging cards and never contacting each other again (neither is connecting on LinkedIn and never speaking to each other by the way); it’s about sowing seeds for mutual growth and forging solid win-win collaborations!\n\nSo, the question is, are you ready to leave your indelible mark?\n\nDrop your vision in the comments – let's inspire each other!",
      "reactions": {
        "likes": "598",
        "comments": "124 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "That's spot on Dennis! Thanks for sharing!",
          "userName": "Chahat Raj Kapoor",
          "userProfileURL": "https://www.linkedin.com/in/chahat-raj-kapoor",
          "dataId": "urn:li:comment:(activity:7288833987811110912,7288939798294097920)"
        }
      ],
      "commentAdded": "Absolutely! Lets embrace our uniqueness and innovate together. Excited to see everyones visions and support each other’s journeys! 🌟"
    },
    {
      "postId": "urn:li:activity:7287407569558466564",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287407569558466564",
      "url": "https://www.linkedin.com/in/dupeburgess?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABvuM0kBMBiyaFKVbDKsiSYEWwwf2knjHBQ",
      "name": "Dr. Dupe Burgess\nDr. Dupe Burgess",
      "content": "Over 70% of employees feel disengaged at work.\n\nI was once one of those people:\n\n- Overworked\n- Under-appreciated\n- Wanting more fulfilment\n\nIt’s draining, it creates doubt,\nAnd most importantly, it costs you your happiness.\n\n8 career red flags you shouldn’t ignore\n(And what to do about it):\n\n1. You’ve stopped learning\n↳ Stagnation kills growth & ambition\n↳ Learn new skills or seek new growth projects.\n\n2. You don’t feel appreciated\n↳ Lack of recognition lowers motivation & morale.\n↳ Share your wins & get constructive feedback.\n\n3. No work-life balance\n↳ Overworking indicates a toxic, draining culture.\n↳ Set boundaries, delegate & streamline your work.\n\n4. Your values don’t align\n↳ Misaligned value cause deep dissatisfaction.\n↳ Seek out projects that align with your principles\n\n5. You’re constantly stressed or anxious\n↳ Constant stress damages health & happiness.\n↳ Address stress sources and prioritise self-care.\n\n6. There’s no room for advancement\n↳ No growth means no future potential.\n↳ Communicate ambitions & build necessary skills.\n\n7. You’re underpaid\n↳ Low pay reflects low appreciation.\n↳ Benchmark your pay & ask for fair compensation.\n\n8. You feel isolated\n↳ Isolation lowers job satisfaction & morale.\n↳ Connect with coworkers and find a mentor.\n\nYour job should inspire you, not exhaust you.\nIt’s never too late to redirect your path.\n\nWhat was the biggest turning point in your career?\nLet me know in the comments below \n\nYou might like my free newsletter where I talk more about these topics—sign up:\n\n️ Repost to help your network navigate their career.\n Followfor more.",
      "reactions": {
        "likes": "1,000",
        "comments": "293 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Such a relatable post, Dr. Dupe Burgess. My turning point came when I realized stagnation was stealing my ambition. Alignment and growth made all the difference, and now I’m helping other leaders achieve that.",
          "userName": "Damesha Craig, Leadership Coach and Startup Advisor",
          "userProfileURL": "https://www.linkedin.com/in/dameshacraig",
          "dataId": "urn:li:comment:(ugcPost:7287407566064607232,7287426145149431808)"
        },
        {
          "commentText": "Damesha Craig, Leadership Coach and Startup Advisor amazing! Thank you for sharing.",
          "userName": "Dr. Dupe Burgess",
          "userProfileURL": "https://www.linkedin.com/in/dupeburgess",
          "dataId": "urn:li:comment:(ugcPost:7287407566064607232,7287430355475652608)"
        },
        {
          "commentText": "Disengagement drains growth and happiness—recognize the red flags and take action to reclaim your career.",
          "userName": "Cassie Lincoln",
          "userProfileURL": "https://www.linkedin.com/in/cassielincolnalm",
          "dataId": "urn:li:comment:(ugcPost:7287407566064607232,7287461504008830977)"
        }
      ],
      "commentAdded": "Thanks for sharing these crucial insights! Aligning our work with our values is key to fulfillment. Excited to hear others turning points! 🚀"
    },
    {
      "postId": "urn:li:activity:7284587160735809536",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7284587160735809536",
      "url": "https://www.linkedin.com/in/davidlorango?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADIXfsBjASfnTRxRgIxkqXGR-KsDN_c3wk",
      "name": "David Lorango\nDavid Lorango",
      "content": "Nothing like meeting new people who share your passions. Thanks to Stan Rosenberg for bringing a solid crew together.\n\nSide note - learn from the greats of history. More to come on this!!",
      "reactions": {
        "likes": "6",
        "comments": "1 comment",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Was so much fun catching up with you David Lorango! Excited to work together even more closely in the year ahead.",
          "userName": "Stan Rosenberg",
          "userProfileURL": "https://www.linkedin.com/in/stanrosenberg",
          "dataId": "urn:li:comment:(ugcPost:7284587159896899584,7284593075711062016)"
        }
      ],
      "commentAdded": "It’s inspiring to connect with like-minded individuals! Excited to see what’s next and learn from the greats alongside this amazing group!"
    },
    {
      "postId": "urn:li:activity:7288904723439443968",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7288904723439443968",
      "url": "https://www.linkedin.com/in/jondavidleslie?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABu-s4B50TpraNCLboiGWes3m1D2rP1sHk",
      "name": "Jon Leslie\nJon Leslie",
      "content": "Do you think it's OK to take a career break?\n\nThe average professional career is 40 years. \n\nThat’s working for:\n\n-> 480 months\n-> 1,920 weeks\n-> 9,600 days\n\nWithout a significant break.\n\nHave you taken a career break?\n\nIf not, are you planning to take a career break?",
      "reactions": {
        "likes": "15",
        "comments": "35 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "So far, I haven’t taken a break, even though I did start over in a new career path 11 years ago. \n\nHow long is a career break? Several years? 1 year? A month? \n\nWould I? I don’t know. Maybe if I were so financially well off that I didn’t have to worry about bills or health emergencies and wanted to pursue something else for a bit.",
          "userName": "Selena Brown",
          "userProfileURL": "https://www.linkedin.com/in/selena-m-brown",
          "dataId": "urn:li:comment:(ugcPost:7288904722671894528,7288927804979609600)"
        },
        {
          "commentText": "Selena Brown I’d say a career break is anything longer than 2x your usual vacation time. But shoot for a year plus if you can. Use it as a knowledge growing sabbatical.",
          "userName": "Jon Leslie",
          "userProfileURL": "https://www.linkedin.com/in/jondavidleslie",
          "dataId": "urn:li:comment:(ugcPost:7288904722671894528,7288928578153373696)"
        },
        {
          "commentText": "Jon Leslie 2X my usual break is only 2 weeks. ",
          "userName": "Selena Brown",
          "userProfileURL": "https://www.linkedin.com/in/selena-m-brown",
          "dataId": "urn:li:comment:(ugcPost:7288904722671894528,7288930876439052288)"
        },
        {
          "commentText": "Of course is it ok but people, mainly those who look at your cv for your next role might find a reason otherwise. \nYou can’t win. \nStayed too long at a job, no ambition, \nmoved a lot, very ambitious,\nwent on a career break, nope that’s a huge gap….",
          "userName": "Vinnie Gill FCIPD",
          "userProfileURL": "https://www.linkedin.com/in/vinniegill",
          "dataId": "urn:li:comment:(ugcPost:7288904722671894528,7288910097060159489)"
        },
        {
          "commentText": "Vinnie Gill FCIPD It makes no sense. You’d think companies would admire the initiative (tried something new) or adventurous spirit (traveled for a year).",
          "userName": "Jon Leslie",
          "userProfileURL": "https://www.linkedin.com/in/jondavidleslie",
          "dataId": "urn:li:comment:(ugcPost:7288904722671894528,7288920531955798016)"
        }
      ],
      "commentAdded": "Absolutely! A career break can offer valuable insights and renewed energy. It’s essential for long-term growth and well-being. What’s your experience?"
    },
    {
      "postId": "urn:li:activity:7288962297010475008",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7288962297010475008",
      "url": "https://www.linkedin.com/company/coforge-tech/posts",
      "name": "Coforge\nCoforge",
      "content": "Coforge delivers exceptional growth in Q3, FY 25 and expresses strong growth confidence for the year ahead!",
      "reactions": {
        "likes": "109",
        "comments": "3 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "#QuarterlyResults \n#Investors \n#CoforgeResults \n#CoforgeIsGrowth \n#Coforge \n#Awards \n#recognitions \n#gptw\n\nSudhir Singh, Sunil Fernandes, John Speight,,,,,,,,,,,,,,,,,,,,,,",
          "userName": "Coforge",
          "userProfileURL": "https://www.linkedin.com/company/coforge-tech/posts",
          "dataId": "urn:li:comment:(ugcPost:7288962296234577922,7288963954792439808)"
        },
        {
          "commentText": "Jabse coforge ne mujhe hire Kiya hai day by day growth hoti ja rhi hai coforge ki ",
          "userName": "sourav dhiman",
          "userProfileURL": "https://www.linkedin.com/in/sourav-dhiman-407b13323",
          "dataId": "urn:li:comment:(ugcPost:7288962296234577922,7288989183522549760)"
        }
      ],
      "commentAdded": "Exciting news, Coforge team! Impressive Q3 results are a testament to your hard work and vision. Looking forward to seeing what’s next! 📈"
    },
    {
      "postId": "urn:li:activity:7288573251822268416",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7288573251822268416",
      "url": "https://www.linkedin.com/in/coleharmonson?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAEYcRcBh_ETnKo-_b2wZNbgUvPD4JkmcvQ",
      "name": "Cole Harmonson\nCole Harmonson",
      "content": "When I started Far West Capital, I made every mistake in the book.\n\nHired too many portfolio managers Created endless spreadsheets Chased data in 9 different systems\n\nThe truth? Most factors are still operating this way.\n\nWhy?\n\nBecause they're stuck with legacy systems that:\n Don't talk to each other\n Can't scale\n Cost a fortune to maintain\n\nThat's exactly why we built NN6.\n\nYou shouldn't need an army of analysts to know:\n What's happening in your portfolio\n Where your risks are\n Which clients need attention\n\nOne click. Real insights. Better decisions.\n\nReady to see what modern factoring looks like?\n\nDM me.",
      "reactions": {
        "likes": "13",
        "comments": "1 comment",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Can't wait!",
          "userName": "Leighton Weston",
          "userProfileURL": "https://www.linkedin.com/in/leighton-weston",
          "dataId": "urn:li:comment:(activity:7288541058806824960,7288951165713592320)"
        }
      ],
      "commentAdded": "Excited to see how NN6 simplifies portfolio management! A game changer for the industry. Looking forward to learning more! #Innovation"
    },
    {
      "postId": "urn:li:activity:7288991017054154752",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7288991017054154752",
      "url": "https://www.linkedin.com/in/vanessaloder?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAEkEdoBTynSM-XF6bZLUpct-8zCEides3c",
      "name": "Vanessa Loder\nVanessa Loder",
      "content": "I had an absolute blast being a guest on the Your Second Prime podcast! It was such a fun and candid conversation with Gretchen, where we dove into all things leadership, personal growth, and empowerment. So grateful for the opportunity!\n\nPlease check out @yoursecondprime and if you would like to listen to the podcast you can find it here:",
      "reactions": {
        "likes": "4",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Sounds like an amazing experience! I cant wait to listen in on your insights about leadership and personal growth. 🎙️✨ #YourSecondPrime"
    },
    {
      "postId": "urn:li:activity:7287009532680065024",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287009532680065024",
      "url": "https://www.linkedin.com/in/kyadav?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAJrndEBwiBDP9UY70kcWlpQUAzEUsJxyRA",
      "name": "Kuldeep Yadav\nKuldeep Yadav",
      "content": "What does it take to move LLM-powered products from PoCs to production?\n\nI had a great time exploring this question withat the\n\nISF is such a unique event—it brings together everyone from curious school kids to experienced professionals, with attendees ranging in age from 8 to 80. That kind of diversity makes for some incredible conversations.\n\nIn our session, we dived into some key areas:\n\nWhat makes LLMs so exciting and different from traditional software engineering.\nThe new possibilities and use cases unlocked by LLMs (Tanuja shared some fantastic examples from Education and Healthcare).\nCommon mistakes developers and entrepreneurs make when picking use cases.\nThe key ingredients of a successful LLM-powered product - from the right use-case to iterations to scaling. (Not to forget software stack that enables them)\nAnd most importantly, the ethical principles we all need to keep in mind as builders.\n\nleads teams atResearch working on LLMs in Education and Healthcare, shared powerful real-world examples. I was also able to share some insights from our work at\n.\n\nAlways inspiring to be part of events like ISF, where curiosity and innovation are at the center of every conversation.",
      "reactions": {
        "likes": "100",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Incredible insights! Excited to see how we can harness LLMs responsibly across diverse sectors—truly inspiring event! #Innovation #Ethics"
    },
    {
      "postId": "urn:li:activity:7288949988045324288",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7288949988045324288",
      "url": "https://www.linkedin.com/groups/1850284?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A1850284-7288949987034492929",
      "name": "Business Development - The Missing Link Between Marketing & Sales - 540,000 Members Strong\nBusiness Development - The Missing Link Between Marketing & Sales - 540,000 Members Strong",
      "content": null,
      "reactions": {
        "likes": "20",
        "comments": "2 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Listen with the intent to understand !!!not just to reply \nThanks for your words of wisdom",
          "userName": "Gary Goldberg",
          "userProfileURL": "https://www.linkedin.com/in/garyggoldberg",
          "dataId": "urn:li:comment:(groupPost:1850284-7288949987034492929,7288970064836321280)"
        },
        {
          "commentText": "𝗨𝗡 𝗪𝗼𝗺𝗲𝗻 𝗶𝘀 𝗛𝗶𝗿𝗶𝗻𝗴 𝟮𝟬 𝗛𝗼𝗺𝗲-𝗕𝗮𝘀𝗲𝗱 𝗖𝗼𝗻𝘀𝘂𝗹𝘁𝗮𝘁𝗶𝗼𝗻 𝗢𝗽𝗽𝗼𝗿𝘁𝘂𝗻𝗶𝘁𝗶𝗲𝘀 𝗔𝗰𝗿𝗼𝘀𝘀 𝘁𝗵𝗲 𝗚𝗹𝗼𝗯𝗲\n\nUN Women is excited to announce the availability of 20 home-based consultation opportunities for individuals across the globe. This initiative represents a…\n\nREAD MORE/ APPLY HERE:",
          "userName": "Ernest Machingauta",
          "userProfileURL": "https://www.linkedin.com/in/ernest-machingauta-00969b1b9",
          "dataId": "urn:li:comment:(groupPost:1850284-7288949987034492929,7288966612378951680)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7287185282091696130",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287185282091696130",
      "url": "https://www.linkedin.com/in/saaquib-dawoodani?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABKzZVcB8lQOPqP8Ui7onhnHOWU9uigpc1c",
      "name": "Saaquib Dawoodani\nSaaquib Dawoodani",
      "content": "Massively pleased to announce that Himanshu Choudhary has joined Rippling as a Sales Manager!  \n\nGetting Himanshu in feels like closing an enterprise sales deal -- it took me close to 9 months of convincing and he finally jumped ship \n\n- Wishing you a wonderful journey here and thanks for trusting me, brother! ️\n\nCheers \n\n\n\nP.S. - We're hiring across levels in Sales. Please reach out to me atif you're keen to explore!",
      "reactions": {
        "likes": "668",
        "comments": "43 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Superb!",
          "userName": "Yash Chowdhury",
          "userProfileURL": "https://www.linkedin.com/in/ychowdhury",
          "dataId": "urn:li:comment:(ugcPost:7287032942625742849,7287185245223755776)"
        }
      ],
      "commentAdded": "Congratulations, Himanshu! 🎉 Excited to see you thrive at Rippling. Kudos to the team for the successful recruit! 🚀 #SalesExcellence"
    },
    {
      "postId": "urn:li:activity:7286414196592820224",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7286414196592820224",
      "url": "https://www.linkedin.com/company/lal-bahadur-shastri-institute-of-management/posts",
      "name": "Lal Bahadur Shastri Institute of Management\nLal Bahadur Shastri Institute of Management",
      "content": "LBSIM organized the National AI & Data Sciences Conference on the theme of \"AI Driven Innovations: Transforming India's Digital Economy\" on 18th Jan 2025. The Conference commenced with the Inaugural Addresses by Mr., Data & AI Pre-Sales Engineering Leader, IBM Technology, India and South Asia, and Guest of Honours Ms., Managing Director, Accenture, and Member, Advisory Body - LBSIM Mr.Strategy Officer, Reliance Consumer Brands, followed by the Technical Session.\n\nThe Technical Session \"AI Driven Use Cases: Transforming Business Processes for Efficiency and Innovation\" was moderated by, Associate Professor, LBSIM. The Technical Session saw spirited and thoughtful insights from industry experts – Mr., Principal AI/ML Advisor AWS Startups; Generative AI Thought Leader, Mr., Founder & CEO, SimplAI, Mr. Kunal Gupta, Senior Vice President of Data Sciences (GenAI) and Analytics, Ms., Area Sales Director, HCLTech.\n\nLooking forward to the next session on several Workshops by Industry Experts.\n\n&DS",
      "reactions": {
        "likes": "298",
        "comments": "6 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "It was wonderful to have u amongst us...students can immensely benefit from knowledge stack SimplAI has",
          "userName": "Dr. REKHA GUPTA",
          "userProfileURL": "https://www.linkedin.com/in/dr-rekha-gupta-80a5a427",
          "dataId": "urn:li:comment:(ugcPost:7286347313466290176,7286615504717234177)"
        },
        {
          "commentText": "Thank you Dr. Rekha Ma'am and Dr. Kavita Ma'am for inviting me to the National AI & Data Sciences conference on the theme of \"AI Driven Innovations\" organised by LBSIM. It's always a pleasure to share knowledge and in the process learn as well.",
          "userName": "Vaishali Sakhuja",
          "userProfileURL": "https://www.linkedin.com/in/vaishali-sakhuja-15b5b417",
          "dataId": "urn:li:comment:(ugcPost:7286347313466290176,7286436587939287040)"
        },
        {
          "commentText": "Pleasure to have u back on campus",
          "userName": "Dr. REKHA GUPTA",
          "userProfileURL": "https://www.linkedin.com/in/dr-rekha-gupta-80a5a427",
          "dataId": "urn:li:comment:(ugcPost:7286347313466290176,7286615266287927296)"
        }
      ],
      "commentAdded": "Great insights shared at the conference! Excited for the upcoming workshops and the innovations theyll inspire. #AI #DataScience #LBSIM"
    },
    {
      "postId": "urn:li:activity:7285119212031750144",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7285119212031750144",
      "url": "https://www.linkedin.com/in/mayer-schwartz?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABHPsCgBGX4ZtqZuX4I6nn_19GJB3gJl4es",
      "name": "Mayer Schwartz\nMayer Schwartz",
      "content": "Here’s the recap video of our most recent Swift Staffing Group company training, where our team came together from all our locations to connect, learn, and grow. It was an incredible day packed with inspiration, collaboration, and a whole lot of energy!\n\n\nHighlights of the Day:\n\nWe were so lucky to havejoin us as a guest speaker. She shared powerful lessons on how to face challenges head-on and left us all feeling motivated and ready to take on anything.\n\ngave an in-depth presentation about our new SWIFT Acquisitions, Business Brokerage Department, sparking exciting conversations about what’s to come.\n\n\nThe day wasn’t just about work—we also enjoyed a lavish lunch (yes, it was as good as it sounds!), and every single team member left with a beautifully wrapped gift as a small way to show our appreciation.\n\n\nWhat’s Next:\nSince this meeting, we’ve already welcomed new recruiters in Chicago, Queens, NY, and Montreal, Canada. And we’re just getting started. 2025 is shaping up to be our biggest year yet, and we can’t wait to see what we accomplish together.\n\nThank you to everyone who’s been part of our journey—our team, clients, and supporters. Your belief in us keeps us going, and we’re so grateful to have you with us as we continue to grow...\n\nHere’s to making waves in 2025 ",
      "reactions": {
        "likes": "60",
        "comments": "21 comments",
        "shares": "0"
      },
      "mediaUrl": "blob:https://www.linkedin.com/e3100b9d-c50c-4edd-a0ef-bf228bf03af9",
      "comments": [
        {
          "commentText": "  ",
          "userName": "Mayer Schwartz",
          "userProfileURL": "https://www.linkedin.com/in/mayer-schwartz",
          "dataId": "urn:li:comment:(ugcPost:7285119108788973568,7285120142244462593)"
        },
        {
          "commentText": "Sounds like an action-packed day Mayer Schwartz",
          "userName": "Eliezer Blatt",
          "userProfileURL": "https://www.linkedin.com/in/eliezer-blatt-366a756a",
          "dataId": "urn:li:comment:(ugcPost:7285119108788973568,7285142147123531776)"
        },
        {
          "commentText": "Eliezer Blatt Probably in March iyh!\n\n\nOur recruiter Yisroel Greenfeld is currently in Israel, you might bump into him there.",
          "userName": "Mayer Schwartz",
          "userProfileURL": "https://www.linkedin.com/in/mayer-schwartz",
          "dataId": "urn:li:comment:(ugcPost:7285119108788973568,7285161575580102658)"
        },
        {
          "commentText": "Mayer Schwartz Maybe.",
          "userName": "Eliezer Blatt",
          "userProfileURL": "https://www.linkedin.com/in/eliezer-blatt-366a756a",
          "dataId": "urn:li:comment:(ugcPost:7285119108788973568,7285258677408718848)"
        }
      ],
      "commentAdded": "What an inspiring day! Excited to see the growth and collaboration that lies ahead for Swift Staffing Group. Heres to an amazing 2025! 🌟🚀"
    },
    {
      "postId": "urn:li:activity:7288936750435966976",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7288936750435966976",
      "url": "https://www.linkedin.com/in/dieterwolf?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABsFh-8B6C7Xleh7DoXRkF9r0IfCKIovw6o",
      "name": "Dieter Wolf 🖥️\nDieter Wolf 🖥️",
      "content": "One question I get asked a lot is, “What does an AI-powered computer actually do?”.\n\nMaybe it’s something you’ve wondered about too? Let me help…\n\nAI, or artificial intelligence, is a computer’s ability to mimic human intelligence by doing things like learning patterns, understanding speech, or even creating content.\n\nAI-powered computers contain special processors and algorithms that make them faster and smarter at handling these tasks.\n\nThink of it like this: Traditional PCs rely on you to tell them exactly what to do, step by step. AI PCs, on the other hand, can learn from how you work and make smart decisions by themselves to help you out. For example, they can summarize reports, draft emails, schedule meetings, or even translate conversations during video calls.\n\nFor businesses, AI PCs are changing the game. They can save you time by handling repetitive tasks, boost productivity with personalized workflows, and even increase security by monitoring for unusual behavior and adapting to new threats.\n\nAnd the best part?\n\nWith AI built into the computer itself, sensitive data stays local, improving privacy and security for your business.\n\nDoes the idea of using AI-powered PCs in your business excite you? Or does it seem like too much tech to handle?",
      "reactions": {
        "likes": "1",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Absolutely! AI-powered PCs can revolutionize efficiency and security. Excited to see how businesses will leverage this tech! 🚀"
    },
    {
      "postId": "urn:li:activity:7288969802746933248",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7288969802746933248",
      "url": "https://www.linkedin.com/in/allisonpons?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAATH4lQBTReNG_owOHVtnIvANHVjGHqx_wA",
      "name": "Allison Pons\nAllison Pons",
      "content": "As someone who has personal friendships with many of our Afghan Allies: this is heartbreaking. We’re a worse nation for this.",
      "reactions": {
        "likes": "0",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "This truly highlights the importance of standing by our allies. We must advocate for compassion and support in times of crisis."
    },
    {
      "postId": "urn:li:activity:7288978055488753665",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7288978055488753665",
      "url": "https://www.linkedin.com/in/romimahajan?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAlYZuQBDEZNbNuEzy5tczl-rn6tmbfIonY",
      "name": "Romi Mahajan\nRomi Mahajan",
      "content": "Purges. Hegseth. No funding for immigrants. Asylum seekers shut down. Aid money cut off (well, not to two countries- guess which ones?), no WHO, no Paris. All in a week. The LONG KNIVES are going to be around for a while. The night and fog.",
      "reactions": {
        "likes": "2",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "This highlights critical issues facing our society. Its essential to advocate for humane policies and support those in need. Lets engage constructively!"
    },
    {
      "postId": "urn:li:activity:7288868461424836608",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7288868461424836608",
      "url": "https://www.linkedin.com/in/peter-vanham-9602ba6?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAEcu9gBXmfRgDYhkX0PnF9dp5V7utN9eAM",
      "name": "Peter Vanham\nPeter Vanham",
      "content": "I had a wonderful week at the World Economic Forum this week. But except in a few places, the spirit of Davos is fading. \n\nThe Davos week is one I look forward to each year, as it is the moment to reconnect with like-minded people and inspire each other on issues like climate action.\n\nBut this year, while I personally had my best experience ever, leading events on nature and business, climate action, and brain health, my overall assessment is that Davos has become Trump’s Davos, and that the spirit of Davos is fading.\n\nI say Davos, because I’ve been part of the WEF for long enough to know this isn’t intentional on behalf of the organization that convenes global business and government leaders here.\n\nAt WEF, the spirit to improve the state of the world remains alive and well.\n\n, the CEO of, told me, for example, that he attended a WEF session with business leaders and Volodymyr Zelenskyy, to discuss how business could help reconstruct Ukraine.\n\nHe also went to a meeting of the CEO Climate Alliance, where dozens of CEOs recommitted their companies to Paris aligned climate targets, just as so many US businesses and the new US administration are pulling out.\n\nAnd some side-events remain as trailblazing as ever, bringing stakeholders together on issues from nature to health. That was the Davos bubble I was and am part of, and that energizes me so much.\n\nBut as a journalist, I did venture outside of that bubble too, and what I saw there was sobering. The mainstream of Davos has shifted away from the stakeholder origin of WEF.\n\nI met with dozens of mostly US business leaders who said they were in Davos for one reason, and one reason only: to do business.\n\nLongtime skeptics and critics of Davos will probably shrug at this notion. It’s what Davos has been known for for many years — it’s a place for the global business elite to meet each other and enrich themselves, they would say.\n\nBut that’s not how I saw Davos over the years. For attending business leaders, the split was often something like 80-20: 80% business meetings, 20% working on WEF agenda.\n\nNow, however, even that 20% is fast disappearing, at least for US participants. Their political climate is such that stakeholder capitalism, sustainability, and globalism are absolute faux-pas. The business of business is business, once again.\n\nIn some discussions I led, when ideas around global collaboration, nature, or social responsibility were expressed, the general reaction was one of utter disinterest, if not dismissal.\n\nAnd that, I believe, is because the American side of Davos has overnight become Trump’s Davos. The singular focus of many US business leaders is to increase their profits and mind their own business. Working on a global agenda, or with other stakeholders, is a distraction, and a risk.\n\nI’m as energized as ever returning from Davos. But the idea that Davos is a place for stakeholderism and globalism, is now minoritarian. The Davos spirit is fading.",
      "reactions": {
        "likes": "210\nLuigi LENGUITO and 209 others",
        "comments": "45 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "It was my first \n#Davos week, and I am no white-badge holder.\n\nI return with a positive enthusiasm as key subjects are talked over in dept bybpeople that care about them, I did see a couple \"topic-washing\" (AI, ESG, Quantum, etc) event... And my suspect the hype cycle must have been strong in the past. I do look forward returning 2026, and believe\nhas outgrown",
          "userName": "Luigi LENGUITO",
          "userProfileURL": "https://www.linkedin.com/in/llenguito",
          "dataId": "urn:li:comment:(activity:7288572864155320320,7288868450716778496)"
        }
      ],
      "commentAdded": "Insightful take on the evolving dynamics at Davos! Its crucial to reignite the spirit of collaboration and global responsibility. Lets refocus on stakeholderism!"
    },
    {
      "postId": "urn:li:activity:7287959315221528576",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287959315221528576",
      "url": "https://www.linkedin.com/in/samhilsman?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAA7jHLEBLVPtnOolCIDKRY4DfAcFGUpph4A",
      "name": "Sam Hilsman\nSam Hilsman",
      "content": "",
      "reactions": {
        "likes": "1",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": "blob:https://www.linkedin.com/20e64142-5d35-4b7e-b891-7d25a2961495",
      "comments": []
    },
    {
      "postId": "urn:li:activity:7288259135723212803",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7288259135723212803",
      "url": "https://www.linkedin.com/in/manujaggarwal?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAMY_wBiA538UlzNcv3ls30NXdjZZ2cT2c",
      "name": "Manuj Aggarwal\nManuj Aggarwal",
      "content": null,
      "reactions": {
        "likes": "8",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": "blob:https://www.linkedin.com/72ce81aa-d24d-4fe7-b7a3-6c6296e8d12c",
      "comments": []
    },
    {
      "postId": "urn:li:activity:7288180062321860608",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7288180062321860608",
      "url": "https://www.linkedin.com/in/samuel-szuchan?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADJxmOcB9ewkNVvLueDDab0UxS19_vB0-H0",
      "name": "Sam Szuchan\nSam Szuchan",
      "content": "If you’re having issues on LinkedIn…\n\n…here’s how to fix them in 10 minutes (or less):\n\n1. Low impressions?\n\nPost more quality content.\n\n2. Low followers?\n\nProve your credibility.\n\n3. Low conversions\n\nDirect attention to a high-converting landing page.\n\n4. Low profile views\n\nOptimize your profile for search (and post more content)\n\n5. Low shares\n\nMake your value as clear and concise as possible.\n\nGet the full breakdown here:\n\n(h/t)",
      "reactions": {
        "likes": "623",
        "comments": "318 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Great tips! In addition to these, here are a few more quick fixes for LinkedIn:\n\nLow Engagement:\nEngage with others’ posts by liking, commenting, and sharing. Genuine interaction fosters reciprocity and increases visibility.\n\nUnclear Branding:\nUpdate your headline and summary to reflect what you do and how you provide value. Ensure your profile picture and background align with your brand.\n\nLack of Niche Content:\nStart focusing on your niche and creating content around it. This positions you as an expert, making it easier to connect with your target audience.\n\nInconsistent Posting:\nCreate a posting schedule and stick to it. Consistency is key to staying relevant and visible to your audience.",
          "userName": "Ishita K",
          "userProfileURL": "https://www.linkedin.com/in/marketerishita",
          "dataId": "urn:li:comment:(ugcPost:7288180060509892608,7288181826580267008)"
        },
        {
          "commentText": "Good points!",
          "userName": "Sam Szuchan",
          "userProfileURL": "https://www.linkedin.com/in/samuel-szuchan",
          "dataId": "urn:li:comment:(ugcPost:7288180060509892608,7288182884287336448)"
        },
        {
          "commentText": "Sometimes, less is more. Emphasize clarity over complexity. Especially in content! ",
          "userName": "Eden Bitton",
          "userProfileURL": "https://www.linkedin.com/in/eden-bitton",
          "dataId": "urn:li:comment:(ugcPost:7288180060509892608,7288183604965249026)"
        },
        {
          "commentText": "Focusing on 100% value is what changes the game!",
          "userName": "Jake Ward",
          "userProfileURL": "https://www.linkedin.com/in/jakezward",
          "dataId": "urn:li:comment:(ugcPost:7288180060509892608,7288181992444039171)"
        },
        {
          "commentText": "Every time, Jake.",
          "userName": "Sam Szuchan",
          "userProfileURL": "https://www.linkedin.com/in/samuel-szuchan",
          "dataId": "urn:li:comment:(ugcPost:7288180060509892608,7288182691429048322)"
        }
      ],
      "commentAdded": "Great tips! Optimizing our profiles is key. Consistency in quality content really makes a difference. Thanks for sharing! 🚀"
    },
    {
      "postId": "urn:li:activity:7288685699141144577",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7288685699141144577",
      "url": "https://www.linkedin.com/in/sam-blond-791026b?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAH1_t0BJzCtpQfod7NBgqM0Fy1rwhSmLM0",
      "name": "Sam Blond\nSam Blond",
      "content": "It’s hard to measure, but the roi on a 24 hour team offsite is under appreciated. \n\nEveryone comes back fired up about the business and communicating better than ever. The productivity loss is made up for within a couple days.",
      "reactions": {
        "likes": "268\nYash Chowdhury and 267 others",
        "comments": "20 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Why only 24 hrs?",
          "userName": "Milana Martinovic",
          "userProfileURL": "https://www.linkedin.com/in/milanam",
          "dataId": "urn:li:comment:(activity:7288621463463419904,7288632051405148160)"
        },
        {
          "commentText": "Diminishing returns any longer than that. Can do a lot in 24 hours. ",
          "userName": "Sam Blond",
          "userProfileURL": "https://www.linkedin.com/in/sam-blond-791026b",
          "dataId": "urn:li:comment:(activity:7288621463463419904,7288692153235472385)"
        },
        {
          "commentText": "Sam Blond you can definitely do a lot in 24 hrs, but not everything needs to be \"optimized\". The best, most creative serendipitous moments of bonding, new ideas and progress happen in the downtime. The in-between moments of casually striking a conversation with whiever happens to be walking/sitting next to you. Intentionally carving time for those unstructured bits is crucial, which is why you need more time",
          "userName": "Milana Martinovic",
          "userProfileURL": "https://www.linkedin.com/in/milanam",
          "dataId": "urn:li:comment:(activity:7288621463463419904,7288854713062625281)"
        },
        {
          "commentText": "At what scale do you recommend doing these ?",
          "userName": "Devang Agrawal",
          "userProfileURL": "https://www.linkedin.com/in/devangagrawal",
          "dataId": "urn:li:comment:(activity:7288621463463419904,7288621961943957505)"
        },
        {
          "commentText": "Early. In the early days (first 1-2 years) I think quarterly is the right cadence. As the company grows the operational overhead becomes larger so 1-2 full company + a couple team only each year seems like the right amount.",
          "userName": "Sam Blond",
          "userProfileURL": "https://www.linkedin.com/in/sam-blond-791026b",
          "dataId": "urn:li:comment:(activity:7288621463463419904,7288623086717841409)"
        }
      ],
      "commentAdded": "Absolutely! A 24-hour offsite can reignite passion and collaboration, proving that investing in your team pays off in spades! 🌟🚀"
    },
    {
      "postId": "urn:li:activity:7288936423842295808",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7288936423842295808",
      "url": "https://www.linkedin.com/in/anil-kumar-valaboju-96a70b281?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAESgc6IBE0tKJSJ-nIrO4IaYEkJ3FUp8PrI",
      "name": "Anil Kumar Valaboju\nAnil Kumar Valaboju",
      "content": "Attending the Microsoft Evolve event organized by the E-DAM team was an incredibly enriching experience. I want to extend my deepest gratitude to the entire E-DAM team for orchestrating such a dynamic and insightful event.\n\nA special thank you to hosts like Bernard Bhutia, T. Bharath, and the entire team who led compelling sessions on the art of debate. Their engaging presentations not only clarified complex concepts but also ignited a passion for critical thinking and effective communication within me. The interactive discussions challenged us to consider diverse perspectives and sharpen our reasoning skills.\n\nI was also fortunate to attend an enlightening session on Web3 and its transformative potential, led by the esteemed expert fondly known as \"Blockchain Sir.\" His deep dive into blockchain technology and the future of decentralized systems opened my eyes to the limitless possibilities that Web3 holds for various industries. Understanding the importance of this next generation of the internet has inspired me to explore its applications further.\n\nEvery concept shared during the event was thoughtfully presented, making even the most complex topics accessible and engaging. The hosts' dedication to education and their willingness to share their expertise made this event stand out as a highlight of my professional journey.\n\nThank you once again to the E-DAM team, Bernard Bhutia, T. Bharath and team and all the phenomenal hosts for their time, effort, and passion. I'm excited to apply the knowledge gained and continue learning about these fascinating subjects. Looking forward to future events and collaborations!",
      "reactions": {
        "likes": "21\nGrandhi Praveen and 20 others",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "What an inspiring experience! Kudos to the E-DAM team and speakers for elevating our understanding of debate and Web3. Excited for the future!"
    },
    {
      "postId": "urn:li:activity:7288846143982104576",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7288846143982104576",
      "url": "https://www.linkedin.com/in/dr-charif-noureddine-8474a0273?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAELQTrcBokOVArS9Xi4M4v8GirZU0lHPsvM",
      "name": "Dr. Charif Noureddine\nDr. Charif Noureddine",
      "content": "LinkedIn Digital Identity Card: Passport to Globalization and Global Travel\n\nMarshall McLuhan's Quote\n\"The world has become a global village, and digital identity is the window to this village.\"\n\nQuote from Imam Ali ibn Abi Talib(may Allah be pleased with him)\"Whoever looks into the consequences of matters, will know how the beginning should be.\"\n\nIn a world witnessing radical and accelerating transformations across all levels, global economic files such as energy and life technologies, semiconductors, digital trade, artificial intelligence, space industry, rare minerals, e-commerce, internet governance, cybersecurity,and the green economy have become fierce competition pillars that define the contours of the future.These files are not just economic elements;they are strategic cornerstones that control geopolitical balances and redraw the maps of new economic influence.\n\nFrom here, the importance of deeply understanding these files emerges as a necessity to ensure leadership in a world that recognizes only those who possess the tools, data,and vision. Those who understand the transformations in the light of the digital economy revolution will find themselves at the forefront of steering the future.\n\nGlobal Economy: Competition Without Boundaries\nBuilding a digital identity with a global dimension has become an indispensable necessity for individuals and organizations seeking leadership. This identity is no longer just a reflection of skills and experiences;it has become a benchmark for measuring an individual's readiness to integrate into global influence networks.\n\nLinkedIn, as a professional digital platform, embodies the passport to this new world.Thanks to its tools that combine professionalism, innovation, and continuous education, it enables users to present themselves with a consistent identity that transcends cultural and geographical boundaries. This digital identity is not just a profile; it is a system that reflects the ability to participate in solving global challenges and building professional networks that open up unlimited horizons.\n\nCreating a digital identity according to global standards requires professionalism, transparency, and continuous skill development. LinkedIn is not just a platform for communication; it is a global laboratory that measures the impact of each individual and their ability to leave a mark on the international stage. In an era where power dynamics are shaped through digitization, the digital identity remains the key that opens doors to opportunities and ensures a place at the forefront of the future.\n\nTowards Global Standards for Digital Identity through Criteria,Transparency, Specialization,Sustainability,Impact\n\nLet us establish an identity that makes a global difference, reflecting our values and positioning us at the forefront of the new human movement.\n\nDr. Charif Noureddine\nIn a world where borders melt, the individual becomes the empire, and their digital presence is their throne.",
      "reactions": {
        "likes": "107\nNerea Arregui Exposito and 106 others",
        "comments": "58 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "I fully align with the call for a globally relevant digital identity. LinkedIn indeed serves as a vital bridge for such transformations, allowing us to amplify impact and address global challenges collaboratively.",
          "userName": "Nerea Arregui Exposito",
          "userProfileURL": "https://www.linkedin.com/in/nereaarreguiqa",
          "dataId": "urn:li:comment:(activity:7288797004493651968,7288846235283685377)"
        },
        {
          "commentText": "Nerea Arregui Exposito thank you so much for sharing my dear",
          "userName": "Dr. Charif Noureddine",
          "userProfileURL": "https://www.linkedin.com/in/dr-charif-noureddine-8474a0273",
          "dataId": "urn:li:comment:(activity:7288797004493651968,7288846620052324352)"
        },
        {
          "commentText": "Dr. Charif Noureddine Building a global digital identity is no longer optional; it’s essential for anyone looking to lead in today’s interconnected world. \nLinkedIn is the perfect platform to showcase your skills and make an impact on a global scale.",
          "userName": "Syeda Naveen Zehra",
          "userProfileURL": "https://www.linkedin.com/in/syeda-naveen-zehra",
          "dataId": "urn:li:comment:(activity:7288797004493651968,7288965193114472449)"
        },
        {
          "commentText": "Syeda Naveen Zehra thank you so much for sharing my dear",
          "userName": "Dr. Charif Noureddine",
          "userProfileURL": "https://www.linkedin.com/in/dr-charif-noureddine-8474a0273",
          "dataId": "urn:li:comment:(activity:7288797004493651968,7288966871456907265)"
        },
        {
          "commentText": "Dr. Charif Noureddine You're Welcome Sir.",
          "userName": "Syeda Naveen Zehra",
          "userProfileURL": "https://www.linkedin.com/in/syeda-naveen-zehra",
          "dataId": "urn:li:comment:(activity:7288797004493651968,7288967966023462912)"
        }
      ],
      "commentAdded": "Powerful insights, Dr. Noureddine! A strong digital identity is indeed essential for thriving in todays interconnected world. Lets embrace this transformation!"
    },
    {
      "postId": "urn:li:activity:7288541069917503488",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7288541069917503488",
      "url": "https://www.linkedin.com/in/clairemdavis?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAFCGXoB6nWioiigFFst9Mz-mJ5Ku6Q5o1Q",
      "name": "✒️Claire M. Davis🖋️\n✒️Claire M. Davis🖋️",
      "content": "POV: Someone you coached 8 days ago asks for 8 min.\n\nbc he used your networking method and \n\nlanded an interview with his target company\n\nin 8 DAYS\n\n... and from an outside industry.\n\n\n\n\nI know applying online is all the rage\n\nAnd that 'easy apply' button seems sexy\n\nBUT how about we start minimizing applying\n\nto overcrowded job boards and start maximizing\n\nour time on networking and building industry relationships.\n\n\n\nit works.\n\npromise.\n\n5X layoff survivors don't lie.\n\nJust sayin'. ️\n\n\n\nAnd if you're STILL not sure,\nask someone in medical sales\nhow they found their last few jobs.\n\n\n\nYou'll know it when you hear:\n\n\"well this gal I knew from...\"\n\nor\n\n\"so, I had this friend from...\"\n\nor\n\n\"my old boss...\"\n\n____________________\n\nTry it out \n\nIn fact, how about YOU?\n\nHow did YOU find your favorite job?",
      "reactions": {
        "likes": "58",
        "comments": "39 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Absolutely! Networking can open doors that job boards can’t. Love hearing success stories like this! How did networking help you land your role?"
    },
    {
      "postId": "urn:li:activity:7288946191977852928",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7288946191977852928",
      "url": "https://www.linkedin.com/in/navrina?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABA4-sB0WRWqvILHdATiM7gCmC4nPCGpCs",
      "name": "Navrina Singh\nNavrina Singh",
      "content": "The Age of AI: Themes from the World Economic Forum Davos 2025\n\n1️⃣ The Rise of AI Agents\n\n“Today’s CEOs are the last to manage an all-human workforce.” The excitement around AI agents was palpable, with OpenAI’s Operator leading the charge. While these systems remain in a phase of experimentation, the potential is clear—AI agents are poised to transform workflows, enhance decision-making, and redefine industries. This isn’t just a moment of hype; it’s the dawn of a new operational paradigm.\n\n2️⃣ US vs. China: The AI Arms Race\n\nChina’s deployment of millions of super-smart AI agents sparked profound discussions on how AI could reshape power dynamics. “The power of dictatorships has traditionally been constrained by human limitations. AI removes that constraint.”\n\nAt the same time, the rise of open-source AI models like DeepSeek R1 is challenging the dominance of proprietary systems. With its impressive performance and low cost, DeepSeek R1 embodies the promise of democratized AI—but also raises questions of trust. Can businesses and governments rely on open-source AI for critical operations? This tension highlights the growing geopolitical stakes of AI innovation.\n\n3️⃣ Human Evolution and the Age of FOBO\n\nFOBO—Fear of Becoming Obsolete—was a recurring theme at Davos. “Tools are becoming better than humans at almost every task.”\n\nThe rapid evolution of AI is forcing humanity to rethink not just work but purpose & identity. How do we adapt to a future where AI outpaces human cognitive abilities? Optimists see this as an unparalleled opportunity—those who embrace change and prioritize AI literacy will lead in the age of intelligence.\n\n4️⃣ AI Governance: The Key to Unlocking AI’s Potential\n\nGovernance was a central focus this year, and for good reason: without it, the full promise of AI cannot be realized. Trust is the foundation of adoption, and governance frameworks are critical to ensuring AI systems like DeepSeek R1—open-source yet powerful—are reliable, secure, and aligned with societal values.\n\nLeaders at Davos recognized that governance is an enabler of innovation.\n\n5️⃣ AI Investment Amid Uncertainty\n\nDespite economic volatility, AI investment continues to accelerate. The excitement around AI agents, powerful open-source models, and generative capabilities is driving a renewed wave of optimism.\nHowever, overlapping hype cycles demand careful navigation. Investors and businesses must focus on applications that align with governance and trust principles to scale AI responsibly.\n\nThanks to all the AI tools who joined me at Davos - helped take notes, summarize key themes , follow up fast & efficiently on all my to-dos  \n\nDavos 2025 made one thing clear: AI’s future depends on our ability to evolve alongside it—responsibly and with Governance and trust as our foundation. cc",
      "reactions": {
        "likes": "67\nSarah Lloyd Favaro and 66 others",
        "comments": "5 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "AI Agents “a new operational paradigm”. Indeed. \n\n#AIAgents that are productive and align with values will be built upon foundational governance guidelines.",
          "userName": "Michael N.",
          "userProfileURL": "https://www.linkedin.com/in/iotmichaelnovak",
          "dataId": "urn:li:comment:(ugcPost:7288945170945884160,7288957527621337088)"
        },
        {
          "commentText": "Curious to hear all about the AI tools you found useful during this event. The market is flooded already!",
          "userName": "Sonal Mane",
          "userProfileURL": "https://www.linkedin.com/in/sonalmane",
          "dataId": "urn:li:comment:(ugcPost:7288945170945884160,7288974031762997248)"
        }
      ],
      "commentAdded": "Insightful themes from Davos! Embracing AIs potential responsibly will shape our future—exciting times ahead for innovation and governance!"
    },
    {
      "postId": "urn:li:activity:7288549976282939392",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7288549976282939392",
      "url": "https://www.linkedin.com/in/michaelocean?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABRkVVcBdJXrbHnrLNPe5NG3L1FNnS_LDdw",
      "name": "Michael Ocean\nMichael Ocean",
      "content": "Would you buy a Ferrari from a bicycle seller?\n\n\n(Sales Enablement Manager at MATRIXX Software, ex-BlackBerry) is an expert in preparing enterprise sellers through high-touch onboarding. He believes the secret is extreme personalization for each seller like every high-value client.\n\n\nThink about it:\n\n- Your solution costs millions\n- Your buyers are C-suite experts\n- Yet you onboard reps with \"Here's a Dropbox link, see you Monday\"?\n\n\nAs Neman puts it: \"It's my responsibility to be absolutely sure that they're not only provided with the resources they need, but they can use them, understand them, and apply them when necessary.\"\n\n\nWhen your customers invest at Ferrari levels, your onboarding should reflect the same premium standard. Excellence starts with how you prepare your team.\n\n\nFull conversation in the comments ",
      "reactions": {
        "likes": "16",
        "comments": "1 comment",
        "shares": "0"
      },
      "mediaUrl": "blob:https://www.linkedin.com/73cb4efc-bc3a-4063-922f-a3489dbed5ae",
      "comments": [
        {
          "commentText": "Full episode here: https://youtu.be/_bam1tis93Y ",
          "userName": "Michael Ocean",
          "userProfileURL": "https://www.linkedin.com/in/michaelocean",
          "dataId": "urn:li:comment:(ugcPost:7286620716295159808,7288549972239646720)"
        }
      ],
      "commentAdded": "Absolutely agree! Tailored onboarding is essential. Just as you wouldnt buy luxury without the right expertise, neither should your reps be underprepared."
    },
    {
      "postId": "urn:li:activity:7288954182990999552",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7288954182990999552",
      "url": "https://www.linkedin.com/groups/762547?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A762547-7288954182147944448",
      "name": "Big Data 🟥 Data Science | Machine Learning | Deep Learning | Artificial Intelligence\nBig Data 🟥 Data Science | Machine Learning | Deep Learning | Artificial Intelligence",
      "content": "20 Must-Have Project Management Excel Templates and Spreadsheets\nGet a Complete Set of Project Management Templates & Documents in Excel at: https://lnkd.in/gHRdprpi A person who never failed is a person who never tried anything new.",
      "reactions": {
        "likes": "2",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Excited to explore these templates! A great reminder that innovation often comes from trial and error. Lets embrace the learning journey!"
    },
    {
      "postId": "urn:li:activity:7288909092130021378",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7288909092130021378",
      "url": "https://www.linkedin.com/in/houseofbricks?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAA-MkMBNOorFGtIDG0boxkwxMypXZhfUgk",
      "name": "Michael Kainatsky\nMichael Kainatsky",
      "content": "I write content that converts, but it’s not what most think it is. \n\n\nEvery day I write what comes to mind.\n\nThere’s no planning or strategy, hopefully that’s pretty clear.\n\nIt seems many people expect content about what you do for a living.\n\nThe most common question I’m asked is “what do you even do?”\n\nIs that what this platform has become?\n\nOur experience and background is right there if you scroll.\n\nBut people seem to stop at posts but don’t explore further.\n\nYou know how I know this?\n\nLook at your profile views relative to other metrics.\n\nMy posts have reached 1m members in 2025 already.\n\nBut the profile views, about 3k in the same period.\n\nAre you here for the A.I. content factory or the people??\n\nI’m here for the relationships, the people behind the posts.\n\nI write content that converts amazing people into relationships\n\nAnd care for nothing else.\n\nThe close friends I have made like\n,,,,.\n\nThey don’t come from sales strategy.\n\nContent is meant to share a piece of ourselves with the world.\n\nNo motives or scheming to get something for ourselves.\n\nNot a fabricated A.I. sales driven expert wannabe version of ourselves.\n\nThe kind that lets people see who we are, and get curious to find out more.\n\nI did not have 1,000+ sales calls in 2024. . .\n\nthey were human to human conversations.\n\nAnd this year, I will continue to search for my “Ideal Human Profile™.\n\nYours truthfully,",
      "reactions": {
        "likes": "50",
        "comments": "42 comments",
        "shares": "0"
      },
      "mediaUrl": "blob:https://www.linkedin.com/32267f00-2996-4d78-aed4-c6da12f849d4",
      "comments": [
        {
          "commentText": "I am so glad you wrote this, Michael Kainatsky. My content is written for people who think a certain way or want to learn something that I know I can show them easily. It is about meaningful conversations, learning from each other, and building relationships. \n\nAnd- i have a system for 8-figure leads and 7-figure sales that I am selling this week for a 50% discount to the first 3 people who sign up. Oh, and if you sign up within 24 hours, you get a portion of the San Antonio Riverwalk for free!!  ",
          "userName": "Dr. Kruti Lehenbauer",
          "userProfileURL": "https://www.linkedin.com/in/kruti-lehenbauer",
          "dataId": "urn:li:comment:(ugcPost:7288909072282574849,7288919202806083585)"
        },
        {
          "commentText": "Dr. Kruti I think i'd really like a piece of the San Antonio Riverwalk!",
          "userName": "Michael Kainatsky",
          "userProfileURL": "https://www.linkedin.com/in/houseofbricks",
          "dataId": "urn:li:comment:(ugcPost:7288909072282574849,7288935794637963265)"
        },
        {
          "commentText": "You had me at hello. ",
          "userName": "Adam House Sr.",
          "userProfileURL": "https://www.linkedin.com/in/adamhousesr",
          "dataId": "urn:li:comment:(ugcPost:7288909072282574849,7288911779106103297)"
        },
        {
          "commentText": "and with that, so has your profile pic to one with a smile.",
          "userName": "Michael Kainatsky",
          "userProfileURL": "https://www.linkedin.com/in/houseofbricks",
          "dataId": "urn:li:comment:(ugcPost:7288909072282574849,7288979854731935744)"
        }
      ],
      "commentAdded": "Love this perspective! It’s all about genuine connections over sales tactics. Here’s to building real relationships! 🌟"
    },
    {
      "postId": "urn:li:activity:7288972957639417856",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7288972957639417856",
      "url": "https://www.linkedin.com/in/jnando82?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAACfbcYB5KtgXpUrgMeAwPG8MEfAiRXX3wU",
      "name": "Fernando Perez\nFernando Perez",
      "content": "𝗖𝗼𝗻𝘁𝗲𝗻𝘁 𝗠𝗮𝗱𝗲 𝗘𝗮𝘀𝘆 𝗙𝗼𝗿 𝗖𝗼𝗮𝗰𝗵𝗲𝘀: \n \nUse your podcast episodes, blog posts, and even recorded coaching content (with customer consent, of course) to repurpose it into a variety of engaging social media formats.\n\nNo need to break your head about what to post when you can use what you have - multiple times. =)\n\nEXAMPLE:\n\n𝗥𝗲𝗽𝘂𝗿𝗽𝗼𝘀𝗲 𝗖𝗼𝗻𝘁𝗲𝗻𝘁:\n\nCustomer testimonial (turns into) >> article >> clips >> quote images >> carousel >> Twitter serial post >> ...\n\nLet us know what works for you!\n\n▸",
      "reactions": {
        "likes": "0",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Great tips on content repurposing! Its a smart way to maximize resources and engage audiences in diverse formats. Keep the ideas coming! 🌟"
    },
    {
      "postId": "urn:li:activity:7288926108547260416",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7288926108547260416",
      "url": "https://www.linkedin.com/in/sahilkataria?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAeUmF8BKZv-laaK4cpNPbgYOMgv_jRnUeM",
      "name": "Sahil Kataria\nSahil Kataria",
      "content": "In today’s fast-paced business landscape, \noperational efficiency is crucial for staying \nahead of the competition. \n\nWith IoT, businesses can:\n\n-Optimize processes\n-Reduce costs\n-Boost real-time performance\n\nFrom predictive maintenance to energy\noptimization, IoT is reshaping how industries\noperate across the globe.\n\nBut is it truly the key to improving operational\nefficiency, or are there other factors at play?\n\nWe want to hear your thoughts!\n\nVote below and share your insights:\n\nLet’s discuss how IoT is driving efficiency in your\nindustry:",
      "reactions": {
        "likes": "0",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Absolutely agree! IoT is revolutionizing efficiency. Curious to hear how others are leveraging it in their industries! #Innovation #IoT"
    },
    {
      "postId": "urn:li:activity:7287813131475599360",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287813131475599360",
      "url": "https://www.linkedin.com/in/sandeep-dinodiya?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAjV68YBDGiWNlfy0lNRRRpHXJVCZj8e8eU",
      "name": "Sandeep Dinodiya\nSandeep Dinodiya",
      "content": "Let’s explore the key challenges and concerns BFSIs face in adopting AI, with a primary focus on ensuring security as the top priority.",
      "reactions": {
        "likes": "21",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Great topic! Navigating security in AI adoption is crucial for BFSIs. What strategies do you think could enhance trust in these systems?"
    },
    {
      "postId": "urn:li:activity:7287233826815123456",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287233826815123456",
      "url": "https://www.linkedin.com/in/jakedunlap?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAENCicB0qY59ybik0DUN4FzM8lk0Rq6bjk",
      "name": "Jake Dunlap\nJake Dunlap",
      "content": "Best advice I’ve heard this year sitting in the airport eavesdropping on two sellers: \n\n“If you just reschedule an internal meeting like 1-2 times…it never happens”\n\n100% pure gold\n\nProof that 50+% of meetings don’t need to happen\n\n️ ",
      "reactions": {
        "likes": "64",
        "comments": "11 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "When did leadership and building a team become about 2-3 meetings a week? Handle your business people.",
          "userName": "Jake Dunlap",
          "userProfileURL": "https://www.linkedin.com/in/jakedunlap",
          "dataId": "urn:li:comment:(activity:7287233826815123456,7287237318397116416)"
        },
        {
          "commentText": " A lot of meetings just aren't necessary",
          "userName": "Segun Duyile",
          "userProfileURL": "https://www.linkedin.com/in/segun-duyile",
          "dataId": "urn:li:comment:(activity:7287233826815123456,7288902617080954880)"
        }
      ],
      "commentAdded": "Such a valuable insight! Streamlining meetings can boost productivity and focus on what truly matters. Thanks for sharing! 🚀"
    },
    {
      "postId": "urn:li:activity:7288851809027121152",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7288851809027121152",
      "url": "https://www.linkedin.com/in/svetlanamakarova?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAANVVjQBUIQREd4wVtuJIUrRHVR-DPEIwYA",
      "name": "Svetlana Makarova, MBA\nSvetlana Makarova, MBA",
      "content": "One problem I commonly see with AI:\n\nStarting with complex use cases and underestimating the effort it takes to see quality results.\n\nWhen building AI solutions, it’s easy to fall into this trap:\n\n→ Tackling multiple use cases\n→ Using diverse datasets\n→ Optimizing for different roles\n\nThis results in underwhelming results. Output quality isn't there. Pilots stall or stop, even if the use case seems feasible for AI to tackle.\n\nHere’s the advice I gave a team recently:\n\nOptimize for quality, not scale (at least at first).\n\nHere’s the approach:\n1️⃣ Start with a smaller scope to validate the solution.\n2️⃣ Focus on output quality—ensure it works well before expanding.\n3️⃣ Once you have clear results, scale gradually.\n\nThis means that you'll need to compromise. Instead of trying to achieve all possible use cases that AI \"could\" achieve. Optimize for a specific use case (i.e. data source or data type), then expand from there.\n\nThe key with AI isn’t to boil the ocean.\n\nDon’t assume because “it’s AI,” it will:\n・Work through the complexity on its own\n・Understand context without guidance\n・Handle large and diverse data sets without optimizations\n\nStart small.\nOptimize for quality.\nScale gradually.\n\n️ Repost.\nFollow for more.",
      "reactions": {
        "likes": "31\nNerea Arregui Exposito and 30 others",
        "comments": "13 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Your point about starting small and optimizing for quality resonates strongly with my experience in AI adoption. Focusing on solving specific challenges, rather than tackling everything at once, ensures impactful outcomes and smoother scalability. AI thrives when it augments existing processes with clear purpose and precision.",
          "userName": "Nerea Arregui Exposito",
          "userProfileURL": "https://www.linkedin.com/in/nereaarreguiqa",
          "dataId": "urn:li:comment:(activity:7288216003266646017,7288851789599158272)"
        }
      ],
      "commentAdded": "Great insights! Focusing on quality over scale is crucial for successful AI implementation. Starting small can lead to more impactful results!"
    }
  ],
  "errors": [
    {
      "postId": "urn:li:activity:7287404256091856897",
      "url": "https://www.linkedin.com/in/nereaarreguiqa?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAEHgTbsBKHMzatlhgCsnqQX4ohcNYmxBmz8",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7288300128967274498",
      "url": "https://www.linkedin.com/in/jasonbramble-revcarto?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABQ_gTEBQxoseSKiiYMeftV9QrMfHofdIJ8",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7288716357662085120",
      "url": "https://www.linkedin.com/in/rpessar?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAwcjW4BvCJUAK0fWiSBca-E80oRWsQF_oI",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7288195821651550208",
      "url": "https://www.linkedin.com/in/kunalpandya?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAACL0_MB79gEt9NILd9av4JZlHjtcFSiKmo",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7288950556356710401",
      "url": "https://www.linkedin.com/in/johnkraski?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABkbm-0Be4xxSTDslQoX9c9qcRoExoNAGWk",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287620526062157826",
      "url": "https://www.linkedin.com/in/reubenholdaway?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACCPcCcBi8oFaoQlXwrvciQQjsNhjXHTo3s",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7288982796927164417",
      "url": "https://www.linkedin.com/in/leilahormozi?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABZU1dIBQs0EayRru0YoZ-Ro_0mXO5dZTC4",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7288727465164738561",
      "url": "https://www.linkedin.com/in/hwilson3?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABkQ4eQBVV61aa6L6wnZtFX7vckEmZjEXoI",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7288624104377597952",
      "url": "https://www.linkedin.com/in/mkoesterer?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAJ9iiAB5bh6NL9kMz59hr5JCHi31nuQIM8",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7288679359173799936",
      "url": "https://www.linkedin.com/in/pspielmann?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAOQ7vQBNR4ikJ_-2CAg0Qzf-1XpVrCX8gM",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7288989401462775808",
      "url": "https://www.linkedin.com/in/thomassjohnston?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAChCJsBrEidBhbt9Yg4O33bsyZ7Nuze4Y0",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7288569634205638656",
      "url": "https://www.linkedin.com/in/leslievenetz?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADPju4B9I-KSyVAlH2xAmiN72f5wsayOtM",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287439346054430720",
      "url": "https://www.linkedin.com/in/emmiefaust?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABQG94BQKmqEq872V85cvMOJzJ5W3arrYY",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7288976861596987393",
      "url": "https://www.linkedin.com/in/curtismay?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAACOW7YBirTXZs5yzFIG1rLENx49lU4WhIc",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7288860719498833920",
      "url": "https://www.linkedin.com/in/ayush-kaushal-1a147b228?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADkFskkBfudZl9ImS2SRfPxkexpaVyZf2ks",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7288603481341407232",
      "url": "https://www.linkedin.com/in/ukstopsalestrainer1?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABonWnABFmam2K6LQCm7UvKhDCGJCr8foDI",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7288211662740865025",
      "url": "https://www.linkedin.com/in/nona-prather-b5663010a?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABuAYXIBi7sSvrYjNrRn52Kia7vOCxjVrRM",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287237130307665921",
      "url": "https://www.linkedin.com/in/rickconlowservantleadership?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAPUxFwB6p1p6ESvdwgOkdRMuNdW3KDrJTU",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7288651836377481216",
      "url": "https://www.linkedin.com/company/keithsconiers/posts",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7288978320396890112",
      "url": "https://www.linkedin.com/in/romimahajan?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAlYZuQBDEZNbNuEzy5tczl-rn6tmbfIonY",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287820625912463360",
      "url": "https://www.linkedin.com/in/henrylovecrypto?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAnt7msB9Inngljm39OC1beppZTooRP3nyk",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7288939802517803008",
      "url": "https://www.linkedin.com/in/dennisolympios?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAl9PhoBuXY1_3zEBPUm0arqDPI0o-8SKPQ",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287407569558466564",
      "url": "https://www.linkedin.com/in/dupeburgess?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABvuM0kBMBiyaFKVbDKsiSYEWwwf2knjHBQ",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7284587160735809536",
      "url": "https://www.linkedin.com/in/davidlorango?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADIXfsBjASfnTRxRgIxkqXGR-KsDN_c3wk",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7288904723439443968",
      "url": "https://www.linkedin.com/in/jondavidleslie?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABu-s4B50TpraNCLboiGWes3m1D2rP1sHk",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7288962297010475008",
      "url": "https://www.linkedin.com/company/coforge-tech/posts",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7288573251822268416",
      "url": "https://www.linkedin.com/in/coleharmonson?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAEYcRcBh_ETnKo-_b2wZNbgUvPD4JkmcvQ",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7288991017054154752",
      "url": "https://www.linkedin.com/in/vanessaloder?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAEkEdoBTynSM-XF6bZLUpct-8zCEides3c",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287009532680065024",
      "url": "https://www.linkedin.com/in/kyadav?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAJrndEBwiBDP9UY70kcWlpQUAzEUsJxyRA",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7288949988045324288",
      "url": "https://www.linkedin.com/groups/1850284?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A1850284-7288949987034492929",
      "errors": [
        "Failed to fetch content.",
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287185282091696130",
      "url": "https://www.linkedin.com/in/saaquib-dawoodani?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABKzZVcB8lQOPqP8Ui7onhnHOWU9uigpc1c",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7286414196592820224",
      "url": "https://www.linkedin.com/company/lal-bahadur-shastri-institute-of-management/posts",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7288936750435966976",
      "url": "https://www.linkedin.com/in/dieterwolf?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABsFh-8B6C7Xleh7DoXRkF9r0IfCKIovw6o",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7288969802746933248",
      "url": "https://www.linkedin.com/in/allisonpons?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAATH4lQBTReNG_owOHVtnIvANHVjGHqx_wA",
      "errors": [
        "Failed to fetch reactions.",
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7288978055488753665",
      "url": "https://www.linkedin.com/in/romimahajan?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAlYZuQBDEZNbNuEzy5tczl-rn6tmbfIonY",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7288868461424836608",
      "url": "https://www.linkedin.com/in/peter-vanham-9602ba6?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAEcu9gBXmfRgDYhkX0PnF9dp5V7utN9eAM",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7288259135723212803",
      "url": "https://www.linkedin.com/in/manujaggarwal?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAMY_wBiA538UlzNcv3ls30NXdjZZ2cT2c",
      "errors": [
        "Failed to fetch content."
      ]
    },
    {
      "postId": "urn:li:activity:7288180062321860608",
      "url": "https://www.linkedin.com/in/samuel-szuchan?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADJxmOcB9ewkNVvLueDDab0UxS19_vB0-H0",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7288685699141144577",
      "url": "https://www.linkedin.com/in/sam-blond-791026b?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAH1_t0BJzCtpQfod7NBgqM0Fy1rwhSmLM0",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7288936423842295808",
      "url": "https://www.linkedin.com/in/anil-kumar-valaboju-96a70b281?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAESgc6IBE0tKJSJ-nIrO4IaYEkJ3FUp8PrI",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7288846143982104576",
      "url": "https://www.linkedin.com/in/dr-charif-noureddine-8474a0273?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAELQTrcBokOVArS9Xi4M4v8GirZU0lHPsvM",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7288541069917503488",
      "url": "https://www.linkedin.com/in/clairemdavis?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAFCGXoB6nWioiigFFst9Mz-mJ5Ku6Q5o1Q",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7288946191977852928",
      "url": "https://www.linkedin.com/in/navrina?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABA4-sB0WRWqvILHdATiM7gCmC4nPCGpCs",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7288954182990999552",
      "url": "https://www.linkedin.com/groups/762547?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A762547-7288954182147944448",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7288972957639417856",
      "url": "https://www.linkedin.com/in/jnando82?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAACfbcYB5KtgXpUrgMeAwPG8MEfAiRXX3wU",
      "errors": [
        "Failed to fetch reactions.",
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7288926108547260416",
      "url": "https://www.linkedin.com/in/sahilkataria?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAeUmF8BKZv-laaK4cpNPbgYOMgv_jRnUeM",
      "errors": [
        "Failed to fetch reactions.",
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287813131475599360",
      "url": "https://www.linkedin.com/in/sandeep-dinodiya?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAjV68YBDGiWNlfy0lNRRRpHXJVCZj8e8eU",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287233826815123456",
      "url": "https://www.linkedin.com/in/jakedunlap?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAENCicB0qY59ybik0DUN4FzM8lk0Rq6bjk",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7288851809027121152",
      "url": "https://www.linkedin.com/in/svetlanamakarova?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAANVVjQBUIQREd4wVtuJIUrRHVR-DPEIwYA",
      "errors": [
        "Failed to fetch media URL."
      ]
    }
  ]
}