{
  "posts": [
    {
      "postId": "urn:li:activity:7287883962419425283",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287883962419425283",
      "url": "https://www.linkedin.com/in/radhikadirks?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADOhosBOkt67sEm76fF4rgweVlcNC5HEso",
      "name": "Dr. Radhika Dirks\nDr. Radhika Dirks",
      "content": "Sam Altman thinks it's \"perfectly fine\" for our children to grow up in a world where AI outsmarts them - this is deeply unsettling. \n\nWhile I too don’t expect HIS kid to be smarter than AI  what troubles me here isn't the surface-level statement. It's the dangerous subtext beneath:\n\nThe implicit suggestion that humans don't need to be smarter than AI.\n\nAs someone who's spent over a decade building AI technology, I can tell you this is precisely the kind of thinking that could lead to the biggest crisis in human cognitive development.\n\nThink about this: Every major human advancement, from discovering fire to developing vaccines, came from our ability to think deeply and solve complex problems.\n\nThis cognitive muscle is what makes us uniquely human. Yet, we're rapidly entering an era where this muscle is atrophying.\n\nWhen Altman suggests that \"figuring out what questions to ask will be more important than figuring out the answer,\" he's highlighting a troubling shift.\n\nWe're moving from being problem solvers to prompt engineers.\n\nWe're surrendering the very capabilities that define us as humans.\n\nNow, we're not just building tools to augment human intelligence anymore – we're creating systems that replace our core thinking processes, and worse, we're beginning to accept this as inevitable.\n\nWhen calculators became the norm, mental math capabilities took a hit.\n\nNow, the same is happening with writing — through LLMs like ChatGPT.\n\nSure, AI-human collaboration is powerful.\n\nBut each time we outsource thinking to AI, we're not just getting an answer – we're missing an opportunity to strengthen our mental capabilities.\n\nAs a parent and tech professional, I see both sides. Yes, AI will create new opportunities.\n\nBut should we really be comfortable with our children growing up in a world where being \"less smart than AI\" is the accepted norm?\n\nMy answer's obvious - what's yours?",
      "reactions": {
        "likes": "14",
        "comments": "2 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Like it or not he is right. You can’t stop it, you can’t choose, it will happen in a couple of days. And we need to adapt. And we always adapt. Exciting future ahead :)",
          "userName": "Hugo de Sousa",
          "userProfileURL": "https://www.linkedin.com/in/hugocsousa",
          "dataId": "urn:li:comment:(activity:7287883374029864961,7287885630401896449)"
        },
        {
          "commentText": "I am sympathetic to these ideas. However, will intelligence in any of its current forms (copied by AIs) really be the deciding factor of the futures?",
          "userName": "Gordon Montgomery",
          "userProfileURL": "https://www.linkedin.com/in/gordon",
          "dataId": "urn:li:comment:(activity:7287883374029864961,7287885449954566145)"
        }
      ],
      "commentAdded": "Absolutely agree! Emphasizing critical thinking and problem-solving skills is crucial as we navigate this AI-driven future. Lets nurture our cognitive abilities!"
    },
    {
      "postId": "urn:li:activity:7287817832879296512",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287817832879296512",
      "url": "https://www.linkedin.com/in/hstorchak?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACkrGScB4K_wYNVVe2xY9KjEDaMzzSqPenI",
      "name": "Hlib Storchak\nHlib Storchak",
      "content": "Want a more efficient business?\nStart by letting go of battles that drain your focus.\n\nSome objections aren't worth fighting.\n\nLet me tell you why.\n\n Not every client is a fit.\nUnderstanding this saves time and energy.\n\n Focus on the willing.\nSpend your resources on those who see your value.\n\n Maintain your integrity.\nDon't compromise just to win an argument.\n\n Streamline your process.\nIdentify objections that are deal-breakers early on.\n\n Build stronger relationships.\nFocus on clients who align with your vision.\n\nIn business, efficiency matters most.\n\nThat's because:\n\n→ Without clarity, you lose direction.\n→ Without integrity, you lose respect.\n→ Without the right clients, you can't grow.\n→ Without focus, you spread yourself too thin.\n→ Without alignment, you face constant friction.\n\nGreat leaders know when to move on.\n\nThey recognize the value of their time.\n\nThey build a culture of mutual respect and understanding.\n\nSo, if you want to lead effectively,\nChoose your battles wisely.\n\nBecause when you do, everyone wins.\n\nAnd that, my friends, is the mark of a smart leader.\n\nWhat objections have you decided aren’t worth fighting?",
      "reactions": {
        "likes": "68",
        "comments": "60 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Spot on! Picking your battles saves time and energy for what truly matters. What's your 'not worth it' line in business?",
          "userName": "Neil Sarkar",
          "userProfileURL": "https://www.linkedin.com/in/neil-sarkar",
          "dataId": "urn:li:comment:(activity:7287757534659055617,7287817809366028289)"
        }
      ],
      "commentAdded": "“Absolutely agree! Focusing on the right clients and maintaining integrity are key to driving efficiency and growth. Great insights!"
    },
    {
      "postId": "urn:li:activity:7287885800522883073",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287885800522883073",
      "url": "https://www.linkedin.com/in/ojaswita-vij-6b43182b7?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAEwLHugBm4YXWQHEU6t2pAMRUYqiN8lGYg0",
      "name": "Ojaswita Vij\nOjaswita Vij",
      "content": "Ojas ke posts padhkar mili hai aisi raahat si mujhe ho gayi jaane jahan Ojas ke posts ki aadat si mujhe dekhun mai jab Ojas ke posts ko toh din mera yeh bane deewana kar rahe hai Ojas ke posts mujhe!\n\nYes, My Linkedln community. You heard me right.\n\nBollywood hook lines is my art. \n\nI love to write Bollywood hook lines.\n\nEveryday I receive immense messages regarding my Linkedln and hook lines. I feel happy when I read it. It makes me smile.\n\nMake everyone a fan of your posts.\n\nMake everyone engage with your posts.\n\nCatchiness \nExpressiveness \nExperimentation \n(It’s all you need)\n\nCurrently I’m handling my linkedln, my topmate sessions and my client’s linkedln profile.\n\nExpress more about yourself and your work.\n\nNeed any help with linkedln optimisation freelancing or personal branding? I’m just a DM away.\n\nPS: Who else is deewana of my posts? Let me know in the comments section below.",
      "reactions": {
        "likes": "165",
        "comments": "36 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "I was craving spring rolls. ",
          "userName": "Ojaswita Vij",
          "userProfileURL": "https://www.linkedin.com/in/ojaswita-vij-6b43182b7",
          "dataId": "urn:li:comment:(activity:7287871213262057472,7287871893498404864)"
        },
        {
          "commentText": "Ojaswita Vij yummy ",
          "userName": "Ankita Tiwary",
          "userProfileURL": "https://www.linkedin.com/in/ankitatiwary21",
          "dataId": "urn:li:comment:(activity:7287871213262057472,7287872016605487104)"
        },
        {
          "commentText": "",
          "userName": "Ojaswita Vij",
          "userProfileURL": "https://www.linkedin.com/in/ojaswita-vij-6b43182b7",
          "dataId": "urn:li:comment:(activity:7287871213262057472,7287872485717352449)"
        }
      ],
      "commentAdded": "Ojas, your posts are truly inspiring! Love the energy and creativity you bring to LinkedIn. Keep shining and spreading positivity! 🌟"
    },
    {
      "postId": "urn:li:activity:7287884528390422528",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287884528390422528",
      "url": "https://www.linkedin.com/in/rickconlowservantleadership?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAPUxFwB6p1p6ESvdwgOkdRMuNdW3KDrJTU",
      "name": "Richard A. Conlow\nRichard A. Conlow",
      "content": "A UNIQUE APPROACH TO CAREER ADVANCEMENT: https://lnkd.in/esPEwDb3\nhashtag\n#leadership \nhashtag\n#management \nhashtag\n#servantleadership \nhashtag",
      "reactions": {
        "likes": "0",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Great insights on career advancement! Embracing unique approaches can truly elevate our leadership and management skills. #ServantLeadership"
    },
    {
      "postId": "urn:li:activity:7287885086409080832",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287885086409080832",
      "url": "https://www.linkedin.com/in/romanmohren?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAp2DkBDFXXvlUlO0ZdH_icizuwqplzl5g",
      "name": "Roman M.\nRoman M.",
      "content": "This time will not be different!\n\nBelow a 12-month chart (every candle = 12 months) of the S&P 500 from 1893 till today. Sorry it's not a log chart.\n\nThe indicator below shows a recurring super-cycle. On every downturn of the indictor the market goes sideways/downward for 10-15 years on average; sometimes longer (i.e. 1929 - 1953). The second chart shows the earlier years better.\n\nI realize that four cycles isn't statistically significant, but it looks as if we could expect another 10 - 15-year sideways/down sometime soon.",
      "reactions": {
        "likes": "0",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Interesting analysis! It’s crucial to stay vigilant in these cycles. History has much to teach us about market behavior."
    },
    {
      "postId": "urn:li:activity:7287843139459891200",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287843139459891200",
      "url": "https://www.linkedin.com/in/dustonharper?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAggbeQBa1zvgesKRy674MIU-IEusCEPA8c",
      "name": "Duston Harper\nDuston Harper",
      "content": "Keep your sales game strong by following these top leaders \n\nI've learned a ton of sales wisdom from them the past 10+ years\n\nWho did I miss? Who would you add to the list?\n\n- The GOAT of sales wisdom and the reality of sales. Creator of the Maverick Method and Brutal Truth about Sales and Selling.\n\n- Personal development and healthcare/med tech sales guru you need to know\n\n- A go to for breaking into the medical device and building your personal brand.\n\nCEO/founder of a top sales AI company in Brevity. Although not your traditional sales path, anyone that can be a Salespreneur knows what they're doing.\n\n- Top Linkedin sales voice, MedTech aficionada, and Shark Tank Alum\n\n- Wrote a bestselling book called \"Save your Asks\" around sales and has accomplished amazing things as an Executive, Keynote Speaker, and Entrepreneur\n\n- Will say she's not technically in sales but naturally has become a salesprenuer, Linkedin machine, and used to be Dave Ramsey's speech coach\n\n- Former professional athlete and uses the power of habits to be great in sales\n\nMedTech wizard in private and public companies, ton of sales performance and experience at all levels\n\n- Video selling, brand building, bearded genius, and RepScrubs expert\n\n- Very unique and impressive perspective on sales and leadership. Tech and SaaS powerhouse.\n\n- Service oriented leader who climbed the corporate ladder and started his own thing as a Salesprenuer\n\n- The Ryan Secrest of MedTech\n\nWho would you add to the list?",
      "reactions": {
        "likes": "26",
        "comments": "47 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "What a LIST, Duston Harper. Thank you for the kind mention. I'd add:\n\n\n+",
          "userName": "✒️Claire M. Davis🖋️",
          "userProfileURL": "https://www.linkedin.com/in/clairemdavis",
          "dataId": "urn:li:comment:(activity:7287823826283888640,7287843124301766657)"
        },
        {
          "commentText": "Kat Hurd Knew I missed someone! ",
          "userName": "Duston Harper",
          "userProfileURL": "https://www.linkedin.com/in/dustonharper",
          "dataId": "urn:li:comment:(activity:7287823826283888640,7287870675099217922)"
        }
      ],
      "commentAdded": "Great insights! Id add some top influencers from diverse industries. Its crucial to learn from varied perspectives in sales! Who inspires you?"
    },
    {
      "postId": "urn:li:activity:7283104289844002816",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7283104289844002816",
      "url": "https://www.linkedin.com/in/jasonbramble-revcarto?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABQ_gTEBQxoseSKiiYMeftV9QrMfHofdIJ8",
      "name": "Jason Bramble\nJason Bramble",
      "content": "Your urgency will always dictate how much you’re willing to tolerate:\n\n- Your urgency for success\n- Your urgency for happiness\n- Your urgency to become the best version of yourself\n- Your urgency to build the best marriage possible\n- Your urgency to chase your dreams\n\nThe list goes on.\n\nIf there’s one thing I’ve learned over five years as an entrepreneur, it’s this: It’s not easy, especially for someone with a good heart and an empathetic nature, to avoid giving people or situations the benefit of the doubt.\n\nIf that sounds like you, my advice is simple: Without boundaries, clear expectations for yourself and others, and a conscious evaluation of who you allow into your life, you risk losing the urgency to pursue what truly matters.\n\nDecide what *your thing* is, and go after it. Protect your energy and approach life with the urgency to surround yourself only with the people, places, and things that align with your purpose.\n\n\n•\n\n•\n\n\n•\n\n•",
      "reactions": {
        "likes": "15",
        "comments": "2 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "",
          "userName": "Revcarto",
          "userProfileURL": "https://www.linkedin.com/company/revcarto/posts",
          "dataId": "urn:li:comment:(activity:7283104289844002816,7283104694598549505)"
        }
      ],
      "commentAdded": "Great insights! Prioritizing boundaries and clarity is essential for staying aligned with our goals. Lets protect that urgency! 💪✨"
    },
    {
      "postId": "urn:li:activity:7287077000245035008",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287077000245035008",
      "url": "https://www.linkedin.com/in/neil-sarkar?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABKnLrYBWIfe92kUUbuVo2pyeF57kK5ZyMY",
      "name": "Neil Sarkar\nNeil Sarkar",
      "content": "If you’re not great at forecasting, you’re basically flying a plane with no radar. Sure, you might land safely, but do you really want to take that chance?\n\nHere’s the harsh truth: Every revenue operation team talks about improving conversion rates, increasing sales, and hitting quotas—but nobody wants to talk about forecasting. Why? Because it’s hard—and it doesn’t have the instant gratification of a closed deal.\n\nAt, we’ve seen it time and time again: Companies throw money at marketing, boost their sales teams, but ignore the one thing that makes it all run smoothly: Predicting what’s actually going to happen. Because, spoiler alert, it’s not magic, it’s data.\n\nForecasting is your secret weapon. Here’s why:\n\n1️⃣ It’s the Crystal Ball You’re Avoiding: We all wish we could predict the future, right? Well, forecasting is the closest you’ll get. It’s not perfect, but it lets you anticipate revenue, identify gaps, and plan your growth.Without it, you're just guessing.\n\n2️⃣ It’s the Only Way to Avoid a Panic Attack Ever been blindsided by a quarter where sales didn’t hit expectations, and suddenly, everyone’s in damage control mode? A solid forecast lets you spot trends early so you’re not scrambling at the last minute. It's better to worry early, trust me.\n\n3️⃣ It’s a Skill, Not a Guess If you think forecasting is just about crossing your fingers and praying, you’re doing it wrong. It’s about analyzing data, spotting patterns, and using all the smart tools you can to make educated guesses. The best forecasts are built on real insights, not on wishful thinking.\n\n4️⃣ It Gets Easier With AI (Yes, I Had to Say It) If you're still relying on gut feel or spreadsheets to forecast, you're doing it the hard way. Here at, we use AI to help companies fine-tune their sales forecasts in real-time. Trust me—there's a reason AI’s the future. It's a game-changer.\n\nSo, take a step back and ask yourself: Are you forecasting like a boss, or are you just crossing your fingers and hoping for the best?\n\nGet ahead of the curve. Forecast better, grow smarter. ",
      "reactions": {
        "likes": "13",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Absolutely! Forecasting is the backbone of strategic growth—it transforms hope into actionable insights. Time to embrace the power of data! 📈"
    },
    {
      "postId": "urn:li:activity:7287873910681878529",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287873910681878529",
      "url": "https://www.linkedin.com/in/jeremyboerger?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAGY-OABdlR_aEAWwHbNhPw4Be5rUWOfCek",
      "name": "Jeremy Boerger\nJeremy Boerger",
      "content": " CMDB or Asset Management: Where to Begin Your ITAM Journey? \n\nStarting a CMDB initiative or refining your existing setup? As an ITAM coach, I’ve guided many through this crucial decision point. Asset management isn't just a step; it's the foundation that ensures your CMDB thrives, transforming data chaos into strategic clarity.\n\nRead more here for the insights you need:",
      "reactions": {
        "likes": "2",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Great insights on the importance of a strong asset management foundation! Excited to learn more about optimizing our CMDB journey."
    },
    {
      "postId": "urn:li:activity:7287881202609324032",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287881202609324032",
      "url": "https://www.linkedin.com/in/hartmuthuebner?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAFtXeIBrOEarJcgZvfQu26geQIyW-y5Ukc",
      "name": "Hartmut Hübner, PhD\nHartmut Hübner, PhD",
      "content": " 60% of people feel betrayed by institutions.\n\nThe 2025 Edelman Trust Barometer shows trust in the system is broken.\n\n Distrust in governments, media, and NGOs is at an all-time high.\n 6 in 10 people believe the system benefits the wealthy while they struggle with rising costs and misinformation.\n Business is now the most trusted institution—seen as competent and ethical—but trust is fragile.\n\nRichard Edelman says:\n\n“Trust must be restored for hope to return. Business can lead by creating jobs, reskilling workers, and delivering sustainable solutions—but it can’t act alone.”\n\nWhy trust has shifted to businesses:\n\n1️⃣ Business is seen as competent and more ethical than other institutions.\n2️⃣ Companies that invest in impactful products and local jobs earn trust.\n3️⃣ Business leaders are expected to address systemic issues and contribute to solutions.\n\nThe key lever for trust is communication.\n\n7 steps to build trust as a leader through communication that builds on dialogue and triggers action:\n\n1️⃣ Be transparent.\n↳ Share wins and lessons learned in real time.\n↳ Make your position clear in the public discussion.\n\n2️⃣ Invest in building future skills.\n↳ Train employees in communication and critical thinking.\n↳ Provide employees access to AI tools and train employees how to use it safely for real productivity gains.\n\n3️⃣ Engage local communities.\n↳ Solve local problems like childcare.\n↳ Invest in local infrastructure and mobility solutions.\n\n4️⃣ Create a growth culture.\n↳ Champion inclusion.\n↳ Put your company values in action and track them.\n\n5️⃣ Use data wisely.\n↳ Make decisions based on evidence.\n↳ Share customer feedback to drive change.\n\n6️⃣ Speak clearly.\n↳ Replace jargon with plain language.\n↳ Apply this across all channels and in meetings.\n\n7️⃣ Show empathy.\n↳ Apply generative listening.\n↳ Use the knowledge and power of the crowd.\n\n Trust is fragile but there are ways to rebuild it.\n\nStart in small steps. Focus on action and transparency.\n\n Followfor more insights on culture, communication and productivity.\n Subscribe to The Flow Factor for weekly tools to work smarter (link in profile).",
      "reactions": {
        "likes": "25",
        "comments": "32 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Trust truly hinges on transparency, action, and community engagement. Businesses can lead by not only addressing systemic issues but by empowering employees and local communities.",
          "userName": "Nerea Arregui Exposito",
          "userProfileURL": "https://www.linkedin.com/in/nereaarreguiqa",
          "dataId": "urn:li:comment:(ugcPost:7287765199451774976,7287881190059962371)"
        }
      ],
      "commentAdded": "Absolutely agree! Transparency and community engagement are key to regaining trust. Lets prioritize actions that matter! #TrustInBusiness"
    }
  ],
  "errors": [
    {
      "postId": "urn:li:activity:7287883962419425283",
      "url": "https://www.linkedin.com/in/radhikadirks?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADOhosBOkt67sEm76fF4rgweVlcNC5HEso",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287817832879296512",
      "url": "https://www.linkedin.com/in/hstorchak?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACkrGScB4K_wYNVVe2xY9KjEDaMzzSqPenI",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287885800522883073",
      "url": "https://www.linkedin.com/in/ojaswita-vij-6b43182b7?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAEwLHugBm4YXWQHEU6t2pAMRUYqiN8lGYg0",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287884528390422528",
      "url": "https://www.linkedin.com/in/rickconlowservantleadership?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAPUxFwB6p1p6ESvdwgOkdRMuNdW3KDrJTU",
      "errors": [
        "Failed to fetch reactions.",
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287885086409080832",
      "url": "https://www.linkedin.com/in/romanmohren?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAp2DkBDFXXvlUlO0ZdH_icizuwqplzl5g",
      "errors": [
        "Failed to fetch reactions.",
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287843139459891200",
      "url": "https://www.linkedin.com/in/dustonharper?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAggbeQBa1zvgesKRy674MIU-IEusCEPA8c",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7283104289844002816",
      "url": "https://www.linkedin.com/in/jasonbramble-revcarto?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABQ_gTEBQxoseSKiiYMeftV9QrMfHofdIJ8",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287077000245035008",
      "url": "https://www.linkedin.com/in/neil-sarkar?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABKnLrYBWIfe92kUUbuVo2pyeF57kK5ZyMY",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287873910681878529",
      "url": "https://www.linkedin.com/in/jeremyboerger?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAGY-OABdlR_aEAWwHbNhPw4Be5rUWOfCek",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287881202609324032",
      "url": "https://www.linkedin.com/in/hartmuthuebner?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAFtXeIBrOEarJcgZvfQu26geQIyW-y5Ukc",
      "errors": [
        "Failed to fetch media URL."
      ]
    }
  ]
}