[
  {
    "postsData": [
      {
        "postId": "urn:li:activity:7295436250554015744",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295436250554015744",
        "url": "https://www.linkedin.com/in/jwmba?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADDhDMBbLBhtJVMaS6QUzkyh0jD78M_s0s",
        "name": "Justin Wright\nJustin Wright",
        "content": "I've seen \"leaders\" throw their team under the bus.\n\nIn front of coworkers.\nIn front of clients.\nWithout hesitation.\n\nIt made me realize something powerful:\n\nIf you don't defend your people,\nyou don't belong in leadership.\n\nPeriod.\n\nTrue leaders know:\n\n Your team's success is your success\n Their growth and achievements are your legacy\n Their trust is what makes you a leader, not your title\n\nWhat does it mean to defend your team?\n\nIt's not about making excuses\nor lowering your standards.\n\nIt's about:\n\n Fighting for their growth\n Protecting them from burnout\n Shielding them from toxic politics\n Offering support without micromanaging\n Being their voice when they're not in the room\n\nThe best leader I ever had taught me this.\n\nWhen our team made mistakes, she'd say:\n\"That's on me. We'll fix it.\"\n\nWhen we succeeded?\n\"My team did all the work. I just cleared the path.\"\n\nShe held us to high standards.\nGave tough feedback when needed.\nBut always had our backs.\n\nKnow what happened?\n\nWe gave everything for that team.\nGrew faster than ever.\nAchieved things we never thought possible.\n\nBecause we knew she'd be there.\nSupporting. Defending. Believing.\n\nRemember:\n\nAnyone can manage tasks.\nReal leaders develop people.\nAnd you can't develop what you don't defend.\n\nSo choose wisely.\nYour team is watching.\nAnd they'll never forget.\n\n️ Agree? Repost to share with your network.\n Followfor more on leadership.\n\nWant my 80 best cheat sheets?\nGet them here for free:",
        "reactions": {
          "likes": "2,699",
          "comments": "474 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": " BONUS: 5 WAYS TO DEFEND YOUR TEAM WITHOUT LOWERING THE BAR \n\n1. Own mistakes publicly, correct them privately. If something goes wrong, take responsibility as a leader. But behind closed doors, help your team learn and improve without fear or shame.\n\n2. Redirect blame, but share credit generously. When pressure comes from above, protect your team from unnecessary heat. But when wins happen, make sure their contributions; not just yours are recognized.\n\n3. Push for fair workloads, not just fast results. Defending your team means speaking up when deadlines are unrealistic or workloads are unsustainable. Burnout isn’t a badge of honor; balance leads to better performance.\n\n4. Call out toxic behavior, even when it's uncomfortable. Gossip, undercutting, or back channeling can destroy trust fast. Set the tone by addressing it directly, even when it comes from higher-ups.\n\n5. Be the leader they trust in tough moments. Anyone can be supportive when things go well. True leadership shows when stakes are high; stay calm, stand by your team, and problem-solve together.",
            "userName": "Justin Wright",
            "userProfileURL": "https://www.linkedin.com/in/jwmba",
            "dataId": "urn:li:comment:(activity:7295430201960800256,7295433829723357185)"
          },
          {
            "commentText": "LET'S HEAR YOUR THOUGHTS\n\nWhat’s one way a great leader has had your back?",
            "userName": "Justin Wright",
            "userProfileURL": "https://www.linkedin.com/in/jwmba",
            "dataId": "urn:li:comment:(activity:7295430201960800256,7295434330011537408)"
          },
          {
            "commentText": "Goncal R. That’s it. Trust and collaboration bring out the best in a team. ",
            "userName": "Justin Wright",
            "userProfileURL": "https://www.linkedin.com/in/jwmba",
            "dataId": "urn:li:comment:(activity:7295430201960800256,7295451275880448000)"
          }
        ],
        "commentAdded": "Absolutely agree! True leadership is all about empowering and defending your team. Their success reflects your own. Let’s uplift each other! 💪 #Leadership"
      },
      {
        "postId": "urn:li:activity:7295225856568766465",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295225856568766465",
        "url": "https://www.linkedin.com/in/gbrentbarkin?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAI5v54B8OquVDdHfjnHpuC9Ga3eD6YsXtk",
        "name": "G. Brent Barkin\nG. Brent Barkin",
        "content": "Now this one is really interesting. I’m sure opinions land on both sides of the debate.\n\nGeorgia state house is entertaining the idea that athletes\nearning would be exempt from state income taxes.\n\nThe theory behind the push makes sense on its face: if other states are doing this, Georgia universities would be at a recruiting disadvantage. Furthermore, many NIL deals for athletes do not reach the scale of the\namounts that hit the headlines.\n\nThe counter-argument, however is that it makes a distinction between the same type of income- namely income from being an\n, solely based on a criteria unrelated to the income itself. If you’re a student on an academic scholarship and get paid to post you have to pay state income taxes. Your best friend on the basketball team doesn’t. Could be the exact same post.\n\nAnd what about those influencers that aren’t in college? What about other workers in the state that couldnt afford to go to college? Why are their earnings paying to subsidize others?\n\nLots to unpack here.",
        "reactions": {
          "likes": "1",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "This is a complex issue! Balancing fair taxation with competitive recruitment in Georgia will require careful consideration. Curious to see how this unfolds!"
      },
      {
        "postId": "urn:li:activity:7295284957512351746",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295284957512351746",
        "url": "https://www.linkedin.com/in/mayer-schwartz?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABHPsCgBGX4ZtqZuX4I6nn_19GJB3gJl4es",
        "name": "Mayer Schwartz\nMayer Schwartz",
        "content": "Most people aren’t held back by laziness. It’s fear.\n\n\n\nSome ideas won’t work. Some people will say no. So what? In the long run, failing is better than never trying at all.\n\n\nInaction leads to overthinking, which feeds anxiety. Action, even messy action, builds momentum and fuels confidence.\n\n\nTake the leap. You’ll thank yourself later...",
        "reactions": {
          "likes": "19",
          "comments": "4 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Agree?",
            "userName": "Mayer Schwartz",
            "userProfileURL": "https://www.linkedin.com/in/mayer-schwartz",
            "dataId": "urn:li:comment:(activity:7295284957512351746,7295284989426810881)"
          },
          {
            "commentText": "It's not laziness. It's the fear they will succeed and might not be able to handle that idea that life will gets busy or the fear of loosing or rejection.",
            "userName": "Hana ✍🏻 Sims",
            "userProfileURL": "https://www.linkedin.com/in/hana-%E2%9C%8D%F0%9F%8F%BB-sims-982500199",
            "dataId": "urn:li:comment:(activity:7295284957512351746,7295415380129296384)"
          }
        ],
        "commentAdded": "Absolutely agree! Embracing action over inaction is key to growth. Every step forward, no matter how small, builds our resilience. Lets leap together!"
      },
      {
        "postId": "urn:li:activity:7295157601267281921",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295157601267281921",
        "url": "https://www.linkedin.com/in/anthonywentzel?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADZN2sBr5ZUAlKZK2QwVQvOE9B6pnFHXt8",
        "name": "Anthony Wentzel\nAnthony Wentzel",
        "content": "Turning a great idea into a great product is a challenge.\n\nAnd it's one that many entrepreneurs face. \n\nEnter the Minimum Viable Product (MVP).\n\nBut there are some tips you need to keep in mind. \n\nKeep it simple\n\nBuild it quickly\n\nGet feedback early and often\n\nBe prepared to pivot\n\nLet's get after it",
        "reactions": {
          "likes": "1",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Great insights! Embracing simplicity and feedback is key. Excited to see how MVPs evolve ideas into impactful products! 🚀"
      },
      {
        "postId": "urn:li:activity:7295106492225990657",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295106492225990657",
        "url": "https://www.linkedin.com/in/matthewbuchalski?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAHq5rcBUODCOiAZTTtYH3Xvrex0EdMFjpA",
        "name": "Matthew Buchalski\nMatthew Buchalski",
        "content": "Change can be terrifying.\n\nIt can disrupt your sense of security and leave you feeling uncertain.\n\nBut growth doesn't happen in a comfort zone.\n\nWhen the universe throws a curveball, lean into it.\n\nEmbrace change.\nEmbrace uncertainty.\n\nYou'll come out stronger and wiser.\n\nLike a butterfly emerging from a cocoon, you'll be transformed.\n\nAnd remember, every obstacle is an opportunity to learn and grow.\n\nDon't be afraid to challenge yourself and try new things.\n\nYou never know what you're truly capable of until you step outside your comfort zone.\n\nSo take a deep breath, trust the journey, and embrace the unknown.\n\nAmazing things await you on the other side.",
        "reactions": {
          "likes": "3",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/90aa8120-6233-4cc4-83d4-afecf4bebe4a",
        "comments": [],
        "commentAdded": "Embracing change is vital for growth! Every challenge is a stepping stone to new opportunities. Lets welcome the unknown together! 🌟"
      },
      {
        "postId": "urn:li:activity:7295203135466225667",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295203135466225667",
        "url": "https://www.linkedin.com/in/monicagauba?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAWIOcBtcOLBynKoHfvDV9vVbCZ8NQYmgc",
        "name": "Monica Gauba\nMonica Gauba",
        "content": " For those embarking on developing AI agents, sharing a few lessons learned from our journey of developing vertical AI agents for GTM. \n\nBuilding these agents for developing GTM strategy and execution taught us that success starts with a clear breakdown of every task that we wanted the agent to perform and, more importantly, providing the right context for each.\n\n**The foundation: A Solid Framework**\n\nFirst we needed to build a robust framework. We began by designing a framework that not only outlines the different tasks for the agent, but also embeds the specific conditions needed for each one to execute effectively. The framework builds on best practices for GTM and also defines clear outcomes.\n\n **The Best Teacher? Testing.**\n\nBy running our agents through diverse scenarios—from building GTM strategies for different company sizes to various business types—we uncovered gaps in our framework, issues with context delivery, and opportunities for better end user experience.\n\nThis testing process reinforced one key lesson: Crafting production-quality, reliable agents that can truly boost human productivity demands deep, iterative work.\n\n️ The payoff?\nThe hard work pays off with smarter, more adaptable product that can genuinely support strategic decision-making.\n\nHowever, the journey doesn't end after launch.\n\nSupporting technology, like GenAI models are evolving everyday - with upgrades to APIs and newer models being released that require testing, enhancements and updates to all functional scenarios.\n\nBut the rewards in improved efficiency and effectiveness are mind blowing and well worth it.\n\n Takeaway:\n\nAgent-driven software is the future—just don't underestimate the work it takes to build products that people can rely on.\n\nUpdating AI agents with evolution of the underlying technology as well as evolution of business process they support will require deep, ongoing effort.\n\nStay adaptable. Keep iterating. The rewards in efficiency and impact are worth it.\n\n**DM if you'd like to see what we've done and trade notes.**",
        "reactions": {
          "likes": "4",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Also worth mentioning that as part of rapid experimentation and testing, leveraging A/B testing, shadow deployments and gradual rollouts before full deployments to assess impact can be applied.",
            "userName": "Monica Gauba",
            "userProfileURL": "https://www.linkedin.com/in/monicagauba",
            "dataId": "urn:li:comment:(activity:7295203135466225667,7295437769022033920)"
          }
        ],
        "commentAdded": "Incredible insights! The importance of a solid framework and continuous testing cannot be overstated. Exciting times ahead for AI-driven solutions!"
      },
      {
        "postId": "urn:li:activity:7295271496271155201",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295271496271155201",
        "url": "https://www.linkedin.com/in/douglas-brown-b3740825a?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAD_GzFsBd73zYL6XkWMw1-EiqRJ_mhF7J18",
        "name": "Douglas Brown\nDouglas Brown",
        "content": "Sounds like a valuable webinar to attend!!",
        "reactions": {
          "likes": "0",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/f40f5901-bb95-4661-99e1-5fa7d2958b03",
        "comments": [],
        "commentAdded": "Absolutely! Looking forward to gaining insights and connecting with fellow professionals. Cant wait to learn more!"
      },
      {
        "postId": "urn:li:activity:7295449114228445187",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295449114228445187",
        "url": "https://www.linkedin.com/in/jigneshjk?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABD98rMB_YFin2e48UeYuZaTOBEMOSFVNzM",
        "name": "Jignesh Khakhriya\nJignesh Khakhriya",
        "content": "Valuable Insights\n\nThanks for sharing Shail ",
        "reactions": {
          "likes": "3",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Great insights, Shail! Its always beneficial to learn from your expertise. Looking forward to more of your valuable posts!"
      },
      {
        "postId": "urn:li:activity:7295456625060966401",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295456625060966401",
        "url": "https://www.linkedin.com/in/isarmeitis?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAMB50B_3NCLMZCvxrShlDeX2sL4TyWZBs",
        "name": "Isar Meitis\nIsar Meitis",
        "content": "STOP WASTING TIME on AI-generated content that doesn’t work!\nToo many people use AI to create content… but they’re doing it wrong.\n\n→ Generic posts.\n→ No engagement.\n→ ZERO business impact.\n\nHere’s the truth: AI isn’t a shortcut to good content—it’s a tool to make good content faster.\n\nSo how do you use AI the right way?\nIn this episode of Leveraging AI,breaks it down in this step-by-step guide\n\n Define Your Ideal Client Persona (ICP)\n Create Content Pillars that align with your expertise\n Build a 30-day content calendar in minutes\n Use ChatGPT for high-performing posts\n Convert posts into scroll-stopping videos (FAST!)\n Automate posting & boost engagement\n Optimize using LinkedIn’s latest algorithm insights\n\nThis guide gives you the exact system to:\n→ Post consistently without stress\n→ Get real engagement (not just likes)\n→ Free up HOURS every week\n\n Listen to the full episode now\n\nFollow for more actionable AI tips!",
        "reactions": {
          "likes": "2",
          "comments": "3 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "This is such a slick and simple overview of all that we covered.\n\nSuch a great resource for anyone wanting to check off the framework from \"Define Your Ideal Client Persona (ICP) - Optimise using LinkedIn’s latest algorithm insights\"\n\nThank you for creating this!",
            "userName": "Claire Farwell",
            "userProfileURL": "https://www.linkedin.com/in/clairefarwell",
            "dataId": "urn:li:comment:(ugcPost:7295452105673199617,7295458745575202816)"
          }
        ],
        "commentAdded": "Great insights! Using AI strategically can transform content creation. Excited to check out the episode and implement these tips!"
      },
      {
        "postId": "urn:li:activity:7295454322304159744",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295454322304159744",
        "url": "https://www.linkedin.com/in/amyposnerbusinessgrowthmentor?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAANqLKABESb3q8pD094NE1Bz5xUxhxo24nI",
        "name": "Amy Posner\nAmy Posner",
        "content": "This is how to get brand-new clients to treat you like an trusted friend... \n\nTL;DR = referrals, but....\n\nThere’s a way to ask and a time to ask. Get it wrong and they'll vanish.\n\nEven worse, I’m getting feedback that people feel uncomfortable asking, or don’t know how.\n\nHow and when do you ask for them (if you do, and if not, curious why not)?\n\nThe cool thing about referrals is they come with built-in trust.\n\nAnd we’re so used to giving referrals in our personal lives.\n\nYou know, the great movie you tell your friend about, or the restaurant you think everyone should try.\n\nBut, when it comes to business, we sometimes get shy or feel awkward, like it's too big an ask.\n\nWhat’s your take on asking for referrals, or giving them?\n\nI love being asked for referrals, and giving them.\n\nI think I just like matchmaking and doing someone a good turn. It’s easy and it feels good. What’s your take?",
        "reactions": {
          "likes": "3\nAuroriele Hans and 2 others",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "This is such a good question. There has to be a certain minimum of happy collaborations first. It has to be organic and can't be forced. It reminds me of... I think this is from Lean In (which I only read halfway because my eye started twitching, I have my issues with that book)--Sheryl Sandberg says you don't ask someone to be your mentor, you sort of organically develop a relationship and realize at some point that they've become your mentor. She says, \"Instead of telling young people, \"Get a mentor and you will excel,\" we tell them \"Excel, and you will get a mentor.\" I feel like the same principle applies to referrals. Do excellent work and the referrals will follow. The timing of the ask is less important than the deep-down knowledge that the response will be \"of course!\"",
            "userName": "Katie Crouch",
            "userProfileURL": "https://www.linkedin.com/in/kc-copy",
            "dataId": "urn:li:comment:(activity:7295453166978940928,7295464955078680578)"
          }
        ],
        "commentAdded": "Great insights! It really is about timing and approach. I agree—referrals create a win-win situation and strengthen our networks."
      }
    ],
    "errors": [
      {
        "postId": "urn:li:activity:7295436250554015744",
        "url": "https://www.linkedin.com/in/jwmba?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADDhDMBbLBhtJVMaS6QUzkyh0jD78M_s0s",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295225856568766465",
        "url": "https://www.linkedin.com/in/gbrentbarkin?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAI5v54B8OquVDdHfjnHpuC9Ga3eD6YsXtk",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295284957512351746",
        "url": "https://www.linkedin.com/in/mayer-schwartz?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABHPsCgBGX4ZtqZuX4I6nn_19GJB3gJl4es",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295157601267281921",
        "url": "https://www.linkedin.com/in/anthonywentzel?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADZN2sBr5ZUAlKZK2QwVQvOE9B6pnFHXt8",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295203135466225667",
        "url": "https://www.linkedin.com/in/monicagauba?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAWIOcBtcOLBynKoHfvDV9vVbCZ8NQYmgc",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295271496271155201",
        "url": "https://www.linkedin.com/in/douglas-brown-b3740825a?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAD_GzFsBd73zYL6XkWMw1-EiqRJ_mhF7J18",
        "errors": [
          "Failed to fetch reactions."
        ]
      },
      {
        "postId": "urn:li:activity:7295449114228445187",
        "url": "https://www.linkedin.com/in/jigneshjk?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABD98rMB_YFin2e48UeYuZaTOBEMOSFVNzM",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295456625060966401",
        "url": "https://www.linkedin.com/in/isarmeitis?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAMB50B_3NCLMZCvxrShlDeX2sL4TyWZBs",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295454322304159744",
        "url": "https://www.linkedin.com/in/amyposnerbusinessgrowthmentor?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAANqLKABESb3q8pD094NE1Bz5xUxhxo24nI",
        "errors": [
          "Failed to fetch media URL."
        ]
      }
    ]
  },
  {
    "postsData": [
      {
        "postId": "urn:li:activity:7295440118180368384",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295440118180368384",
        "url": "https://www.linkedin.com/in/kazanjy?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAAONQBUJN5xZqsVxhFY5yJUVFzFJej3fU",
        "name": "Peter Kazanjy\nPeter Kazanjy",
        "content": "Procurement with your padded implementation fee.",
        "reactions": {
          "likes": "1",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Great insights on procurement! Maximizing value with a detailed implementation fee can truly transform supply chain efficiency. 🚀"
      },
      {
        "postId": "urn:li:activity:7295323470190563329",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295323470190563329",
        "url": "https://www.linkedin.com/in/monicagauba?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAWIOcBtcOLBynKoHfvDV9vVbCZ8NQYmgc",
        "name": "Monica Gauba\nMonica Gauba",
        "content": "Time for marketing to claim its rightful place at the executive table...SureRev.AI is being built for marketers to do just that!",
        "reactions": {
          "likes": "7",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Absolutely! Empowering marketers with tools like SureRev.AI is key to driving strategic decisions at the executive level. Exciting times ahead!"
      },
      {
        "postId": "urn:li:activity:7295465317219082240",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295465317219082240",
        "url": "https://www.linkedin.com/in/annapoplevina?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAlufyoB5GX7yeeaFZW3m-LEeqg822jOf30",
        "name": "Anna Poplevina\nAnna Poplevina",
        "content": "The power of going all in. \n\n(It's simpler than you think.)\n\nWhat happens:\n↳ one market dominates five\n↳ niche businesses scale faster\n↳ focused brands lead markets\n\nThe reality is:\n Clear beats clever [specialization attracts premium clients]\n One offering mastered [beats ten average services]\n Full focus builds empires [scattered business stays small]\n Market leadership pays [being average costs millions]\n Deep expertise sells [surface level loses deals]\n\nHere's what most miss:\nYou don't need more products.\n\nYou need to own one market.\n\nUse this ChatGPT prompt: \"Show me how to dominate [your niche] and become the go-to brand for [your specialty].\n\n----\n\n Repost this and help spread the word!\n\n Subscribe to my newsletter- your 5-minute weekly breakdown of longevity breakthroughs shaping our future.\n\n: America's Got Talent / via social",
        "reactions": {
          "likes": "59",
          "comments": "27 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/6dfa335a-8434-46c2-979d-9a0a11e7eb1e",
        "comments": [
          {
            "commentText": "Focus is the ultimate growth hack! Mastering one niche beats being average in many—this is a game-changing mindset! ",
            "userName": "Mehedi Hasan",
            "userProfileURL": "https://www.linkedin.com/in/mehedi-hasan-89479b342",
            "dataId": "urn:li:comment:(ugcPost:7293740048267546624,7295462788645224450)"
          }
        ],
        "commentAdded": "Love this insight! Focusing on one niche can truly drive growth and establish you as a leader. Let’s dominate our markets together! 🌟"
      },
      {
        "postId": "urn:li:activity:7295455333408284673",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295455333408284673",
        "url": "https://www.linkedin.com/in/justinhills?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADOZO8B9vBt2KagVJkg1IfzIlhNK12xnlM",
        "name": "Justin Hills\nJustin Hills",
        "content": "Worried people might leave after investing in them?\n\nDon't be. You've already lost them.\n\n63% millennials do not believe they're receiving\nadequate leadership development for the future.\n\nBy 2030, they'll make up 75% of all leaders.\n\nWe're watching the largest leadership transition\nin history unfold, while clinging to the\n\nMyth: Great leaders somehow figure it out on their own.\n\n  \n\nThe real concern isn't if they'll leave after you invest.\nIt's what happens if they stay and you didn't.\n\nThe old \"sink or swim\" mentality isn't just outdated\nit's organizational suicide.\n\nDo you agree?\n\nWhat would you like to add to this conversation?\n\n-------------------------------------------------\n️ Repost to share the importance of investing in people.\n Followfor insights on leadership development",
        "reactions": {
          "likes": "34",
          "comments": "27 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Absolutely! Justin Hills\n\nDeveloping leaders isn’t a risk, it’s a necessity. \n\nGrowth-minded teams drive long-term success.",
            "userName": "Holly Moe",
            "userProfileURL": "https://www.linkedin.com/in/hollyamoe",
            "dataId": "urn:li:comment:(activity:7295452844453724162,7295455311128051712)"
          }
        ],
        "commentAdded": "Absolutely agree! Investing in leadership development today is crucial for retaining talent and fostering innovation for tomorrows challenges."
      },
      {
        "postId": "urn:li:activity:7295436037382709249",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295436037382709249",
        "url": "https://www.linkedin.com/in/elwandab?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAygUMBQiFEXLKqp1sw4ikwiGIzt_9EZ-c",
        "name": "Dr. Elwanda Bennett, MEDP, PMP\nDr. Elwanda Bennett, MEDP, PMP",
        "content": null,
        "reactions": {
          "likes": "2",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": []
      },
      {
        "postId": "urn:li:activity:7295465391600873473",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295465391600873473",
        "url": "https://www.linkedin.com/in/douglas-brown-b3740825a?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAD_GzFsBd73zYL6XkWMw1-EiqRJ_mhF7J18",
        "name": "Douglas Brown\nDouglas Brown",
        "content": "Thanks for sharing Sam Reeve Great advice as organizations work to build competitive compensation packages that attract and retain top talent.",
        "reactions": {
          "likes": "0",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Absolutely, Sam! Competitive compensation is key to fostering a motivated workforce. Its all about valuing talent! #HR #TalentManagement"
      },
      {
        "postId": "urn:li:activity:7295385670007635969",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295385670007635969",
        "url": "https://www.linkedin.com/in/dr-himanshu-shekhar-530157a?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAHNMzQBR5FatKVN4VMkFs_qQvcjzfsJtRc",
        "name": "Dr. Himanshu Shekhar\nDr. Himanshu Shekhar",
        "content": "#aspiretoinspire\n\n\"Our greatest glory is not in never falling, but in rising every time we fall.\" — Confucius",
        "reactions": {
          "likes": "5",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/17ebc35b-ca83-42e4-9d71-c6bad430a3b3",
        "comments": [
          {
            "commentText": "Dr. Himanshu Shekhar Beautiful quote, Dr. Himanshu!  It's a powerful reminder that setbacks are not the end of the journey, but a chance to rise stronger each time. Resilience and perseverance shape true success. This message really aligns with the idea that failure is a stepping stone, not a stop sign. ",
            "userName": "Anil Narain अनिल नारायण Matai मटई",
            "userProfileURL": "https://www.linkedin.com/in/anilnarainmatai",
            "dataId": "urn:li:comment:(ugcPost:7295319086182363136,7295385646129405952)"
          }
        ],
        "commentAdded": "Absolutely! Embracing our setbacks is where true growth happens. Lets keep inspiring each other to rise stronger! 💪 #AspireToInspire"
      },
      {
        "postId": "urn:li:activity:7295075321609940993",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295075321609940993",
        "url": "https://www.linkedin.com/in/markselinger?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAS-U0BSId2P1_Cr002hApyc4sxYqlNS-Y",
        "name": "Mark Selinger\nMark Selinger",
        "content": "A skill well worth learning and while uncomfortable for many becomes easier with practice and a few tips. \nhashtag\n#networking",
        "reactions": {
          "likes": "4",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Absolutely! Embracing networking can open doors to new opportunities. Consistent practice makes it feel like second nature! #networking"
      },
      {
        "postId": "urn:li:activity:7295209851972907008",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295209851972907008",
        "url": "https://www.linkedin.com/in/rickconlowservantleadership?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAPUxFwB6p1p6ESvdwgOkdRMuNdW3KDrJTU",
        "name": "Richard A. Conlow\nRichard A. Conlow",
        "content": "DEALING WITH \"MOMENTS OF MISERY\" IN CUSTOMER SERVICE.\nhashtag\n#leadership \nhashtag\n#management \nhashtag\n#servantleadership \nhashtag",
        "reactions": {
          "likes": "3",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Great insights on overcoming challenges in customer service! Embracing these moments can truly enhance our leadership skills. #ServantLeadership"
      },
      {
        "postId": "urn:li:activity:7295109523847979008",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295109523847979008",
        "url": "https://www.linkedin.com/in/anthonywentzel?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADZN2sBr5ZUAlKZK2QwVQvOE9B6pnFHXt8",
        "name": "Anthony Wentzel\nAnthony Wentzel",
        "content": "Stop spending hours on manual tasks.\n\nFocus on automating your workflow.",
        "reactions": {
          "likes": "1",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "If I have to do the same thing more than 3 times - I'm looking to automate it for the 4th.",
            "userName": "Zack Jones",
            "userProfileURL": "https://www.linkedin.com/in/zack-jones-32493b187",
            "dataId": "urn:li:comment:(activity:7295109523847979008,7295109976547635201)"
          }
        ],
        "commentAdded": "Absolutely! Automation not only saves time but also boosts productivity. Embrace the future of work and streamline your processes!"
      }
    ],
    "errors": [
      {
        "postId": "urn:li:activity:7295440118180368384",
        "url": "https://www.linkedin.com/in/kazanjy?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAAONQBUJN5xZqsVxhFY5yJUVFzFJej3fU",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295323470190563329",
        "url": "https://www.linkedin.com/in/monicagauba?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAWIOcBtcOLBynKoHfvDV9vVbCZ8NQYmgc",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295455333408284673",
        "url": "https://www.linkedin.com/in/justinhills?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADOZO8B9vBt2KagVJkg1IfzIlhNK12xnlM",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295436037382709249",
        "url": "https://www.linkedin.com/in/elwandab?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAygUMBQiFEXLKqp1sw4ikwiGIzt_9EZ-c",
        "errors": [
          "Failed to fetch content.",
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295465391600873473",
        "url": "https://www.linkedin.com/in/douglas-brown-b3740825a?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAD_GzFsBd73zYL6XkWMw1-EiqRJ_mhF7J18",
        "errors": [
          "Failed to fetch reactions.",
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295075321609940993",
        "url": "https://www.linkedin.com/in/markselinger?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAS-U0BSId2P1_Cr002hApyc4sxYqlNS-Y",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295209851972907008",
        "url": "https://www.linkedin.com/in/rickconlowservantleadership?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAPUxFwB6p1p6ESvdwgOkdRMuNdW3KDrJTU",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295109523847979008",
        "url": "https://www.linkedin.com/in/anthonywentzel?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADZN2sBr5ZUAlKZK2QwVQvOE9B6pnFHXt8",
        "errors": [
          "Failed to fetch media URL."
        ]
      }
    ]
  },
  {
    "postsData": [
      {
        "postId": "urn:li:activity:7295287540503257089",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295287540503257089",
        "url": "https://www.linkedin.com/in/jordanwilson04?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAF2EO0BaXka5PmlTSX3i8IwsUXlKIDb8ik",
        "name": "Jordan Wilson\nJordan Wilson",
        "content": "$100 million fine if your company uses DeepSeek?  \n\nWhat happened, here? \n\nA few weeks ago, DeepSeek was the internet's darling.\n\nAfter grabbing international headlines and shaking the U.S. stock market to its core, it's been a shake week or two for the Chinese AI company.\n\nSo what's actually happening here?\n\nShould you actually use the model?\n\nIs it safe?\n\nIs it really a SOTA open source model?\n\nTune in for our LIVE Deep Dive on DeepSeek.\n\nDeepSeek Deep Dive: AI’s Sputnik Moment or a National Security Threat? -- An Everyday AI Chat with Jordan Wilson\n\n=",
        "reactions": {
          "likes": "26",
          "comments": "62 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/fbf03c17-ef1b-465c-899f-a3e0fd7b0947",
        "comments": [
          {
            "commentText": "I think that episode was like a day before R1 news dropped",
            "userName": "Douglas Bolin",
            "userProfileURL": "https://www.linkedin.com/in/douglas-bolin",
            "dataId": "urn:li:comment:(ugcPost:7295287539437879296,7295434929369214976)"
          }
        ],
        "commentAdded": "This is a critical discussion! The implications of AI on national security cant be overstated. Looking forward to the insights from the Deep Dive!"
      },
      {
        "postId": "urn:li:activity:7295456649249529857",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295456649249529857",
        "url": "https://www.linkedin.com/in/madina-shaik?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAMt6EBi3qIcpvVfoL8w-6iIfHsEYsaaPA",
        "name": "Madina Shaik\nMadina Shaik",
        "content": "Spare no effort, strike success (pun intended!)\n\nHad a blast reconnecting with the CompQsoft SUBMEPP team at our winter party last weekend in Portsmouth, NH! Watching this group bring their A-game—whether at work or on the bowling lane—reminds me of how much CompQsoft has grown. I started my journey in tech as an independent consultant, and to now be leading this incredible group of professionals is nothing short of humbling.\n\nWe’ve had so many wins in 2024, delivering exceptional IT solutions to U.S. federal agencies, and tonight was all about celebrating those victories together. We've started out 2025 strong, and I have no doubt that the SUBMEPP team will keep this momentum going.",
        "reactions": {
          "likes": "4",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "What a fantastic way to celebrate success! Excited to see the SUBMEPP team continue to thrive in 2025. Together, the best is yet to come! 🎉"
      },
      {
        "postId": "urn:li:activity:7295321202296786945",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295321202296786945",
        "url": "https://www.linkedin.com/in/shalini-pillay-2b8803?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAedewBl7kxhHLXx6cg-9m9f5nu6ian6CE",
        "name": "Shalini Pillay\nShalini Pillay",
        "content": "It was a pleasure to be at the 32 HYSEA National Summit & Awards 2025, and to engage in a very grounded discussion with Sheenam Ohrie, Ranga Pothula, Mahesh Iyerandwho represented the broad spectrum of industry verticals that have leveraged the GCC model most effectively, and all at different stages in the GCC lifecycle.\n\nAs we discussed the much spoken of theme of \"Operations to Innovation: Value Revolution @ GCCs\", our focus was to demystify the cliched 'Value' term and we got into some details of:\n\n- How is 'value' itself being defined: which is truly defined by the business impact being made\n- What are the tailwinds enabling the evolution : where talent and technology top the list + global sponsorship and empowerment + the enabling ecosystem partners\n- What are the headwinds to watch out for and mitigate : and most interestingly how the flipside of the very aspects that are your tailwinds could prove to be your headwinds if not managed well\n- some interesting advice to the slew of young GCCs looking to establish their model to unlock value: aligning to the global business objectives, being agile and adpative, leveraging the ecosystem effectively, etc\n\nIt is the takeaways, industry insights and real, pragmatic examples of what is happening on the ground that make these discussions engaging and valuable- a big thank you to my panelists.",
        "reactions": {
          "likes": "227",
          "comments": "4 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "It was nice meeting you yesterday at the event.",
            "userName": "Ram Babu Vedantham",
            "userProfileURL": "https://www.linkedin.com/in/vedanthamr",
            "dataId": "urn:li:comment:(ugcPost:7295317826322489346,7295325911338434561)"
          },
          {
            "commentText": "It was great to have you join us for the program. Thanks!",
            "userName": "Isaac Rajkumar",
            "userProfileURL": "https://www.linkedin.com/in/irajkumar",
            "dataId": "urn:li:comment:(ugcPost:7295317826322489346,7295360954932895744)"
          }
        ],
        "commentAdded": "Invaluable insights shared at the HYSEA Summit! Its crucial to navigate both tailwinds and headwinds for GCC success. Thank you for the learnings!"
      },
      {
        "postId": "urn:li:activity:7295438075592101888",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295438075592101888",
        "url": "https://www.linkedin.com/groups/12124577?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A12124577-7295438074426126336",
        "name": "VLSI Professional Group\nVLSI Professional Group",
        "content": "(Open Access) Silicon Based Thin Film Solar Cells - https://lnkd.in/eiSBUE_Z\nLook for \"Read and Download Links\" section to download. Follow/Connect me if you like this post.",
        "reactions": {
          "likes": "10",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Great resource on silicon-based solar cells! Excited to dive in and learn more. Thanks for sharing! #Sustainability 🌞"
      },
      {
        "postId": "urn:li:activity:7295441525063254017",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295441525063254017",
        "url": "https://www.linkedin.com/in/zulfiya-forsythe-akbarova-cpa-0214b98?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAF_Z9kBicOLf_14bo6PzXqKjSo7EyrENz4",
        "name": "Zulfiya Forsythe (Akbarova) CPA\nZulfiya Forsythe (Akbarova) CPA",
        "content": "Did the Market Choose Its Winner?  \n\nI track AI obsessively, but it feels like the market already decided. Not just on tech, but on trust, familiarity, and emotion. People stick to what they know.\nDrop your thoughts! ",
        "reactions": {
          "likes": "4",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/4d19d653-f727-4194-977f-bb57760ec161",
        "comments": [],
        "commentAdded": "Interesting perspective! Trust and familiarity are crucial in AI adoption. Excited to see how this evolves as new players enter the market!"
      },
      {
        "postId": "urn:li:activity:7295437869597294592",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295437869597294592",
        "url": "https://www.linkedin.com/in/brianwsykes?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAXRYOcBGOrQ6Lxw96BA7IQD7eEHvYUXHq0",
        "name": "Brian Sykes\nBrian Sykes",
        "content": "Logo Rank is an AI system that understands logo design. \n\nTrained on a million+ logo images, this AI tool can observe and critique the quality of a logo based on set parameters of - uniqueness, legibility, color/contrast, overall - and it is for free.\n\nIn the 'Uniqueness' measure, it can check if your design took inspiration from stock icons (a large portion of the images the system was trained on.)\n\n\nWhile not a replacement for human review and discernment (the AI even points this out in the Overall segment), it can be another simple tool to help review your brand design with an AI 'eye' on the subject.\n\nFor my try, I used the logo I devised for AI LAB.",
        "reactions": {
          "likes": "4\nBrian Sykes and 3 others",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "ANother tool in the toolbox! thanks Brian Sykes",
            "userName": "Michael Uman",
            "userProfileURL": "https://www.linkedin.com/in/michael-uman-new-york",
            "dataId": "urn:li:comment:(ugcPost:7295437868229902336,7295439734128934913)"
          }
        ],
        "commentAdded": "Excited to see how AI can elevate logo design! Looking forward to testing Logo Rank for my next project. Great initiative! #LogoDesign #AI"
      },
      {
        "postId": "urn:li:activity:7295463863137792004",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295463863137792004",
        "url": "https://www.linkedin.com/in/rishen-dalmia?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAA_EbVwBlOCBTwHHWMc5C8oaynSFDRPqG-0",
        "name": "Rishen Dalmia\nRishen Dalmia",
        "content": "Unpopular opinion!\n\nAlways surround yourself with people who help you grow and not take you down.\n\nYour brand value takes time, efforts and more than that your “emotional attachment” with your work.\n\nDon’t let anyone else ruin it. Choose wisely with whom you hang out with! :)",
        "reactions": {
          "likes": "37",
          "comments": "4 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "\"Surrounding yourself with the right people is key to growth. Positive environments fuel success!\"",
            "userName": "Shubhangi Shrivastava",
            "userProfileURL": "https://www.linkedin.com/in/shubhangi-shrivastava-39161bb7",
            "dataId": "urn:li:comment:(activity:7295462845066969088,7295464189853097985)"
          }
        ],
        "commentAdded": "Absolutely agree! Surrounding yourself with growth-minded individuals is crucial for personal and professional development. Choose wisely! 😊"
      },
      {
        "postId": "urn:li:activity:7295465768111001603",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295465768111001603",
        "url": "https://www.linkedin.com/in/maxpashman?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABQIih8B5r2xcOUC4SEvcv6NQSjaD4nC2AM",
        "name": "Max Pashman, CFP®\nMax Pashman, CFP®",
        "content": "If you're single this Valentine's Day, just remember that compounding interest still loves you. \n\nAnd if you need some help with a Valentine's card for your financial love, here you go!\n\nWhich one is your favorite?",
        "reactions": {
          "likes": "17",
          "comments": "19 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Which one of these did you like the most?",
            "userName": "Max Pashman, CFP®",
            "userProfileURL": "https://www.linkedin.com/in/maxpashman",
            "dataId": "urn:li:comment:(ugcPost:7295462058383355905,7295462709305712642)"
          },
          {
            "commentText": "Christopher Nelson Glad you like that one! ",
            "userName": "Max Pashman, CFP®",
            "userProfileURL": "https://www.linkedin.com/in/maxpashman",
            "dataId": "urn:li:comment:(ugcPost:7295462058383355905,7295464713730015232)"
          },
          {
            "commentText": "You made me pick a favorite! They are all really good! ",
            "userName": "Christopher Nelson",
            "userProfileURL": "https://www.linkedin.com/in/christophercnelson",
            "dataId": "urn:li:comment:(ugcPost:7295462058383355905,7295465106044264448)"
          },
          {
            "commentText": "S/o Amanda Nielsen for the inspiration yesterday haha",
            "userName": "Max Pashman, CFP®",
            "userProfileURL": "https://www.linkedin.com/in/maxpashman",
            "dataId": "urn:li:comment:(ugcPost:7295462058383355905,7295464979300827137)"
          }
        ],
        "commentAdded": "Love this twist on Valentines! 💖 Compounding interest truly is the best long-term partner. Which card makes your heart skip a beat?"
      },
      {
        "postId": "urn:li:activity:7295329371748245505",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295329371748245505",
        "url": "https://www.linkedin.com/company/kpmgindia/posts",
        "name": "KPMG India\nKPMG India",
        "content": " Unveiling of the Hyderabad Software Enterprises Association - KPMG India - CBRE - Aon report, '𝐒𝐜𝐚𝐥𝐞@𝐇𝐲𝐝𝐞𝐫𝐚𝐛𝐚𝐝: 𝐆𝐥𝐨𝐛𝐚𝐥 𝐓𝐞𝐜𝐡𝐧𝐨𝐥𝐨𝐠𝐲 𝐃𝐞𝐬𝐭𝐢𝐧𝐚𝐭𝐢𝐨𝐧' at the 32 HYSEA National Summit & Awards 2025!\n\n Speaking about the report,, KPMG in India said, \"We hope that the Scale@Hyderabad report plays a role in attracting more\n, greater talent, and helps showcase\nas a top choice for any organisation considering investing in the\nand\necosystem in India.",
        "reactions": {
          "likes": "92",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Exciting to see the Scale@Hyderabad report launch! This will surely position Hyderabad as a premier global tech hub. Looking forward to the insights!"
      },
      {
        "postId": "urn:li:activity:7295458154006413312",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295458154006413312",
        "url": "https://www.linkedin.com/in/maththinking?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAD5LcBBZCNJ3T89euZhuJxAmL1RWcykg4",
        "name": "Ju Rao\nJu Rao",
        "content": "Neural Network Design - https://lnkd.in/e3RnWDQg\nLook for \"Read and Download Links\" section to download. Follow/Connect me if you like this post.\nhashtag",
        "reactions": {
          "likes": "9",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Exciting resource! Neural network design is crucial in todays tech landscape. Looking forward to diving into this! #NeuralNetworks"
      }
    ],
    "errors": [
      {
        "postId": "urn:li:activity:7295456649249529857",
        "url": "https://www.linkedin.com/in/madina-shaik?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAMt6EBi3qIcpvVfoL8w-6iIfHsEYsaaPA",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295321202296786945",
        "url": "https://www.linkedin.com/in/shalini-pillay-2b8803?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAedewBl7kxhHLXx6cg-9m9f5nu6ian6CE",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295438075592101888",
        "url": "https://www.linkedin.com/groups/12124577?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A12124577-7295438074426126336",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295437869597294592",
        "url": "https://www.linkedin.com/in/brianwsykes?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAXRYOcBGOrQ6Lxw96BA7IQD7eEHvYUXHq0",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295463863137792004",
        "url": "https://www.linkedin.com/in/rishen-dalmia?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAA_EbVwBlOCBTwHHWMc5C8oaynSFDRPqG-0",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295465768111001603",
        "url": "https://www.linkedin.com/in/maxpashman?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABQIih8B5r2xcOUC4SEvcv6NQSjaD4nC2AM",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295329371748245505",
        "url": "https://www.linkedin.com/company/kpmgindia/posts",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295458154006413312",
        "url": "https://www.linkedin.com/in/maththinking?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAD5LcBBZCNJ3T89euZhuJxAmL1RWcykg4",
        "errors": [
          "Failed to fetch media URL."
        ]
      }
    ]
  },
  {
    "postsData": [
      {
        "postId": "urn:li:activity:7295459097074642946",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295459097074642946",
        "url": "https://www.linkedin.com/in/chelsea-olsen-sales-growth?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAJMKJwBGPeVIrrJvvECqC3u_TiFoXLRIis",
        "name": "Chelsea Olsen\nChelsea Olsen",
        "content": "Women are better at predicting sales.\n\n(10% better to be exact.) \n\n𝗕𝘂𝘁 𝗼𝗻𝗹𝘆 19% 𝗼𝗳 𝘀𝗮𝗹𝗲𝘀 𝗹𝗲𝗮𝗱𝗲𝗿𝘀 𝗮𝗿𝗲 𝘄𝗼𝗺𝗲𝗻.\n\nA study analyzed how men and women approach sales forecasting.\n\nIt found that:\n\n- Men were more likely to use their intuition\n- Women relied more on the data and numbers\n- And were 10% more likely to provide accurate forecasts\n\nBut I didn’t need a study to tell me this.\n\nI’ve done a lot of forecasting over the years.\n\n- Used data\n- Been conversative\n- Used common sense\n\nAnd I’ve been right —\n\n(𝘰𝘳 𝘮𝘰𝘳𝘦 𝘳𝘪𝘨𝘩𝘵 𝘵𝘩𝘢𝘯 𝘵𝘩𝘦 𝘮𝘦𝘯 𝘸𝘰𝘳𝘬𝘪𝘯𝘨 𝘸𝘪𝘵𝘩 𝘮𝘦.) \n\nMoral of the story here,\nif you want spot-on sales predictions -\n\nFind a math loving lady like me.\n\nP.S. Did you know girls were also better at math?",
        "reactions": {
          "likes": "35",
          "comments": "25 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "respect! data-backed and crushing it",
            "userName": "Ronen R. Pessar",
            "userProfileURL": "https://www.linkedin.com/in/rpessar",
            "dataId": "urn:li:comment:(activity:7295457837638430720,7295459083464126464)"
          },
          {
            "commentText": "Ronen R. Pessar Yeah data is important!",
            "userName": "Chelsea Olsen",
            "userProfileURL": "https://www.linkedin.com/in/chelsea-olsen-sales-growth",
            "dataId": "urn:li:comment:(activity:7295457837638430720,7295459698495897600)"
          }
        ],
        "commentAdded": "Great insights! Its time we recognize and elevate womens contributions in sales forecasting—data-driven decisions truly make a difference! 📊👏"
      },
      {
        "postId": "urn:li:activity:7295464265904222208",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295464265904222208",
        "url": "https://www.linkedin.com/in/theangelngele?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADIlBjgBCu33RaaiWkBet0oUaLRthBR64R8",
        "name": "Angel Ngele\nAngel Ngele",
        "content": "Not believing in myself cost me years of growth. \n\nWhat could’ve been my breakthrough left me doubting myself.\n\nThis was years ago. I had just finished college at 19. A certified Bachelor of ICT. Young, hungry, and ready to take on the world.\n\nBut the world didn’t see it that way.\n\n\"You’re too young.\"\n\"Some things aren’t meant for you yet.\"\n\"Wait your turn.\"\n\nI let those words sink in. I played small. I stayed in my comfort zone. I had the skills, but I didn’t put myself out there as a personal growth coach and trainer. I thought I had to wait.\n\nLooking back, I was wrong.\n\nThe key is to start. To take the job. To launch the business. To step into the unknown.\n\nClarity unfolds when you take action.\n\nSo if you’re waiting for permission, this is it.\n\nStart now. Keep climbing. You’ll be amazed at how far you go. ️\n\n(I appreciate every repost ️)\n\nP.S. Have you ever held yourself back? Let’s talk. ",
        "reactions": {
          "likes": "11\nAngel Ngele and 10 others",
          "comments": "4 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "ASK ME ANYTHING AT ALL.\n\nIt's my way of giving back to the community, I'm here for you. It doesn't matter what, I'll answer truthfully.\n\nThe key is to be 1% better every day.\n\nI'm here for an hour to answer everyone. Love you all big. ️",
            "userName": "Angel Ngele",
            "userProfileURL": "https://www.linkedin.com/in/theangelngele",
            "dataId": "urn:li:comment:(activity:7295464191665016832,7295466316977565696)"
          }
        ],
        "commentAdded": "Inspiring journey! It’s a powerful reminder that taking action is the key to growth. Here’s to stepping into our potential! 🚀"
      },
      {
        "postId": "urn:li:activity:7295439722640719872",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295439722640719872",
        "url": "https://www.linkedin.com/company/coforge-tech/posts",
        "name": "Coforge\nCoforge",
        "content": "The road to Net Zero isn’t just about commitments—it’s about Execution. Execution. Execution.\n\nOn February 20th, we’re bringing together industry leaders at the Museum of London to cut through the noise and focus on what truly moves the needle post COP29.\n\nHow do we turn sustainability pledges into measurable action?\n\nWhat are the key challenges in implementing large-scale climate strategies? And most importantly—what’s next?\n\nJoin us for an exclusive session whereand other thought leaders break down the real-world blueprint for sustainable transformation.\n\nSecure your spot:",
        "reactions": {
          "likes": "16",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Excited for this event! Turning pledges into action is crucial for real impact. Looking forward to insightful discussions on sustainable transformation! 🌍"
      },
      {
        "postId": "urn:li:activity:7295456022456844288",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295456022456844288",
        "url": "https://www.linkedin.com/in/craigtingram?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAC12SoBZeLuTgIYyJtj282OyjM8pnN-tbA",
        "name": "Craig T. Ingram\nCraig T. Ingram",
        "content": "This post is NOT about politics....It's about the leadership component of what Pete is doing here. \nLeadership in action!!! ⤵️\n\nNotice the \"context\" of how Pete is leading people by integrating with them, getting to their heart, and connecting with them.\n\nIf the leadership in companies would do activities (in context of course) like this leader…we would see transformational changes in companies.\n\nWhat are you doing in your company (as a leader) to truly connect with your people doing the work to make you millions of dollars?",
        "reactions": {
          "likes": "7",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/825c7d11-5d5c-4f08-b30f-d283608efd66",
        "comments": [
          {
            "commentText": "Interesting. Elon Musk has been hired to cut waste in government. It cost us 6.3 million dollars to change the name from Fort Bragg (my old post, right there on Ardennes!) to Fort Liberty. Within a couple of weeks of being given this position, the new Sec of Defense has made a \"command decision?\" to spend an additional (??? 6.3 million again???) to change the name back. That's leadership in action. If you believe that, I've got some swampland in Gaza I can sell you.",
            "userName": "Robert Rhodes",
            "userProfileURL": "https://www.linkedin.com/in/roberterichrhodes",
            "dataId": "urn:li:comment:(ugcPost:7295427660602646528,7295430721114914817)"
          }
        ],
        "commentAdded": "Great point! True leadership thrives on genuine connections. Lets prioritize empathy and engagement to drive meaningful change in our teams!"
      },
      {
        "postId": "urn:li:activity:7295267897558368256",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295267897558368256",
        "url": "https://www.linkedin.com/company/kpmgindia/posts",
        "name": "KPMG India\nKPMG India",
        "content": "️ The advent of  \nhashtag\n#deepfake  has raised global concern as it is being consistently exploited for harmful purposes.\n\n️ Societal impacts include the\nin media and institutions.\n\n️\narise as deepfakes can be used to manipulate personal images without\n.\n\nRead on for more insights in's publication 'Deepfake - How real is it?'",
        "reactions": {
          "likes": "27",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "“Deepfakes present significant ethical challenges. It’s crucial to stay informed about their impact on trust in media and personal privacy. #Deepfake”"
      },
      {
        "postId": "urn:li:activity:7295339466959867904",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295339466959867904",
        "url": "https://www.linkedin.com/company/clear-trust-cc/posts",
        "name": "ClearTrust\nClearTrust",
        "content": "Did you know that up to 25% of leads can be fraudulent, impacting your marketing ROI? \nWe're curious, what's your biggest challenge in combating lead fraud?\nVote in our poll and share your experiences in the comments below! Let's work together to find effective solutions. ",
        "reactions": {
          "likes": "8",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Great insight! Lead fraud is a real challenge. I look forward to hearing everyones experiences and solutions. Lets tackle this together!"
      },
      {
        "postId": "urn:li:activity:7295466489304727552",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295466489304727552",
        "url": "https://www.linkedin.com/in/angelagillnelms?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAkdZI0BRIXsVQk88XGJqfr-PLk6wp0ZhLo",
        "name": "Angela Gill Nelms\nAngela Gill Nelms",
        "content": "Advancing cures has been at the heart of what Florence Healthcare does since day one. I hope you will take advantage of this generous opportunity!!",
        "reactions": {
          "likes": "0",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Exciting to see Florence Healthcares commitment to advancing cures! This opportunity can truly make a difference. Let’s seize it!"
      },
      {
        "postId": "urn:li:activity:7294986420127997953",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294986420127997953",
        "url": "https://www.linkedin.com/showcase/et-auto/posts",
        "name": "ETAuto\nETAuto",
        "content": "Is India’s largest passenger vehicle maker Maruti Suzuki late to the EV party? How does it plan to compete, and win customers in the emerging segment? Sandeep Raina, Head – Product Planning, Maruti Suzuki India answers them, and also talks about the development journey for Suzuki’s first-ever born-electric model e Vitara, and what lies ahead, in an exclusive interview.\n\nWatch at:",
        "reactions": {
          "likes": "70",
          "comments": "2 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/974dc8fc-7d3e-42f6-a90f-e01df7a62f3a",
        "comments": [
          {
            "commentText": "I agree he needs IndiaEV.com",
            "userName": "Yves Ev",
            "userProfileURL": "https://www.linkedin.com/in/yves-ev-b3bb81225",
            "dataId": "urn:li:comment:(ugcPost:7294986346874466305,7295101393856581632)"
          },
          {
            "commentText": "Insightful",
            "userName": "MANISH HAZELA",
            "userProfileURL": "https://www.linkedin.com/in/manish-hazela-660b6b15",
            "dataId": "urn:li:comment:(ugcPost:7294986346874466305,7295003531185463296)"
          }
        ],
        "commentAdded": "Exciting insights from Sandeep Raina! Its crucial for Maruti Suzuki to innovate in the EV space. Looking forward to the e Vitaras impact! 🚗💡"
      },
      {
        "postId": "urn:li:activity:7295417162284810240",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295417162284810240",
        "url": "https://www.linkedin.com/company/finocontrol/posts",
        "name": "Finocontrol®\nFinocontrol®",
        "content": " Union Budget 2025-26: Key Updates \n\nThe new Union Budget brings bold tax cuts, rural boosts, and major infrastructure investments. Ready for a new growth era? Let’s explore how these changes will drive progress and empower every Indian.\n\n Smart reforms in taxes, agriculture, and infrastructure are set to power inclusive growth. Get the insights you need to stay ahead of the curve.\n\n Stay informed with the latest finance updates. Followfor expert analysis and insightful finance content.\n\n Want to become an expert in financial modeling & valuations? Join’s Certified Financial Modeling & Valuations Analyst Programme to enhance your skills and career prospects:",
        "reactions": {
          "likes": "12",
          "comments": "3 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Insightful read",
            "userName": "Tejaswee Tripathy",
            "userProfileURL": "https://www.linkedin.com/in/tejaswee-tripathy",
            "dataId": "urn:li:comment:(ugcPost:7295415809290514433,7295417142571634688)"
          }
        ],
        "commentAdded": "Exciting updates! These reforms could truly transform our economic landscape. Looking forward to seeing their impact on growth and empowerment!"
      },
      {
        "postId": "urn:li:activity:7295109081223049216",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295109081223049216",
        "url": "https://www.linkedin.com/in/tomaszboinski?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAT6i3EBTB8A6x-CZu_4t39xy5C77FfuZhM",
        "name": "Tomasz Boinski\nTomasz Boinski",
        "content": " LISA - Stanford GSB LEAD Incubator & Startup Accelerator 5𝐭𝐡 𝐀𝐧𝐧𝐢𝐯𝐞𝐫𝐬𝐚𝐫𝐲 𝐂𝐞𝐥𝐞𝐛𝐫𝐚𝐭𝐢𝐨𝐧  Happy to share, I'm invited as one of the Top Stanford GSB Startups incubated at LISA! Let's go️‍",
        "reactions": {
          "likes": "62",
          "comments": "22 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "LISA, the incubator & startup accelerator, is a Stanford Alumni Innovation Hub empowering seasoned professionals to launch global startups. Read more here: https://www.gsb-lead-lisa.com/",
            "userName": "Tomasz Boinski",
            "userProfileURL": "https://www.linkedin.com/in/tomaszboinski",
            "dataId": "urn:li:comment:(activity:7295109081223049216,7295112542987722752)"
          },
          {
            "commentText": "Excellent Tomasz Boinski, huge congratulations! ",
            "userName": "✨ Christelle Mombo-Zigah",
            "userProfileURL": "https://www.linkedin.com/in/christellemombozigah",
            "dataId": "urn:li:comment:(activity:7295109081223049216,7295196986402553856)"
          },
          {
            "commentText": " Christelle Mombo-Zigah ",
            "userName": "Tomasz Boinski",
            "userProfileURL": "https://www.linkedin.com/in/tomaszboinski",
            "dataId": "urn:li:comment:(activity:7295109081223049216,7295198843963326465)"
          }
        ],
        "commentAdded": "Congratulations on this amazing achievement! Excited to see your contributions to the startup ecosystem grow through LISA! 🎉🚀"
      },
      {
        "postId": "urn:li:activity:7295117652904058880",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295117652904058880",
        "url": "https://www.linkedin.com/in/duke-rem-%F0%9F%90%A2-793616267?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAEFotd8BDwR_osR-3ROnxQtd2JpPvWbizfw",
        "name": "Duke Rem 🐢\nDuke Rem 🐢",
        "content": "Intel Loses Another Key Executive, Hotard Appointed as Nokia’s New CEO\n\nIntel loses another key executive as Justin Hotard, head of its Data Center and AI (DCAI) division, leaves the chip giant to become the next CEO of Nokia. Hotard’s appointment comes at a difficult time for Intel, which is facing challenges in its data center business. Key points: Justin Hotard is leaving Intel to become CEO of Nokia, effective April 1. Hotard had overseen Intel’s DCAI division, scoring major launches. Intel is grappling with challenges in the area...\n\n[please read our full article by clicking the link below ⬇️]\n\n️If you've made it this far, it seems the post caught your interest! Please consider liking, sharing, or dropping your thoughts in the comments.\n\nHere's why:\n\nIt helps spread the ideas and solutions I feature, amplifying their impact.\n\nYour feedback lets me know instantly if my content resonates with you, helping me improve and bring more of what you enjoy!\n\nBut above all...Please follow me for daily news and insights about AI\n\n Thank you!",
        "reactions": {
          "likes": "1",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Exciting times for Nokia with Justin Hotard at the helm! His leadership experience will be pivotal as they navigate the current landscape. 🚀"
      },
      {
        "postId": "urn:li:activity:7295446512988237824",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295446512988237824",
        "url": "https://www.linkedin.com/company/audience-reports/posts",
        "name": "Audience Reports\nAudience Reports",
        "content": "Grandhi Praveen The Transformative Power of Tech Events - Audience Reports \nhashtag\n#love \nhashtag\n#audiencereports \nhashtag\n#brands \nhashtag\n#professionals",
        "reactions": {
          "likes": "3\nGrandhi Praveen and 2 others",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Absolutely agree, Praveen! Tech events are a game-changer for brands and professionals alike. Excited to see how audience insights transform our approaches! #audiencereports"
      },
      {
        "postId": "urn:li:activity:7295456732414189569",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295456732414189569",
        "url": "https://www.linkedin.com/in/manojkondreddygari?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAC9N8wUB6nK99FI9QPm5qrwC-WnYpdjzAbQ",
        "name": "Manoj Kondreddygari\nManoj Kondreddygari",
        "content": " AI Agents: The New Industrial Revolution \n\nAI agents are transforming industries faster than ever—Salesforce plans zero software engineer hires by 2025, Intel cut 15% of its workforce (15,000 jobs). But this isn’t doom and gloom—it’s a golden era for creators. Stay tuned for actionable insights! \n\n What Exactly Are AI Agents?\n\nAutonomous systems that:\n• Perceive environments (sensors, data)\n• Make decisions (algorithms, learning)\n• Take action (task execution)Your smart thermostat? Basic AI agent. Now imagine this scaled to healthcare diagnostics or software engineering! \n\n\n↔️ Horizontal vs. Vertical AI: The Great Divide\n\nHorizontal (ChatGPT/Gemini):\n• Broad, adaptable across industries\n• Quick implementation, less customizationVertical (Medical imaging AI):\n• Hyper-specialized solutions• Requires domain expertiseWhich will dominate your field? \n\n\n⏳ Dot-Com Bubble 2.0? Here’s Why Not...\n\n50-60% of internet startups died post-2000 crash, but survivors like Amazon/Google birthed new ecosystems. AI’s shakeup differs:\n• Tools democratize creation (3-hour app builds!)\n• Niche markets = massive opportunitiesAdaptation > Panic ️\n\n Survival Guide for the AI Era\n• Upskill relentlessly (no-code tools matter!)\n• Measure productivity, not tenure\n• Solve micro-problems big corps ignoreRecent example: I built a writing-style analyzer using Replit/Vercel AI agents in 3 hours—zero coding! ️\n\n\n Creator Economy 2.0: Your Playbook\n\n5-year prediction:\n• Everyone becomes creator and consumer\n• AI handles 80% of grunt work\n• Success = spotting gaps + rapid prototypingReady to build? I’m drafting a free guide on launching AI tools—no budget or CS degree needed! \n\n\n Let’s Discuss!\n\n• Will vertical AI dominate your industry?\n• What niche could YOU serve with AI?\n• Fears vs. excitement about job shifts?Drop your thoughts below—let’s crowdsource the future! \n\n Follow Me For:\n\n• Step-by-step AI app tutorials\n• Real-time industry disruption analysis\n• Memes that make you snort-laughTogether, we’ll ride this wave—not drown in it. \n\n Coming Next:\n\n“Build Your First AI Tool in 1 Hour” guide drops Thursday. Hit follow so you don’t miss the code-free framework that got me 10K beta users! Let’s turn disruption into advantage—one thread at a time",
        "reactions": {
          "likes": "1 comment",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "In-Depth analysis: https://bit.ly/3EwzSd2",
            "userName": "Manoj Kondreddygari",
            "userProfileURL": "https://www.linkedin.com/in/manojkondreddygari",
            "dataId": "urn:li:comment:(ugcPost:7295456731302703104,7295456754853629953)"
          }
        ],
        "commentAdded": "Exciting times ahead! Embracing AIs potential is key. Cant wait for your guide—building tools without coding opens up endless opportunities! 🚀"
      },
      {
        "postId": "urn:li:activity:7295457372162953216",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295457372162953216",
        "url": "https://www.linkedin.com/in/lukewilsonsignpostceo?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAfuI5kBl2qBFzTl1Tb5LL34gufpdEd9q-c",
        "name": "Lucas Wilson\nLucas Wilson",
        "content": "Stop Telling—Start Asking\n\nToo many leaders believe their job is to give answers. The truth? Your real power is in the questions you ask.\n\nThink about the difference:\n “We need to change this approach.” (Directive, no buy-in)\n “What happens if we continue this approach for the next 6 months?” (Forces reflection & ownership)\n\nWhen you ask the right questions, you don’t just get compliance—you get commitment. People see the path, not because you told them, but because they realized it themselves.\n\nTry this today: Instead of giving an answer, ask a question that leads your team to the right conclusion. You’ll be amazed at the difference.\n\nWhat’s a question that’s helped you drive action? Drop it below!",
        "reactions": {
          "likes": "0",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Great perspective! Asking the right questions truly empowers teams. One that works for me: What opportunities do we see in this challenge?"
      },
      {
        "postId": "urn:li:activity:7295426471886475265",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295426471886475265",
        "url": "https://www.linkedin.com/in/clairemdavis?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAFCGXoB6nWioiigFFst9Mz-mJ5Ku6Q5o1Q",
        "name": "✒️Claire M. Davis🖋️\n✒️Claire M. Davis🖋️",
        "content": "After a layoff\nyou may start to wonder\nif another company will 'take a chance' on you.\n\n>> Even when you've won multiple P-Club Awards\n>> Crushed your stretch and team goals\n>> Been voted MVP by your team\n\nyou know you're good\nyou've been a rock for your team\nyou know you've helped doctors and patients\n\nSo when you hit this speed bump, why is it so hard to tell your own story?\n\nBc we're focusing on what's behind us -- not what's ahead.\n\nIt sounds like \"25 years of experience with proven sales results.\"\n\nAnd it's not helping you stand out.\n\n_______________________________\n\nThe thing is, you don't just need a way to ChatGPT or \"wordsmith yourself out of a tough spot.\"\n\nYou must change your focus.\n\nFrom PAST to FUTURE\n\n_______________________________\n\nAnd if you're getting stuck coming in 2nd over and over again, it's likely you're focusing on the PAST -- not what you can deliver to the FUTURE in the field of healthcare and medical sales.\n\nThe way YOU WILL:\n\n>> Help a VP of Sales interrupt the slow decline of the East or West Region while they're patiently waiting for new data to come out\n\n(and btw, here's how you've done things like that before)\n\n>> Deliver untapped methods of getting lifesaving tech in front of impossible-to-see doctors\n\n(these ones at these places, specifically)\n\n>> Reunite a team that doesn't get along\n\n(and this was the result of that new camaraderie)\n\n>> maybe the way you'll help someone think differently about their story, too <<\n_______________________________\nFocus on the future.\nFind someone who can tell your story.\nAnd for goodness sakes,\ndon't give up on your search.\n\nWe need you out there.\nI need you out there.\nYou can do this.\n\nAnd the future of healthcare depends on you.\n_______________________________",
        "reactions": {
          "likes": "17",
          "comments": "6 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/3f317a3b-ec3e-430d-9466-9d0fbe5d51b7",
        "comments": [
          {
            "commentText": "️Claire M. Davis️ I hear from \"older\" medical reps all the time who are convinced that it's their age that keeps them from landing a position. This is something everyone will face at some point if they're planning to remain in the career. I know this is something that many would love to hear any stories about and your perspective as well in a post sometime.",
            "userName": "Mace Horoff",
            "userProfileURL": "https://www.linkedin.com/in/macehoroff",
            "dataId": "urn:li:comment:(ugcPost:7290522182567280640,7295441807029534722)"
          }
        ],
        "commentAdded": "Absolutely inspiring! Shifting focus to future contributions can unlock new opportunities. Your impact in healthcare is needed now more than ever!"
      },
      {
        "postId": "urn:li:activity:7295456596573204480",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295456596573204480",
        "url": "https://www.linkedin.com/in/matthew-archer-991a6115?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAMuej0BrTdV7h0mXVotwOeObOO8riZK758",
        "name": "Matthew Archer\nMatthew Archer",
        "content": "Corporate America is trapped in the great meeting lie: \n\nWe mistake talking for progress.\n\nWe sit in a glass-walled conference room, nodding at slides, rehashing old ideas, adding our two cents… and somehow, we convince ourselves this is work.\n\nIt’s not.\n\nReal work produces movement.\nReal work creates clarity.\nReal work solves problems.\n\nBut most meetings do none of these things. Instead, we:\n\n Keep stacking meetings on top of meetings, like a Jenga tower of wasted time.\n Add more attendees so no one feels left out—but fewer people feel responsible.\n Spend more time debating who owns what than actually doing the work.\n\nThe result? An echo chamber of inefficiency.\n\n Employees spend an average of 31 hours a month in meetings they rate as unproductive.\n Companies lose $25,000 per employee per year due to bad meetings.\n And the worst part? No one stops the cycle.\n\nWe know meetings are broken, but we keep showing up, performing our roles, and booking the next one.\n\nThe fix isn’t better scheduling. It’s fundamental change.\n\n If a meeting doesn’t lead to a decision, it shouldn’t be on the calendar.\n If no one is accountable, no one should be there.\n If the loudest voice always wins, the best ideas are being lost.\n\nTalking feels like progress. But progress only happens when decisions turn into action.\n\nWhat’s one thing you’ve done to break the cycle of useless meetings?",
        "reactions": {
          "likes": "5",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Completely agree! I've recently been in 3 meetings that went in circles creating lists of To-Dos only to come to the next meeting with the same list... almost no progress was made. Very frustrating!",
            "userName": "Lacey Archer",
            "userProfileURL": "https://www.linkedin.com/in/lacey-archer-7b13a943",
            "dataId": "urn:li:comment:(activity:7295415113228955648,7295468160768487426)"
          }
        ],
        "commentAdded": "Great insights! To combat this, Ive started implementing clear action items at the end of each meeting, ensuring accountability and real progress."
      },
      {
        "postId": "urn:li:activity:7295459841240702977",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295459841240702977",
        "url": "https://www.linkedin.com/in/oliverjohnsonnn?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADeNEJQBqgXX6QYCijyWLKyFeF4ZaTVecGs",
        "name": "Oliver Johnson\nOliver Johnson",
        "content": "Salespeople… Watch me book a meeting with a head of sales on a LIVE cold call below. \n\n\nWhile yes, I did book the meeting - there’s always room for improvement. Here is the good AND the bad from the call.\n\nThe GOOD:\n\n1. Got him to visit the website.\n\nOne of the most unique aspects aboutis that you can live video call prospects on your website. The fact that I was able to show him this on the initial cold call, is a perfect way to build intrigue to ensure that he actually shows up to the meeting.\n\n2. Calm and collected tone.\n\nI think this call was a good example of how important it is to have a calm and collected tone to disarm prospects and show them you’re a real HUMAN - not some sleazy telemarketer.\n\n3. ASKED for the meeting when I knew he was interested.\n\nSo often reps will wait TOO long to ask for the meeting - even when the prospect is clearly interested. I think I asked for the meeting at the perfect time during this call in particular.\n\nThe BAD:\n\n1. Could have probed for more pain.\n\nDefinitely could have led with more pain to ensure there was a real problem to be solved.\n\n\nAll in all, I’d consider this a pretty successful cold call.\n\n,,,,,,,,What do you think of the call?",
        "reactions": {
          "likes": "24",
          "comments": "24 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/b9595945-8f92-44d7-a6d5-225a673957c1",
        "comments": [
          {
            "commentText": "Settle something for me Oliver Johnson before you called em up did you do a little pre research or nah? CC:Ronen R. Pessar  P.S. Dope you went right in and got to it! Such a sick product and if you can get them to see it LIVE its even better! Nice work man",
            "userName": "🔥 Tom Slocum",
            "userProfileURL": "https://www.linkedin.com/in/tomslocum",
            "dataId": "urn:li:comment:(ugcPost:7295456268079534081,7295465682656260097)"
          }
        ],
        "commentAdded": "Great insights! Your ability to balance confidence and humility is key. Excited to see how you refine your approach even further!"
      },
      {
        "postId": "urn:li:activity:7295465278434332672",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295465278434332672",
        "url": "https://www.linkedin.com/in/yash-gupta-115728294?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAEdMbKEBUHYbmmhRUezMh7FBr-cIk1M-WtM",
        "name": "Yash Gupta\nYash Gupta",
        "content": "Exciting News!\n\nI am thrilled to share that I have successfully completed a One-month Virtual Internship in AI/ML at(02/01/25 - 31/01/25), where I had the opportunity to enhance my knowledge and skills in&.\n\nThroughout this internship, I delved deep into supervised learning, deep learning, and computer vision, gaining hands-on experience with neural networks, model optimization techniques, and real-world AI applications.\n\nAs a part of my journey, I developed a Facial Emotion Recognition project, where my model achieved an outstanding 99% accuracy! This project leveraged TensorFlow, OpenCV, and Streamlit, showcasing how AI can effectively interpret human emotions from facial expressions.\n\nA huge thanks to ShadowFox and Mr.Aakash S for this incredible learning experience! Looking forward to applying these skills to more exciting AI/ML projects.",
        "reactions": {
          "likes": "0",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Congratulations on this impressive achievement! Your project sounds fascinating and showcases the real impact of AI in understanding human emotions!"
      },
      {
        "postId": "urn:li:activity:7295464804004028435",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295464804004028435",
        "url": "https://www.linkedin.com/in/chrisicarver?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAACrKQgBOLd29JhcU6joKGBrDrcklcngi8E",
        "name": "Chris Carver\nChris Carver",
        "content": "How do you get the most ROI out of your content?\n\nSay it with me...\n\n“The best content comes from the stories and experiences of real people”\n\nThis quote seems to sum it up for me.\n\nAnd the answer for marketing teams is right in front of them.\n\n- Their Event Marketing counterparts and the Speaker Network they have worked so hard to develop.\n\nWhy:\n- Your speakers and their expertise, authority and networks are what Google and LinkedIn Value.\n\n- Your speakers (both internal and external) are the SME’s, Influencers, Thought leaders and Content Creators in our respective markets.\n\n-They want to share their knowledge and the right companies give them another platform to stand out.\n\nSpeakers want to Speak - Harness that.",
        "reactions": {
          "likes": "7\nEric Giguere and 6 others",
          "comments": "2 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Great insights! Harnessing speaker expertise can truly elevate content strategy. What’s your favorite success story?",
            "userName": "Eric Giguere",
            "userProfileURL": "https://www.linkedin.com/in/egiguere",
            "dataId": "urn:li:comment:(activity:7295455368564887552,7295464778536275968)"
          }
        ],
        "commentAdded": "Absolutely! Leveraging the stories of speakers not only enhances content but also builds genuine connections. Let’s empower those voices!"
      },
      {
        "postId": "urn:li:activity:7295465011534020609",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295465011534020609",
        "url": "https://www.linkedin.com/in/josemarquezleon?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAiV7gB99rSZkYx68zcP9EpMKL5VJUIl0Y",
        "name": "Dr. Jose Marquez - Leon, PhD\nDr. Jose Marquez - Leon, PhD",
        "content": "More challenging costs ahead.",
        "reactions": {
          "likes": "0",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/83b6ef60-755d-445f-881b-a6a8e928aab4",
        "comments": [],
        "commentAdded": "Absolutely! Navigating financial challenges requires innovation and resilience. Let’s embrace these hurdles and find new opportunities together!"
      }
    ],
    "errors": [
      {
        "postId": "urn:li:activity:7295459097074642946",
        "url": "https://www.linkedin.com/in/chelsea-olsen-sales-growth?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAJMKJwBGPeVIrrJvvECqC3u_TiFoXLRIis",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295464265904222208",
        "url": "https://www.linkedin.com/in/theangelngele?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADIlBjgBCu33RaaiWkBet0oUaLRthBR64R8",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295439722640719872",
        "url": "https://www.linkedin.com/company/coforge-tech/posts",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295267897558368256",
        "url": "https://www.linkedin.com/company/kpmgindia/posts",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295339466959867904",
        "url": "https://www.linkedin.com/company/clear-trust-cc/posts",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295466489304727552",
        "url": "https://www.linkedin.com/in/angelagillnelms?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAkdZI0BRIXsVQk88XGJqfr-PLk6wp0ZhLo",
        "errors": [
          "Failed to fetch reactions.",
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295417162284810240",
        "url": "https://www.linkedin.com/company/finocontrol/posts",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295109081223049216",
        "url": "https://www.linkedin.com/in/tomaszboinski?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAT6i3EBTB8A6x-CZu_4t39xy5C77FfuZhM",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295117652904058880",
        "url": "https://www.linkedin.com/in/duke-rem-%F0%9F%90%A2-793616267?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAEFotd8BDwR_osR-3ROnxQtd2JpPvWbizfw",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295446512988237824",
        "url": "https://www.linkedin.com/company/audience-reports/posts",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295456732414189569",
        "url": "https://www.linkedin.com/in/manojkondreddygari?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAC9N8wUB6nK99FI9QPm5qrwC-WnYpdjzAbQ",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295457372162953216",
        "url": "https://www.linkedin.com/in/lukewilsonsignpostceo?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAfuI5kBl2qBFzTl1Tb5LL34gufpdEd9q-c",
        "errors": [
          "Failed to fetch reactions.",
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295456596573204480",
        "url": "https://www.linkedin.com/in/matthew-archer-991a6115?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAMuej0BrTdV7h0mXVotwOeObOO8riZK758",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295465278434332672",
        "url": "https://www.linkedin.com/in/yash-gupta-115728294?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAEdMbKEBUHYbmmhRUezMh7FBr-cIk1M-WtM",
        "errors": [
          "Failed to fetch reactions.",
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295464804004028435",
        "url": "https://www.linkedin.com/in/chrisicarver?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAACrKQgBOLd29JhcU6joKGBrDrcklcngi8E",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295465011534020609",
        "url": "https://www.linkedin.com/in/josemarquezleon?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAiV7gB99rSZkYx68zcP9EpMKL5VJUIl0Y",
        "errors": [
          "Failed to fetch reactions."
        ]
      }
    ]
  },
  {
    "postsData": [
      {
        "postId": "urn:li:activity:7295460436005593088",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295460436005593088",
        "url": "https://www.linkedin.com/company/spinsci-technologies-llc/posts",
        "name": "SpinSci Technologies LLC\nSpinSci Technologies LLC",
        "content": "A leading health system needed a solution for their outdated attendant console, integrating Epic and Cisco telephony together, but faced challenges with their legacy systems. With SpinSci’s Operator Console, they achieved a full replacement of their legacy attendant console in just under 8 weeks—streamlining operations and improving efficiency for the IT staff and end users.\n\n The impact?\n• Reduced call transfer rates, boosting patient satisfaction\n• Increased speed to answer, enhancing operational efficiency\n• Future-ready solution enabling a smooth transition to cloud telephony\n\nLearn more about Operator Console at",
        "reactions": {
          "likes": "1",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Impressive transformation! 🚀 SpinSci’s Operator Console not only modernizes operations but also enhances patient satisfaction—an essential win for healthcare!"
      },
      {
        "postId": "urn:li:activity:7295430202984161285",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295430202984161285",
        "url": "https://www.linkedin.com/company/kpmgindia/posts",
        "name": "KPMG India\nKPMG India",
        "content": "⭐ According to the group of high performers in KPMG's research, 𝐟𝐫𝐞𝐪𝐮𝐞𝐧𝐭 𝐝𝐚𝐭𝐚-𝐜𝐞𝐧𝐭𝐫𝐢𝐜 𝐞𝐯𝐚𝐥𝐮𝐚𝐭𝐢𝐨𝐧 is one of the two effective tactics for achieving quick wins from \nhashtag\n.\n\n️ 53% tech executives are strategically evaluating their\nportfolio to ensure it is aligned with their long-term goals.\n\n️ 70% ensure that their tech investments directly target their\nand\n.\n\n For more insights, read the KPMG global\n2024",
        "reactions": {
          "likes": "12",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Great insights! Data-centric evaluation is key to aligning tech investments with long-term goals. Excited to see the full KPMG report! 🚀"
      },
      {
        "postId": "urn:li:activity:7295454207321538561",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295454207321538561",
        "url": "https://www.linkedin.com/company/plazo-sullivan-roche-capital/posts",
        "name": "Plazo Sullivan Roche Capital\nPlazo Sullivan Roche Capital",
        "content": "The US CPI data is scheduled to be released today at 7:00 PM IST.\n\nThe\nmarket can either PUMP or DUMP.\n\nExpectations: 𝟮.𝟵%\nLast Month: 𝟮.𝟵%\n\nBelow 2.9%:  Bullish (e.g., 2.5% = strong upside)\nAbove 2.9%:  Bearish (e.g., 3.5% = sharp downside)\n\nStay frosty!",
        "reactions": {
          "likes": "247",
          "comments": "9 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "we need a low print so the FED gets us cuts",
            "userName": "Svitlana Lysianska",
            "userProfileURL": "https://www.linkedin.com/in/svitlana-lysianska-89a522329",
            "dataId": "urn:li:comment:(ugcPost:7295394840228298752,7295397391568908288)"
          }
        ],
        "commentAdded": "Exciting times ahead! Market reactions can be unpredictable. Lets see how the CPI data influences todays trends. Stay alert! 📊"
      },
      {
        "postId": "urn:li:activity:7295095588566540288",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295095588566540288",
        "url": "https://www.linkedin.com/groups/3416532?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A3416532-7295095587606007808",
        "name": "Digital Marketing Group - #1 Internet Online Advertising SEO Social Media Mobile\nDigital Marketing Group - #1 Internet Online Advertising SEO Social Media Mobile",
        "content": "LinkedIn isn’t anymore a platform \nfor job seekers… it’s a stage for leaders, \ninnovators, and professionals to showcase what \n\nmakes them stand out.\n\nYour skills,\n\nyour story,\n\nand your personal brand are your biggest assets.\n\n\nHere’s how you can make LinkedIn work for you:\n\n1️⃣ Highlight Your Wins:\nWhether it’s a project you led, a problem you solved, or a milestone you reached, share it! People want to connect with success stories.\n\n\n2️⃣ Engage With Your Network:\nStart meaningful conversations, comment thoughtfully, and add value to others’ posts. Networking isn’t about taking—it’s about giving.\n\n\n3️⃣ Be Consistent:\nYour personal brand is built over time. Post regularly, share insights, and let your audience see the professional (and human) behind the profile.\n\n\nLinkedIn success doesn’t\n\nhappen overnight,\n\nbut with the right approach,\n\nyour audience will grow…\n\nand so will your opportunities.\n\nHow are you promoting yourself today?\n\nLet’s hear it!",
        "reactions": {
          "likes": "9\nMarianna Outsia and 8 others",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Great insights! 👏 Consistency and genuine engagement are key to building a strong personal brand. What steps are you taking to shine on LinkedIn?"
      },
      {
        "postId": "urn:li:activity:7290722950276677632",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290722950276677632",
        "url": "https://www.linkedin.com/company/coforge-tech/posts",
        "name": "Coforge\nCoforge",
        "content": "We're thrilled to announce our strategic partnership with Intellect Design Arena Ltd to transform Global Banking and Financial Services. This collaboration leverages Intellect’s cutting-edge platforms,—a first-principles-based open finance platform, and iTurmeric—a low-code integration suite, to enable financial institutions to modernize systems with minimal disruption, seamlessly digitize operations, launch differentiated products, and innovate new experiences using data and generative AI.\n\nCombining Coforge’s deep expertise in delivering complex techno-functional solutions with Intellect’s financial technology, this collaboration empowers financial institutions across\n,\n,\n, and the\nto build agile, efficient, and customer-centric operational models. The iTurmeric low-code suite, with 300+ microservices and 500+ events, accelerates the delivery of business solutions and next-gen platforms.\n\n️ Read the full press release hereand DM us for a demo/consultation with our Banking & Financial Services experts.\n\n\n\n,,,, and",
        "reactions": {
          "likes": "122",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Excited about this partnership and its impact on accelerating our clients' transformation. Let's go! Suresh Iyengar",
            "userName": "Ashish K.",
            "userProfileURL": "https://www.linkedin.com/in/ashish-k-7103692",
            "dataId": "urn:li:comment:(activity:7290722950276677632,7290730071315603456)"
          }
        ],
        "commentAdded": "Exciting news! This partnership is set to redefine the future of banking. Looking forward to seeing the innovations that emerge! #FinTech #Collaboration"
      },
      {
        "postId": "urn:li:activity:7295229395223384065",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295229395223384065",
        "url": "https://www.linkedin.com/in/jameilpendleton?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADc76gBtlXMB9e-m1k678LFSWDhlyGXPuo",
        "name": "Jameil ‘Jay’ Pendleton™\nJameil ‘Jay’ Pendleton™",
        "content": "Cuts will come, are you safe?\n\n⤵️\n\nI made a video you reps/managers out there navigating this frenzy of M&A in MSK…",
        "reactions": {
          "likes": "16",
          "comments": "4 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/141153f9-a5f9-440f-888d-f8b0b3207288",
        "comments": [
          {
            "commentText": "Get good at converting that value into words! Great insights here, Jameil ‘Jay’ Pendleton™!",
            "userName": "✒️Claire M. Davis🖋️",
            "userProfileURL": "https://www.linkedin.com/in/clairemdavis",
            "dataId": "urn:li:comment:(ugcPost:7295203521103065092,7295229382476935170)"
          }
        ],
        "commentAdded": "Great insight! Navigating M&A can be challenging. Your video will definitely help us stay informed and prepared. Thank you for sharing!"
      },
      {
        "postId": "urn:li:activity:7295460644437291008",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295460644437291008",
        "url": "https://www.linkedin.com/in/alaqsha-qadeer-2001?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACeQJIIBr3oxAZWdg6fE1XPZf9whBXcxON8",
        "name": "Alaqsha Qadeer\nAlaqsha Qadeer",
        "content": "Swiggy sent me a Rose… and Now I’m Blushing! \n\nWhen your grocery delivery comes with a rose, you know you’ve picked the right app! ️\n\nThanks,, for this lovely surprise. Turns out, you don’t need a date to feel special—just a grocery order! ",
        "reactions": {
          "likes": "64",
          "comments": "2 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Something is fishy! You checked if delivery partner didn't do that? :P",
            "userName": "Mohd Mohtashim N.",
            "userProfileURL": "https://www.linkedin.com/in/mohd-mohtashim-nawaz",
            "dataId": "urn:li:comment:(activity:7295426495404023808,7295455535674400769)"
          },
          {
            "commentText": "",
            "userName": "Gayatri Sangtani",
            "userProfileURL": "https://www.linkedin.com/in/gayatri-sangtani-b90664180",
            "dataId": "urn:li:comment:(activity:7295426495404023808,7295459299617619969)"
          }
        ],
        "commentAdded": "What a delightful surprise! 🌹 Its the little things that brighten our day. Kudos to Swiggy for spreading positivity with every delivery!"
      },
      {
        "postId": "urn:li:activity:7295290533474701313",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295290533474701313",
        "url": "https://www.linkedin.com/company/kpmgindia/posts",
        "name": "KPMG India\nKPMG India",
        "content": "▶️ Heading into 2025, there is growing optimism that global \nhashtag\n#VC investment will continue to pick up, particularly if interest rates continue to fall and the exit environment perks up.\n\n▶️\nin\nwill likely continue to outpace investment in all other sectors heading in to Q1’25, with investment continuing to broaden into a wider range of sub-sectors — such as industry solutions and AI-enabled robotics.\n\n▶️ Corporates will likely continue to drive a large share of\nas the large tech giants compete for prominence, and as industry players look to leverage AI to improve their operational efficiencies and provide more value to their customers.\n\nRead on for more insights ins Venture Pulse Q4 2024 ",
        "reactions": {
          "likes": "19",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/37b7b1fa-70ba-4c01-8a3e-5956655c57d0",
        "comments": [],
        "commentAdded": "Exciting times ahead! The rise of AI and industry solutions will reshape the VC landscape. Looking forward to seeing how this evolves! #VentureCapital"
      },
      {
        "postId": "urn:li:activity:7295411341794713601",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295411341794713601",
        "url": "https://www.linkedin.com/in/ezxpo?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAIjGYB6b_NDVVPDgshQzRZBv-z3gmsaT0",
        "name": "Matt Fok\nMatt Fok",
        "content": "Startups & Entrepreneurs – Get Your AI-Powered Growth Engine  \n\n 90% of startups fail due to high costs & poor customer engagement. Don’t be one of them!\n\n Paid ads burn cash with little return\n Cold outreach takes too long to convert\n Lack of automation makes scaling impossible\n\n AI X Network turns your startup into a lead-gen machine:\n AI-Podcast – Build authority & attract your ideal audience effortlessly \n AI-Email & AI-CRM – Automate lead nurturing & close more deals \n AI-Agent & AI-Chatbot – Engage & convert leads while you sleep \n\n Stop struggling & start scaling—AI X Network gives you the unfair advantage!\n",
        "reactions": {
          "likes": "1",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Absolutely love this! AI X Network is paving the way for smarter growth strategies. Excited to see startups leverage AI for success! 🚀"
      },
      {
        "postId": "urn:li:activity:7295404441237700609",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295404441237700609",
        "url": "https://www.linkedin.com/in/duke-rem-%F0%9F%90%A2-793616267?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAEFotd8BDwR_osR-3ROnxQtd2JpPvWbizfw",
        "name": "Duke Rem 🐢\nDuke Rem 🐢",
        "content": "Language Models and Latent Reasoning: A New Approach to Test-Stage Computation\n\nA new approach to language models exploits latent reasoning to scale computation without depending on token generation. A recurrent network allows processing to deepen dynamically, improving performance with limited resources. Key points: Latent reasoning: The model processes information in latent space, separating internal computation from visible context. Dynamic depth: The architecture uses a recurrent block to iterate and deepen reasoning without generating multiple tokens. Computational...\n\n[please read our full article by clicking the link below ⬇️]\n\n️If you've made it this far, it seems the post caught your interest! Please consider liking, sharing, or dropping your thoughts in the comments.\n\nHere's why:\n\nIt helps spread the ideas and solutions I feature, amplifying their impact.\n\nYour feedback lets me know instantly if my content resonates with you, helping me improve and bring more of what you enjoy!\n\nBut above all...Please follow me for daily news and insights about AI\n\n Thank you!",
        "reactions": {
          "likes": "3\nSudhir Sekharan, M.Ed. and 2 others",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Exciting advancements in AI! The integration of latent reasoning and dynamic depth could revolutionize how we approach language models.🔥"
      },
      {
        "postId": "urn:li:activity:7295415715073863680",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295415715073863680",
        "url": "https://www.linkedin.com/company/lucidity-cloud/posts",
        "name": "Lucidity\nLucidity",
        "content": "Today, Lucidity is excited to announce a $21M Series A funding led by WestBridge Capital with participation from existing investor, Alpha Wave Global. This takes our total fundraise to $31M.\n\nCloud storage has often been overlooked as an area of waste and poor optimization, but it can have a huge impact on cloud spend and DevOps’ time. Lucidity has set out to change that.\n\nWe've built the world's first multi-cloud storage management platform. Available across AWS, Azure and Google Cloud, Lucidity gives cloud and DevOps teams the power to eliminate storage over-provisioning, the risk of downtime, and manual storage management efforts, helping them reduce costs by up to 70%.\n\nAs we ramp up the rocket ship, we’re thankful for our amazing team, customers, investors, and partners who have been with us so far. This is only the beginning for Lucidity and there is so much happening under the hood that we're excited about, so stay tuned and come see what we're building.",
        "reactions": {
          "likes": "95",
          "comments": "7 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Congratulations Nitin Bhadauria, Vatsal Rastogi , and the entire Lucidity team on this milestone. You are solving a real issue most enterprises are unable to address, without making any change to their environment or apps. I’m excited for what future holds for the team Lucidity.",
            "userName": "Raj Dutt",
            "userProfileURL": "https://www.linkedin.com/in/raghavdutt",
            "dataId": "urn:li:comment:(activity:7295415715073863680,7295424887404253184)"
          },
          {
            "commentText": "Congratulations Vatsal Rastogi Nitin Bhadauria Lucidity Team for raising A series funds.",
            "userName": "Hemlata Kapri",
            "userProfileURL": "https://www.linkedin.com/in/hemlata-kapri-86a34565",
            "dataId": "urn:li:comment:(activity:7295415715073863680,7295420211493539841)"
          }
        ],
        "commentAdded": "Congratulations, Lucidity team! Excited to see how your innovative platform will transform cloud storage management and drive efficiency! 🚀"
      },
      {
        "postId": "urn:li:activity:7295434246809075713",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295434246809075713",
        "url": "https://www.linkedin.com/in/robertsjeff?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAeZvQUBybFX1rFWHMOHhOcZiZKlyH6HX5k",
        "name": "Jeff Roberts\nJeff Roberts",
        "content": "Virtual reality is revolutionizing how NFL quarterbacks like Jayden Daniels prepare for game day. As highlighted in an Innovation Vista article, Daniels uses VR to simulate defensive schemes, refine his decision-making, and anticipate game scenarios—all without adding physical strain.\n\nThis technology isn't just transforming quarterback training—it's setting a new standard for how sports and industries alike can harness innovation to improve performance.\n\nCould your field benefit from VR's ability to turn preparation into precision?\n\nRead the full article on Innovation Vista:",
        "reactions": {
          "likes": "0",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Exciting to see VR shaping the future of sports training! Imagine the impact this could have across various industries. Whats next for innovation?"
      },
      {
        "postId": "urn:li:activity:7295437755117928450",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295437755117928450",
        "url": "https://www.linkedin.com/in/dr-denise-turley?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAIYFckBeAOicNqaw7OJoM5ODK6DIhSPnX4",
        "name": "Dr. Denise Turley\nDr. Denise Turley",
        "content": "Last few days to register...just a few spots left.\n\nP.S. Feel free to share this invitation with colleagues and fellow professionals who might benefit. Register here ",
        "reactions": {
          "likes": "3",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/e667697f-85e8-432b-a9d0-80c2203a73f6",
        "comments": [],
        "commentAdded": "Exciting opportunity! Don’t miss out on securing your spot—great chance for growth and networking. Let’s spread the word! 🚀"
      },
      {
        "postId": "urn:li:activity:7295455802297851905",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295455802297851905",
        "url": "https://www.linkedin.com/in/alexnewmann?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAMAfdcBcvjU3Y8Tfdt8dXbtU60IfLEwGv4",
        "name": "Alex Newmann\nAlex Newmann",
        "content": "Bye Linkedin\n\nNo more posts\n\nIt's ski time\n\nMy happy place\n\nSee y'all next week\n\n*if you want more of me and want to build a sales or prospecting repeatable process, check out the playbooks on my website",
        "reactions": {
          "likes": "11\nAdam P. Boyd and 10 others",
          "comments": "4 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Enjoy shredding the slopes man!",
            "userName": "Kevin Hodgkins",
            "userProfileURL": "https://www.linkedin.com/in/kevin-hodgkins",
            "dataId": "urn:li:comment:(activity:7295453850998571009,7295464589436092417)"
          },
          {
            "commentText": "Rock Star  ",
            "userName": "JC Negri",
            "userProfileURL": "https://www.linkedin.com/in/jcnegri",
            "dataId": "urn:li:comment:(activity:7295453850998571009,7295454062076936194)"
          }
        ],
        "commentAdded": "Enjoy your time on the slopes! Looking forward to seeing you back next week. 🏔️ Don’t forget to recharge and have fun!"
      },
      {
        "postId": "urn:li:activity:7295465934171869184",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295465934171869184",
        "url": "https://www.linkedin.com/in/marcin-lewandowski-679b6a166?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACeu0T0BUDbmkEn8xpBSoXUgoDtnpDJEg6c",
        "name": "Marcin Lewandowski\nMarcin Lewandowski",
        "content": "Some people go on vacation. We went on a five-city startup adventure. Chased down some of the world’s boldest founders and investors and asked them to spill their secrets.\n\nSome people make safe bets. We made a show that feels like the startup world really is - fast, risky, unpredictable, and full of moments that make you go, “Wait… WHAT just happened?”\n\nWelcome to TurnedVC Season 2.\n\nThis season, we went bigger, crazier, and deeper into the world’s most dynamic startup ecosystems.\n\nFrom the bustling streets of Paris and Lisbon to the creative energy of Helsinki, Turin, and Barcelona, we explored the startup cities shaping the future.\n\n16 extraordinary people.\n\nOne mission: To bring you the most inspiring stories from founders, investors and leaders building a better, happier and more sustainable world.\n\nWe met startup rockstars. We captured their raw, unfiltered journeys.\nWe got lost. More than once. Some bets paid off. Some… did not. But every moment felt real, unscripted, and exactly what TurnedVC is all about.\n\nMeet the lineup:\n\n()\n(&)\n()\n()\n()\n()\n()\n()\n()\n()\n()\n(@Intuition VC & Pro Athlete)\n(@intuition)\n()\n()\n()\n\nFirst episode drops next week. The trailer is out now.\nHit play. Join the ride.\nSubscribe on YouTube (link in comments).",
        "reactions": {
          "likes": "40",
          "comments": "25 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/40512a34-7c92-4461-92e6-bab5b9d4e16e",
        "comments": [
          {
            "commentText": "by the way so glad you're recovered from the \"biking\" accident. Phew",
            "userName": "Papillon Luck",
            "userProfileURL": "https://www.linkedin.com/in/papillonluck",
            "dataId": "urn:li:comment:(ugcPost:7295452973722161152,7295457362134327298)"
          }
        ],
        "commentAdded": "Excited to see the raw journeys of these startup rockstars! 🎉 Cant wait for the first episode! 🚀 #TurnedVC #StartupAdventure"
      },
      {
        "postId": "urn:li:activity:7295460651987005440",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295460651987005440",
        "url": "https://www.linkedin.com/in/kenny-jain?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACX0RSsBZ92HLnFsHyYMnLM4UoFdAsk7_zE",
        "name": "Kenny Jain\nKenny Jain",
        "content": "Your product is great.\n\nYour startup is solid.\n\nBut if nobody knows you, how will they trust what you sell?\n\nSaaS isn't just about the software - it's about the founder behind it.\n\n️ Trust - People buy from people, not logos.\n️ Visibility - A strong LinkedIn brand = inbound leads\n️Authority - Share insights, and you become the go-to expert.\n️ Growth - Investors, partners, and clients come to you.\n\nYou don't need to go viral.\n\nYou need the right people to see you consistently.\n\nYour personal brand is your biggest SaaS growth hack.\n\nWhat's stopping you from building yours today?",
        "reactions": {
          "likes": "12",
          "comments": "3 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Trust and visibility are the foundations of any successful SaaS. How are you building your personal brand to connect with the right audience? Kenny Jain",
            "userName": "Nabajit Gope ✍️",
            "userProfileURL": "https://www.linkedin.com/in/nabajitgope",
            "dataId": "urn:li:comment:(activity:7295459664123617280,7295466683421388800)"
          },
          {
            "commentText": "Valid point",
            "userName": "Nur Mohammad",
            "userProfileURL": "https://www.linkedin.com/in/nurdesigner",
            "dataId": "urn:li:comment:(activity:7295459664123617280,7295463897765924865)"
          },
          {
            "commentText": "Nur Mohammad Glad you resonated",
            "userName": "Kenny Jain",
            "userProfileURL": "https://www.linkedin.com/in/kenny-jain",
            "dataId": "urn:li:comment:(activity:7295459664123617280,7295465591459528704)"
          }
        ],
        "commentAdded": "Absolutely agree! Personal branding is key in SaaS. Its all about building trust and visibility with the right audience. Lets elevate our presence!"
      },
      {
        "postId": "urn:li:activity:7292891689277394945",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292891689277394945",
        "url": "https://www.linkedin.com/in/samarth-gupta-08?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACxFTywBZ6e1DmS3poRwyydEU-4zq18mt04",
        "name": "Samarth Gupta\nSamarth Gupta",
        "content": "𝗛𝗲𝗿𝗼 𝗠𝗼𝘁𝗼𝗖𝗼𝗿𝗽: 𝗔 𝗗𝗲𝗲𝗽 𝗗𝗶𝘃𝗲 𝗶𝗻𝘁𝗼 𝗜𝘁𝘀 𝗚𝗿𝗼𝘄𝘁𝗵 & 𝗩𝗮𝗹𝘂𝗮𝘁𝗶𝗼𝗻!️\n\nExcited to share my 𝗘𝗾𝘂𝗶𝘁𝘆 𝗥𝗲𝘀𝗲𝗮𝗿𝗰𝗵 Report on Hero MotoCorp!\nConducting equity research requires a deep dive into a company’s financials, industry landscape, and competitive positioning. This report provides a comprehensive analysis of Hero MotoCorp, covering its financial performance, strategic direction, and valuation insights.\nKey highlights of the report:\n Company Overview & Industry Trends\n Economic & Sector Outlook\n Management & Business Model Evaluation\n Financial Performance (Revenue, Profitability, Cash Flow, Balance Sheet)\n Capex and Growth Analysis\n Concall Analysis\n DuPont Analysis (ROE & ROCE)\n Investment Outlook\nThis project has been an incredible learning experience, helping me strengthen my understanding of equity research and valuation methodologies. Grateful for the guidance and insights from,along the way!\n\nLooking forward to more research and discussions in the finance domain. Would love to hear your thoughts!",
        "reactions": {
          "likes": "39",
          "comments": "12 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Love this️",
            "userName": "sakshi Patil",
            "userProfileURL": "https://www.linkedin.com/in/sakshi-patil-5b06b0309",
            "dataId": "urn:li:comment:(ugcPost:7292891688073666560,7292906678335725570)"
          },
          {
            "commentText": "sakshi Patil Glad you liked it!",
            "userName": "Samarth Gupta",
            "userProfileURL": "https://www.linkedin.com/in/samarth-gupta-08",
            "dataId": "urn:li:comment:(ugcPost:7292891688073666560,7292908266706149376)"
          },
          {
            "commentText": "Love this",
            "userName": "Rajender Singh Negi",
            "userProfileURL": "https://www.linkedin.com/in/rajender-singh-negi-85428a198",
            "dataId": "urn:li:comment:(ugcPost:7292891688073666560,7292904365437173760)"
          },
          {
            "commentText": "Thanks! I am glad you found it valuable",
            "userName": "Samarth Gupta",
            "userProfileURL": "https://www.linkedin.com/in/samarth-gupta-08",
            "dataId": "urn:li:comment:(ugcPost:7292891688073666560,7292905731022864385)"
          }
        ],
        "commentAdded": "Congratulations on your deep dive into Hero MotoCorp! Your insights into equity research and valuation methodologies are inspiring. Excited to see more!"
      },
      {
        "postId": "urn:li:activity:7295466390193405954",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295466390193405954",
        "url": "https://www.linkedin.com/in/jamesparry858?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABGRqLoBLV-kl130jJtL3nVMjKpEFH7eNxc",
        "name": "James Parry⚡️\nJames Parry⚡️",
        "content": "Look, I get it. AI is the hot new thing, and everyone's excited to jump on the bandwagon. But c'mon people, let's use a little common sense here. \n\nFlooding LinkedIn comment threads with a bunch of generic, AI-generated responses? Not a good look. LinkedIn is supposed to be about authentic human interaction and building genuine professional relationships.\n\nHow's that supposed to happen when half the comments sound like they were spit out by a soulless machine? It's like showing up to a networking event with a bunch of robots - awkward, impersonal, and missing the point.\n\nSo let's keep the AI where it belongs and save the LinkedIn convos for us humans, shall we? Trust me, your connections will thank you for keeping it real.",
        "reactions": {
          "likes": "15",
          "comments": "13 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "I guess their AI needs to update the geography piece of it. ",
            "userName": "Dan Goodman",
            "userProfileURL": "https://www.linkedin.com/in/daniel-goodman2001",
            "dataId": "urn:li:comment:(activity:7295466014002094080,7295466380387123201)"
          },
          {
            "commentText": "Dan Goodman, I tell you! Also, when are you coming to San Diego?",
            "userName": "James Parry⚡️",
            "userProfileURL": "https://www.linkedin.com/in/jamesparry858",
            "dataId": "urn:li:comment:(activity:7295466014002094080,7295466797367996416)"
          }
        ],
        "commentAdded": "Absolutely agree! Authenticity is key to meaningful connections. Lets keep our conversations human and genuine! 💬✨"
      },
      {
        "postId": "urn:li:activity:7295350948837662720",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295350948837662720",
        "url": "https://www.linkedin.com/company/kpmgindia/posts",
        "name": "KPMG India\nKPMG India",
        "content": " In 1999, just 35% of the largest 250 companies reported on \nhashtag\n#sustainability. Now, 96% do so.\n\n Explore the findings of the 13th edition of's research and find out how companies measure up ->",
        "reactions": {
          "likes": "21",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Incredible growth in sustainability reporting! 📈 Its great to see so many companies prioritizing transparency and accountability. #sustainability"
      },
      {
        "postId": "urn:li:activity:7295464177974833152",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295464177974833152",
        "url": "https://www.linkedin.com/in/ajayprasadgmr?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAGe4LcBo1xqzdQqIbcF0D90LEEbhsfLZKo",
        "name": "Ajay Prasad\nAjay Prasad",
        "content": "I just finished reading this insightful article on reputation management for physical therapy practices, and I felt it was absolutely worth sharing. We all know that in today’s world, patients are researching online before they even step into your office.\n\nThe article dives into the importance of online reviews, social media engagement, and how responding to both positive and negative feedback can shape your practice’s future.\n\nWhat I really appreciated about the article is how it highlights the power of real patient stories, those success stories that not only help build trust but can also be a game-changer in attracting new patients.\n\nAs a strong believer in the importance of a positive, community-driven reputation, I truly think every practice, whether small or large, will find value in this.\n\nIf you’re looking to grow your practice or just refine your online presence, this blog is a must-read. Trust me, it’s packed with actionable tips that can lead to meaningful results. \n\nTake a few minutes, and give it a read! You won’t regret it.",
        "reactions": {
          "likes": "1",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Great insights! Reputation management is crucial for attracting new patients. Thanks for sharing this valuable resource! 🌟 #PatientCare"
      }
    ],
    "errors": [
      {
        "postId": "urn:li:activity:7295460436005593088",
        "url": "https://www.linkedin.com/company/spinsci-technologies-llc/posts",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295430202984161285",
        "url": "https://www.linkedin.com/company/kpmgindia/posts",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295454207321538561",
        "url": "https://www.linkedin.com/company/plazo-sullivan-roche-capital/posts",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295095588566540288",
        "url": "https://www.linkedin.com/groups/3416532?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A3416532-7295095587606007808",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7290722950276677632",
        "url": "https://www.linkedin.com/company/coforge-tech/posts",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295460644437291008",
        "url": "https://www.linkedin.com/in/alaqsha-qadeer-2001?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACeQJIIBr3oxAZWdg6fE1XPZf9whBXcxON8",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295411341794713601",
        "url": "https://www.linkedin.com/in/ezxpo?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAIjGYB6b_NDVVPDgshQzRZBv-z3gmsaT0",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295404441237700609",
        "url": "https://www.linkedin.com/in/duke-rem-%F0%9F%90%A2-793616267?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAEFotd8BDwR_osR-3ROnxQtd2JpPvWbizfw",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295415715073863680",
        "url": "https://www.linkedin.com/company/lucidity-cloud/posts",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295434246809075713",
        "url": "https://www.linkedin.com/in/robertsjeff?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAeZvQUBybFX1rFWHMOHhOcZiZKlyH6HX5k",
        "errors": [
          "Failed to fetch reactions.",
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295455802297851905",
        "url": "https://www.linkedin.com/in/alexnewmann?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAMAfdcBcvjU3Y8Tfdt8dXbtU60IfLEwGv4",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295460651987005440",
        "url": "https://www.linkedin.com/in/kenny-jain?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACX0RSsBZ92HLnFsHyYMnLM4UoFdAsk7_zE",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292891689277394945",
        "url": "https://www.linkedin.com/in/samarth-gupta-08?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACxFTywBZ6e1DmS3poRwyydEU-4zq18mt04",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295466390193405954",
        "url": "https://www.linkedin.com/in/jamesparry858?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABGRqLoBLV-kl130jJtL3nVMjKpEFH7eNxc",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295350948837662720",
        "url": "https://www.linkedin.com/company/kpmgindia/posts",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295464177974833152",
        "url": "https://www.linkedin.com/in/ajayprasadgmr?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAGe4LcBo1xqzdQqIbcF0D90LEEbhsfLZKo",
        "errors": [
          "Failed to fetch media URL."
        ]
      }
    ]
  },
  {
    "postsData": [
      {
        "postId": "urn:li:activity:7295456947162497025",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295456947162497025",
        "url": "https://www.linkedin.com/groups/123661?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A123661-7295456945883234306",
        "name": "Health & Fitness Industry Professionals\nHealth & Fitness Industry Professionals",
        "content": "Create a vision for the life you really want - then work relentlessly towards making it a reality.\n\nThis is something I live by.\n\nWhen I decided to rebrand SickFitness last year, I didn’t jump straight into the work.\nI spent months solely focused on creating a vision for the life I wanted.\n\nI asked myself:\n\n️ What do I want for myself and my family in the future?\n️ What does that future look like?\n️ How can I design my business around the life I desire for myself, my wife, and my stepdaughter?\n️ How do all of these things fit together?\n\nI saw myself in the future and engraved that snapshot in my mind.\n\nIt took time - months of deep thinking and refining my vision - but once I had clarity, everything changed.\n\n No more waking up and going through the motions.\n No more aimless effort without direction.\n A clear vision became my blueprint.\n\nIt gave structure to my days, helped me set short-term and long-term goals, and aligned my daily actions with my ultimate purpose.\n\nOnce you have a vision and a plan, the next step is execution.\n\nPut in the work EVERY single day. No matter how you feel.\n\nWhether it’s your career, your fitness, or any other goal in life -\nHave a vision for where you want to go.\n\nLet your vision be your destination.\nLet your plan be the roadmap.\nThen show up and execute.\n\nIf you struggle to create a clear vision for your health and fitness goals, I’m here to help.\n\nWith over 20 years as a strength and conditioning specialist, I’ve helped over a thousand people design their roadmap for success. Let’s build yours.\n\n Visit. You're capable of so much more than you think. ",
        "reactions": {
          "likes": "6",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Inspiring message! 🌟 A strong vision truly does pave the way for success. Excited to see others transform their lives with clarity and purpose!"
      },
      {
        "postId": "urn:li:activity:7295457217820966913",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295457217820966913",
        "url": "https://www.linkedin.com/in/abheek-dutta-80764532?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAbbkkcBwEqntLHa873ENH7SxYOL8nmwdsg",
        "name": "Abheek Dutta\nAbheek Dutta",
        "content": "We are Hiring",
        "reactions": {
          "likes": "2",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Exciting opportunity! Im looking forward to seeing the talented individuals who join your team. Best of luck with the hiring process!"
      },
      {
        "postId": "urn:li:activity:7295415326425464832",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295415326425464832",
        "url": "https://www.linkedin.com/in/syed-nyamathullah?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABUrsMcB2JTD0RlU8cw3yJFX2-TFx9sQoCY",
        "name": "Syed Nyamathullah ↗️\nSyed Nyamathullah ↗️",
        "content": "Great products don’t sell themselves\n\nespecially in healthcare!\n\nThe medical device industry is\n- Crowded\n- Competitive\n- Complex\n\nA revolutionary product means nothing if no one knows about it.\n\nSo, how do you stand out?\n\nIn my latest article, I break down proven marketing strategies for medical device companies.\n\n SEO & content that attracts the right audience\n\n Engaging video marketing & live demonstrations\n\n Social media strategies that actually work\n\n Leveraging Key Opinion Leaders for trust\n\n AI & data-driven insights for better conversions\n\nWhat’s the biggest challenge you face in marketing medical devices? Let’s discuss. ⬇️\n\nWant to future-proof your marketing?\nFeel Free to DM me on\n\n\n\n\nRead the full article here: []",
        "reactions": {
          "likes": "45",
          "comments": "16 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Thanks for sharing.",
            "userName": "Chahat Raj Kapoor",
            "userProfileURL": "https://www.linkedin.com/in/chahat-raj-kapoor",
            "dataId": "urn:li:comment:(ugcPost:7295410440715583489,7295415309396537344)"
          }
        ],
        "commentAdded": "Absolutely agree! In such a competitive landscape, effective marketing is key. Excited to read your article and explore these strategies!"
      },
      {
        "postId": "urn:li:activity:7295444214266384384",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295444214266384384",
        "url": "https://www.linkedin.com/in/kevin-william-91778611b?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAB3WOaMBxDXFxHRrRX7pAhQTYmedqtrJESs",
        "name": "Kevin William\nKevin William",
        "content": " Struggling to Lead Your Team? Here’s Step 2!  \n\nGreat leadership isn’t just about giving direction, it’s about understanding the people you’re leading. \nDo you really know your team? Not just their skills, but what drives them, what motivates them, and how they think?\n\n Why this matters:\n It helps you leverage strengths instead of fighting against them.\n It allows you to motivate effectively based on what actually drives people.\n It transforms your team from a group of individuals into a high-performance unit.\n\nGreat teams don’t just happen, they are built by leaders who take the time to understand the people within them.\n\n Question for you: What’s the best way you’ve found to understand your team’s motivations? Drop your thoughts below! ",
        "reactions": {
          "likes": "245",
          "comments": "59 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/a6d353f9-ca94-4c32-98c6-c7b20154b5fc",
        "comments": [
          {
            "commentText": "When I first stepped into leadership, I focused only on skills and execution—big mistake. It didn’t take long to realize that even the most skilled people won’t perform at their best if they don’t feel understood. Some thrive on recognition, others on challenges, and some just need autonomy to excel. But if you lead everyone the same way, you’ll lose engagement, create frustration, and lower morale. Leadership isn’t about changing people—it’s about understanding who they are and positioning them for success.",
            "userName": "Rustam Burkeev",
            "userProfileURL": "https://www.linkedin.com/in/rburkeev",
            "dataId": "urn:li:comment:(ugcPost:7295396150889607168,7295404859229417472)"
          },
          {
            "commentText": "Rustam Burkeev That’s such a powerful realization!  The best leaders evolve from managing tasks to understanding people, and that shift changes everything. When leaders take the time to recognize individual motivators, they don’t just improve performance; they create an environment where people feel valued, heard, and empowered. It’s not about one-size-fits-all leadership, but about meeting people where they are and helping them thrive in their own way. Your insight is spot on—leadership isn’t about changing people, it’s about leveraging their strengths to build something greater together.  Curious—what was the turning point that made you realize this in your leadership journey?",
            "userName": "Kevin William",
            "userProfileURL": "https://www.linkedin.com/in/kevin-william-91778611b",
            "dataId": "urn:li:comment:(ugcPost:7295396150889607168,7295406117101137921)"
          },
          {
            "commentText": "I once had a manager who couldn’t figure out why our team was underperforming, despite being highly skilled. The problem? He assigned work based on skills, not motivation. Once we shifted responsibilities based on individual strengths and motivators, our productivity skyrocketed. Lesson learned: Leadership isn’t just about execution—it’s about energy alignment.",
            "userName": "Jonathan Tetlak",
            "userProfileURL": "https://www.linkedin.com/in/jtetlak",
            "dataId": "urn:li:comment:(ugcPost:7295396150889607168,7295406457431224320)"
          },
          {
            "commentText": "Jonathan Tetlak Love the phrase: Energy Alignment! a very interesting take on how we should view \n#leadership  ",
            "userName": "Kevin William",
            "userProfileURL": "https://www.linkedin.com/in/kevin-william-91778611b",
            "dataId": "urn:li:comment:(ugcPost:7295396150889607168,7295423369091440642)"
          }
        ],
        "commentAdded": "Absolutely! Taking time to listen and engage with team members really uncovers their motivations. Great insights here!"
      },
      {
        "postId": "urn:li:activity:7295446374798528512",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295446374798528512",
        "url": "https://www.linkedin.com/company/caplinedentalservices/posts",
        "name": "Capline Dental Services\nCapline Dental Services",
        "content": "Honoring the legacy of resilience and integrity on Lincoln’s Birthday. His wisdom continues to guide us today.",
        "reactions": {
          "likes": "1",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Absolutely! Lincolns values remain a powerful reminder of the importance of resilience and integrity in our leadership today."
      },
      {
        "postId": "urn:li:activity:7295438372062257152",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295438372062257152",
        "url": "https://www.linkedin.com/in/jeffhuckaby?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABkXZoBavtmkTjpzN74wC1Vv7oY1xi8Tss",
        "name": "Jeff Huckaby\nJeff Huckaby",
        "content": "It sounds like this \"\nhashtag\n#AI thing\" may not go away anytime soon.  \n\nIn my \"spare\" time, I plan to complete three books over the next few months: \"Your AI Roadmap\" by, \"The AI Factor\" by, and \"Future Healthcare 2050\" by.\nNot only do these books cover all of the pertinent aspects of AI, but they are all three written by just incredible human beings.\n\nLinks to get your copy:\n\"Your AI Roadmap\" -\n\"The AI Factor\"\n\"Future Healthcare 2050\" -",
        "reactions": {
          "likes": "6",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Thanks for the shoutout! Careers and money are going to Change a lot in the next few years and I look forward to your thoughts on my book Your AI Roadmap ",
            "userName": "Dr. Joan Palmiter Bajorek",
            "userProfileURL": "https://www.linkedin.com/in/dr-jpb",
            "dataId": "urn:li:comment:(activity:7295438372062257152,7295465533854859267)"
          }
        ],
        "commentAdded": "Exciting reading list! 📚 Diving into AI is essential for the future. Cant wait to see your insights after you finish those books! #LifelongLearning"
      },
      {
        "postId": "urn:li:activity:7295117647145320448",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295117647145320448",
        "url": "https://www.linkedin.com/in/duke-rem-%F0%9F%90%A2-793616267?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAEFotd8BDwR_osR-3ROnxQtd2JpPvWbizfw",
        "name": "Duke Rem 🐢\nDuke Rem 🐢",
        "content": "Guidehouse and HIMSS Join Forces to Power Digital Transformation in Healthcare\n\nGuidehouse, in collaboration with HIMSS, launches a partnership to accelerate digital transformation in healthcare, using globally recognized digital maturity models to improve data governance, AI adoption, and population health outcomes. Key Points:  Guidehouse joins HIMSS Digital Health Consulting Partner Program to advance digital health. HIMSS Maturity Models will be used to assess and enhance technology capabilities in healthcare organizations. The initiative includes the use of three foundational models...\n\n[please read our full article by clicking the link below ⬇️]\n\n️If you've made it this far, it seems the post caught your interest! Please consider liking, sharing, or dropping your thoughts in the comments.\n\nHere's why:\n\nIt helps spread the ideas and solutions I feature, amplifying their impact.\n\nYour feedback lets me know instantly if my content resonates with you, helping me improve and bring more of what you enjoy!\n\nBut above all...Please follow me for daily news and insights about AI\n\n Thank you!",
        "reactions": {
          "likes": "6",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Duke Rem , this healthcare partnership could revolutionize how we deliver digital care solutions. ",
            "userName": "Kashif M.",
            "userProfileURL": "https://www.linkedin.com/in/iamkash",
            "dataId": "urn:li:comment:(activity:7295117647145320448,7295129637750247424)"
          }
        ],
        "commentAdded": "Exciting collaboration! This partnership will surely enhance digital capabilities in healthcare, driving better outcomes for patients. Looking forward to the impact!"
      },
      {
        "postId": "urn:li:activity:7295403774209146880",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295403774209146880",
        "url": "https://www.linkedin.com/in/rahulbhadoriyadesigner?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACe102oBuevRBUy-nNgVV1J7VyPuvu7rvus",
        "name": "Rahul Singh Bhadoriya\nRahul Singh Bhadoriya",
        "content": "Brand Soul is the bridge between what you say you are and what users actually experience.",
        "reactions": {
          "likes": "3",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Absolutely! Bridging that gap is essential for building trust and loyalty. Excited to see more brands embrace their true essence!"
      },
      {
        "postId": "urn:li:activity:7295348066696474625",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295348066696474625",
        "url": "https://www.linkedin.com/in/priyank-ahuja?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAL9WCIBlpfzadAVTWPPVd5XG57aasvhRYY",
        "name": "Priyank Ahuja\nPriyank Ahuja",
        "content": "Urgent Requirement!!\n\nLooking for Professionals Interested to Work and Settle in Canada, Australia and Germany!!\n\nRequirements:\n- Minimum Bachelor’s Degree\n- Atleast 2 years of professional experience\n\nPlease fill out the form:\n\nIn-demand Jobs and Salaries:\n\nEngineering Professionals: $102,340 per year\nArchitects: $99,443 per year\nAdministrative Assistants: $55,048 per year\nSales and Marketing: $49,500 per year\nIT Professionals: $72,060 per year\nHealth Care Professionals: $39,552 per year\nRestaurant Professionals: $43,208 per year\nChefs: $84,488 per year\nAccountants: $90,627 per year\nHotel Managers: $87,765 per year\n\nKey Benefits:\n\n Free Education for Kids\n Free Healthcare Insurance\n Unemployment Benefits\n Citizenship after 3 years\n\n If you’re interested, please fill out the form:\n\nHit like or comment “INTERESTED” so that we can review your profile! ",
        "reactions": {
          "likes": "561",
          "comments": "139 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Please fill out the form: https://bit.ly/3V80Pu1",
            "userName": "Priyank Ahuja",
            "userProfileURL": "https://www.linkedin.com/in/priyank-ahuja",
            "dataId": "urn:li:comment:(activity:7295275724322549760,7295275763690258432)"
          },
          {
            "commentText": "Priyank Ahuja Fraud immigration consultant",
            "userName": "Nisha Arora",
            "userProfileURL": "https://www.linkedin.com/in/nisha-arora-55847b204",
            "dataId": "urn:li:comment:(activity:7295275724322549760,7295359201093005313)"
          },
          {
            "commentText": "Great opportunity for professionals looking to build a future abroad! ",
            "userName": "Matt at Tech Retriever",
            "userProfileURL": "https://www.linkedin.com/company/tech-retriever/posts",
            "dataId": "urn:li:comment:(activity:7295275724322549760,7295378849909944320)"
          }
        ],
        "commentAdded": "Exciting opportunity! Im interested in exploring these roles. Looking forward to connecting and learning more about the requirements!"
      },
      {
        "postId": "urn:li:activity:7295456656417509377",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295456656417509377",
        "url": "https://www.linkedin.com/in/rpessar?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAwcjW4BvCJUAK0fWiSBca-E80oRWsQF_oI",
        "name": "Ronen R. Pessar\nRonen R. Pessar",
        "content": "Harsh truth:\n\nYour SDRs decide your pipeline’s fate.\n\nWeak SDRs? Say goodbye to revenue.\n\nResearch from Operatix shows it:\n\n\"Elite SDR teams drive 30-45% revenue.\"\n\nStrong SDRs aren’t optional. They’re essential.\n\nTop leaders do things differently:\n\n- They practice role-playing often.\n- They leverage AI and tech to optimize.\n- They invest in training, not just onboarding.\n- They strategically align their SDRs with their AE-team.\n- They are ruthless ab targeting: right companies/contacts.\n\nThe bottom line?\n\nYour SDR team isn't just a cost center.\n\nThey're your revenue driver.\n\nWant to 2x your growth?\n\nStart by empowering your SDR team.\n\nFor more leadership tips, hit .\n\nPS: Do your SDRs and AEs collaborate?",
        "reactions": {
          "likes": "17",
          "comments": "4 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/c251ca2d-5cd4-4aaf-80cd-1678104cf831",
        "comments": [
          {
            "commentText": "SDRs are the power house \nInvest in them and increase revenue by a huge %\n\nRonen R. Pessar ",
            "userName": "Rejoice Onyenanu",
            "userProfileURL": "https://www.linkedin.com/in/rejoice-onyenanu",
            "dataId": "urn:li:comment:(ugcPost:7294847978513604608,7295457325526491137)"
          },
          {
            "commentText": "Rejoice Onyenanu strong SDRs = strong pipeline = strong revenue",
            "userName": "Ronen R. Pessar",
            "userProfileURL": "https://www.linkedin.com/in/rpessar",
            "dataId": "urn:li:comment:(ugcPost:7294847978513604608,7295457801005322240)"
          },
          {
            "commentText": "Ronen R. Pessar ",
            "userName": "Rejoice Onyenanu",
            "userProfileURL": "https://www.linkedin.com/in/rejoice-onyenanu",
            "dataId": "urn:li:comment:(ugcPost:7294847978513604608,7295471033849909248)"
          },
          {
            "commentText": "But do these SDRs do pre research or no? That is the question we all wanna know Ronen R. Pessar  but for real the SDR side of the house needs some real TLC and you need to empower your reps to be elite and do what they do best! Its an investment not an expense ",
            "userName": "🔥 Tom Slocum",
            "userProfileURL": "https://www.linkedin.com/in/tomslocum",
            "dataId": "urn:li:comment:(ugcPost:7294847978513604608,7295468786843873281)"
          },
          {
            "commentText": " Tom Slocum haha the million-dollar question!  the best teams find the balance—efficiency and smart targeting",
            "userName": "Ronen R. Pessar",
            "userProfileURL": "https://www.linkedin.com/in/rpessar",
            "dataId": "urn:li:comment:(ugcPost:7294847978513604608,7295470412384124928)"
          }
        ],
        "commentAdded": "Absolutely agree! Empowering SDRs is key to success. Collaboration with AEs can truly elevate our pipeline and revenue potential! 🚀"
      }
    ],
    "errors": [
      {
        "postId": "urn:li:activity:7295456947162497025",
        "url": "https://www.linkedin.com/groups/123661?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A123661-7295456945883234306",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295457217820966913",
        "url": "https://www.linkedin.com/in/abheek-dutta-80764532?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAbbkkcBwEqntLHa873ENH7SxYOL8nmwdsg",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295415326425464832",
        "url": "https://www.linkedin.com/in/syed-nyamathullah?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABUrsMcB2JTD0RlU8cw3yJFX2-TFx9sQoCY",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295446374798528512",
        "url": "https://www.linkedin.com/company/caplinedentalservices/posts",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295438372062257152",
        "url": "https://www.linkedin.com/in/jeffhuckaby?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABkXZoBavtmkTjpzN74wC1Vv7oY1xi8Tss",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295117647145320448",
        "url": "https://www.linkedin.com/in/duke-rem-%F0%9F%90%A2-793616267?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAEFotd8BDwR_osR-3ROnxQtd2JpPvWbizfw",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295403774209146880",
        "url": "https://www.linkedin.com/in/rahulbhadoriyadesigner?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACe102oBuevRBUy-nNgVV1J7VyPuvu7rvus",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295348066696474625",
        "url": "https://www.linkedin.com/in/priyank-ahuja?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAL9WCIBlpfzadAVTWPPVd5XG57aasvhRYY",
        "errors": [
          "Failed to fetch media URL."
        ]
      }
    ]
  },
  {
    "postsData": [
      {
        "postId": "urn:li:activity:7295465428284280834",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295465428284280834",
        "url": "https://www.linkedin.com/in/leonardo-freixas?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAvPMPIBxg-5V-C6mXAUclOeSkhCQVNLrpQ",
        "name": "Leonardo Freixas\nLeonardo Freixas",
        "content": "Here's a truth bomb about potential:\n\n(Most people die at 25%) \n\nQuick story:\n11 years of playing small on LinkedIn.\nResume page. Zero impact.\nThen I made one decision:\nStop hiding, start building.\n6 months later: One of the fastest growing creators in business and entrepreneurship.\n\n3 Reality Checks That Changed Everything:\n\n1. Growth is Mathematical\n↳ Every post teaches you something new\n↳ 6 months of consistency > 11 years of lurking\n↳ Your first 100 posts unlock everything\n\n2. Fear is Just Bad Math\n↳ Rejection rate drops 80% after first month\n↳ One viral post erases 50 forgotten ones\n↳ Every \"no\" brings you closer to your \"yes\"\n\n3. Impact is Exponential\n↳ First 1K followers took 3 months\n↳ Next 9K? Just 90 days\n↳ Your network compounds like interest\n\nP.S. The real ceiling?\nIt's not your capability.\nIt's your willingness to look foolish while you grow.\n\nQuestion is:\nHow many more years will you wait?\nLet me know ⬇️\n\n—\n\n️ Repost if you're done playing small!\n Followfor more real talk like this.",
        "reactions": {
          "likes": "123",
          "comments": "82 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/e66bdfa1-9c06-40f0-9c72-dcaaf102f870",
        "comments": [
          {
            "commentText": " What’s the biggest excuse keeping you from posting on LinkedIn? ",
            "userName": "Leonardo Freixas",
            "userProfileURL": "https://www.linkedin.com/in/leonardo-freixas",
            "dataId": "urn:li:comment:(ugcPost:7295460673965248513,7295461130028666881)"
          },
          {
            "commentText": " What’s one lesson LinkedIn has taught you about growth? ",
            "userName": "Leonardo Freixas",
            "userProfileURL": "https://www.linkedin.com/in/leonardo-freixas",
            "dataId": "urn:li:comment:(ugcPost:7295460673965248513,7295461223314194432)"
          }
        ],
        "commentAdded": "Love this perspective! 🚀 Embracing growth and overcoming fear are key to unlocking our true potential. Lets keep building together! 💪✨"
      },
      {
        "postId": "urn:li:activity:7295435040564396032",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295435040564396032",
        "url": "https://www.linkedin.com/company/mob-avenue/posts",
        "name": "Mobavenue Media\nMobavenue Media",
        "content": "Find an inside scoop on how Mobavenue is building new frontiers in AI-powered innovations.\n\nIn an exclusive feature with, our chief,, reveals Mobavenue’s evolution into a leading Madtech platform and shares insights from our AI-driven playbook—powering the future of Adtech.\n\nDive into our compelling narrative here:",
        "reactions": {
          "likes": "5\nSandeep Dinodiya and 4 others",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Exciting to see Mobavenue leading the charge in AI-driven Adtech! Eager to learn more about your innovative strategies and success stories! 🚀"
      },
      {
        "postId": "urn:li:activity:7295463048268369920",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295463048268369920",
        "url": "https://www.linkedin.com/company/lucidity-cloud/posts",
        "name": "Lucidity\nLucidity",
        "content": "This fundraise isn't just capital – it's rocket fuel for the next big thing in the cloud.\n\nTo our customers: Thank you for trusting us. We're just getting started and there's lots more to come.\n\nTo our team: This is your moment too. Your dedication made this possible.\n\nTo our new investors: Welcome to the Lucidity family. Thank you for your trust. Let's build something extraordinary!\n,,,",
        "reactions": {
          "likes": "10",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/9037e501-bcd8-4d1d-a8e2-5ea63c79a810",
        "comments": [
          {
            "commentText": "Read more about our Series A round here: https://shorturl.at/0KtaN",
            "userName": "Lucidity",
            "userProfileURL": "https://www.linkedin.com/company/lucidity-cloud/posts",
            "dataId": "urn:li:comment:(ugcPost:7295462985978822657,7295463972349034496)"
          }
        ],
        "commentAdded": "Exciting times ahead! Grateful to be part of this journey, where innovation meets teamwork. Lets elevate the cloud experience together! 🚀"
      },
      {
        "postId": "urn:li:activity:7295465943365799938",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295465943365799938",
        "url": "https://www.linkedin.com/in/ari-rose?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADDk1lUBjonw1yqLQHfzAuU8Xl__6_QJG5c",
        "name": "Ari Rose 🌹\nAri Rose 🌹",
        "content": "LinkedIn is my best investment. \n\n\nBut it’s also been the hardest.\n\nI love LinkedIn because:\n\n I have more confidence than ever.\n I network daily as an introvert.\n Sales have never been easier.\n\nBut success comes with struggles too.\n\nPeople think I blew up overnight.\nThe truth? I’ve put in 𝘩𝘶𝘯𝘥𝘳𝘦𝘥𝘴 of hours.\n\nI spend over an hour on a post.\nSometimes, it still flops.\n\nI work weekends analyzing results.\nI invest time, money, and energy refining.\n\nAnd with growth comes negativity.\n\n𝗜𝗻 𝘁𝗵𝗲 𝗽𝗮𝘀𝘁 𝘄𝗲𝗲𝗸 𝗮𝗹𝗼𝗻𝗲:\n\n Criticized in my DMs.\n Told I “look like I’m struggling.”\n Told my success is “just because I’m cute.”\n\nAt first, it bothered me.\nI’m human.\n\n𝗛𝗲𝗿𝗲’𝘀 𝘁𝗵𝗲 𝗿𝗲𝗮𝗹𝗶𝘁𝘆:\nCriticism never comes from people doing better.\nIt comes from people doing 𝘭𝘦𝘴𝘴.\n\n𝗪𝗵𝗲𝗻 𝗻𝗲𝗴𝗮𝘁𝗶𝘃𝗶𝘁𝘆 𝗰𝗼𝗺𝗲𝘀, 𝗜 𝗿𝗲𝗳𝗿𝗮𝗺𝗲 𝗶𝘁.\n\nFor me, it’s taught 3 things:\n\n• Protect my energy at all costs.\n• If something feels 1% 𝘰𝘧𝘧, I say no.\n• It’s made incredibly mentally strong.\n\n𝗡𝗲𝘄 𝗹𝗲𝘃𝗲𝗹 = 𝗻𝗲𝘄 𝗽𝗿𝗼𝗯𝗹𝗲𝗺𝘀.\n\nPeople will copy you.\nPeople will criticize you.\nPeople will make assumptions.\n\nBut if you 𝘣𝘦𝘭𝘪𝘦𝘷𝘦 in your message?\nYou won’t quit.\n\n 𝗛𝗼𝘄 𝗱𝗼 𝘆𝗼𝘂 𝗿𝗲𝗳𝗿𝗮𝗺𝗲 𝗻𝗲𝗴𝗮𝘁𝗶𝘃𝗶𝘁𝘆?",
        "reactions": {
          "likes": "188",
          "comments": "115 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "When people doubt you, use that as your greatest fuel. You can either let other people's limiting beliefs break you or propel you forward. Either way, you hold that decision in your hands.",
            "userName": "Ryan Sick",
            "userProfileURL": "https://www.linkedin.com/in/ryansick",
            "dataId": "urn:li:comment:(activity:7295456697735647233,7295465906216849410)"
          },
          {
            "commentText": "Ryan Sick Oh I always say \"Control, Alt, Delete\" any limiting belief anyone says to me. \n\nI don't even let my brain implant that seed lol\n\nWhat's your number one mindset tip!?",
            "userName": "Ari Rose 🌹",
            "userProfileURL": "https://www.linkedin.com/in/ari-rose",
            "dataId": "urn:li:comment:(activity:7295456697735647233,7295466772294422529)"
          }
        ],
        "commentAdded": "Incredible insight! Reframing negativity is key to growth. Your resilience and dedication inspire many—keep shining! 🌟 #StayFocused #NetworkStrong"
      },
      {
        "postId": "urn:li:activity:7295425801712218113",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295425801712218113",
        "url": "https://www.linkedin.com/in/aayushi-goel73?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAEmUGJMBtauELAEYrW0NfetDM-dL7Um-Vxw",
        "name": "Aayushi Goel\nAayushi Goel",
        "content": " Exciting News! A New Chapter Begins! \n\n𝐄𝐱𝐜𝐢𝐭𝐞𝐝 𝐭𝐨 𝐬𝐡𝐚𝐫𝐞 𝐭𝐡𝐚𝐭 𝐈’𝐯𝐞 𝐛𝐞𝐞𝐧 𝐬𝐞𝐥𝐞𝐜𝐭𝐞𝐝 𝐟𝐨𝐫 𝐈𝐧𝐟𝐨𝐬𝐲𝐬 𝐒𝐩𝐫𝐢𝐧𝐠𝐛𝐨𝐚𝐫𝐝 𝐏𝐫𝐚𝐠𝐚𝐭𝐢: 𝐏𝐚𝐭𝐡 𝐭𝐨 𝐅𝐮𝐭𝐮𝐫𝐞 𝐂𝐨𝐡𝐨𝐫𝐭 4!  This isn’t just another learning program; it’s a game-changer for women ready to lead, innovate, and grow in today’s fast-evolving world!\n\n Over the next few months, I’ll be diving into cutting-edge skills like Generative AI, leadership, and industry engagement, connecting with inspiring mentors and like-minded individuals who are shaping the future.\n\nThis opportunity reaffirms my belief that learning never stops and growth comes from taking bold steps forward. Can’t wait to unlock new possibilities, expand my network, and push my limits! \n\nA huge thanks tofor this incredible opportunity! \n\n To my network: Have you taken a step recently that pushes you toward growth? Let’s connect and inspire each other! ",
        "reactions": {
          "likes": "14\nSahil Ansari and 13 others",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Excellent work Aayushi",
            "userName": "Avanish Prasad",
            "userProfileURL": "https://www.linkedin.com/in/avanishprasad",
            "dataId": "urn:li:comment:(activity:7295418894922485760,7295430011551920130)"
          }
        ],
        "commentAdded": "Congratulations on this amazing opportunity! 🌟 Excited to see how youll leverage these skills to shape the future. Lets empower each other!"
      },
      {
        "postId": "urn:li:activity:7293936422971936768",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293936422971936768",
        "url": "https://www.linkedin.com/in/a-shubham-verma?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACt3g4ABU3a-t-Xyf1pfOmA6njJMIB3qbrM",
        "name": "Shubham Verma\nShubham Verma",
        "content": " Beware of Fake Job Posts on LinkedIn! \n\nLately, I’ve come across several fake pages posting job openings that don’t actually exist. What’s even more concerning is that these pages seem to be connected, as they constantly comment on each other’s posts and artificially boost their follower count.\n\nA common pattern I’ve noticed is that these pages never provide direct links to official company job postings. Instead, they redirect users to third-party platforms like Foundit or Unstop (which don’t even lead to the actual job postings but rather prompt users to create a profile on those platforms for every job link). This raises doubts about their legitimacy. Their goal seems to be engagement farming rather than genuinely helping job seekers.\n\nIt’s alarming that Linkedin's system is allowing such fake accounts to grow unchecked. These scams not only waste people’s time but also create false hope for those genuinely looking for opportunities.\n\nIf you’re job hunting, please be cautious! Always verify job postings by checking the official company website or trusted sources before applying. Also, avoid clicking on random external links shared by unfamiliar pages.\n\nHas anyone else noticed this trend?",
        "reactions": {
          "likes": "1,596",
          "comments": "141 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "I completely agree with you, all these people are just trying to increase followers, they don't care about providing real jobs, they just want to increase the engagement of their posts, they just want to get \"interested\" comments from job seekers on their posts. Most of the people posting jobs just want to increase followers and play with the emotions of a person who is really looking for opportunities.",
            "userName": "Deepak Jha",
            "userProfileURL": "https://www.linkedin.com/in/deepak-jha-018944270",
            "dataId": "urn:li:comment:(ugcPost:7293936422040801280,7293952104887369728)"
          },
          {
            "commentText": "Deepak Jha true!",
            "userName": "Shubham Verma",
            "userProfileURL": "https://www.linkedin.com/in/a-shubham-verma",
            "dataId": "urn:li:comment:(ugcPost:7293936422040801280,7293972406153416704)"
          },
          {
            "commentText": "\n\nWell yeah, these douchebags always make posts of urgent hiring but didn't hire even a single guy or not even reply, only posts fake jobs don't know what they get with this pitty actions.",
            "userName": "Satyam Singh",
            "userProfileURL": "https://www.linkedin.com/in/satyam8932",
            "dataId": "urn:li:comment:(ugcPost:7293936422040801280,7295415321786494976)"
          },
          {
            "commentText": "Satyam Singh they are even not giving actual job link or any site or job on any third party site instead they redirect users to third-party platforms like Foundit or Unstop (which don’t even lead to the actual job postings but rather prompt users to create a profile on those platforms for every job link)",
            "userName": "Shubham Verma",
            "userProfileURL": "https://www.linkedin.com/in/a-shubham-verma",
            "dataId": "urn:li:comment:(ugcPost:7293936422040801280,7295454045031301123)"
          },
          {
            "commentText": "Shubham Verma yeah man I got you... Because of these creeps I also had to create account on these platforms but didn't got a single job interview ‍",
            "userName": "Satyam Singh",
            "userProfileURL": "https://www.linkedin.com/in/satyam8932",
            "dataId": "urn:li:comment:(ugcPost:7293936422040801280,7295456863200952322)"
          }
        ],
        "commentAdded": "Thanks for highlighting this issue! Its crucial to stay vigilant and verify job postings. We need to protect our job-seeking community!"
      },
      {
        "postId": "urn:li:activity:7295313176194158593",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295313176194158593",
        "url": "https://www.linkedin.com/company/kpmgindia/posts",
        "name": "KPMG India\nKPMG India",
        "content": "Building a proactive tax defense strategy and audit preparedness with adequate documentary evidence has become imperative for organisations having intra-group services.’s proprietary tax automation has assisted several enterprises in strengthening the\nsupporting documentation. To know more, click here \n\n|||",
        "reactions": {
          "likes": "41",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Absolutely agree! A robust tax defense strategy is essential. Exciting to see how automation is enhancing compliance. #TaxStrategy #Innovation"
      },
      {
        "postId": "urn:li:activity:7295237710460469248",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295237710460469248",
        "url": "https://www.linkedin.com/groups/3723330?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A3723330-7295237709835476992",
        "name": "Writers and Illustrators Circle\nWriters and Illustrators Circle",
        "content": "Feeling like life’s a hot mess?  Vasistha from the Rig Veda shows you how to dance through chaos and create your own harmony!  Let’s turn turbulence into transformation and chaos into pure magic.  Ready to thrive? ",
        "reactions": {
          "likes": "5",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Absolutely inspiring! Embracing chaos can lead to incredible transformations. Let’s dance our way to harmony and growth! 💃✨ #ThriveTogether"
      },
      {
        "postId": "urn:li:activity:7295320048448016384",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295320048448016384",
        "url": "https://www.linkedin.com/in/sureshkumar-vasikarla-8aaa7595?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABRE5cIBlKewfVAw-rqeVGzD0veO8Z-OZJg",
        "name": "SureshKumar Vasikarla\nSureshKumar Vasikarla",
        "content": "𝗕𝗼𝗼𝘀𝘁 𝗬𝗼𝘂𝗿 𝗦𝗽𝗮𝗿𝗸  𝗣𝗲𝗿𝗳𝗼𝗿𝗺𝗮𝗻𝗰𝗲 𝘄𝗶𝘁𝗵 𝗧𝗵𝗲𝘀𝗲 𝗢𝗽𝘁𝗶𝗺𝗶𝘇𝗮𝘁𝗶𝗼𝗻 𝗧𝗲𝗰𝗵𝗻𝗶𝗾𝘂𝗲𝘀  \n\n================================================\n\n.\n.\n.\n.\n.\n.\n\nApache Spark is a powerful tool for big data processing, but to get the best performance, you need to optimize your Spark jobs. Here are some key techniques to help you achieve that:\n\n1️⃣ . 𝗨𝘀𝗲 𝗗𝗮𝘁𝗮𝗙𝗿𝗮𝗺𝗲/𝗗𝗮𝘁𝗮𝘀𝗲𝘁 𝗼𝘃𝗲𝗿 𝗥𝗗𝗗\n\nDataFrames and Datasets come with built-in optimization modules, thanks to the Catalyst optimizer and Tungsten project. They provide better performance compared to RDDs.\n\n2️⃣ . 𝗦𝗲𝗿𝗶𝗮𝗹𝗶𝘇𝗮𝘁𝗶𝗼𝗻\n\nUse Kryo serialization instead of Java serialization. Kryo is faster and more compact, offering up to 10x better performance.\n\n3️⃣ . 𝗔𝘃𝗼𝗶𝗱 𝗦𝗵𝘂𝗳𝗳𝗹𝗶𝗻𝗴\n\nMinimize shuffling by using operations like `mapPartitions()` instead of `map()`, and `coalesce()` instead of `repartition()`.\n\n4️⃣ . 𝗖𝗮𝗰𝗵𝗶𝗻𝗴 𝗮𝗻𝗱 𝗣𝗲𝗿𝘀𝗶𝘀𝘁𝗲𝗻𝗰𝗲\n\nCache frequently accessed data using `cache()` or `persist()` methods to reduce computation time and improve performance.\n\n5️⃣ . 𝗢𝗽𝘁𝗶𝗺𝗶𝘇𝗲 𝗝𝗼𝗶𝗻𝘀\n\nUse broadcast joins for small datasets to avoid shuffling large amounts of data. This can significantly speed up join operations.\n\n6️⃣ . 𝗧𝘂𝗻𝗶𝗻𝗴 𝗦𝗽𝗮𝗿𝗸 𝗖𝗼𝗻𝗳𝗶𝗴𝘂𝗿𝗮𝘁𝗶𝗼𝗻𝘀\n\nAdjust executor memory, cores, and other configurations based on your workload. Proper tuning can lead to better resource utilization and performance.\n\n7️⃣ . 𝗨𝘀𝗲 𝗕𝘂𝗶𝗹𝘁-𝗶𝗻 𝗙𝘂𝗻𝗰𝘁𝗶𝗼𝗻𝘀\n\nLeverage Spark's built-in functions instead of writing custom UDFs (User Defined Functions). Built-in functions are optimized and perform better.\n\n8️⃣ . 𝗣𝗮𝗿𝘁𝗶𝘁𝗶𝗼𝗻𝗶𝗻𝗴\n\nOptimize data partitioning to ensure even distribution of data across nodes. This helps in parallel processing and reduces data skew.\n\n9️⃣ . 𝗔𝘃𝗼𝗶𝗱 𝗪𝗶𝗱𝗲 𝗧𝗿𝗮𝗻𝘀𝗳𝗼𝗿𝗺𝗮𝘁𝗶𝗼𝗻𝘀\nMinimize the use of wide transformations like `groupByKey()` and `reduceByKey()`, which can cause shuffling and slow down your job.\n\n . 𝗠𝗼𝗻𝗶𝘁𝗼𝗿 𝗮𝗻𝗱 𝗧𝘂𝗻𝗲\n\nContinuously monitor your Spark jobs using Spark UI and other monitoring tools. Identify bottlenecks and tune your jobs accordingly.\n\n\n\nBy implementing these optimization techniques, you can significantly improve the performance of your Spark applications.\n\n\n\n\n\n\nCredits:",
        "reactions": {
          "likes": "43",
          "comments": "12 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Very helpful",
            "userName": "Sattari Sateesh Kumar",
            "userProfileURL": "https://www.linkedin.com/in/sattari-sateesh-kumar",
            "dataId": "urn:li:comment:(ugcPost:7295315219042463744,7295320008585277442)"
          }
        ],
        "commentAdded": "Great insights! Implementing these techniques can truly elevate Spark performance. Excited to optimize my projects further! 🚀"
      },
      {
        "postId": "urn:li:activity:7295441771524763648",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295441771524763648",
        "url": "https://www.linkedin.com/in/hollyamoe?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAFwucIBdyPQvlbR6P9zIIz1f58o7RDiuqQ",
        "name": "Holly Moe\nHolly Moe",
        "content": "8 Habits of Consistent High Achievers\n\nSmall changes, massive results.\n\nThanks to my friend Mike Leber for this inspiring post!\n(Be sure to follow him)\n\nBold moves spark progress,\nBut consistency creates lasting impact.\n\nHigh achievers never rely on luck.\nInstead, they master small habits that fuel massive growth.\n\nThese achievers intentionally build powerful routines.\n\nHere are 8 daily practices that drive their success and can drive yours too:\n\n1. Morning Focus\n↳ Start the day with clarity and intention.\n↳ Purpose fuels peak performance.\n\n2. Focused Task Lists\n↳ Only what moves the needle.\n↳ Saying no is the secret to great results.\n\n3. Regular Skill Growth\n↳ Never stop learning - curiosity is your superpower.\n↳ Continuous growth is the ultimate competitive advantage.\n\n4. Planned Downtime\n↳ Constantly recharge yourself.\n↳ Rest isn't a luxury, it's a necessity.\n\n5. Smart Delegation\n↳ Share the workload.\n↳ Empowering your team multiplies your impact.\n\n6. Continuous Networking\n↳ Relationships are the rocket fuel of success.\n↳ Strong networks create endless opportunities.\n\n7. Evening Review\n↳ Reflect and evaluate your progress daily.\n↳ Self-awareness is the foundation of growth.\n\n8. Regular Feedback\n↳ Seek feedback from peers, mentors, and clients.\n↳ Authentic feedback fuels rapid development.\n\nSuccess isn't about one-time moves.\n\nIt's built on simple habits others overlook.\n\nStart small - results will follow.\n\nI'm focusing on #6 as my daily habit.\n\nWhich habit will you focus on first?\nShare in the comments ⬇️\n\n️ Repost to empower others in their success path\n Followfor more growth strategies.",
        "reactions": {
          "likes": "63",
          "comments": "54 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "You want to be a consistent performer?\n\nHere is what you need to do:\n\n️ Be kind\n️ Show up daily\n️ Be on time always\n️ Prepare the night before\n️ Remember people's name\n️ Actually do the things, you said you would do\n\nAnd a bonus tip:\n\nTry like you mean it (thanks me later)",
            "userName": "Muhammad Husnain",
            "userProfileURL": "https://www.linkedin.com/in/muhammadhusnain-personal-brand-designer",
            "dataId": "urn:li:comment:(ugcPost:7295240978506948608,7295446278602186753)"
          },
          {
            "commentText": "Husnain, thank you for adding this. Have a great day!",
            "userName": "Holly Moe",
            "userProfileURL": "https://www.linkedin.com/in/hollyamoe",
            "dataId": "urn:li:comment:(ugcPost:7295240978506948608,7295448793460719616)"
          },
          {
            "commentText": "Holly Moe You too!",
            "userName": "Muhammad Husnain",
            "userProfileURL": "https://www.linkedin.com/in/muhammadhusnain-personal-brand-designer",
            "dataId": "urn:li:comment:(ugcPost:7295240978506948608,7295449201063161856)"
          },
          {
            "commentText": "Success isn’t about luck—it’s about habits stacked over time. Love how this breaks it down into simple, actionable steps. Consistency always wins!",
            "userName": "Jose Carlos de Wit",
            "userProfileURL": "https://www.linkedin.com/in/josedewit",
            "dataId": "urn:li:comment:(ugcPost:7295240978506948608,7295451784272138241)"
          },
          {
            "commentText": "Jose, you're right! Growth comes from intentional habits, not chance. Small, daily actions create momentum, and over time, consistency outperforms everything else.",
            "userName": "Holly Moe",
            "userProfileURL": "https://www.linkedin.com/in/hollyamoe",
            "dataId": "urn:li:comment:(ugcPost:7295240978506948608,7295452513380573184)"
          }
        ],
        "commentAdded": "Great insights! I love how consistency fuels lasting impact. Ill be focusing on #5 for effective teamwork. What a game changer!"
      }
    ],
    "errors": [
      {
        "postId": "urn:li:activity:7295435040564396032",
        "url": "https://www.linkedin.com/company/mob-avenue/posts",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295465943365799938",
        "url": "https://www.linkedin.com/in/ari-rose?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADDk1lUBjonw1yqLQHfzAuU8Xl__6_QJG5c",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295425801712218113",
        "url": "https://www.linkedin.com/in/aayushi-goel73?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAEmUGJMBtauELAEYrW0NfetDM-dL7Um-Vxw",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293936422971936768",
        "url": "https://www.linkedin.com/in/a-shubham-verma?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACt3g4ABU3a-t-Xyf1pfOmA6njJMIB3qbrM",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295313176194158593",
        "url": "https://www.linkedin.com/company/kpmgindia/posts",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295237710460469248",
        "url": "https://www.linkedin.com/groups/3723330?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A3723330-7295237709835476992",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295320048448016384",
        "url": "https://www.linkedin.com/in/sureshkumar-vasikarla-8aaa7595?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABRE5cIBlKewfVAw-rqeVGzD0veO8Z-OZJg",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295441771524763648",
        "url": "https://www.linkedin.com/in/hollyamoe?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAFwucIBdyPQvlbR6P9zIIz1f58o7RDiuqQ",
        "errors": [
          "Failed to fetch media URL."
        ]
      }
    ]
  },
  {
    "postsData": [
      {
        "postId": "urn:li:activity:7295452914863509504",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295452914863509504",
        "url": "https://www.linkedin.com/in/walterlcrosby?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABnRy4BfAi04dsWOrVfiDq5Fz8C2uALVWA",
        "name": "Walter Crosby\nWalter Crosby",
        "content": "Before you hire that marketing agency, ask this question first: Could your business actually handle an influx of qualified leads right now?\n\nI've seen it countless times - businesses invest heavily in marketing without having the foundation to convert and serve those leads. It's like trying to fill a bucket with holes.\n\nWhat good are 200 leads if you can only handle 50? Growth should be sustainable, not overwhelming.\n\nAsk yourself:\n• Is your sales process documented?\n• Do you have enough staff?\n• Can you maintain quality at scale?\n• Are your systems ready?\n\nSave this post for when you're ready to scale! ",
        "reactions": {
          "likes": "2",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Hard truths -- Better to find them, than have the hard truth find you. \nGood reflection as always Walter Crosby",
            "userName": "Ian Richardson",
            "userProfileURL": "https://www.linkedin.com/in/ianalexanderrichardson",
            "dataId": "urn:li:comment:(activity:7295452914863509504,7295465626809090048)"
          }
        ],
        "commentAdded": "Great insights! Sustainable growth is key. Ensuring your team and systems are ready is crucial before ramping up those leads! 🌟"
      },
      {
        "postId": "urn:li:activity:7295457281838600192",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295457281838600192",
        "url": "https://www.linkedin.com/groups/8352662?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A8352662-7295457280634834944",
        "name": "Growth Mindset & Wellbeing\nGrowth Mindset & Wellbeing",
        "content": "Create a vision for the life you really want - then work relentlessly towards making it a reality.\n\nThis is something I live by.\n\nWhen I decided to rebrand SickFitness last year, I didn’t jump straight into the work.\nI spent months solely focused on creating a vision for the life I wanted.\n\nI asked myself:\n\n️ What do I want for myself and my family in the future?\n️ What does that future look like?\n️ How can I design my business around the life I desire for myself, my wife, and my stepdaughter?\n️ How do all of these things fit together?\n\nI saw myself in the future and engraved that snapshot in my mind.\n\nIt took time - months of deep thinking and refining my vision - but once I had clarity, everything changed.\n\n No more waking up and going through the motions.\n No more aimless effort without direction.\n A clear vision became my blueprint.\n\nIt gave structure to my days, helped me set short-term and long-term goals, and aligned my daily actions with my ultimate purpose.\n\nOnce you have a vision and a plan, the next step is execution.\n\nPut in the work EVERY single day. No matter how you feel.\n\nWhether it’s your career, your fitness, or any other goal in life -\nHave a vision for where you want to go.\n\nLet your vision be your destination.\nLet your plan be the roadmap.\nThen show up and execute.\n\nIf you struggle to create a clear vision for your health and fitness goals, I’m here to help.\n\nWith over 20 years as a strength and conditioning specialist, I’ve helped over a thousand people design their roadmap for success. Let’s build yours.\n\n Visit. You're capable of so much more than you think. ",
        "reactions": {
          "likes": "7",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Love this approach! A clear vision truly transforms our path to success. Excited to see how SickFitness evolves with your dedication!"
      },
      {
        "postId": "urn:li:activity:7295455663499972609",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295455663499972609",
        "url": "https://www.linkedin.com/in/megapplegate?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAL6qTIBf7ULneeXg9gxLQJ_oGC2kgIG4PM",
        "name": "Meg Applegate\nMeg Applegate",
        "content": "This isn't the sexiest part of a job search, but it'll make you LOOK it. Adopt the lazy genius way to make it easy.\n\nWhat am I talking about?\n\n Company Research.\n\nBe genius about what matters and lazy about what doesn't  That's the motto of Kendra Adachi's 2020 read, The Lazy Genius Way.\n\nA targeted job search is an effective one. One important tool in your toolkit is a target company list.\n\nI'm talking a list of 20-30 employers (maybe more, maybe less) that you want to work for.\n\nDoing this research work sets up your job search strategy and gives you the gems for impactful convos. Because when the time comes for interviews and networking meetings, you'll know what's trending and the pain points (and wins) of your company of interest.\n\nSo, what can you do now to make your job search easier in terms of research?\n\nThree things are top of mind \n\nWhat are you lazy-geniusing? Yep, it's a verb now ",
        "reactions": {
          "likes": "15",
          "comments": "15 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Here are more ideas on how to uncomplicate your career growth (ahem small actions now for big impact later) - https://www.hingeresume.com/blog/career-growth-made-simple-uncomplicate-your-next-steps-with-this-one-question-lx75b",
            "userName": "Meg Applegate",
            "userProfileURL": "https://www.linkedin.com/in/megapplegate",
            "dataId": "urn:li:comment:(ugcPost:7295432197627412480,7295433078175354880)"
          },
          {
            "commentText": "Sarah Johnston has a great article on how to build a target company list. Read it here: https://www.briefcasecoach.com/experts-guide-to-creating-targeted-company-lists/",
            "userName": "Meg Applegate",
            "userProfileURL": "https://www.linkedin.com/in/megapplegate",
            "dataId": "urn:li:comment:(ugcPost:7295432197627412480,7295432865712865280)"
          }
        ],
        "commentAdded": "Great tips! Targeted research can truly set you apart. 📈 Ready to make my list of dream companies! #JobSearch #LazyGenius"
      },
      {
        "postId": "urn:li:activity:7295103522209968128",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295103522209968128",
        "url": "https://www.linkedin.com/in/nona-prather-b5663010a?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABuAYXIBi7sSvrYjNrRn52Kia7vOCxjVrRM",
        "name": "Nona Prather\nNona Prather",
        "content": "I’m excited to share my Facebook group (Speaker Elevation) dedicated to connecting and empowering professional speakers! \n\nWhether you're looking to improve your speaking skills, share experiences, or network with industry peers, this community is for you. Join us to learn, grow, and elevate your speaking career!\n\nHere is the link below!",
        "reactions": {
          "likes": "12\nNona Prather and 11 others",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "",
            "userName": "Jesse Cruz",
            "userProfileURL": "https://www.linkedin.com/in/jesse-cruz-133714164",
            "dataId": "urn:li:comment:(activity:7295103522209968128,7295109915382009858)"
          }
        ],
        "commentAdded": "Great initiative! Connecting with fellow speakers can truly elevate our skills. Excited to join and learn from this vibrant community! 🎤✨"
      },
      {
        "postId": "urn:li:activity:7295152335415123968",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295152335415123968",
        "url": "https://www.linkedin.com/in/tomaszboinski?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAT6i3EBTB8A6x-CZu_4t39xy5C77FfuZhM",
        "name": "Tomasz Boinski\nTomasz Boinski",
        "content": " 10,000 \nhashtag\n#linkedin \nhashtag\n#followers?! Is this real life?!  Now, 10,000 amazing people have hit that “Follow” button!\n 10,000 reasons to celebrate\n 10,000 brains full of brilliance\n 10,000 opportunities to keep growing\nThank you all for the support, engagement, and for pretending to laugh at my jokes.  Here’s to the next 10,000! ",
        "reactions": {
          "likes": "25",
          "comments": "7 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Nicely earned Tomasz Boinski\nI just hit 15k but its been a long time coming! ",
            "userName": "🎸Geoff Koboldt, MBA 🎸",
            "userProfileURL": "https://www.linkedin.com/in/koboldt",
            "dataId": "urn:li:comment:(activity:7295152335415123968,7295230120837951488)"
          },
          {
            "commentText": "Geoff Koboldt, MBA  I'm here since August 2010... 5 years ago had 2500 if I remember correctly.",
            "userName": "Tomasz Boinski",
            "userProfileURL": "https://www.linkedin.com/in/tomaszboinski",
            "dataId": "urn:li:comment:(activity:7295152335415123968,7295231745858187266)"
          },
          {
            "commentText": "Tomasz Boinski 2005 for me... and back then around 2005-2010, I had about 3-4k, which was a lot. I use to message all my contacts at least 1x/year back then...and only about 3-4% would ever write back. Thankfully about 2 years ago, LI cleaned up some ghost connections and reduced me down about 1500, which was great. I just want an engaged community!",
            "userName": "🎸Geoff Koboldt, MBA 🎸",
            "userProfileURL": "https://www.linkedin.com/in/koboldt",
            "dataId": "urn:li:comment:(activity:7295152335415123968,7295232698481065985)"
          },
          {
            "commentText": "Whoohoo! We are both celebrating for hitting new follower goals. I am so excited for you, my friend. Onwards to 20k.",
            "userName": "Daniel Hemhauser",
            "userProfileURL": "https://www.linkedin.com/in/danielhemhauser",
            "dataId": "urn:li:comment:(activity:7295152335415123968,7295255585724252160)"
          },
          {
            "commentText": "Daniel Hemhauser well done  ️",
            "userName": "Tomasz Boinski",
            "userProfileURL": "https://www.linkedin.com/in/tomaszboinski",
            "dataId": "urn:li:comment:(activity:7295152335415123968,7295259360148996097)"
          }
        ],
        "commentAdded": "Congrats on this incredible milestone! 🎉 Heres to the next 10,000 and all the amazing connections ahead. Keep shining! #community"
      },
      {
        "postId": "urn:li:activity:7295444262106595328",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295444262106595328",
        "url": "https://www.linkedin.com/in/michaelocean?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABRkVVcBdJXrbHnrLNPe5NG3L1FNnS_LDdw",
        "name": "Michael Ocean\nMichael Ocean",
        "content": "\"Look, I launched 3 enablement programs in the last 2 quarters. Want to know how many actually moved the needle on revenue? None.\"\n\n\nBeen there? Yeah, it's frustrating.\n\n\nHere's the thing - you need to know what actually works before pouring more resources into training. Because let's be honest, if you can't show impact, you're just another cost center in the eyes of leadership.\n\n\nLet's talk about what's really going on:\n\n\n- We're all running programs blindly - no clue which reps need what help\n- Sure, some reps crush it, but what are they doing differently?\n- And how do we know if any of our training sticks in real sales calls?\n\n\nHere's how we fix it:\n\n- Finally see what makes your top performers different\n- Turn their winning moves into AI roleplays everyone can practice\n- Give every rep their own AI coach to make sure the training actually sticks\n\n\nImagine walking into your next meeting with the CRO and showing exactly how your work impacts the bottom line.\n\n\nGot a team of 20+ sellers? Let's talk about making your enablement efforts count → Book a demo at",
        "reactions": {
          "likes": "16",
          "comments": "4 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/940d9276-3e0a-4c1b-807d-7ac925309ccb",
        "comments": [
          {
            "commentText": "Talking to yourself takes on a whole new meaning now haha \n\nMy favorite part is definitely talking to the coach after roleplays or client calls, asking any questions you have, and not just what's written in your scorecards. Makes it so much easier to learn and improve. You can even rant about things, and no one judges you! ",
            "userName": "Yana Yabloneva",
            "userProfileURL": "https://www.linkedin.com/in/yana-yabloneva",
            "dataId": "urn:li:comment:(ugcPost:7295444140958334976,7295447438998347776)"
          },
          {
            "commentText": "Too much enablement happens in a vacuum, with no clear way to measure impact. \n\nUnderstanding > guesswork. \n\nWhat specific insight from top performers completely shift how a team approaches sales?",
            "userName": "Mike D'Angelo",
            "userProfileURL": "https://www.linkedin.com/in/mdangelo",
            "dataId": "urn:li:comment:(ugcPost:7295444140958334976,7295450079149129728)"
          }
        ],
        "commentAdded": "Absolutely agree! It’s crucial to align training with measurable outcomes. Let’s revolutionize enablement to drive real impact! 💡"
      },
      {
        "postId": "urn:li:activity:7295464549195857920",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295464549195857920",
        "url": "https://www.linkedin.com/in/lauraallencoach?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABnM8FwBQs2rGdO5yYbLKS7gm8hb_uSQ1oY",
        "name": "Laura Allen\nLaura Allen",
        "content": "Why I am so glad I put my course on Udemy:\n\nBecause it’s insanely affordable! £14.99!?!?\n\nMy 1-1 coaching costs used to price a lot of people out who really needed the help because they couldn’t afford it.\n\nSo instead, I used to put out as many free resources as I could including webinars and workbooks but it wasn’t enough.\n\nBut now that has all changed!\n\nMy 1-1 package has been turned into a self study course on Udemy and can be accessed by anyone worldwide \n\nYou get the same programme content plus MORE and I guide you every step of the way.\n\nAnd the best bit!\n\nYou wIll get the same results as if it was 1-1 coaching \n\nHow do I know that?\n\nWell, read the reviews from people who have done it and see ️\n\nIf you want to explore a change change but don't know where to start, start here!\n\nFor £14.99 you have nothing to lose and an entirely new life to gain!",
        "reactions": {
          "likes": "40",
          "comments": "6 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Love this move—making coaching accessible to everyone is a total game-changer! ",
            "userName": "Naime Khan",
            "userProfileURL": "https://www.linkedin.com/in/digiticn",
            "dataId": "urn:li:comment:(ugcPost:7295452435060281344,7295454274812067841)"
          },
          {
            "commentText": "Love this! Affordable learning is a game changer. Can’t wait to see how many lives you’ll transform! ",
            "userName": "Khushi Verma",
            "userProfileURL": "https://www.linkedin.com/in/khushi-verma-bb1b991a0",
            "dataId": "urn:li:comment:(ugcPost:7295452435060281344,7295460560572190720)"
          }
        ],
        "commentAdded": "What an incredible opportunity! Making quality coaching accessible is a game-changer. Excited to see the positive impact this will have! 🌟"
      },
      {
        "postId": "urn:li:activity:7295458519728697344",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295458519728697344",
        "url": "https://www.linkedin.com/company/vista-business-group/posts",
        "name": "Vista Business Group\nVista Business Group",
        "content": "The hardest part of selling your business with Vista will be deciding where you want to go afterwards.",
        "reactions": {
          "likes": "3",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Exciting times ahead! It’s all about envisioning your next adventure. What opportunities are you considering post-sale? 🚀"
      },
      {
        "postId": "urn:li:activity:7295464169594617856",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295464169594617856",
        "url": "https://www.linkedin.com/company/kpmgindia/posts",
        "name": "KPMG India\nKPMG India",
        "content": "The KPMG global \nhashtag\n#techreport 2024 highlights a pivotal shift in how organisations engage with \nhashtag\n#technology – transitioning from a reactive stance to a more strategic, value-focussed model. Although the majority of organisations report productivity gains driven by\n, challenges such as\naversion and inadequate\nremain significant barriers to transformation:,.\n\n Read more in",
        "reactions": {
          "likes": "12",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "It's great to see KPMG India leading the conversation on the strategic role of technology in driving productivity. Addressing the challenges while embracing the opportunities will be key to transformative growth.",
            "userName": "Key Software Services Private Limited",
            "userProfileURL": "https://www.linkedin.com/company/keyssin/posts",
            "dataId": "urn:li:comment:(ugcPost:7295446464212705281,7295466233947205632)"
          }
        ],
        "commentAdded": "Exciting insights! Embracing a strategic tech approach is crucial for overcoming barriers and maximizing productivity. #TechReport2024"
      },
      {
        "postId": "urn:li:activity:7295457227656613888",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7295457227656613888",
        "url": "https://www.linkedin.com/groups/13927028?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A13927028-7295457226385678336",
        "name": "Brain Expansion Group\nBrain Expansion Group",
        "content": "Create a vision for the life you really want - then work relentlessly towards making it a reality.\n\nThis is something I live by.\n\nWhen I decided to rebrand SickFitness last year, I didn’t jump straight into the work.\nI spent months solely focused on creating a vision for the life I wanted.\n\nI asked myself:\n\n️ What do I want for myself and my family in the future?\n️ What does that future look like?\n️ How can I design my business around the life I desire for myself, my wife, and my stepdaughter?\n️ How do all of these things fit together?\n\nI saw myself in the future and engraved that snapshot in my mind.\n\nIt took time - months of deep thinking and refining my vision - but once I had clarity, everything changed.\n\n No more waking up and going through the motions.\n No more aimless effort without direction.\n A clear vision became my blueprint.\n\nIt gave structure to my days, helped me set short-term and long-term goals, and aligned my daily actions with my ultimate purpose.\n\nOnce you have a vision and a plan, the next step is execution.\n\nPut in the work EVERY single day. No matter how you feel.\n\nWhether it’s your career, your fitness, or any other goal in life -\nHave a vision for where you want to go.\n\nLet your vision be your destination.\nLet your plan be the roadmap.\nThen show up and execute.\n\nIf you struggle to create a clear vision for your health and fitness goals, I’m here to help.\n\nWith over 20 years as a strength and conditioning specialist, I’ve helped over a thousand people design their roadmap for success. Let’s build yours.\n\n Visit. You're capable of so much more than you think. ",
        "reactions": {
          "likes": "7",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Absolutely inspiring! A clear vision truly transforms effort into purpose. Excited to see how your roadmap helps others find their path! 🌟"
      }
    ],
    "errors": [
      {
        "postId": "urn:li:activity:7295452914863509504",
        "url": "https://www.linkedin.com/in/walterlcrosby?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABnRy4BfAi04dsWOrVfiDq5Fz8C2uALVWA",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295457281838600192",
        "url": "https://www.linkedin.com/groups/8352662?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A8352662-7295457280634834944",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295455663499972609",
        "url": "https://www.linkedin.com/in/megapplegate?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAL6qTIBf7ULneeXg9gxLQJ_oGC2kgIG4PM",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295103522209968128",
        "url": "https://www.linkedin.com/in/nona-prather-b5663010a?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABuAYXIBi7sSvrYjNrRn52Kia7vOCxjVrRM",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295152335415123968",
        "url": "https://www.linkedin.com/in/tomaszboinski?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAT6i3EBTB8A6x-CZu_4t39xy5C77FfuZhM",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295464549195857920",
        "url": "https://www.linkedin.com/in/lauraallencoach?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABnM8FwBQs2rGdO5yYbLKS7gm8hb_uSQ1oY",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295458519728697344",
        "url": "https://www.linkedin.com/company/vista-business-group/posts",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295464169594617856",
        "url": "https://www.linkedin.com/company/kpmgindia/posts",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7295457227656613888",
        "url": "https://www.linkedin.com/groups/13927028?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A13927028-7295457226385678336",
        "errors": [
          "Failed to fetch media URL."
        ]
      }
    ]
  }
]