{
  "posts": [
    {
      "postId": "urn:li:activity:7287512310967873536",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287512310967873536",
      "url": "https://www.linkedin.com/in/stevenkamensky?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAKdCREB47gRHqS_iAkoL2KbGVRlpmaERKA",
      "name": "steven kamensky\nsteven kamensky",
      "content": "We are all human, and we make mistakes.\nRemember, every stumble is a lesson in disguise. The past is a treasure trove of wisdom, not a burden. Learn from it, then let it go. Keep your energy positive and don't let the past replay in your mind, draining your present.\nLive each day to the fullest.\nEmbrace the now, cherish each moment, and radiate positivity. The future is yours to create. Have a fantastic day ahead!\nFeel free to tweak it to your liking!  Keep shining and spread the positivity! \nexpand on above\nAbsolutely! Here's a more detailed version of the inspirational post:\nWe are all human, and we make mistakes.\nEmbrace the fact that no one is perfect. Each mistake is a stepping stone on the path of growth. The past serves as a classroom, teaching us valuable lessons that shape who we are today. While it's essential to reflect and learn, it's equally important to release the weight of past errors.\nThe past is for learning, and then moving on.\nHolding onto past mistakes and regrets only hinders our progress. Channel your energy towards the present and future, where new possibilities await. Don’t let the past replay in your mind, draining your present energy. Keep your focus on the here and now, where you have the power to create positive change.\nKeep your energy positive.\nSurround yourself with positivity and let go of negative thoughts that hold you back. Cultivate a mindset that sees opportunities in every challenge. Your energy is precious—use it to uplift yourself and those around you.\nLive each day to the fullest.\nCherish each moment and make the most of every day. Engage in activities that bring you joy and fulfillment. Spend time with loved ones, pursue your passions, and don't be afraid to step out of your comfort zone. Life is a beautiful journey, and each day is a gift waiting to be unwrapped.\nHave a great day ahead!\nStart your day with a smile and a heart full of gratitude. Embrace the new day with enthusiasm and optimism. Remember, the future is yours to create, one positive step at a time.\nFeel free to personalize this further! Here's to embracing each day with positivity and purpose.  Have an amazing day ahead! ",
      "reactions": {
        "likes": "0",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Absolutely love this perspective! Every mishap truly is a lesson in disguise. Lets embrace each moment and keep shining together! ✨"
    },
    {
      "postId": "urn:li:activity:7287510721905471488",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287510721905471488",
      "url": "https://www.linkedin.com/in/nbstagge?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAATnuucByGwl32yGUrVxrwutwtfYfM6bNqk",
      "name": "nick stagge 💭\nnick stagge 💭",
      "content": "\"You may have mouth cancer. It's a 50/50 survival rate & the life expectancy is 18 months.\"\n\n(spoiler alert, I'm ok)\n\nI was just going in for a small lump in my lip. No biggie. After spending 30 seconds digging around in my mouth my doctor looked straight into my eyes and delivered the potential diagnosis.\n\nI was shook to my core.\n\nI tried to be brave, but the second I got to my car I burst into hysteria, unsure how to tell my family or what to do next. What. The. Actual. F?\n\nAfter a few phone calls I was able to get a same day appointment with a specialist (what are the odds). My wife was on her way in to meet me when the new doctor took a look and assured me that I was going to be okay.\n\nAn hour later, the lump was removed from my lip. My new doctor was confident it wasn't cancer, and they were sending it off to be tested just in case.\n\nEven though this whole experience only lasted a few hours, it was an emotionally exhausting day & weekend. It really makes you sit back and evaluate what is truly important in this life.\n\nFor me: that's spending meaningful time with my wife & my kids. Everything else comes second. A distant second. A very distant second.",
      "reactions": {
        "likes": "18",
        "comments": "9 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "I wish these focusing moments could be had a lower cost. But it important to understanding what you truly value and where you want to spend your time. \n\nSometime I will have to tell you about some of my focusing moments. Not fun, but so necessary.",
          "userName": "Jordan Smith",
          "userProfileURL": "https://www.linkedin.com/in/roninconsultingllc",
          "dataId": "urn:li:comment:(activity:7287510721905471488,7287516354046304258)"
        },
        {
          "commentText": "Man hopefully that’s not a direct quote from your dentist… things like that not explained well can ruin so much so fast, especially when it’s something that serious. Glad you’re all good ",
          "userName": "Austin DeSpain, 👀",
          "userProfileURL": "https://www.linkedin.com/in/austindespain",
          "dataId": "urn:li:comment:(activity:7287510721905471488,7287514463421837312)"
        }
      ],
      "commentAdded": "Thank you for sharing your experience! Its a powerful reminder to cherish our loved ones and prioritize what truly matters in life. Wishing you continued health!"
    },
    {
      "postId": "urn:li:activity:7287516119181967360",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287516119181967360",
      "url": "https://www.linkedin.com/in/ashleywright1?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAALFyAEB6VHfncn6YKEhnzMW_Irp3MCdnlU",
      "name": "Ashley Wright\nAshley Wright",
      "content": "What a week it’s been...\n\nWhy?\n\nThe uncertainty surrounding TikTok in the US has been the talk of the town.\n\nBut here’s the shift we’re seeing: confidence among brands is growing.\n\nNot just in the US, but globally.\n\nThis week has been a powerful reminder that while diversification is crucial,\n\nSocial commerce is here to stay.\n\nWhat we’ve mastered through TikTok Shop is highly transferrable\n\nWe’re fortunate to work with brands across multiple markets\n\nA reach that’s only growing stronger.\n\nIt’s not \"business as usual\" for us.\n\nWe’re constantly reimagining ways to overdeliver for our brands\n\nNo matter where they are in the world.\n\nBecause here’s the truth:\n\nThe brands that stick with us\n\nTrust the process\n\nPlay the long game\n\nAre the ones reaping the rewards.\n\nWe’re writing an incredible chapter together\n\nCan’t wait to see what’s next. ",
      "reactions": {
        "likes": "7",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Exciting times ahead! 🌍 Embracing change and innovation in social commerce is key. Excited to see the next chapter unfold! #BrandGrowth"
    },
    {
      "postId": "urn:li:activity:7287503790474186753",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287503790474186753",
      "url": "https://www.linkedin.com/in/walkerdeibel?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAOuGsBTul6kKDjIbaaJPNFoIIJzQMbuIg",
      "name": "Walker Deibel\nWalker Deibel",
      "content": "The secret to building generational wealth isn't starting from scratch.\n\nIt's combining these 3 asset classes strategically:\n\nI've acquired 7 companies since 2006, building a $16.5M revenue portfolio.\n\nBut the real wealth isn't in businesses alone - it's how you combine different asset classes to create exponential growth.\n\nThe wealthiest people understand this formula.\n\nThey don't just pick one asset class - they strategically combine three:\n\n1. Business Assets\n\nThe foundation of wealth building.\n\nWhen you buy an existing business, you get:\n• Both tangible and intangible value\n• Working systems and processes\n• Proven cash flow from day one\n• Established customer base\n\n2. Real Estate\n\nTiming is critical here.\n\nWait until your business generates consistent cash flow, then:\n• Use that cash flow to acquire strategic properties\n• Leverage physical assets as collateral\n• Create stability in your portfolio\n• Build long-term appreciation\n\n3. Intellectual Property\n\nThis is what separates the wealthy from the ultra-wealthy:\n\n• Patents, trademarks, content\n• Passive income generation\n• Unlimited scaling potential\n• No physical limitations\n\nThe magic happens when you combine these assets correctly, they multiply each other:\n\n• Business cash flow funds real estate investments\n• Real estate provides collateral for expansion\n• IP creates new opportunities for both\n\nBut there's one important thing you must not forget...\n\nDon't try to do everything at once.\n\nStart with one business. Get it generating consistent cash flow.\n\nThen expand strategically into real estate and IP.\n\nThe framework I've shared isn't theory - it's exactly what I've done to build sustainable wealth that:\n• Generates consistent cash flow\n• Appreciates over time\n• Can be passed down generationally\n\nYou don't need to start from scratch.\n\nIn fact, buying an existing business is often the fastest path to financial freedom.\n\nWant to learn more about buying businesses?\n\nGet my weekly newsletter here →",
      "reactions": {
        "likes": "49",
        "comments": "4 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Walker Deibel this is right on. Strategic wealth building is about synergy, not silos, and you really get the synergies when you have your ecosystem in place. Combining operating businesses with real estate and IP creates a self-reinforcing ecosystem: cash flow fuels acquisitions, assets drive stability, and IP unlocks scalable growth. Success hinges on disciplined execution. Great advice to master one asset class before layering in others. This approach turns ambition into enduring legacy.",
          "userName": "Craig Miller",
          "userProfileURL": "https://www.linkedin.com/in/ccmiller",
          "dataId": "urn:li:comment:(activity:7287499267328409601,7287514830117236736)"
        }
      ],
      "commentAdded": "Great insights! Combining these asset classes can truly accelerate wealth building. Excited to learn more about your strategies!"
    },
    {
      "postId": "urn:li:activity:7287465211979083779",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287465211979083779",
      "url": "https://www.linkedin.com/in/jakedunlap?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAENCicB0qY59ybik0DUN4FzM8lk0Rq6bjk",
      "name": "Jake Dunlap\nJake Dunlap",
      "content": "I have a completely new revenue and GTM playbook we are deploying for sales reps and teams in 2025\n\nThe reason most sales and revenue teams aren't getting better, faster?\n\nWe only implement \"homerun\" strategies like new playbooks, new tools, and their revenue support teams don't have a seat at the table on what to fix\n\nWinning sales reps and sales teams are focused on 4 things - that's it:\n\n1. Benchmarked performance: We know our numbers for our GAINS metrics. Pipeline Velocity, Sales Cycle by Stage, Win rate by Stage, NRR, and Rep Productivity\n\n2. Their Revenue Operations and Enablement groups aren't regulated to answering tickets and building reports or trainings the nobody looks at. They are strategically aligned to create incremental wins in the GAINS metrics.\n\n3. The sales reps ALL know their own numbers and have personalized development plans to improve the bottlenecks in their process. Reps can coach themselves.\n\n4. Front line leaders spend less time on pipeline conversations and more time building reps skills to impact the metric the rep is focused on. They stop \"checking in on deals\" and start \"working with Timmy on how we can increase win rate from stage 2 to 3\"\n\nPick ONE  of the above and watch what happens\n\nThat's it...andand I go hard on this on the AI Powered Seller Podcast - Episode three drops tomorrow!",
      "reactions": {
        "likes": "12",
        "comments": "5 comments",
        "shares": "0"
      },
      "mediaUrl": "blob:https://www.linkedin.com/242d3500-606f-4f73-bb0a-046cd378bc44",
      "comments": [
        {
          "commentText": "Pipeline Velocity doesn't \"measure\" anything...it's purely a forecasting mechanism...and a highly unstable and volatile forecasting mechanism.\n\nYou cannot measure past or current performance using a guess about the future, and that's what Pipeline Velocity is....a guess about future events that haven't even happened yet!\n\nHow can PAST performance be measured based on make-believe events somewhere off in the FUTURE that have never occurred?\n\nTake nine minutes and watch this video and it'll be 100% clear why you can't use Pipeline Velocity as a \"performance metric\".",
          "userName": "Dale W. Harrison",
          "userProfileURL": "https://www.linkedin.com/in/dalewharrison",
          "dataId": "urn:li:comment:(ugcPost:7285310681510223872,7287474120055758848)"
        }
      ],
      "commentAdded": "Exciting insights! Focusing on benchmarked performance could truly transform sales success. Cant wait to hear more on the podcast!"
    },
    {
      "postId": "urn:li:activity:7287449827527852032",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287449827527852032",
      "url": "https://www.linkedin.com/in/houseofbricks?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAA-MkMBNOorFGtIDG0boxkwxMypXZhfUgk",
      "name": "Michael Kainatsky\nMichael Kainatsky",
      "content": "Do you know the difference between a network and an audience?\n\n\nMany people likely believe that their connections and followers\nare their network.\n\nHow many of your connections do you really know?\n\nA very small percentage.\n\nMany big creators boast those figures and sell the growth.\n\nHave you ever actually thought about their engagement\n\nrelative to their following?\n\n200k followers, 1k likes and usually, less than 10% of that comments?\n\nHave you even read through the comments?\n\nThe ones that aren't repetitive pod engagements\n\nare just AI completely devoid of real insight.\n\nIs that good engagement?\n\nAll that work to build followers and a strong network to have\n\nhardly anyone care to leave their thoughts?\n\nReal genuine engagement onis only dependent on\n\nthe quality of connections you establish.\n\nThe people that value your POV and consider you as one of their VIPs.\n\nThe best creators get greater than 70% comments to likes ratio.\n\nWhy?\n\nBecause there are real conversations taking place.\n\nWhy are the gurus getting 1/10 of their likes as comments?\n\nBecause their \"networks\" are not real.\n\nYou can accomplish more with 500 real connections\n\nthan they could with 100k followers.\n\nThis platform has become the equivalent of a beauty magazine.\n\n-> Photo shopped pictures\n-> Manufactured personalities\n-> Fabricated success\n-> Counterfeit authority\n-> Pretend popularity\n\n\"Don't read beauty magazines; they will only make you feel ugly.\"\n- Mary Schmich\n\nYours truthfully,",
      "reactions": {
        "likes": "40",
        "comments": "44 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "I stopped paying attention to comments, likes and followers, blah blah a long time ago. \n\nI'm connecting with people who share my vibes and interests.\n\nUnfortunately, there are many people who are deceived and pay a high price for this fake stuff, but we can't help save the world.\n\nUnfortunately, people, similar to young children, learn when they are in trouble or hurt that something is wrong and thereafter they will not do it again.",
          "userName": "Vilislava Dimbareva",
          "userProfileURL": "https://www.linkedin.com/in/vilislava-dimbareva-3a70b8138",
          "dataId": "urn:li:comment:(activity:7287449198612889600,7287507548243402752)"
        }
      ],
      "commentAdded": "Absolutely! Real engagement stems from meaningful connections. Quality over quantity is key—let’s prioritize genuine interactions!"
    },
    {
      "postId": "urn:li:activity:7287452064912232449",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287452064912232449",
      "url": "https://www.linkedin.com/in/gbrentbarkin?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAI5v54B8OquVDdHfjnHpuC9Ga3eD6YsXtk",
      "name": "G. Brent Barkin\nG. Brent Barkin",
      "content": "Continuing the 2025 post series with post 10.\n\nPart of the reason that Coach Saban was the advent of NIL and the impact it was having to his plethora of recruits begging to be part of his “system.”\n\nNo doubt Saban had a winning formula, recruit great players and make them even better through discipline and outright insanely good coaching- yes I’m from Alabama so I’m biased.\n\nThen along came NIL and the promise of acareer wasn’t enough. “Show me the money” became the mantra, and that was what it took to move Nick on from coaching- but not the game.\n\nHe sees that this\nworld isn’t the answer. Change must occur.\n\nI think about this myself nearly every day. But what, specifically, is the solution, Coach?\n\nSalary caps? Limits on number of transfers? Loss of a year of eligibility after the first transfer? What else?\n\nLet’s discuss.",
      "reactions": {
        "likes": "3\nG. Brent Barkin and 2 others",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Great insights! Balancing talent retention and fair compensation is crucial. How about exploring a combination of salary caps and transfer limits?"
    },
    {
      "postId": "urn:li:activity:7287515336348774403",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287515336348774403",
      "url": "https://www.linkedin.com/in/johnkraski?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABkbm-0Be4xxSTDslQoX9c9qcRoExoNAGWk",
      "name": "John Kraski\nJohn Kraski",
      "content": "Are you struggling to create content on LinkedIn?\n\nStop thinking your content should only be posted once and then stay in a mausoleum until you die.\n\nStart realizing the TV shows and films you love are replayed millions of time.\n\nFind your best stuff and keep reusing it.\n\nMost people aren’t fully reading your stuff anyway.\n\nTrust me on this one.",
      "reactions": {
        "likes": "23",
        "comments": "12 comments",
        "shares": "0"
      },
      "mediaUrl": "blob:https://www.linkedin.com/3da6fd98-22c9-4485-bb37-1673c4c79a2a",
      "comments": [
        {
          "commentText": "John Kraski \"Look at every major platform - they're all moving toward TikTok-style engagement. \nShort videos. Personality. Authenticity. No AI BS.\nJust real people with real stories to tell\nLinkedin is doing the same thing.\nThe signs are pretty clear:\n• Pushing video content harder\n• Favoring authentic over corporate bs\n• Moving away from traditional \"business speak\"\n• Preparing for the next generation of professionals who engage via content instead of cold automated DMs\nThe algorithm is deprioritizing what used to work pre 2025\"",
          "userName": "Tomasz Boinski",
          "userProfileURL": "https://www.linkedin.com/in/tomaszboinski",
          "dataId": "urn:li:comment:(ugcPost:7287512203690201088,7287515298658693120)"
        },
        {
          "commentText": "Nailed it Tomasz Boinski!",
          "userName": "John Kraski",
          "userProfileURL": "https://www.linkedin.com/in/johnkraski",
          "dataId": "urn:li:comment:(ugcPost:7287512203690201088,7287515830223851520)"
        }
      ],
      "commentAdded": "Absolutely! Recycling great content not only maximizes reach but also reinforces key messages. Let’s keep the conversation going! 🚀"
    },
    {
      "postId": "urn:li:activity:7287514190544613376",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287514190544613376",
      "url": "https://www.linkedin.com/in/keithsconiers?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAiFgPQBYU0OqvdvlKoHET8lLuqoZwghCFE",
      "name": "Keith Sconiers\nKeith Sconiers",
      "content": "Keep inspiring us Kirby Porter! Thanks for documenting this for us Kasey Brown!",
      "reactions": {
        "likes": "0",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Absolutely! Kirbys journey is truly motivating, and Kasey’s documentation brings valuable insights. Keep up the great work!"
    },
    {
      "postId": "urn:li:activity:7287485768254541825",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287485768254541825",
      "url": "https://www.linkedin.com/in/jeanlarkin?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAuRg7UBs2-nUoTUPgIJglWeI72dbsrkMXk",
      "name": "Jean Larkin\nJean Larkin",
      "content": "Remote work matters more now than ever before.\n\nA few weeks ago, I woke up to a massive snowstorm. \n\nRoads were declared “impassable,” and authorities warned against all non-essential travel.\n\nIt got me thinking:\n\nWhat happens to employees in companies that refuse to embrace remote work even when natural disasters, family emergencies, or other life events arise?\n\nThe answer is stark:\n1️⃣ Some businesses shut down entirely, grinding operations to a halt.\n2️⃣ Others are severely understaffed, forcing employees to take sick or unpaid days.\n3️⃣ And worst of all, some put their people in danger, requiring commutes through unsafe conditions, causing stress, and risking accidents.\n\nThis isn’t just inconvenient—it’s irresponsible.\n\nRemote work is no longer a perk—it’s a necessity.\n• The benefits extend far beyond personal convenience. Remote and hybrid work models:\n• Prioritize safety: Employees aren’t risking their lives or well-being for a commute.\n• Increase resilience: Operations continue seamlessly, regardless of external disruptions.\n• Support dedicated work time: Flexibility empowers employees to navigate their responsibilities without sacrificing performance.\n\nWork is evolving—why aren’t all companies keeping up?\n\nWith modern technology and tools, most knowledge work can be done remotely. Offering flexibility isn’t just about attracting top talent; it’s about creating a sustainable, human-focused workplace where employees can thrive no matter the circumstances.\n\nIt’s time for companies to embrace remote and hybrid work—not as a trend, but as a foundational part of how we work.\n\nThe question isn’t if your organization should prioritize flexibility. It’s when.\n\nThis post was inspired by a thought-provoking conversation started by, founder of, about the critical need for companies to adapt to the future of work on the morning a snowstorm shut this city down.\n\nWhat’s stopping your company from fully embracing remote work?\n\nOr, if you’ve already made the shift, how has it impacted your team?",
      "reactions": {
        "likes": "15\nJon Leslie 🔵 and 14 others",
        "comments": "8 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Remote-first companies are more resilient. They don't rely on people making it to an office to ensure continued operations. Big storm? Employee's don't have to risk the roads, and the company stays business as usual.",
          "userName": "Jon Leslie 🔵",
          "userProfileURL": "https://www.linkedin.com/in/jondavidleslie",
          "dataId": "urn:li:comment:(activity:7287468988349976576,7287485709064548352)"
        }
      ],
      "commentAdded": "Absolutely agree! Embracing remote work isn’t just smart—its essential for employee well-being and business continuity. Lets drive the change!"
    }
  ],
  "errors": [
    {
      "postId": "urn:li:activity:7287512310967873536",
      "url": "https://www.linkedin.com/in/stevenkamensky?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAKdCREB47gRHqS_iAkoL2KbGVRlpmaERKA",
      "errors": [
        "Failed to fetch reactions.",
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287510721905471488",
      "url": "https://www.linkedin.com/in/nbstagge?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAATnuucByGwl32yGUrVxrwutwtfYfM6bNqk",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287516119181967360",
      "url": "https://www.linkedin.com/in/ashleywright1?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAALFyAEB6VHfncn6YKEhnzMW_Irp3MCdnlU",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287503790474186753",
      "url": "https://www.linkedin.com/in/walkerdeibel?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAOuGsBTul6kKDjIbaaJPNFoIIJzQMbuIg",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287449827527852032",
      "url": "https://www.linkedin.com/in/houseofbricks?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAA-MkMBNOorFGtIDG0boxkwxMypXZhfUgk",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287452064912232449",
      "url": "https://www.linkedin.com/in/gbrentbarkin?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAI5v54B8OquVDdHfjnHpuC9Ga3eD6YsXtk",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287514190544613376",
      "url": "https://www.linkedin.com/in/keithsconiers?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAiFgPQBYU0OqvdvlKoHET8lLuqoZwghCFE",
      "errors": [
        "Failed to fetch reactions.",
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287485768254541825",
      "url": "https://www.linkedin.com/in/jeanlarkin?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAuRg7UBs2-nUoTUPgIJglWeI72dbsrkMXk",
      "errors": [
        "Failed to fetch media URL."
      ]
    }
  ]
}