{
  "posts": [
    {
      "postId": "urn:li:activity:7287708711194669056",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287708711194669056",
      "url": "https://www.linkedin.com/in/nereaarreguiqa?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAEHgTbsBKHMzatlhgCsnqQX4ohcNYmxBmz8",
      "name": "Nerea Arregui Exposito\nNerea Arregui Exposito",
      "content": "Is your AI adoption strategy focused on quantity or quality?\n\n\nThe businesses leading the way in AI adoption aren’t just adding more tools; they’re choosing the right ones and making the most out of the ones they already have.\n\nThey’re leveraging their existing tools to their fullest potential and aligning them with their strategic goals.\n\nWhy mastery is key to AI adoption\n\n Strategic Value: Mastery ensures that AI tools are chosen wisely and used purposefully, solving real business challenges rather than adding complexity.\n Efficiency: Businesses that focus on understanding their AI tools can streamline operations, reduce redundancies, and improve decision-making.\n Scalability: AI adoption is most impactful when built on processes that can grow and adapt with the organization.\n\nHow to successfully adopt AI\n\n Start with the problem, not the tool: Identify the core challenges your business faces and choose AI solutions that address them directly.\n Invest in education: Empower your team with the knowledge to fully leverage your AI tools. Mastery unlocks true potential.\n Optimize before you automate: Ensure your processes are efficient and well-structured before integrating AI.\n\n AI adoption isn’t about having the most tools; it’s about creating real value through thoughtful integration and mastery.\n\n️ How does your organization approach AI adoption?\n\n⬇️ Ready to make AI work for your business? Reach out to me or visitto explore how we can help you unlock the potential of AI adoption.",
      "reactions": {
        "likes": "7",
        "comments": "4 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Nerea Arregui Exposito Great insights, Nerea! AI adoption is all about strategic application rather than just adding more tools. Mastery ensures AI drives real value by solving specific challenges, improving efficiency, and enabling scalability. A focused approach can make all the difference!\"",
          "userName": "Mohamed Chaudry",
          "userProfileURL": "https://www.linkedin.com/in/mohamedchaudry",
          "dataId": "urn:li:comment:(activity:7287708711194669056,7287741006878310400)"
        },
        {
          "commentText": "Mohamed Chaudry Thank you, Mohamed! I couldn’t agree more,mastery and strategic alignment are critical for AI adoption",
          "userName": "Nerea Arregui Exposito",
          "userProfileURL": "https://www.linkedin.com/in/nereaarreguiqa",
          "dataId": "urn:li:comment:(activity:7287708711194669056,7287817748624076804)"
        },
        {
          "commentText": "Spot on! Mastering the right tools is key to unlocking AI’s true potential. Nerea Arregui Exposito",
          "userName": "Jeffrey Ross",
          "userProfileURL": "https://www.linkedin.com/in/jeffreyross01",
          "dataId": "urn:li:comment:(activity:7287708711194669056,7287793638502232064)"
        },
        {
          "commentText": "Jeffrey Ross mastery and skill development are critical not only but also for effective AI adoption, for general success :)",
          "userName": "Nerea Arregui Exposito",
          "userProfileURL": "https://www.linkedin.com/in/nereaarreguiqa",
          "dataId": "urn:li:comment:(activity:7287708711194669056,7287818428055207936)"
        }
      ],
      "commentAdded": "Great insights! Focusing on mastery over quantity truly drives value. Its all about aligning AI with strategic goals for maximum impact!"
    },
    {
      "postId": "urn:li:activity:7287898214656000000",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287898214656000000",
      "url": "https://www.linkedin.com/company/i-customer.ai/posts",
      "name": "iCustomer\niCustomer",
      "content": "The Educational Perspective: How Retail is Embracing AI and Innovation\n\nThe retail industry is undergoing a seismic shift in how it handles customer data and decision-making. At NRF 2024, the conversation moved beyond basic AI implementation to more sophisticated solutions like agentive AI and customer journey optimization.\n\nHere are some key trends shaping the future of retail:\n Retailers are investing heavily in AI, even with traditionally tight\nmargins.\n Customer experience remains paramount, as technology bridges\nonline-offline gaps.\n Privacy considerations have become table stakes, not afterthoughts.\n\nThe most successful retailers are those embracing:\n A global mindset\n Scalable solutions\n Value-driven decision-making\n Strong tech partnerships\n\nWhat’s particularly fascinating is how executives are preparing for multiple economic scenarios while still prioritizing technological advancement.\n\n Watch our podcast where we dive deeper into these trends!\n\n\n|",
      "reactions": {
        "likes": "4",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Exciting times for retail! Embracing AI with a focus on customer experience and privacy is key. Cant wait to catch the podcast! 🎧✨ #RetailInnovation"
    },
    {
      "postId": "urn:li:activity:7287892081371463681",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287892081371463681",
      "url": "https://www.linkedin.com/in/marketing-exec?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAACfE4ABvEg32pyHXCyLK6CEJVb_VY23sso",
      "name": "Mindy Anderson\nMindy Anderson",
      "content": "Every CEO and Co-Founder I speak with is looking to acquire new clients. \n\nBut one should note: THERE IS NO SILVER BULLET.\n\nIn B2B Products and Services, one key ingredient wins: TRUST BUILDING\n\nBuilding trust is NOT a 1-time event. It is an ongoing process that requires consistent effort, patience, and clear communication. It takes work, patience, and time. Usually more time than the CEO wants to wait.\n\nBuilding trust required consistent interactions and demonstrating that you will follow through on what you say.\n\nThat means your CMO or Marketing leader will get you to the finish line once that trust is built up and secured. But it takes TIME.\n\nHere are some ways you can building trust with customers:\n1. Focus on building relationships and understanding customer needs instead of going straight for the hard sell.\n2. Provide value by offering educational content that helps customers understand their problems.\n3. Do not skip the relationship-building phase.\n4. Actively listen to what customers are saying and help them put the pieces together for themselves.\n5. Be transparent with prospects about how you work.\n6. Always be authentic to your brand.\n\nIf you're ready to acquire more customers the right way, get in touch for a strategy call. Your reputation is essential for success. Do it right!",
      "reactions": {
        "likes": "2",
        "comments": "1 comment",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "building trust takes time, but the rewards are worth every patient moment.  \nhashtag\n#buildtrust",
          "userName": "Jessica Jones",
          "userProfileURL": "https://www.linkedin.com/in/jessijones",
          "dataId": "urn:li:comment:(activity:7287892081371463681,7287895307554631681)"
        }
      ],
      "commentAdded": "Absolutely! Trust is the foundation of lasting client relationships. Lets prioritize genuine connections for sustainable growth! 🔑💼"
    },
    {
      "postId": "urn:li:activity:7287504386921046016",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287504386921046016",
      "url": "https://www.linkedin.com/in/yarby?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAIG5eIBsf8-2bGhH5Rmeq-2jo9PD4QhxZU",
      "name": "Jason Yarborough 🐻\nJason Yarborough 🐻",
      "content": "Sponsorship Opportunities Now Open for the 2025 Arcadia Leadership Experience \n\nAt last year’s ALX, we experienced something truly unique: 2.5 days that redefined what a “conference” could be. From the location, to the carefully curated sessions, every moment was intentional, immersive, and worlds away from your typical large-scale conference.\n\nEven our sponsors were part of the magic. Friends like,anddidn’t just slap their logos on a banner, they became integral and integrated into the experience, connecting with decision-makers in ways that drove meaningful ROI.\n\n️Here’s what makes sponsoring ALX different:\n\n Curated connections: You’re not just sponsoring a room; you’re part of a community of 75 of the brightest minds in partnerships and GTM leadership.\n Exclusive visibility: Sponsors stand out with premium experiences and opportunities to engage directly with attendees.\n High-value ROI: Every conversation matters when you’re connecting with decision-makers who lead teams, control budgets, and shape the future of partnerships.\n\n Choose your level of involvement: From hosting the Welcome Dinner to sponsoring unique experiences like fly fishing or yoga, at ALX @Sam and I make sure your brand isn’t just present, it’s woven into the fabric of an unforgettable experience.\n\n Sponsorships are limited and started to get scooped up. Shoot me a DM If you’re ready to experience the Arcadia difference. Or you can check out event details….",
      "reactions": {
        "likes": "49",
        "comments": "21 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "If you sponsor, I will wear your swag for 1 day during the event. Just a little added benefit to your sponsorship",
          "userName": "Cory Snyder",
          "userProfileURL": "https://www.linkedin.com/in/corysnyder",
          "dataId": "urn:li:comment:(activity:7287503348570693632,7287504372329074689)"
        },
        {
          "commentText": "Daniel Gaugler don't think we haven't thought about it. Could be Shift's....",
          "userName": "Jason Yarborough 🐻",
          "userProfileURL": "https://www.linkedin.com/in/yarby",
          "dataId": "urn:li:comment:(activity:7287503348570693632,7287518007331901440)"
        },
        {
          "commentText": "Cory Snyder unlimited pics/poses/settings or",
          "userName": "Amelia Taylor",
          "userProfileURL": "https://www.linkedin.com/in/tayloramelia",
          "dataId": "urn:li:comment:(activity:7287503348570693632,7287525062964912130)"
        }
      ],
      "commentAdded": "Excited to see the 2025 Arcadia Leadership Experience taking shape! Sponsorship opportunities like this foster invaluable connections. Lets make an impact!"
    },
    {
      "postId": "urn:li:activity:7287817049798541314",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287817049798541314",
      "url": "https://www.linkedin.com/in/nausheenichen?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAII5fIBliBV2d5ptUuru8IEtfj3hGy5L4g",
      "name": "Nausheen I. Chen\nNausheen I. Chen",
      "content": "She was a VP at a top 5 bank in the UK.\n\nBut she’d get so nervous that she walked off stages.\n\nThat was the reason S came to me for help.\n\nShe was great at talking with her team.\n\nBut when she spoke to a big audience -\n\n- She felt overwhelmed.\n- She came across as nervous.\n- She couldn’t articulate her ideas.\n\nWe worked together on her Annual Dinner speech.\n\nAfter 8 weeks of working together, S\n\n→ Could manage her nerves.\n→ Spoke fluidly without hesitation.\n→ Felt at ease and in control in the spotlight.\n\nShe used to dread speaking on stage.\n\nBut now she felt confident, capable and…excited.\n\nConquer your nerves → Become unstoppable.\n\nP.S. In my newsletter I share exactly how we achieved this -",
      "reactions": {
        "likes": "267",
        "comments": "179 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Many struggle with nerves. Nausheen I. Chen\nHow do you build confidence in your clients? ",
          "userName": "Samina Yasmin",
          "userProfileURL": "https://www.linkedin.com/in/saminaayasmin",
          "dataId": "urn:li:comment:(activity:7287809713444941824,7287810532466683907)"
        },
        {
          "commentText": "I have been sharing tons of tips here Samina Yasmin. You can also find more at www.speaking.coach",
          "userName": "Nausheen I. Chen",
          "userProfileURL": "https://www.linkedin.com/in/nausheenichen",
          "dataId": "urn:li:comment:(activity:7287809713444941824,7287812244988456960)"
        },
        {
          "commentText": "Nausheen I. Chen Sure ",
          "userName": "Samina Yasmin",
          "userProfileURL": "https://www.linkedin.com/in/saminaayasmin",
          "dataId": "urn:li:comment:(activity:7287809713444941824,7287813522170744832)"
        },
        {
          "commentText": "Amazing, keep impacting positively in us.",
          "userName": "Chinwendu Nwachukwu",
          "userProfileURL": "https://www.linkedin.com/in/chinwendu-nwachukwu1",
          "dataId": "urn:li:comment:(activity:7287809713444941824,7287815403811082240)"
        },
        {
          "commentText": "Thank youuu Chinwendu Nwachukwu. Good to know this is helpful.",
          "userName": "Nausheen I. Chen",
          "userProfileURL": "https://www.linkedin.com/in/nausheenichen",
          "dataId": "urn:li:comment:(activity:7287809713444941824,7287817587999043584)"
        }
      ],
      "commentAdded": "Incredible transformation! 🎤 Overcoming nerves is key to unlocking potential. Excited to see her shine on stage! #PublicSpeaking #Confidence"
    },
    {
      "postId": "urn:li:activity:7287891451873566720",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287891451873566720",
      "url": "https://www.linkedin.com/in/manujaggarwal?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAMY_wBiA538UlzNcv3ls30NXdjZZ2cT2c",
      "name": "Manuj Aggarwal\nManuj Aggarwal",
      "content": "The biggest danger right now for most people \n\nis swimming in a small pond and thinking you are the whale.\n\nYou see, I have been on both sides of the table.\n\nStartups that are trying to be unicorns with a shoestring budget.\nAnd Fortune 500 with hundreds of billions in the bank.\n\nThe only difference between these 2 extremes are:\n- How big do they think\n- How much intelligence they can hire to make that vision come to reality\n\nNow, with AI - intelligence is a commodity.\n\nSo the only thing left is your own mind.\n\nHow big can you think?\n\nA billion-dollar company will be run by a single person - the CEO (Sam Altman and other AI visionaries).\n\nCan you wrap your head around it?\n\nCan you make it happen?\n\nIf you are someone who can think that big but just needs direction, tools, and frameworks to get there - get in touch.\n\nLet me guide you in this AI tsunami coming our way.\n\nI have been in these waters for over 2 decades.\n\nOh, BTW this is what SVP of T-Mobile (Fortune 100 company worth $150B) had to say about my work:",
      "reactions": {
        "likes": "2",
        "comments": "1 comment",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Love how you're bridging the gap between startup dreams and Fortune 500 realities. What's your take on AI democratizing success?  ",
          "userName": "Ryan H. Vaughn",
          "userProfileURL": "https://www.linkedin.com/in/ryanhvaughn",
          "dataId": "urn:li:comment:(activity:7287891451873566720,7287897020428677122)"
        }
      ],
      "commentAdded": "Powerful insights! 🚀 The shift in how we think can truly redefine our limits in this AI era. Ready to dive into bigger waters!"
    },
    {
      "postId": "urn:li:activity:7287891624569802755",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287891624569802755",
      "url": "https://www.linkedin.com/in/andrewyng?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAqBL5gBXJ8MGhQh-qHYyxAOW-DYlHM3VLg",
      "name": "Andrew Ng\nAndrew Ng",
      "content": "Our first short course with Anthropic! Building Towards Computer Use with Anthropic. This teaches you to build an LLM-based agent that uses a computer interface, by generating mouse clicks and keystrokes. Computer Use is an important, emerging capability for LLMs that will let AI agents do many more tasks than were possible before, since it lets them interact with interfaces designed for humans to use, rather than only tools that provide explicit API access. I hope you will enjoy learning about it!\n\nThis course is taught by Anthropic's Head of Curriculum,. You'll learn to apply image reasoning and tool use to \"use\" a computer as follows: a model processes an image of the screen, analyzes it to understand what's going on, and navigates the computer via mouse clicks and keystrokes.\n\nThis course goes through the key building blocks, and culminates in a demo of an AI assistant that uses a web browser to search for a research paper, downloads the PDF, and finally summarizes the paper for you.\n\nIn detail, you’ll:\n- Learn about Anthropic's family of models, when to use which one, and make API requests to Claude\n- Use multi-modal prompts that combine text and image content blocks, and also work with streaming responses\n- Improve your prompting by using prompt templates, using XML to structure prompts, and providing examples\n- Implement prompt caching to reduce cost and latency\n- Apply tool-use to build a chatbot that can call different tools to respond to queries\n- See all these building blocks come together in Computer Use demo\n\nPlease sign up here:",
      "reactions": {
        "likes": "511",
        "comments": "16 comments",
        "shares": "0"
      },
      "mediaUrl": "blob:https://www.linkedin.com/6ac5e447-6d90-47e1-b9ce-8654358a9f00",
      "comments": [
        {
          "commentText": "Wow, this course sounds incredible! Teaching AI agents to navigate computer interfaces with mouse clicks and keystrokes is a game-changer for enabling them to interact with tools built for humans.\n\nKudos toand Colt Steele for making this accessible. Definitely looks like a must-learn for anyone exploring the cutting edge of AI development!",
          "userName": "GenerativeAI",
          "userProfileURL": "https://www.linkedin.com/company/ntgenai/posts",
          "dataId": "urn:li:comment:(ugcPost:7287891519930351616,7287898510207660032)"
        },
        {
          "commentText": "Love this, Andrew Ng AI agents interacting with human interfaces will create endless new opportunities for innovation.",
          "userName": "LL97.ai",
          "userProfileURL": "https://www.linkedin.com/company/ll97ai-nyc/posts",
          "dataId": "urn:li:comment:(ugcPost:7287891519930351616,7287892516366950404)"
        }
      ],
      "commentAdded": "Exciting course! Empowering AI to navigate and interact with human interfaces opens up new possibilities. Looking forward to learning! #AI #LLM"
    },
    {
      "postId": "urn:li:activity:7287898496454561795",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287898496454561795",
      "url": "https://www.linkedin.com/in/tonymoroney?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADOfUUBn1OudEB-xaVbTGPQr3ij5DMNhE0",
      "name": "Tony Moroney\nTony Moroney",
      "content": "hashtag\n#GenAI technology continues to advance at incredible speed. However, most organisations are moving at the speed of organisations, not at the speed of technology -.\n\nKey Findings\n The focus is on core business value.\n The C-suite sees things differently.\n Agentic AI is here.",
      "reactions": {
        "likes": "3",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Absolutely! Bridging the gap between tech speed and business value is crucial for maximizing GenAIs potential. Exciting times ahead! 🚀"
    },
    {
      "postId": "urn:li:activity:7287834982046134273",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287834982046134273",
      "url": "https://www.linkedin.com/in/neilsahota?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAFJGABEoUR0jN0u6ElMgITICDe3mwaA3I",
      "name": "Neil Sahota\nNeil Sahota",
      "content": "AI can enhance expertise and efficiency, but it can't replace the cultural wisdom people bring. Exploring how businesses can balance technology with human insight to maintain a thriving culture.\n\n\nTo watch the entire Human-AI Symbiosis with  Cedric Chin and Lia DiBello Ph.D on the Commoncog podcast, click here -",
      "reactions": {
        "likes": "107",
        "comments": "48 comments",
        "shares": "0"
      },
      "mediaUrl": "blob:https://www.linkedin.com/49687db4-6b4d-479a-a223-6320ab532ab0",
      "comments": [
        {
          "commentText": "How do you think small businesses can effectively balance AI integration with preserving their company culture?",
          "userName": "Jason Bramble",
          "userProfileURL": "https://www.linkedin.com/in/jasonbramble-revcarto",
          "dataId": "urn:li:comment:(ugcPost:7287825686952566786,7287834975402381312)"
        }
      ],
      "commentAdded": "Great insights! Striking that balance between AI and human wisdom is key to fostering innovation while preserving company culture."
    },
    {
      "postId": "urn:li:activity:7287873423026847745",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287873423026847745",
      "url": "https://www.linkedin.com/in/bradleyvoorhees?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAKOXS4BEiP4BbFtbLhrUK2RV5o29Hu1WcA",
      "name": "Brad Voorhees\nBrad Voorhees",
      "content": "A few years ago, I met a software company that saw HR as... paperwork.\n\nTheir view? HR was just there to handle admin tasks, forms, and compliance. Nothing more.\nBut the cracks were showing:\n\n→ Employee turnover was climbing.\n→ Team performance felt stagnant.\n\nThey didn’t see how HR could play a role beyond the basics.\n\nI asked one question:\n\n“What if HR could actually help drive business success?”\n\nThey looked puzzled.\n\nSo, we got to work.\n\nWe focused on transforming the talent experience.\n\n→ Built stronger connections with employees.\n→ Designed strategies to boost retention and performance.\n\nAnd slowly, things changed.\n\nEmployees felt more engaged. Teams started performing better. And the company began to see results where it mattered most:\n\n→ Retention improved, cutting costly turnover.\n→ Performance soared, increasing productivity.\n\nHR wasn’t just “HR” anymore. It became a strategic partner in their success.\n\nHere’s what they learned (and what you might need to hear):\n\nHR is more than just paperwork.\n\n→ It’s about creating an environment where people thrive.\n→ It’s about using people to drive business success.\n\nInvesting in your talent pays dividends.\n\n→ Retention saves recruitment dollars.\n→ Performance fuels growth.\n\nYour HR strategy could be the difference between a business that coasts and one that\nthrives.\n\nIt’s time to treat it like it matters.\n\nIf you agree, please ️ .",
      "reactions": {
        "likes": "30",
        "comments": "26 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": " HR is more than paperwork.",
          "userName": "Brad Voorhees",
          "userProfileURL": "https://www.linkedin.com/in/bradleyvoorhees",
          "dataId": "urn:li:comment:(activity:7287839153075982337,7287851193547010049)"
        },
        {
          "commentText": " if you agree, repost!",
          "userName": "Brad Voorhees",
          "userProfileURL": "https://www.linkedin.com/in/bradleyvoorhees",
          "dataId": "urn:li:comment:(activity:7287839153075982337,7287852291812995072)"
        }
      ],
      "commentAdded": "Absolutely agree! Transforming HR into a strategic partner is key to unlocking potential and driving real business success. 🌟"
    }
  ],
  "errors": [
    {
      "postId": "urn:li:activity:7287708711194669056",
      "url": "https://www.linkedin.com/in/nereaarreguiqa?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAEHgTbsBKHMzatlhgCsnqQX4ohcNYmxBmz8",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287898214656000000",
      "url": "https://www.linkedin.com/company/i-customer.ai/posts",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287892081371463681",
      "url": "https://www.linkedin.com/in/marketing-exec?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAACfE4ABvEg32pyHXCyLK6CEJVb_VY23sso",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287504386921046016",
      "url": "https://www.linkedin.com/in/yarby?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAIG5eIBsf8-2bGhH5Rmeq-2jo9PD4QhxZU",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287817049798541314",
      "url": "https://www.linkedin.com/in/nausheenichen?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAII5fIBliBV2d5ptUuru8IEtfj3hGy5L4g",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287891451873566720",
      "url": "https://www.linkedin.com/in/manujaggarwal?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAMY_wBiA538UlzNcv3ls30NXdjZZ2cT2c",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287898496454561795",
      "url": "https://www.linkedin.com/in/tonymoroney?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADOfUUBn1OudEB-xaVbTGPQr3ij5DMNhE0",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287873423026847745",
      "url": "https://www.linkedin.com/in/bradleyvoorhees?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAKOXS4BEiP4BbFtbLhrUK2RV5o29Hu1WcA",
      "errors": [
        "Failed to fetch media URL."
      ]
    }
  ]
}