[
  {
    "postsData": [
      {
        "postId": "urn:li:activity:7290008628487483393",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290008628487483393",
        "url": "https://www.linkedin.com/in/marcmawhinney?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAJWjsgBu2cTod184XtwdLJ8mEZQyy27JvU",
        "name": "Marc Mawhinney\nMarc Mawhinney",
        "content": "A common complaint that I've heard about coaching programs: \n\nThey're not long enough!\n\nA lot of coaches run three month programs, and although 90 days sounds like a long time, it flies by quickly. Halloween was three months ago, that doesn't seem that long ago does it?\n\nAnd some coaches do six month programs, but they go by quickly too and can leave loose ends when they finish.\n\nThat's why when I was planning my new Natural Born Coaches Program I decided to make it open-ended, meaning that the coaches who join can stay in as long as the program is running.\n\nThat means they get access to all of the programs in it, including new ones launched down the road, and continuing access to the group support calls (even if it's way down the road).\n\nAnd those who join in the initial launch also get 6 monthly 1:1 calls with me to help their progress.\n\nInterested? The next step is to book a call to chat about it at the link in the comments!",
        "reactions": {
          "likes": "1 comment",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "www.nbcprogram.com",
            "userName": "Marc Mawhinney",
            "userProfileURL": "https://www.linkedin.com/in/marcmawhinney",
            "dataId": "urn:li:comment:(activity:7290008628487483393,7290008676281507840)"
          }
        ],
        "commentAdded": "Love the open-ended approach! Continuous access and support can truly make a difference in coaching. Excited to see how this evolves! 🌟"
      },
      {
        "postId": "urn:li:activity:7290313156059426817",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290313156059426817",
        "url": "https://www.linkedin.com/in/llenguito?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAC8HlMBkxkXGbjqfdHpbnGm_SZ8GDKx7EA",
        "name": "Luigi LENGUITO\nLuigi LENGUITO",
        "content": "Still gathering thoughts on my \nhashtag\n#WEF2025 \nhashtag\n#Davos week, and as I was lucky to attend a few of those sessions, here is thanks to The Wall Street Journal great speakers and panels on topics worth thinking through: fromofto Risk management and AI models there is content for everybody. Enjoy !",
        "reactions": {
          "likes": "4",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Sounds like an incredible experience! Excited to hear your insights on the sessions, especially regarding AI and risk management. #WEF2025"
      },
      {
        "postId": "urn:li:activity:7290348047769710592",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290348047769710592",
        "url": "https://www.linkedin.com/in/jepsontaylor?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAT1knkBKurLdx7ocCJOtEwdp07TIBzisxg",
        "name": "🦾Jepson Taylor\n🦾Jepson Taylor",
        "content": "The \"dog ate my homework\" has been replaced by \"AI did my homework\". \nThe teachers that demand that students are NOT allowed to use LLMs are shooting their students in the foot. One of my kids had to sign an integrity letter promising they would not use LLMs for school. Dumb. The education system has to change, teaching kids in pre-LLM is equivalent to the stone age for what they need for their future.\n\nIs it cheating? No, not with the right system. The grade curve has shifted, some of you were disliked in school because you ruined the curve. AI is 'ruining the curve'. Imagine a distribution of grade for an essay, written by humans. Now imagine the distribution scored by a naive teacher who doesn't understand AI, the reports all got better and shifted to the right.\n\nFor the lazy students, the procrastinators their position in the curve hasn't changed. If you forgot about your report the night before and right before bed you have an LLM right it... if you're computing/competing against humans you might get a high score 95%. If you're competing against humans using AI, you will get a low score, 60%.\n\nCompare the procrastinator to the student who spent the same amount of time as they might normally spend, 3-5 hours, doing a report. They are doing multiple iterations, their prompting is getting better, their research is going wider, their style is being perfected. They are delivering a paper that in the human world might have received the highest school for the entire district.\n\nStop holding our kids back, stop preparing them for the present when you should be preparing them for the future.\n\nThe main issue is access, kids with access to more expensive LLMs will have an unfair advantage to those who do not. The education system and governments should figure out how to enable all students with great LLM access.",
        "reactions": {
          "likes": "12",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "I agree with the accessibility and the inclusivity for all then we really would have a 'free world' \nWhere everyone has access to clean water, sanitary products, food, shelter and healthcare. ",
            "userName": "Lucy Lynch 🌈",
            "userProfileURL": "https://www.linkedin.com/in/lucylynchacademy",
            "dataId": "urn:li:comment:(activity:7290348047769710592,7290349692796743680)"
          },
          {
            "commentText": "One thing I am curious to discuss with more people is, how do we enable children to have more time to “Think Deeper”? \n\nTheir 3-5 hours of investment in improving their craft in that report, can shift from data gatehering and source validation to data processing, and increased repetition & application, and decision making.\n\nImproved group discussions and conversations, time spent storytelling and conveying their point of view, while learning other people’s points of view. Ultimately, solving for problems empowered by data driven insights we didn’t have growing up.",
            "userName": "David Serna Perez",
            "userProfileURL": "https://www.linkedin.com/in/david-serna-perez-42825689",
            "dataId": "urn:li:comment:(activity:7290348047769710592,7290355855827296256)"
          }
        ],
        "commentAdded": "Absolutely! Embracing AI in education can elevate learning if we adapt our systems. Let’s prepare students for a tech-driven future! 🌟"
      },
      {
        "postId": "urn:li:activity:7290354435401175041",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290354435401175041",
        "url": "https://www.linkedin.com/in/anshikaagrawal11?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADd-eCYBp_toq3ZVnAVjUNHk_BLj8JKtUI4",
        "name": "Anshika Agrawal\nAnshika Agrawal",
        "content": "What's the One Trait That Defines You?\n\nIf people could remember just one thing about you, what would it be?\n\nWould they say you're fearlessly optimistic, always finding a way forward?\nOr are you the reliable rock, the one people turn to in tough times?\nMaybe you're the creative spark, seeing possibilities where others see problems.\n\nWe all have that one defining trait—the thing that makes us uniquely us.\n\nIt's what shapes our relationships, our work, and the way we impact the world around us.\n\nFor me, it's communication and engagement.\n\nNow, I’d love to hear from you!\n\nDrop a comment and share:\n\nWhat's the one word that defines YOU?\n\nLet’s see how different and yet connected we all are!",
        "reactions": {
          "likes": "22",
          "comments": "9 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Yesss, we do have a unique trait which we are remembered for\n\nGreat perspective \nWell said!",
            "userName": "Aadvaith Naarayanan",
            "userProfileURL": "https://www.linkedin.com/in/aadvaith-naarayanan-932500239",
            "dataId": "urn:li:comment:(activity:7290343119819001856,7290354584542154753)"
          },
          {
            "commentText": "One word? Persuasive!  Because whether it's ideas, opportunities, or the last slice of pizza—I know how to make it happen!  What about you?",
            "userName": "Ishika Sah",
            "userProfileURL": "https://www.linkedin.com/in/ishika-sah-b9683b2b9",
            "dataId": "urn:li:comment:(activity:7290343119819001856,7290348816933740544)"
          }
        ],
        "commentAdded": "Great question! I’d say my defining trait is resilience. Its the drive to overcome challenges and adapt that fuels my growth. What about others?"
      },
      {
        "postId": "urn:li:activity:7290203734876307456",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290203734876307456",
        "url": "https://www.linkedin.com/in/nikkiwalkerpr?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADr7FgBlyIeWY7f7v7LUVYM4brGazgvIhY",
        "name": "Nikki Walker\nNikki Walker",
        "content": " Excited for The House of \nCode + Culture! \n\nI want to take a moment to highlight the importance of supporting the House of Code and Culture during this incredible event. This initiative is a powerful platform that amplifies the voices of African-Americans in tech, addressing the unique challenges they face.\n\nIt's inspiring to see our entire community come together to make this event a reality. The support fromandhas been top tier! By sharing our knowledge and experiences, we foster an environment of growth and understanding. The insights from our panelists will be invaluable in helping us diversify our perspectives and enrich our professional journeys.\n\nLet’s also remember the importance of immersing ourselves in different cultures. Embracing diversity allows us to appreciate the beauty in our lives and work, ultimately driving greater innovation.\n\nJoinand I at this one of a kind event and let’s learn from one another! Together, we can build a more inclusive tech community. ",
        "reactions": {
          "likes": "19",
          "comments": "5 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "https://app.getriver.io/profile/house-of-code-+-culture-the-heart-and-soul-of-technology-5o3r",
            "userName": "Nikki Walker",
            "userProfileURL": "https://www.linkedin.com/in/nikkiwalkerpr",
            "dataId": "urn:li:comment:(ugcPost:7290203733487992832,7290204692809162752)"
          },
          {
            "commentText": "I’m so looking forward to your events tomorrow!",
            "userName": "Kyle Spencer",
            "userProfileURL": "https://www.linkedin.com/in/spencerkyle",
            "dataId": "urn:li:comment:(ugcPost:7290203733487992832,7290210231324659712)"
          },
          {
            "commentText": "Kyle Spencer ",
            "userName": "Nikki Walker",
            "userProfileURL": "https://www.linkedin.com/in/nikkiwalkerpr",
            "dataId": "urn:li:comment:(ugcPost:7290203733487992832,7290224618781491202)"
          }
        ],
        "commentAdded": "Absolutely! This initiative is vital for empowering voices in tech. Excited to see the impact we can make together! 🌍✨ #Inclusion #Innovation"
      },
      {
        "postId": "urn:li:activity:7290051679259893760",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290051679259893760",
        "url": "https://www.linkedin.com/in/tomaszboinski?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAT6i3EBTB8A6x-CZu_4t39xy5C77FfuZhM",
        "name": "Tomasz Boinski\nTomasz Boinski",
        "content": " 𝐓𝐡𝐫𝐢𝐯𝐢𝐧𝐠 𝐢𝐧 𝐭𝐡𝐞 𝐒𝐭𝐚𝐫𝐭𝐮𝐩 𝐖𝐨𝐫𝐥𝐝 𝐰𝐢𝐭𝐡 𝐓𝐡𝐞 𝐏𝐌𝐈 𝐓𝐨𝐨𝐥𝐤𝐢𝐭 𝐟𝐨𝐫 𝐒𝐭𝐚𝐫𝐭𝐮𝐩𝐬  \nAt TechEdge Dynamics, we understand the challenges startups face on their journey to success, whether it's achieving market traction, managing limited resources, or scaling effectively.\n\nThat's why we’re excited to highlight The PMI Toolkit for Startups, a resource designed to empower entrepreneurs with proven project management techniques for sustainable growth.\n\nStartups operate in a world of uncertainty, where up to 90% face failure within their first year. But failure isn’t inevitable. Often, it comes down to operational challenges like risk management, task prioritization, cost estimation, and communication, areas that are within a team’s control. The PMI Toolkit brings decades of expertise to help startups overcome these obstacles with clarity and confidence.\n\nThe toolkit provides practical, evidence-based resources to help founders navigate key challenges:\n Proactive Risk Management: Identifying threats and creating strategies to minimize impacts ensures startups stay ahead of uncertainty.\n Task Prioritization: Aligning efforts with strategic goals, especially with limited resources, drives focus and momentum.\n Accurate Cost Estimation: Building realistic budgets and managing finances is critical to maintaining long-term viability.\n Streamlined Communication: Keeping teams aligned fosters collaboration, minimizes conflicts, and supports effective pivots when priorities change.\n\nBy leveraging tools like these, startups can enhance decision-making, optimize resources, and reduce the likelihood of common pitfalls. The result? A foundation built for scaling and achieving your vision.\n\nAt, we believe in empowering the next wave of dreamers and doers to create real impact. With resources like the PMI Toolkit, the path to startup success becomes not just possible but sustainable.\n\nReady to level up? Dive into these tools and start driving results today. ",
        "reactions": {
          "likes": "8",
          "comments": "4 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "This is a great resource for any startup looking to navigate growth challenges! The PMI Toolkit for Startups provides a structured approach to managing risk, prioritizing tasks, and estimating costs—essential areas where many startups struggle. It’s exciting to see such practical tools that help entrepreneurs stay focused, make informed decisions, and ultimately increase their chances of long-term success. Using proven project management techniques, startups can scale confidently and sustainably, avoiding common pitfalls. For many decades, SMBs have felt like project management was out of reach, but now, there are so many great resources like this that show them that it is possible and it can be done right.",
            "userName": "Daniel Hemhauser",
            "userProfileURL": "https://www.linkedin.com/in/danielhemhauser",
            "dataId": "urn:li:comment:(ugcPost:7290051677984800768,7290054377266917376)"
          }
        ],
        "commentAdded": "Excited to see such valuable resources for startups! The PMI Toolkit is a game changer for navigating challenges and driving sustainable growth. 🌟"
      },
      {
        "postId": "urn:li:activity:7290129043075592192",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290129043075592192",
        "url": "https://www.linkedin.com/in/michaeltbeck?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAdkz58BMFx9YaHydaO3tjIjOiYBPZpO72I",
        "name": "Michael Beck\nMichael Beck",
        "content": "One million percent correct Alex Hormozi!\n\nDon’t go to a doctor if you aren’t going to take their educated remedy.\n\nDon’t go to classes if your are going to listen.\n\nAnd don’t hire or retain talent or domain experts if you are going to continue to follow the same tired playbooks that haven’t gotten you the results you have been looking for so far!\n\nIt never ceases to amaze me how a business will seek out the talent and expertise that has proven themselves time and time again and then come in from on high with their own startegies or worse yet micromanagement that didn’t work previously and then wonder why they are continuing to spin their wheels in the mud of their own creation.",
        "reactions": {
          "likes": "4\nChad Horn and 3 others",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Amen!!!",
            "userName": "Lynne DeVall",
            "userProfileURL": "https://www.linkedin.com/in/lynne-devall",
            "dataId": "urn:li:comment:(activity:7290129043075592192,7290153723576696832)"
          }
        ],
        "commentAdded": "Absolutely! Embracing expert advice is crucial for growth. Let’s trust the process and break free from outdated methods!"
      },
      {
        "postId": "urn:li:activity:7290353036349112320",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290353036349112320",
        "url": "https://www.linkedin.com/in/colbywegter?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABKlU-gB43StC0lTFt2eMY4ubjQvzVYSc9w",
        "name": "Colby Wegter\nColby Wegter",
        "content": "You're going to make a lot of money. Accept this.\n\nThen, know that this isn't the ultimate flex.\n\nThe ultimate flex is work that feels like play.\n\nBut you're nowhere near it.\n\nAnd you'll never feel that way no matter how high the numbers go in your account unless you address it.\n\nIt doesn't have to be crazy at work.\n\nYou left corporate to start your own thing.\n\nDesign it how you want. Add some play.\n\nIt's yours.\n\n_ _ _\n\nWhat's good? If you're stumbling across my profile for the first time, just know I created a prison of an agency by doing it by default.\n\nThen, I raised my standard for what I said yes to. If I wasn't willing to do it for 10 years, I wouldn't do it.\n\n→ This eliminated 90% of what I was doing\n→ Got me from 70-hour work weeks down to 8\n→ Saw the agency go from $1M ARR to $2.5M ARR in 12 months\n\nWhen you trade crazy/more for focus/less, you get play that pays.\n\nI share the whole story here:\n\nSo you can avoid all the mistakes I made and get there faster.",
        "reactions": {
          "likes": "3",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/f1b4d06b-1b6d-4491-a409-f101d64ba245",
        "comments": [
          {
            "commentText": "awesome!!!  ",
            "userName": "Alanna Gerton",
            "userProfileURL": "https://www.linkedin.com/in/lanagerton",
            "dataId": "urn:li:comment:(ugcPost:7289681369536839680,7290355042086252544)"
          }
        ],
        "commentAdded": "Love this perspective! 🎉 Embracing focus over frenzy can lead to true joy in our work. Excited to apply these insights to my journey!"
      },
      {
        "postId": "urn:li:activity:7290346693764468736",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290346693764468736",
        "url": "https://www.linkedin.com/in/mudrikakavdia?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADTE85gB-iZQ7vK85Vmo3H_bYNjjifzwUDI",
        "name": "Mudrika Kavdia\nMudrika Kavdia",
        "content": "I just came back from this mini trip. It was an experience that made me think beyond just tourism.\n\nThis place isn’t just a monument, it’s a money-making machine.\n\nA place built to honor Sardar Patel is now a self-sustaining business ecosystem.\n\nIt’s an economy in itself.\n\nMost people see it as a tourist spot. I saw it as a business model.\n\nI didn’t feel like I was in India. Not because of the statue- but because of the:\n\n- cleanliness\n- efficiency and\n- business mindset.\n\nThe revenue, the branding, the insane tourist flow.\n\nAnd all of it runs smoothly, efficiently, and profitably.\n\nThe entire area is cleaner than most Indian cities. No plastic lying around. Proper waste management.\n\nIt almost feels like a different version of India- the one we wish our cities could be.\n\nAnd the best part?\n\nIt’s all government-run. A rare example of a public project that actually works.\n\nPeople from all over India, spending money at every step. The kind of cash flow here is what startups dream of.\n\nImagine if more cities operated like this.\n\nNot just with statues, but with better planning, cleaner environments, and revenue models that actually make sense.\n\nIt’s a case study in how to turn a vision into a thriving business.\n\nTurns out, India can look like a developed country.\n\nHave you seen any other tourist spots in India that are managed this well? Let me know!\n\nPS: This place is proof that when things are clean and well-managed, Indians actually behave.",
        "reactions": {
          "likes": "115",
          "comments": "15 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "This is such a great perspective! It's amazing to see how well-managed public projects can transform an entire area. If more places followed this model, India could definitely set a global standard for efficiency and cleanliness.",
            "userName": "CA Sreyans Jain",
            "userProfileURL": "https://www.linkedin.com/in/ca-sreyans-jain-941636190",
            "dataId": "urn:li:comment:(activity:7290343415731359744,7290347041476464640)"
          }
        ],
        "commentAdded": "Such an insightful perspective! It’s inspiring to see public projects excel in cleanliness and efficiency. Here’s to more successful models like this!"
      },
      {
        "postId": "urn:li:activity:7290037633487945730",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290037633487945730",
        "url": "https://www.linkedin.com/in/angelagillnelms?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAkdZI0BRIXsVQk88XGJqfr-PLk6wp0ZhLo",
        "name": "Angela Gill Nelms\nAngela Gill Nelms",
        "content": "This was an amazing event in Atlanta hosted by Tracy Lee! Reach out if you are a woman in Atlanta and want to be invited to a future event!!",
        "reactions": {
          "likes": "12",
          "comments": "6 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/2ac10b28-4657-44de-b83e-2ac94f2a285f",
        "comments": [
          {
            "commentText": "Sounds like a fantastic event, Angela! I'm glad you had the opportunity to attend. Connecting with women in Atlanta is an invaluable experience. Keep us posted on future events!",
            "userName": "Noah Swiderski",
            "userProfileURL": "https://www.linkedin.com/in/noahswiderski",
            "dataId": "urn:li:comment:(ugcPost:7290037632691056641,7290038300336115712)"
          },
          {
            "commentText": "Noah Swiderski will do!",
            "userName": "Angela Gill Nelms",
            "userProfileURL": "https://www.linkedin.com/in/angelagillnelms",
            "dataId": "urn:li:comment:(ugcPost:7290037632691056641,7290038971907162113)"
          },
          {
            "commentText": "was this the lunch from friday? Im so sad i missed it.",
            "userName": "Stephanie Krell",
            "userProfileURL": "https://www.linkedin.com/in/stephanie-krell",
            "dataId": "urn:li:comment:(ugcPost:7290037632691056641,7290071978412003328)"
          },
          {
            "commentText": "Stephanie Krell yes!! We missed you so much. It was a great conversation!",
            "userName": "Angela Gill Nelms",
            "userProfileURL": "https://www.linkedin.com/in/angelagillnelms",
            "dataId": "urn:li:comment:(ugcPost:7290037632691056641,7290093840932163584)"
          }
        ],
        "commentAdded": "What a fantastic initiative, Tracy! Excited to see more women connect and empower each other in Atlanta. Count me in for future events! 🌟"
      }
    ],
    "errors": [
      {
        "postId": "urn:li:activity:7290008628487483393",
        "url": "https://www.linkedin.com/in/marcmawhinney?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAJWjsgBu2cTod184XtwdLJ8mEZQyy27JvU",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7290313156059426817",
        "url": "https://www.linkedin.com/in/llenguito?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAC8HlMBkxkXGbjqfdHpbnGm_SZ8GDKx7EA",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7290348047769710592",
        "url": "https://www.linkedin.com/in/jepsontaylor?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAT1knkBKurLdx7ocCJOtEwdp07TIBzisxg",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7290354435401175041",
        "url": "https://www.linkedin.com/in/anshikaagrawal11?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADd-eCYBp_toq3ZVnAVjUNHk_BLj8JKtUI4",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7290203734876307456",
        "url": "https://www.linkedin.com/in/nikkiwalkerpr?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADr7FgBlyIeWY7f7v7LUVYM4brGazgvIhY",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7290051679259893760",
        "url": "https://www.linkedin.com/in/tomaszboinski?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAT6i3EBTB8A6x-CZu_4t39xy5C77FfuZhM",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7290129043075592192",
        "url": "https://www.linkedin.com/in/michaeltbeck?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAdkz58BMFx9YaHydaO3tjIjOiYBPZpO72I",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7290346693764468736",
        "url": "https://www.linkedin.com/in/mudrikakavdia?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADTE85gB-iZQ7vK85Vmo3H_bYNjjifzwUDI",
        "errors": [
          "Failed to fetch media URL."
        ]
      }
    ]
  },
  {
    "postsData": [
      {
        "postId": "urn:li:activity:7290314214995374080",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290314214995374080",
        "url": "https://www.linkedin.com/in/rachelparkco?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAa1ojgB6thaDElEllbhupHwYhc6Wgk0cao",
        "name": "Rachel Park\nRachel Park",
        "content": "'Always on' hustle culture isn't success.\nIt's a recipe for burnout.\n\nHere are 7 research-backed signs you're heading for burnout:\n\n1. Decision Paralysis\n↳ You struggle with simple choices\n↳ Create decision-making frameworks for recurring choices\n\n2. Decreased Performance\n↳ You take longer to complete routine tasks\n↳ Prioritize tasks based on energy levels, not just deadlines\n\n3. Memory Loss & Brain Fog\n↳ You struggle with simple tasks you once mastered\n↳ Block focused time for complex tasks when your energy peaks\n\n4. Emotional Exhaustion\n↳ You lose passion for work you once loved\n↳ Create clear start and end times for your workday\n\n5. Physical Warning Signs\n↳ You experience unexplained headaches and tension\n↳ Schedule regular movement breaks between meetings\n\n6. Social Withdrawal\n↳ You avoid team interactions\n↳ Build regular check-ins with trusted colleagues\n\n7. Cynicism Creep\n↳ You become unusually critical of others\n↳ Document wins and positive feedback for perspective\n\n\nSuccess isn't about being always available.\n\nIt’s about building a sustainable way of working.\n\n\nWhich sign resonates most with you? Share below \n\n\n If you enjoyed this content, you might like my newsletter here:\n\n\n____\n\n Follow mefor more posts on career & wellbeing.\n️ Repost to support your network.",
        "reactions": {
          "likes": "103",
          "comments": "144 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": " Bonus #2:\n Early intervention reduces burnout recovery time by 60% (Mayo Clinic Research, 2023)",
            "userName": "Rachel Park",
            "userProfileURL": "https://www.linkedin.com/in/rachelparkco",
            "dataId": "urn:li:comment:(ugcPost:7290308166829907968,7290308650085060608)"
          },
          {
            "commentText": " Bonus #1:  76% of professionals miss early burnout signs (Workplace Wellness Institute, 2023) ",
            "userName": "Rachel Park",
            "userProfileURL": "https://www.linkedin.com/in/rachelparkco",
            "dataId": "urn:li:comment:(ugcPost:7290308166829907968,7290308625514778624)"
          }
        ],
        "commentAdded": "Great insights! Its crucial to recognize these signs early. Balance is key to sustainable success. Which sign do you see most in your work?"
      },
      {
        "postId": "urn:li:activity:7290307820174901248",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290307820174901248",
        "url": "https://www.linkedin.com/in/gerrit-sneam-7304a4347?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAFa_aRQB0-RCgyybx1RpJiXQQFlIRWWx-Ws",
        "name": "Gerrit Sneam\nGerrit Sneam",
        "content": "Growth or stagnation: How effective is your current strategy?\n\nIt's about leveraging every tool at your disposal. ️\n\nEver faced a challenge and thought you needed to solve it all by yourself? Let's shift that mindset. \n\nAdopt frameworks. They're like a navigator through the fog, simplifying solutions and clearing the path for decisions. Why? Because they're the secret weapon to a CEO’s clarity.\n\nAnd let's get this straight:\n\n- Leadership is more about your impact than your title. \n- Growth hinges on your influence, not just sheer control. \n- A strong team thrives on guidance, not directives. \n\nFor those aiming at lasting success, understanding these principles is key.\n\nEmbrace the right frameworks to revolutionize your leadership style, motivate your team, and drive empowerment.\n\nExperiment with one this week. Observe the difference it makes in your decision-making and outcomes.\n\n\nReady to be the leader your business needs?",
        "reactions": {
          "likes": "44",
          "comments": "6 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Wie würdest du argumentieren, wenn jemand sagt, dass Führung eher von persönlichem Charisma als von systematischen Ansätzen abhängt?",
            "userName": "Chahat Raj Kapoor",
            "userProfileURL": "https://www.linkedin.com/in/chahat-raj-kapoor",
            "dataId": "urn:li:comment:(activity:7290273860774416385,7290307806165897216)"
          }
        ],
        "commentAdded": "Absolutely agree! Embracing frameworks can transform our approach to leadership and decision-making. Excited to experiment this week! 🚀"
      },
      {
        "postId": "urn:li:activity:7290349015265673216",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290349015265673216",
        "url": "https://www.linkedin.com/in/mtr-coaching?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAZfmIYBRgj-0quRQRoQD1VXT8T4EdrrLtU",
        "name": "Mark Tanchoco Reid\nMark Tanchoco Reid",
        "content": "Some of my best advice has come from the most unlikely sources!  \n\nWhat would your role model do right now?\n\nNapoleon Hill's Think and Grow Rich introduced invisible counsellors. \n\nGreat minds can guide us toward better solutions.\n\nChoose 3-5 inspiring figures who embody your desired qualities. \n\nMeet with these counsellors daily in your mind. \n\nAsk yourself: How would they handle this situation?\n\nWhat wisdom would they offer in this moment?\n\nTheir principles transform into fresh insights for you.\n\nDon't copy others - unlock your own inner wisdom. \n\nYour counsellors mirror your untapped potential back to you.\n\nWho will join your round table of wisdom? ",
        "reactions": {
          "likes": "11\nJason Bramble and 10 others",
          "comments": "3 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/03d06813-8ff2-4a67-b4bf-f7a3b5112df5",
        "comments": [
          {
            "commentText": "Such an innovative approach to personal growth and self-reflection, thanks Mark!",
            "userName": "ram dalli",
            "userProfileURL": "https://www.linkedin.com/in/ram-dalli",
            "dataId": "urn:li:comment:(ugcPost:7290314294661980160,7290326338068983810)"
          },
          {
            "commentText": "ram dalli thanks, Napolean Hill is one of my favourites. Enjoy!",
            "userName": "Mark Tanchoco Reid",
            "userProfileURL": "https://www.linkedin.com/in/mtr-coaching",
            "dataId": "urn:li:comment:(ugcPost:7290314294661980160,7290327320517595136)"
          },
          {
            "commentText": "Mark, these are great insights, thanks for sharing.",
            "userName": "Tyler Cerny",
            "userProfileURL": "https://www.linkedin.com/in/tylercerny",
            "dataId": "urn:li:comment:(ugcPost:7290314294661980160,7290325462768119808)"
          }
        ],
        "commentAdded": "What a thought-provoking concept! I love the idea of tapping into our invisible counsellors for inspiration. Who inspires you the most?"
      },
      {
        "postId": "urn:li:activity:7290071595232960514",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290071595232960514",
        "url": "https://www.linkedin.com/in/leslievenetz?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADPju4B9I-KSyVAlH2xAmiN72f5wsayOtM",
        "name": "Leslie Venetz\nLeslie Venetz",
        "content": "Finalizing the title of my book this week (eeee!) & want your feedback. \n\nPLEASE click \"see more\" to view the title AND subtitle (below) before providing feedback so I can better understand what you find compelling.\n\n\n TITLES:\n\n1. Outbound 3.0: Elevating Sales Through Buyer-Centric Strategies\n\n2. EARN: Your Guide to Prospecting, Lead Generation & Building a B2B Sales Pipeline\n\n3. Revenue Made Simple: The Modern Guide to Building an Always-Full Sales Pipeline\n\n4. Ever-Full Pipeline: Your Guide to Mastering Top-of-Funnel Sales and Driving Revenue\n\n\nDeeply appreciate any comments or insights as well that I can share with my Publisher & Brand Strategist.\n\n\n\n If you're thinking, whatever the title- I'm IN, it would be amazing to have you become a book launch supporter.\n\nSign up here:\n\nI'll have more details as we get closer but I'll need everything from pre-readers to folks who leave reviews to folks that will remind me 'you got this.'",
        "reactions": {
          "likes": "28",
          "comments": "80 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "There's an Outbound sales conference, so not sure it that might confuse some folks, but this gives you the ability to update the book as time progresses: \n* Outbound 3.1: Elevating Sales Through new Buyer-Centric Strategies\n* Outbound 3.2: Elevating Sales Through better Buyer-Centric Strategies\n* Etc.",
            "userName": "Mark Bregmann",
            "userProfileURL": "https://www.linkedin.com/in/mark-bregmann-7b738410",
            "dataId": "urn:li:comment:(ugcPost:7290071594259886081,7290175030582198272)"
          }
        ],
        "commentAdded": "Exciting titles! I’m drawn to Revenue Made Simple. It feels approachable and speaks to the core of building a successful pipeline. Can’t wait to read!"
      },
      {
        "postId": "urn:li:activity:7290112289259618304",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290112289259618304",
        "url": "https://www.linkedin.com/in/irawinkler?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAANVxwBpPx-hRKEiC0UiY5XEjDBpjibmXc",
        "name": "Ira Winkler\nIra Winkler",
        "content": "We ran out of available cabins for CruiseCon last week, and this video is a reminder for people who have signed up and want to be prepared. If you missed this chance to attend, I will informally announce that there will be others given the success of the original event. Follow thepage as well as me for more information. We will be announcing once we get back to normal.\n\nThanks for all your support.",
        "reactions": {
          "likes": "38\nLuigi LENGUITO and 37 others",
          "comments": "3 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/ab75772e-d305-4307-b121-5f0f7345e01e",
        "comments": [
          {
            "commentText": "Congrats, this is going to be a true blast for the participants - I'm more a mountain person, so will go to a SKI conference instead ... but I've loved every post of yours highlighting the value and special touches your have planned for the group !",
            "userName": "Luigi LENGUITO",
            "userProfileURL": "https://www.linkedin.com/in/llenguito",
            "dataId": "urn:li:comment:(ugcPost:7290012501310664704,7290112271727423488)"
          }
        ],
        "commentAdded": "Exciting news about future CruiseCon events! Looking forward to the updates and more chances to connect with everyone. 🚢✨"
      },
      {
        "postId": "urn:li:activity:7290184514025177088",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290184514025177088",
        "url": "https://www.linkedin.com/in/mayer-schwartz?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABHPsCgBGX4ZtqZuX4I6nn_19GJB3gJl4es",
        "name": "Mayer Schwartz\nMayer Schwartz",
        "content": "The Swift Staffing Group is honored to sponsor the photo booth at the Business & Mindset event in the Nefesh B'Nefesh building in Jerusalem this upcoming Sunday iyh.\n\n\nOpening our Israel office in September 2023 was a milestone for us. But just weeks later, on October 7th, everything changed. It has been a challenging time for so many, and now more than ever, we are committed to giving back, rebuilding, and reconnecting with business owners, job seekers, and professionals across industries.\n\n\nThis event features an incredible panel of speakers and we are excited to be part of such a meaningful gathering.\n\nWhat a lineup!\n\n,,,,,,,,,,,,,,,,,,,,and more...\n\nA huge thank you to the event organizers and to our amazing, for making this happen.\n\nStop by, snap a photo, connect, and let’s build a stronger future together.\n\nOur Israel Recruiteris looking forward to meeting you there!",
        "reactions": {
          "likes": "26",
          "comments": "9 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "The video of our Jerusalem office opening ceremony \n\nhttps://www.linkedin.com/posts/macschlesinger_i-would-like-to-congratulate-my-buddy-mayer-activity-7112294079840804865-EpiI?utm_source=share&utm_medium=member_android\n\nThank youfor joining the special occasion.",
            "userName": "Mayer Schwartz",
            "userProfileURL": "https://www.linkedin.com/in/mayer-schwartz",
            "dataId": "urn:li:comment:(activity:7290184514025177088,7290185090318446592)"
          },
          {
            "commentText": "Awesome! Looking forward",
            "userName": "🧊Abe Braha",
            "userProfileURL": "https://www.linkedin.com/in/abe-braha",
            "dataId": "urn:li:comment:(activity:7290184514025177088,7290219365893902336)"
          },
          {
            "commentText": "Abe Braha Likewise!",
            "userName": "Mayer Schwartz",
            "userProfileURL": "https://www.linkedin.com/in/mayer-schwartz",
            "dataId": "urn:li:comment:(activity:7290184514025177088,7290221483061059584)"
          }
        ],
        "commentAdded": "Excited to see the community come together for such a vital event! Looking forward to connecting and building a brighter future together! 📸✨"
      },
      {
        "postId": "urn:li:activity:7290236969479979009",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290236969479979009",
        "url": "https://www.linkedin.com/in/houseofbricks?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAA-MkMBNOorFGtIDG0boxkwxMypXZhfUgk",
        "name": "Michael Kainatsky\nMichael Kainatsky",
        "content": "Have you ever been asked in a DM \"How's your LinkedIn treating you?\"\n\n\nWell I am asking you that now?\n\nNo matter how many people I speak with on a weekly basis,\nat least 50% tell me they're sick of this platform\n\nOR\n\nThey're sick from the platform.\n\nBurnout here is at an all time high, and the majority of people aren't\nenjoying it.\n\nPersonally, I am really tired of hearing this.\n\nYou know what they say?\n\nWhen you're tired of hearing something, change the conversation.\n\nTomorrow,,and I will do just that.\n\nWe will share\n-> the best practices of how to get \"real\" success on.\n-> the game-changing tool we use to be efficient and avoid burnout\n-> step by step of how I scheduled 1000+ networking calls in 2024\n-> the most important metrics to pay attention to, what to ignore\n-> some really funny jokes\n\nAnd, you wont be put into a lead funnel for registering!\n\nRegister here, trust me, we're experts.",
        "reactions": {
          "likes": "49",
          "comments": "50 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/c02321c0-d400-4d1f-a001-4e380b6d45fa",
        "comments": [
          {
            "commentText": "I wish I could have an autoreply set up for people who ask that question.\n\n\"Fine.\"",
            "userName": "Aaron Shields",
            "userProfileURL": "https://www.linkedin.com/in/aaronleeshields",
            "dataId": "urn:li:comment:(ugcPost:7290163294043029505,7290327782302076929)"
          }
        ],
        "commentAdded": "Excited for this fresh approach! Its time to shift the narrative and find joy in networking again. Looking forward to your insights!"
      },
      {
        "postId": "urn:li:activity:7290045017509806080",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290045017509806080",
        "url": "https://www.linkedin.com/in/grandhi-praveen-5a95a82a0?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAEiz31EBgNKC1vtH2XohEpmqEPmrnOE6jhw",
        "name": "Grandhi Praveen\nGrandhi Praveen",
        "content": "Thrilled to be part of an insightful event packed with expert talks on cloud-native technologies! Engaging sessions, fresh perspectives, and valuable takeaways made it a fantastic experience.\n\n Key Highlights:\n Intro to CNCF –delivered a fantastic debut talk, breaking down the CNCF ecosystem with clarity and enthusiasm. Well done, Swapna! \n Observability Demystified –unraveled observability concepts and tools, providing practical insights for real-world applications. \n Intro to AI –gave a captivating introduction to AI fundamentals, along with beginner-friendly resources to kickstart the journey into AI. \n DevOps Career & Vision –shared an excellent roadmap for navigating the DevOps landscape, with career tips and advice on staying ahead of the curve. \n\n A big shoutout to theteam andfor organizing such an incredible event and built some connections at event`\n\nLooking forward to more such inspiring gatherings where we can learn, grow, and connect. Here’s to the incredible spirit of the tech community! ",
        "reactions": {
          "likes": "49",
          "comments": "5 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Thank you. Looking forward to see you at more meetups. ",
            "userName": "Y Sarvani Swapna Priya",
            "userProfileURL": "https://www.linkedin.com/in/ysspriya",
            "dataId": "urn:li:comment:(ugcPost:7290045016113037312,7290056961352482817)"
          },
          {
            "commentText": " ",
            "userName": "Grandhi Praveen",
            "userProfileURL": "https://www.linkedin.com/in/grandhi-praveen-5a95a82a0",
            "dataId": "urn:li:comment:(ugcPost:7290045016113037312,7290063107215761408)"
          },
          {
            "commentText": "Thanks for joining the session ",
            "userName": "Sathpal Singh 🇮🇳",
            "userProfileURL": "https://www.linkedin.com/in/sathpalsingh",
            "dataId": "urn:li:comment:(ugcPost:7290045016113037312,7290046840186511361)"
          },
          {
            "commentText": "Sathpal Singh 🇮🇳 Thanks for having me! it was my first meetup related to cloud",
            "userName": "Grandhi Praveen",
            "userProfileURL": "https://www.linkedin.com/in/grandhi-praveen-5a95a82a0",
            "dataId": "urn:li:comment:(ugcPost:7290045016113037312,7290064080608837632)"
          }
        ],
        "commentAdded": "Sounds like an amazing event! Kudos to the organizers and speakers for fostering valuable learning and connections in the tech community! 👏✨"
      },
      {
        "postId": "urn:li:activity:7290354304996003842",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290354304996003842",
        "url": "https://www.linkedin.com/in/michaeltbeck?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAdkz58BMFx9YaHydaO3tjIjOiYBPZpO72I",
        "name": "Michael Beck\nMichael Beck",
        "content": null,
        "reactions": {
          "likes": "1",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": []
      }
    ],
    "errors": [
      {
        "postId": "urn:li:activity:7290314214995374080",
        "url": "https://www.linkedin.com/in/rachelparkco?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAa1ojgB6thaDElEllbhupHwYhc6Wgk0cao",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7290307820174901248",
        "url": "https://www.linkedin.com/in/gerrit-sneam-7304a4347?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAFa_aRQB0-RCgyybx1RpJiXQQFlIRWWx-Ws",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7290071595232960514",
        "url": "https://www.linkedin.com/in/leslievenetz?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADPju4B9I-KSyVAlH2xAmiN72f5wsayOtM",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7290184514025177088",
        "url": "https://www.linkedin.com/in/mayer-schwartz?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABHPsCgBGX4ZtqZuX4I6nn_19GJB3gJl4es",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7290045017509806080",
        "url": "https://www.linkedin.com/in/grandhi-praveen-5a95a82a0?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAEiz31EBgNKC1vtH2XohEpmqEPmrnOE6jhw",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7290354304996003842",
        "url": "https://www.linkedin.com/in/michaeltbeck?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAdkz58BMFx9YaHydaO3tjIjOiYBPZpO72I",
        "errors": [
          "Failed to fetch content.",
          "Failed to fetch media URL."
        ]
      }
    ]
  },
  {
    "postsData": [
      {
        "postId": "urn:li:activity:7290296371943817216",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290296371943817216",
        "url": "https://www.linkedin.com/in/megha-chaudhary-0961561b1?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADFSWfIBsa2gZytKS4MP-diNDU4pE410cm8",
        "name": "Megha Chaudhary\nMegha Chaudhary",
        "content": "Feeling incredibly grateful for the opportunity to work as a curriculum Design Lead in the Transformational Schooling  \nThis experience has been nothing short of insightful, helping me understand the nuances of designing a curriculum that balances the needs of both teachers and students.\nEach feedback session, meeting, and collaborative effort pushed me to improve my work, pay attention to the smallest details, and bring my best to the table.\nA huge thank you to for your unwavering support and infectious energy—you made every task so enjoyable and rewarding. To , your innovative ideas and persistence are truly commendable; you taught me the value of pushing boundaries to achieve excellence. And , your ability to ignite the critical thinker in me has been transformative. Thank you ️ for challenging me to see beyond the obvious and embrace creativity in the process.\nThis journey has not only helped me grow professionally but has also left me deeply inspired. Here's to more opportunities to learn, grow, and create meaningful impact! ",
        "reactions": {
          "likes": "16",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Well deserved",
            "userName": "MANENDRA KUMAR",
            "userProfileURL": "https://www.linkedin.com/in/manendra-kumar-bbb74b213",
            "dataId": "urn:li:comment:(ugcPost:7290217701967376387,7290325409542422528)"
          }
        ],
        "commentAdded": "Congratulations on this incredible journey! Your passion for curriculum design and collaborative spirit truly shines. Excited to see your continued impact!"
      },
      {
        "postId": "urn:li:activity:7290275526156410880",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290275526156410880",
        "url": "https://www.linkedin.com/in/cristian-mudure-9506183?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAACgBEwBcZH6muplFsd2Ji_GcjfawFvto5E",
        "name": "Cristian Mudure\nCristian Mudure",
        "content": "A common sentence is: \"I regret not having fired an employee quickly enough.\"\n\nHowever, before I decide to terminate someone, I always consider these points:\n\n1. The reasons for a dismissal are not always clear-cut. Often, it is a matter of judgment that can impact the entire team.\n\nDuring the 2014 World Cup, Kevin Großkreutz was mocked for becoming a world champion without playing a single minute. But those who were in the locker room knew how important he was for team cohesion. Just like in a sports team, individual performance is not the only thing that matter, the dynamics and overall performance of a team or department also play a crucial role.\n\nSometimes, a person who is not a top performer still contributes positively to group dynamics. However, if someone consistently falls short of expectations, it can affect the motivation of the entire team.\n\n2. People at the beginning of their careers deserve a second chance. Especially with young professionals, it often turns out that they are better suited for a different role. In my company, I have frequently seen cases where someone was initially hired for a specific position but, after a short time, thrived and was much more successful in a different area.\n\n3. The key question at the end of the probation period.\nWhen the probation period is about to end, I always ask myself:\n\n\"Knowing what I know today, would I hire this person again?\"",
        "reactions": {
          "likes": "21",
          "comments": "2 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Love this Cristian Mudure. One more thing to consider: Is the issue skill or mindset? Skills can be developed, but if someone lacks accountability or a growth mentality, no amount of coaching will fix it.",
            "userName": "John Radford",
            "userProfileURL": "https://www.linkedin.com/in/johnwradford",
            "dataId": "urn:li:comment:(activity:7290275526156410880,7290297847747366912)"
          }
        ],
        "commentAdded": "Great insights! Balancing performance and team dynamics is crucial. Giving young professionals a second chance can lead to unexpected successes!"
      },
      {
        "postId": "urn:li:activity:7290058895559901184",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290058895559901184",
        "url": "https://www.linkedin.com/in/sameerranjan009?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABjl9l0Bkk6w4b5EjM9ImD-uc_WJvdkFo-w",
        "name": "Sameer Ranjan\nSameer Ranjan",
        "content": "Great opportunity for students to learn about Google and GenAI at The University of Texas at Dallas",
        "reactions": {
          "likes": "8",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Exciting initiative! This is a fantastic chance for students to dive into the world of Google and GenAI. Lets empower the next generation!"
      },
      {
        "postId": "urn:li:activity:7289980326011895809",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289980326011895809",
        "url": "https://www.linkedin.com/in/christinalangdoncoachconsultant?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAFTKXUBfbA1AVJGERPumW45HsdACxqLq8E",
        "name": "Christina Langdon - Success Coach\nChristina Langdon - Success Coach",
        "content": "The rules we are taught to follow:\n\nDon't be disruptive.\nStay humble, avoid attention.\nFollow the traditional path.\nWait your turn.\nDon't ask for too much.\nPlay it safe.\n\nI know these rules all too well. \n\nYet look at the most successful people and brands in the world – they break every one of these rules.\n\nThe disruptors reshape industries. The delegators build empires. The attention-seekers become influencers. The best salespeople change the world. The rule-breakers create new industries. The impatient innovate faster. The bold negotiators earn more. And those who take calculated risks? They're the ones making history.\n\nSometimes extraordinary success means unlearning what we've been taught.\nI learned that through nearly two decades working for Martha Stewart. It was like getting my MBA in personal branding with Professor Stewart; failing wasn't an option.\n\nI learned that excellence isn't just a goal – it's a daily practice.\n\nListen to the 7 Lessons I learned at Martha University. A good reminder that breaking the rules is a path that's never crowded.\n_______________\nReady to build a personal brand that breaks through the noise? My Sunday Sunshine readers tell me: your personal brand isn't just important – it's everything.\n\nIf you're a high achiever ready to:\n-Turn industry rules into opportunities\n-Transform your expertise into undeniable influence\n-Build a brand that opens doors before you even walk in\n\nLet's talk. I work with select CEOs and leaders ready to think bigger, act bolder, and achieve what others call impossible.\n\nThe leaders who make history don't just break the mold – they create a new one.",
        "reactions": {
          "likes": "15",
          "comments": "5 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Love this perspective Christina Langdon - Success Coach! The biggest breakthroughs come from those willing to challenge the norm",
            "userName": "Yulia Petrossian Boyle",
            "userProfileURL": "https://www.linkedin.com/in/yuliaboyle",
            "dataId": "urn:li:comment:(activity:7289980326011895809,7290021233935433729)"
          }
        ],
        "commentAdded": "Absolutely resonate with this! Breaking the mold paves the way for innovation and growth. Lets redefine success together! 🚀 #RuleBreakers"
      },
      {
        "postId": "urn:li:activity:7290355014416400384",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290355014416400384",
        "url": "https://www.linkedin.com/in/krutamhathi?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACOOdIkBXQY_AXjak5O7tyaCRoMfBoceBi4",
        "name": "Krutam Hathi\nKrutam Hathi",
        "content": "We all know investing is key to building wealth. But here’s something we don’t talk about enough - how much wealth do we actually need?\n\nFor the longest time, I didn’t have an answer. Retirement felt like a far-off goal, and I had no idea whether I was saving enough - or too little.\n\nWould 2 Crores be enough for my retirement? Or would I need 10? I was clueless.\nThe math felt too overwhelming. Thankfully,I found an app that did it for me.\n\nPowerUp Moneymade it extremely easy to calculate my retirement age and the money I’d need for it. And beyond just giving me a number, it let me explore how different life choices could impact my journey:\n\n→ The impact of major life events like a wedding or home purchase on my retirement fund and timeline\n→ How a 10% increase in investments could bring down my retirement age by two years\n→ A year-by-year projection of my wealth growth\n\nFor the first time, I feel like I’m planning with a purpose, not just investing blindly. If you’ve ever wondered what your retirement number looks like, this is worth checking out.",
        "reactions": {
          "likes": "27",
          "comments": "11 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "This is great ",
            "userName": "Ashish Misal",
            "userProfileURL": "https://www.linkedin.com/in/ashishmisal",
            "dataId": "urn:li:comment:(activity:7290352654763888642,7290355017419517952)"
          },
          {
            "commentText": "Great share Krutam Hathi",
            "userName": "Tauseef Fayyaz",
            "userProfileURL": "https://www.linkedin.com/in/tauseeffayyaz",
            "dataId": "urn:li:comment:(activity:7290352654763888642,7290354439519920128)"
          }
        ],
        "commentAdded": "Great insights! Understanding our retirement needs is crucial. Excited to explore PowerUp Money for a clearer financial future! 💡"
      },
      {
        "postId": "urn:li:activity:7290013278527725569",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290013278527725569",
        "url": "https://www.linkedin.com/in/leslievenetz?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADPju4B9I-KSyVAlH2xAmiN72f5wsayOtM",
        "name": "Leslie Venetz\nLeslie Venetz",
        "content": "Are you working IN the business so much that you’ve stopped working ON the business?\n\nRight now is a difficult time to be a sales leader.\n\nWe’re coming off a period of rapid, easy growth.\n\nExpectations are sky-high.\n\nMany leaders are being asked to deliver results with fewer resources - smaller teams, leaner budgets, and a consolidated tech stack.\n\nWhen that happens, it’s easy to get insular.\n\nThe pressure to hit numbers can lead to tunnel vision.\n\nThat’s exactly when you need external perspective the most.\n\n\n️ Here’s why seeking an outside perspective is essential for revenue growth:\n\n- Fresh insights and innovation:\n\nExternal experts can introduce strategies and ideas you might not have considered, often pulling best practices from across industries.\n\n- Unbiased market analysis:\n\nThey bring objectivity, helping you spot opportunities and gaps that may be hidden in plain sight.\n\n- Optimized strategies:\n\nWhether it’s pricing, sales, or marketing, an external lens ensures your strategies are tailored for maximum impact.\n\n\n️ As leaders, we can’t afford to let pressure lock us into doing more of the same.\n\nSometimes, the best way to move the needle is to step back, invite new ideas, and work on the business, not just in it.\n\n\n What’s one way you can commit to seeking an external perspective in 2025?\n\n\nShameless plug:\nI am hosting a Sales Masterclass on April 8 in Phoenix with&. It's ideal for Sales Leaders & aspiring sales leaders.\n\nThis is a PERFECT way to learn, network, and grow by seeking external perspectives.\n\nLearn more and snag your ticket here:",
        "reactions": {
          "likes": "68",
          "comments": "19 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/050b0f0a-7d4b-4b72-8166-34d6de3f023d",
        "comments": [
          {
            "commentText": "Such an important message! As a digital marketer and SEO specialist, I see how easy it is to get caught up in the daily grind. Seeking an external perspective can bring fresh ideas, uncover hidden opportunities, and refine strategies for better results. It’s all about evolving and optimizing to stay ahead!",
            "userName": "Ahmad Bilal",
            "userProfileURL": "https://www.linkedin.com/in/ahmadbilalkhizri",
            "dataId": "urn:li:comment:(ugcPost:7281774202083274753,7290253043390939136)"
          }
        ],
        "commentAdded": "Great insights! Seeking external perspectives is crucial for innovation and growth. Excited to see how your masterclass fosters new ideas!"
      },
      {
        "postId": "urn:li:activity:7290160960298713088",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290160960298713088",
        "url": "https://www.linkedin.com/in/nealconlon?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAhYvx4BQsaUxum6g_YrZe0lxTaVFqxCY9o",
        "name": "Neal Conlon\nNeal Conlon",
        "content": "Does your business have this capability?\n\nExecutive Threat Reporting \nOur Executive Threat Reporting provides C-suite executives and decision-makers with in-depth analysis and real-time reporting on cyber threats, security breaches, and emerging vulnerabilities. This service enables organizations to proactively mitigate risks and understand the full scope of their exposure, with clear, actionable insights.\n\nInside Baseball HUMINT Reporting\nThis unique product leverages human intelligence (HUMINT) to uncover hidden threats and risks within your organization and the broader threat landscape. We provide detailed reports, including insider threat analysis and intelligence on adversaries, to ensure you're always several steps ahead.\n\nSWAT Team Services\nFor Converging Physical and Digital Security Black Orchid’s SWAT team services bring together the best in physical and digital security, offering a holistic approach to safeguarding high-risk environments. Our team operates with precision to protect your critical assets by combining physical security protocols with digital safeguards, ensuring a seamless, layered defense.",
        "reactions": {
          "likes": "19",
          "comments": "3 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "",
            "userName": "Damien Snow",
            "userProfileURL": "https://www.linkedin.com/in/admin-pressforward",
            "dataId": "urn:li:comment:(ugcPost:7290160958327410689,7290170009576701952)"
          },
          {
            "commentText": "Congrats Neal! ",
            "userName": "Thomas Johnson",
            "userProfileURL": "https://www.linkedin.com/in/thomas-johnson-3ab024312",
            "dataId": "urn:li:comment:(ugcPost:7290160958327410689,7290219352455360512)"
          }
        ],
        "commentAdded": "Impressive offerings! Proactive threat intelligence is crucial for today’s executives. How do you integrate these services across teams?"
      },
      {
        "postId": "urn:li:activity:7290335664129069056",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290335664129069056",
        "url": "https://www.linkedin.com/in/jepsontaylor?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAT1knkBKurLdx7ocCJOtEwdp07TIBzisxg",
        "name": "🦾Jepson Taylor\n🦾Jepson Taylor",
        "content": "This didn’t age well…",
        "reactions": {
          "likes": "40",
          "comments": "8 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/783de9ea-6102-4dc8-8086-c3ec67092c30",
        "comments": [
          {
            "commentText": "Nothing is ever “Totally hopeless”…\n\nEspecially not Competition…\n\nPARTICULARLY for those who say it’s hopeless to compete with them!!",
            "userName": "Russell Willis",
            "userProfileURL": "https://www.linkedin.com/in/russell-willis",
            "dataId": "urn:li:comment:(ugcPost:7290335663730704386,7290348538536886274)"
          },
          {
            "commentText": "Hahaha it’s funny… looking back how insane! To assume that you’ll maintain dominance in an emerging technology suggests a complete lack of situational awareness!",
            "userName": "Trevor Slade, PE",
            "userProfileURL": "https://www.linkedin.com/in/trevor-slade-pe-774b9116",
            "dataId": "urn:li:comment:(ugcPost:7290335663730704386,7290337662194851843)"
          }
        ],
        "commentAdded": "Isnt it fascinating how quickly perspectives can shift? Heres to continuous learning and adapting! #GrowthMindset"
      },
      {
        "postId": "urn:li:activity:7290353660188835840",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290353660188835840",
        "url": "https://www.linkedin.com/in/holmesonwukaife?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAq3E2AB8fFLfM2cLTsm7BmmBfNqv7cpOno",
        "name": "Holmes Onwukaife\nHolmes Onwukaife",
        "content": "High level summary of Q4 2024 in the Austin Office Market. (Full Report Attached)\n\nEconomic Strength: Austin's economy remains robust, adding 22,000 jobs YOY with a low unemployment rate of 3.5%, outperforming both state (4.2%) and national averages.\n\nHigh Vacancy Rates: The overall office vacancy rate increased to 29.8%, with the Central Business District (CBD) reaching 30.0%. A surplus of new speculative office buildings has contributed significantly to elevated vacancy levels.\n\nLeasing Activity Improvement: Despite economic uncertainty, Q4 2024 ended positively with 884,000 square feet leased, contributing to a modest yearly net absorption of 259,000 square feet. However, the CBD recorded a negative absorption of 269,000 square feet.\n\nStable Pricing: Asking rents have remained stable despite elevated vacancies, with the average market rate at $47.45 per square foot. Class A spaces in the CBD lead the market at $65.63 per square foot.\n\nConstruction Slowdown: New office space deliveries have slowed, with 1.9 million square feet under construction, predominantly in the CBD. About 25% of this space is pre-leased.",
        "reactions": {
          "likes": "2\nLucas Wilson and 1 other",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Great insights on the Austin office market! Its encouraging to see job growth despite the challenges of high vacancy rates. Excited for future developments!"
      },
      {
        "postId": "urn:li:activity:7290222628504526848",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290222628504526848",
        "url": "https://www.linkedin.com/groups/762547?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A762547-7290222627300741122",
        "name": "Big Data 🟥 Data Science | Machine Learning | Deep Learning | Artificial Intelligence\nBig Data 🟥 Data Science | Machine Learning | Deep Learning | Artificial Intelligence",
        "content": "Talent, intelligence, and luck are not your greatest strengths.\nIt’s resilience.\nResilience is the ability to face adversity head-on, adapt, and\n\nrise stronger.\n\nIt’s what separates those who give up\n\nfrom those who persevere.\n\n\nIt’s the superpower that turns failure into a stepping stone for success.\n\nLet’s be real:\n\nthe path to our goals isn’t smooth.\n\nChallenges, setbacks,\n\nand moments of doubt will test us.\n\nBut resilience is what helps us turn obstacles\n\ninto opportunities and dreams into reality.\n\n\nHere’s how you can develop your resilience:\n\n• Reframe obstacles: Instead of “Why me?” ask, “What’s the lesson here?”\n• Stay grounded in your vision: Your “why” keeps you moving forward.\n• Celebrate every step: Progress, no matter how small, is still progress.\n\nResilience isn’t about avoiding struggles…\n\nit’s about thriving because of them.\n\nWhen was the last time resilience\n\nhelped you push through?\n\nLet’s share and inspire each other.",
        "reactions": {
          "likes": "19\nMarianna Outsia and 18 others",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Absolutely! Resilience is the key to growth. Embracing challenges as lessons shapes our journey to success. What a powerful reminder!"
      }
    ],
    "errors": [
      {
        "postId": "urn:li:activity:7290296371943817216",
        "url": "https://www.linkedin.com/in/megha-chaudhary-0961561b1?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADFSWfIBsa2gZytKS4MP-diNDU4pE410cm8",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7290275526156410880",
        "url": "https://www.linkedin.com/in/cristian-mudure-9506183?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAACgBEwBcZH6muplFsd2Ji_GcjfawFvto5E",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7290058895559901184",
        "url": "https://www.linkedin.com/in/sameerranjan009?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABjl9l0Bkk6w4b5EjM9ImD-uc_WJvdkFo-w",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7289980326011895809",
        "url": "https://www.linkedin.com/in/christinalangdoncoachconsultant?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAFTKXUBfbA1AVJGERPumW45HsdACxqLq8E",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7290355014416400384",
        "url": "https://www.linkedin.com/in/krutamhathi?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACOOdIkBXQY_AXjak5O7tyaCRoMfBoceBi4",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7290160960298713088",
        "url": "https://www.linkedin.com/in/nealconlon?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAhYvx4BQsaUxum6g_YrZe0lxTaVFqxCY9o",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7290353660188835840",
        "url": "https://www.linkedin.com/in/holmesonwukaife?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAq3E2AB8fFLfM2cLTsm7BmmBfNqv7cpOno",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7290222628504526848",
        "url": "https://www.linkedin.com/groups/762547?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A762547-7290222627300741122",
        "errors": [
          "Failed to fetch media URL."
        ]
      }
    ]
  },
  {
    "postsData": [
      {
        "postId": "urn:li:activity:7290222133241094145",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290222133241094145",
        "url": "https://www.linkedin.com/in/sonali-malhotra23?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABwfkCUBHzeJEIxfGf2hmbxe6mAFfAZLyq0",
        "name": "Sonali M.\nSonali M.",
        "content": "#Mastercard gets it.\n\nA simple billboard.\nA human truth.\nA personal touch.\n\nB2B brands, 𝘁𝗮𝗸𝗲 𝗻𝗼𝘁𝗲𝘀.\n\nPeople don’t connect with 𝙟𝙖𝙧𝙜𝙤𝙣 𝙖𝙣𝙙 𝙘𝙤𝙧𝙥𝙤𝙧𝙖𝙩𝙚 𝙩𝙖𝙡𝙠.\n\nThey connect with 𝗲𝗺𝗼𝘁𝗶𝗼𝗻𝘀, 𝘀𝘁𝗼𝗿𝗶𝗲𝘀, 𝗮𝗻𝗱 𝗿𝗲𝗮𝗹 𝗺𝗼𝗺𝗲𝗻𝘁𝘀.\n\nStop sounding like a robot.\n\nStart being human.\n\nBecause business isn’t B2B or B2C.\n\nIt’s always P2P—𝗣𝗲𝗼𝗽𝗹𝗲 𝘁𝗼 𝗣𝗲𝗼𝗽𝗹𝗲 —\n\n\nWhat’s your take on this?",
        "reactions": {
          "likes": "251",
          "comments": "112 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Sonali M. well said. Business is about people to people. It's about a personal touch. Simplicity and authenticity will always win.",
            "userName": "Sourish Bujarbaruah 📌",
            "userProfileURL": "https://www.linkedin.com/in/sourish-bujarbaruah-%F0%9F%93%8C-358151292",
            "dataId": "urn:li:comment:(activity:7290221044882120704,7290222122268835840)"
          },
          {
            "commentText": "Sourish Bujarbaruah  Always….. it’s the best way to connect with audience",
            "userName": "Sonali M.",
            "userProfileURL": "https://www.linkedin.com/in/sonali-malhotra23",
            "dataId": "urn:li:comment:(activity:7290221044882120704,7290228591080919040)"
          }
        ],
        "commentAdded": "Absolutely! Connecting on a human level fosters genuine relationships. Let’s prioritize emotions and stories in our B2B interactions! #PeopleToPeople"
      },
      {
        "postId": "urn:li:activity:7290089641335001088",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290089641335001088",
        "url": "https://www.linkedin.com/company/utahvc/posts",
        "name": "Utah VC\nUtah VC",
        "content": "Mobly secures $4.3M seed funding: https://lnkd.in/gJ4W_E2X\n\nFounders:and\nFunders:,,,, Peak Ventures, and notable angel investorsand.",
        "reactions": {
          "likes": "72",
          "comments": "6 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Go Mobly !!",
            "userName": "Ethan P.",
            "userProfileURL": "https://www.linkedin.com/in/parkerethan",
            "dataId": "urn:li:comment:(activity:7290088957692809216,7290175385131003904)"
          },
          {
            "commentText": "Congrats on all the hard work of you and your team  Zach Barney l! You deserve it.",
            "userName": "Ryan Gray",
            "userProfileURL": "https://www.linkedin.com/in/ryanadamgray",
            "dataId": "urn:li:comment:(activity:7290088957692809216,7290126231214206976)"
          }
        ],
        "commentAdded": "Exciting news for Mobly! 🚀 Congrats to the founders and funders on this impressive seed funding milestone. Looking forward to seeing their growth!"
      },
      {
        "postId": "urn:li:activity:7290348409981419520",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290348409981419520",
        "url": "https://www.linkedin.com/in/miodrag-o-markovic?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAWyHnEB842NovxmdKytP1VkWHSdhtYXPR8",
        "name": "Miodrag O. Markovic\nMiodrag O. Markovic",
        "content": "𝗗𝗶𝘀𝗿𝘂𝗽𝘁𝗶𝗼𝗻 𝗶𝗻 𝘁𝗵𝗲 𝗔𝗜 𝗜𝗻𝗱𝘂𝘀𝘁𝗿𝘆, 𝗗𝗲𝗲𝗽𝗦𝗲𝗲𝗸 𝗩𝗦 𝗢𝗽𝗲𝗻𝗔𝗜\n\nHonestly, I felt like I’m late to the discussion train. \n\nEvery single post on LinkedIn, X, and even in real life is talking about DeepSeek and the disruption it’s causing in the tech space.\n\nBut, I realized I am not late at all because they launched a video and image generator as well.\n\nOne sentence came to my mind that could be the answer to all the panic caused:\nThe space is evolving with lightning speed every day.\n\nLet’s break down the news quickly, and then I’ll explain how this sentence ties into everything:\n\n— DeepSeek’s AI development costs under $6 million, less than OpenAI’s billion-dollar investments.\n— Unlike OpenAI, DeepSeek offers open-source solutions, allowing for more customization.\n— DeepSeek provides an affordable alternative to Western AI giants.\n— DeepSeek’s energy-efficient hardware contrasts with OpenAI’s reliance on high-end chips, offering a greener solution.\n— Nvidia's stock experienced a significant decline following the launch of DeepSeek's AI model.\n\nBack to that sentence: we have to accept that new startups are emerging every day.\n\nThese startups might even outperform the tech giants in some areas.\n\nAnd this could be you, or anyone in the space. If you’re lucky enough, within just one day of launching, you could be the talk of the world, just like DeepSeek.\n\nThe key is not to panic about competitors or market fluctuations.\n\nFocus on delivering sustainable innovation that solves real problems, backed by a dedicated team, passion, hard work, and a deep understanding of your customers' needs.\n\nThe future is coming fast, and the best way to stay ahead is by creating solutions that truly matter.\n\nAnd if you are a user, please treat every merging tool with precision in testing it and reviewing its policy because hype eventually goes down on projects that are not valuable.\n\nI hope DeepSeek is not just hype, and that it lives up to the sustainable and impactful innovation that can truly help people.",
        "reactions": {
          "likes": "13",
          "comments": "11 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "https://www.linkedin.com/posts/michaeldedecek_aiforgood-globalcooperation-ethicalai-activity-7290089779373719553-nr-s?utm_source=share&utm_medium=member_desktop",
            "userName": "Michael Dedecek",
            "userProfileURL": "https://www.linkedin.com/in/michaeldedecek",
            "dataId": "urn:li:comment:(activity:7290348409981419520,7290351529780232193)"
          },
          {
            "commentText": "Michael Dedecek - Just read it, and I completely agree. Without collaboration, we’ll be stuck in a toxic race between companies instead of making real progress. We need sustainable solutions. This aligns perfectly with what I wrote, I’m glad we agree that moving forward means recognizing that others are also capable and bringing value to the table.",
            "userName": "Miodrag O. Markovic",
            "userProfileURL": "https://www.linkedin.com/in/miodrag-o-markovic",
            "dataId": "urn:li:comment:(activity:7290348409981419520,7290353578290888704)"
          },
          {
            "commentText": "Miodrag O. Markovic exactly, thank you!  ",
            "userName": "Michael Dedecek",
            "userProfileURL": "https://www.linkedin.com/in/michaeldedecek",
            "dataId": "urn:li:comment:(activity:7290348409981419520,7290354508663013377)"
          },
          {
            "commentText": " Staying ahead means adapting quickly and building solutions that actually solve real-world problems, not just chasing trends. As Founder & CEO of a software development company specializing in Blockchain SaaS & AI-driven platforms, I believe this disruption is a clear reminder that true value comes from creating sustainable, customer-focused solutions.",
            "userName": "Waqas S.",
            "userProfileURL": "https://www.linkedin.com/in/sarwarwaqas-",
            "dataId": "urn:li:comment:(activity:7290348409981419520,7290353739352203264)"
          },
          {
            "commentText": "Waqas S. Exactly, thanks.",
            "userName": "Miodrag O. Markovic",
            "userProfileURL": "https://www.linkedin.com/in/miodrag-o-markovic",
            "dataId": "urn:li:comment:(activity:7290348409981419520,7290354841892106241)"
          }
        ],
        "commentAdded": "Exciting times ahead in the AI space! DeepSeeks approach shows that innovation can come from anywhere. Lets keep pushing for sustainable solutions! 🌍✨"
      },
      {
        "postId": "urn:li:activity:7290317766983659520",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290317766983659520",
        "url": "https://www.linkedin.com/in/dupeburgess?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABvuM0kBMBiyaFKVbDKsiSYEWwwf2knjHBQ",
        "name": "Dr. Dupe Burgess\nDr. Dupe Burgess",
        "content": "Trust isn’t built with words, it’s built with actions.\n\nBeing liked is easy, but being trusted takes work.\n\nIf people don’t trust you, nothing else matters.\n\n9 overlooked ways to earn people’s trust\n(And how to do it):\n\n1. Admit when you’re unqualified\n↳ Honesty about knowledge makes you authentic.\n↳ Admit your limits, get help, and grow.\n\n2. Underpromise & overdeliver\n↳ Overdelivering makes you the trusted go-to.\n↳ Set limits, and exceed on what you promise.\n\n3. Challenge authority (respectfully)\n↳ Questioning authority shows real courage.\n↳ Challenge calmly using data & solutions.\n\n4. Give credit, loud & clear\n↳ Publicly praising others builds loyalty & trust.\n↳ Share credit with specific, named examples.\n\n5. Admit when you’re wrong\n↳ Owning mistakes shows strength & decency.\n↳ Apologise, take responsibility, and fix things.\n\n6. Celebrate Others' better ideas\n↳ Celebrating others’ ideas fuels trust.\n↳ Admit better ideas and take them on.\n\n7. Respect boundaries, always\n↳ Respecting boundaries reduces resentment.\n↳ Ask, listen, & honour people's down time.\n\n8. Keep private issues confidential\n↳ Discretion builds trust; gossip destroys it.\n↳ Always keep sensitive information private.\n\n9. Tell the truth, even when it’s hard\n↳ Hard truths build credibility.\n↳ Be honest, empathetic, & solution-focused.\n\nTrust isn't built overnight.\nBut these gestures are a great start.\n\nWhich of these actions do you need to work on?\nLet me know in the comments\n\nWant my 75 best carousel PDFs? Get them here for free:\n\n️ Repost to help your network build trust.\n Followfor more.",
        "reactions": {
          "likes": "245",
          "comments": "187 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "It’s not about what we say, but what we do consistently, and these steps are a great guide to earning that trust. Thank you Dr. Dupe Burgess",
            "userName": "Damesha Craig, Leadership Coach and Startup Advisor",
            "userProfileURL": "https://www.linkedin.com/in/dameshacraig",
            "dataId": "urn:li:comment:(ugcPost:7290310119152603136,7290317716815548416)"
          },
          {
            "commentText": "Damesha Craig, Leadership Coach and Startup Advisor you are welcome, thank you for your comment",
            "userName": "Dr. Dupe Burgess",
            "userProfileURL": "https://www.linkedin.com/in/dupeburgess",
            "dataId": "urn:li:comment:(ugcPost:7290310119152603136,7290328984922320896)"
          }
        ],
        "commentAdded": "Great insights! Honesty and humility can truly transform relationships. Lets all strive to build trust through our actions! 💪✨"
      },
      {
        "postId": "urn:li:activity:7290346392538013696",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290346392538013696",
        "url": "https://www.linkedin.com/company/kpmgindia/posts",
        "name": "KPMG India\nKPMG India",
        "content": "It was a pleasure to be amongst \nhashtag\n#technologyleaders, \nhashtag\n#CIO and \nhashtag\n#ICT partners at the  13th CIO Choice – Red Carpet Night  to celebrate recognition of \nhashtag\n#ICTpartners by CIOs for their contribution in value creation as trusted partners. Had the privilege of presenting to the\non attributes of enterprises that demonstrate technology leadership based our report ‘KPMG Global Tech Report 2024’, which is a result of surveying 2450 senior executives across 26 countries.\n\nOur research demonstrates that such enterprises, amongst others have invested to align stakeholders around a clear definition of success, harness power of partnerships, prioritise trust and security, build a strong data backbone, mitigate technical debt, develop\nproficiencies, and resist FOMO distort decisions. By taking a measured approach to\n, executives are already benefiting for the tech advancements:,.",
        "reactions": {
          "likes": "29",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Great insights shared at the 13th CIO Choice Night! Excited to see how these tech leaders drive innovation and create lasting value. #TechnologyLeadership"
      },
      {
        "postId": "urn:li:activity:7290297932250075137",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290297932250075137",
        "url": "https://www.linkedin.com/in/marianna-outsia-48974b9a?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABUchOkBCpQtnZTjT4cnylaX9tuwAm8N1RU",
        "name": "Marianna Outsia\nMarianna Outsia",
        "content": "Talent, intelligence, and luck are not your greatest strengths.\nIt’s resilience.\nResilience is the ability to face adversity head-on, adapt, and\n\nrise stronger.\n\nIt’s what separates those who give up\n\nfrom those who persevere.\n\n\nIt’s the superpower that turns failure into a stepping stone for success.\n\nLet’s be real:\n\nthe path to our goals isn’t smooth.\n\nChallenges, setbacks,\n\nand moments of doubt will test us.\n\nBut resilience is what helps us turn obstacles\n\ninto opportunities and dreams into reality.\n\n\nHere’s how you can develop your resilience:\n\n• Reframe obstacles: Instead of “Why me?” ask, “What’s the lesson here?”\n• Stay grounded in your vision: Your “why” keeps you moving forward.\n• Celebrate every step: Progress, no matter how small, is still progress.\n\nResilience isn’t about avoiding struggles…\n\nit’s about thriving because of them.\n\nWhen was the last time resilience\n\nhelped you push through?\n\nLet’s share and inspire each other.",
        "reactions": {
          "likes": "30",
          "comments": "5 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Success isn’t just about talent or luck—it’s about resilience, adaptability, and the courage to take action! Marianna, your insights are a powerful reminder that we create our own opportunities. What’s one mindset shift that made the biggest impact on your journey?",
            "userName": "Samia Bibi",
            "userProfileURL": "https://www.linkedin.com/in/samia-bibi-526b78203",
            "dataId": "urn:li:comment:(activity:7290222313709461504,7290232201118425088)"
          }
        ],
        "commentAdded": "Absolutely! Resilience truly is the key to turning challenges into growth opportunities. Lets embrace every lesson along our journey! 💪✨"
      },
      {
        "postId": "urn:li:activity:7290020890442924032",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290020890442924032",
        "url": "https://www.linkedin.com/in/dr-amit-shah-phd?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAjXO8cBGEiHZU8rcHiZkZT16ysl11yMAq0",
        "name": "Dr. Amit Shah, PhD\nDr. Amit Shah, PhD",
        "content": "In my view, LLMs will get more accurate with better applications of reinforcement learning, though I think there are diminishing returns to that. However, reliability will always be a fundamental constraint. I like to tease those two apart, because accuracy is task-specific, whereas reliability is about process consistency and maintaining predictable outputs within error tolerances.\n\nDeepSeek made several key innovations:\n\n️ Using their mixture-of-experts architecture to achieve ChatGPT O1-level reasoning performance through an efficient fine-tuning process.\n\n Developing a pure reinforcement learning approach for reasoning capabilities without supervised fine-tuning.\n\n‍‍ Successfully distilling a 600B+ parameter model down to more practical sizes (as small as 1.5B parameters).\n\nThis represents significant progress in efficient model enhancement, though it's important to note that the full development costs, including multiple training runs and data collection, remain substantial. DeepSeek-R1 builds on earlier work while showing how targeted optimization can improve specific capabilities like reasoning tasks.\n\nWhile developing LLMs from scratch remains extremely expensive, this work demonstrates promising directions for enhancing and specializing existing models more efficiently.",
        "reactions": {
          "likes": "3",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "You raise an excellent point about the distinction between accuracy and reliability in AI models. As LLMs become more task-specific, refining reliability through consistent processes will be crucial.\nWhat do you think are the key challenges in balancing accuracy with reliability in AI, especially as models like DeepSeek's push efficiency?",
            "userName": "Ammar Malhi",
            "userProfileURL": "https://www.linkedin.com/in/ammar-malhi-ab617417a",
            "dataId": "urn:li:comment:(activity:7290020890442924032,7290032668392484864)"
          }
        ],
        "commentAdded": "Impressive advancements by DeepSeek! Excited to see how these innovations in reinforcement learning will shape the future of LLMs!"
      },
      {
        "postId": "urn:li:activity:7290215208621379585",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290215208621379585",
        "url": "https://www.linkedin.com/in/markfriedler?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAIS14Bnk-hBd9lEfb-HT0YBRHV4ZTTKM4",
        "name": "Mark Friedler\nMark Friedler",
        "content": "Join us for a 30 min webinar \"How to Boost Your MultiLocation/Franchise Business Profits through the use of smart technology\". \nJoin Jim Mitte CEO Turtlehut and me for an engaging conversation with practical tips and ideas you can apply to your business to boost profits.\nThurs Feb 6, 2pm ET/11am PT Sign up here!",
        "reactions": {
          "likes": "2",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Excited for this insightful webinar! Looking forward to learning practical tech strategies to elevate multi-location business profits. Don’t miss it!"
      },
      {
        "postId": "urn:li:activity:7290050587604267009",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290050587604267009",
        "url": "https://www.linkedin.com/in/rpessar?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAwcjW4BvCJUAK0fWiSBca-E80oRWsQF_oI",
        "name": "Ronen R. Pessar\nRonen R. Pessar",
        "content": "Here's why top cold callers set 25-40% of their convos\n\nThey have the \"X-Factor\" meaning they can...\n\n→ read IOIs\n→ pick up on tonal cues\n→ use situational awareness\n\nThis is what separates elite callers from the average ones.\n\nThe top cold callers have mastered the art of reading IOIs (Indicators of Interest). They know when a prospect is engaged and interested. This skill allows them to steer the conversation in a way that builds trust and rapport.\n\nTonal cues are another critical factor. Elite cold callers can pick up on subtle changes in a prospect's tone. They can sense hesitation, excitement, or doubt. This helps them adapt their approach in real-time, making the conversation feel more natural and less scripted.\n\nSituational awareness is the final piece of the puzzle. Top performers are always aware of the context of the conversation. They understand the prospect's industry, pain points, and potential objections. This allows them to provide relevant solutions and build credibility.\n\nWant to learn more about how to become an elite cold caller?\n\n\nCheck out the full video\n↳",
        "reactions": {
          "likes": "39",
          "comments": "17 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/30647364-5ee2-49d5-afc3-79d777bd5875",
        "comments": [
          {
            "commentText": "Ronen R. Pessar, Totally agree! The \"X-Factor\" sets elite cold callers apart—reading IOIs, tonal cues, and staying aware. It’s all about guiding the conversation, adapting quickly, and building trust. Cold calling is more than dialing, it’s connecting. Ready to crush it?",
            "userName": "Dhrugmesh D.",
            "userProfileURL": "https://www.linkedin.com/in/dhrughmesh-dave-sales-expert",
            "dataId": "urn:li:comment:(ugcPost:7290049972840841219,7290056977370537985)"
          }
        ],
        "commentAdded": "Great insights! Mastering these skills truly makes a difference in connecting with prospects. Excited to learn more from the video!"
      },
      {
        "postId": "urn:li:activity:7290344622743076864",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290344622743076864",
        "url": "https://www.linkedin.com/in/heathermaietta?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAFsIAQBYMwd25N2vlwFo3djmioVA6kSj2U",
        "name": "Dr. Heather Maietta\nDr. Heather Maietta",
        "content": "7 Worst Pieces of Career Advice (and the smarter moves to make):\n\nThanks to. Give her a follow!\n\nPopular career advice is often outdated.\n\nThese old rules are holding you back.\n\n Fake it 'til you make it:\n↳ Be honest about your gaps.\n↳ Seek learning opportunities and project confidence while growing your expertise.\n\n Hard work always pays off:\n↳ Document and communicate your progress.\n↳ Advocate for yourself to ensure your efforts are recognized.\n\n Find a secure job and stick with it:\n↳ Regularly assess job satisfaction and growth opportunities.\n↳ Stay open to roles that match your skills and passions.\n\n Become a manager if you want to grow your career:\n↳ You don't need a title to lead and impact others.\n↳ Assess your strengths and interests, and explore various career paths.\n\n Follow the money, leave passion for hobbies:\n↳ Align financial goals with meaningful work.\n↳ Build your passions into valuable skills.\n\n Keep your head down and do your job:\n↳ Take initiative and make your achievements known.\n↳ Prioritize networking and visibility for career growth.\n\n Never say No to your boss:\n↳ Be transparent about your workload and goals.\n↳ Set boundaries and prioritize tasks.\n\nDon’t let outdated advice hold you back.\n\nThe world deserves to see your sparkle!\n\n️ Repost to help someone\n Followfor daily career advice",
        "reactions": {
          "likes": "82",
          "comments": "65 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Leadership isn’t about titles—it’s about influence, ownership, and impact. When you take initiative, support others, and lead by example, people will naturally see you as a leader.",
            "userName": "Damesha Craig, Leadership Coach and Startup Advisor",
            "userProfileURL": "https://www.linkedin.com/in/dameshacraig",
            "dataId": "urn:li:comment:(ugcPost:7290054874531069952,7290344673649270784)"
          }
        ],
        "commentAdded": "Great insights! Its crucial to adapt and redefine success on our own terms. Lets embrace authenticity and growth in our careers! ✨"
      }
    ],
    "errors": [
      {
        "postId": "urn:li:activity:7290222133241094145",
        "url": "https://www.linkedin.com/in/sonali-malhotra23?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABwfkCUBHzeJEIxfGf2hmbxe6mAFfAZLyq0",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7290089641335001088",
        "url": "https://www.linkedin.com/company/utahvc/posts",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7290348409981419520",
        "url": "https://www.linkedin.com/in/miodrag-o-markovic?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAWyHnEB842NovxmdKytP1VkWHSdhtYXPR8",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7290317766983659520",
        "url": "https://www.linkedin.com/in/dupeburgess?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABvuM0kBMBiyaFKVbDKsiSYEWwwf2knjHBQ",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7290346392538013696",
        "url": "https://www.linkedin.com/company/kpmgindia/posts",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7290297932250075137",
        "url": "https://www.linkedin.com/in/marianna-outsia-48974b9a?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABUchOkBCpQtnZTjT4cnylaX9tuwAm8N1RU",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7290020890442924032",
        "url": "https://www.linkedin.com/in/dr-amit-shah-phd?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAjXO8cBGEiHZU8rcHiZkZT16ysl11yMAq0",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7290215208621379585",
        "url": "https://www.linkedin.com/in/markfriedler?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAIS14Bnk-hBd9lEfb-HT0YBRHV4ZTTKM4",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7290344622743076864",
        "url": "https://www.linkedin.com/in/heathermaietta?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAFsIAQBYMwd25N2vlwFo3djmioVA6kSj2U",
        "errors": [
          "Failed to fetch media URL."
        ]
      }
    ]
  },
  {
    "postsData": [
      {
        "postId": "urn:li:activity:7290026730084319232",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290026730084319232",
        "url": "https://www.linkedin.com/in/dharmrakshit?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAKWj-sB6x80ECGXMwTKy07AJ_bBhYyROds",
        "name": "DHARM RAKSHIT\nDHARM RAKSHIT",
        "content": "A wonderful opportunity for all fellow HR Professionsls of NCR region to participate in this mega conclave and get enlighten by the insights of thought leaders Prem Singh@",
        "reactions": {
          "likes": "37",
          "comments": "10 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "https://docs.google.com/forms/d/e/1FAIpQLSdUa04o7LzfSMKpxGIPThuLjxuzT9vevAhs2VUotp4EnGttmw/viewform",
            "userName": "Prachi G.",
            "userProfileURL": "https://www.linkedin.com/in/prachi-g-16640035",
            "dataId": "urn:li:comment:(activity:7290026730084319232,7290047731706802177)"
          },
          {
            "commentText": "Prachi G. pls use this link for registration",
            "userName": "DHARM RAKSHIT",
            "userProfileURL": "https://www.linkedin.com/in/dharmrakshit",
            "dataId": "urn:li:comment:(activity:7290026730084319232,7290259667295866881)"
          },
          {
            "commentText": "Must attend",
            "userName": "Tusharika Singh",
            "userProfileURL": "https://www.linkedin.com/in/tusharika-singh1616",
            "dataId": "urn:li:comment:(activity:7290026730084319232,7290040388109615105)"
          }
        ],
        "commentAdded": "Looks like a fantastic opportunity to network and gain valuable insights! Cant wait to see the discussions unfold. 🌟 #HRExcellence"
      },
      {
        "postId": "urn:li:activity:7290100509309353984",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290100509309353984",
        "url": "https://www.linkedin.com/in/lmacvittie?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAy8E0BPFfMw7MRTpGDUlojYK0uvWk5Q0A",
        "name": "Lori MacVittie\nLori MacVittie",
        "content": "Buckle up, kids, cause 2025 is going to be crazy. And not just because of \nhashtag\n#AI. Remember, AI may be the new shiny, but there are still plenty of toys that need attention. Like \nhashtag\nand\n.\n\nSo jump on in to this month's recap of interesting research I found just laying around the Internet.",
        "reactions": {
          "likes": "32",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "I like them APis.",
            "userName": "Kin Lane",
            "userProfileURL": "https://www.linkedin.com/in/kinlane",
            "dataId": "urn:li:comment:(ugcPost:7289735794330607616,7290061877106098176)"
          }
        ],
        "commentAdded": "Exciting times ahead! 🌟 Cant wait to see how AI and other emerging trends shape our future. Looking forward to your research insights!"
      },
      {
        "postId": "urn:li:activity:7290081420398448640",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290081420398448640",
        "url": "https://www.linkedin.com/in/ayush-kaushal-1a147b228?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADkFskkBfudZl9ImS2SRfPxkexpaVyZf2ks",
        "name": "Ayush Kaushal\nAyush Kaushal",
        "content": "GEEKS FOR GEEKS 160 DAYS CODING CHALLENGE\n\nDAY 62: LONGEST SUBARRAY WITH SUM K",
        "reactions": {
          "likes": "2",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Great challenge! Tackling the longest subarray problem is a fantastic way to enhance coding skills. Keep up the great work, everyone! 💻🚀"
      },
      {
        "postId": "urn:li:activity:7290346483843776512",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290346483843776512",
        "url": "https://www.linkedin.com/in/kaye-chew-a70996228?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADkZM3QB4RHxsFZSojvyYHzHdaSbbEWQIMo",
        "name": "Kaye Chew\nKaye Chew",
        "content": "Onboarding a virtual assistant is where most business owners mess up.\n\nThey think hiring is the hard part.\n\nIt’s not.\n\nThe hard part is teaching someone how to run your business like you do.\n\nHere’s how to onboard a virtual assistant like a pro:\n\n1. Document everything.\n→ Write down your repeatable tasks.\n→ Explain them step-by-step, as if you’re teaching a 10-year-old.\n→ Be as specific as possible.\n\n2. Use video.\n→ Show them how to do tasks with screen recordings.\n→ Tools like Loom are your best friend.\n→ Seeing is learning.\n\n3. Start with small wins.\n→ Give them one simple task at a time.\n→ Set them up for success early.\n→ This builds their confidence and your trust in them.\n\n4. Schedule check-ins.\n→ Weekly reviews keep everyone aligned.\n→ They need feedback, and you need to know they’re on track.\n\nOnboarding isn’t just about handing over tasks.\n\nIt’s about creating a partnership.\n\nInvest time upfront, and you’ll get 10x the ROI later.\n\nHow you onboard today determines your assistant's success tomorrow.",
        "reactions": {
          "likes": "8",
          "comments": "8 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "This is a solid framework for onboarding a virtual assistant effectively. Many business owners assume hiring is the biggest challenge, but without a structured onboarding process, even the best assistants can struggle. ",
            "userName": "Nerea Arregui Exposito",
            "userProfileURL": "https://www.linkedin.com/in/nereaarreguiqa",
            "dataId": "urn:li:comment:(activity:7289975622779445248,7290346691289833473)"
          },
          {
            "commentText": "Nerea Arregui Exposito Spot on! Thanks for sharing you insights. I'm happy you can relate and you liked the framework. ",
            "userName": "Kaye Chew",
            "userProfileURL": "https://www.linkedin.com/in/kaye-chew-a70996228",
            "dataId": "urn:li:comment:(activity:7289975622779445248,7290349521719439360)"
          },
          {
            "commentText": "Onboarding isn’t just about delegating—it’s about setting up a foundation for success. Documenting processes and using tools like Loom are game-changers for clear communication. Starting small and building trust over time is something I’ve found critical when bringing someone new onto a team.\n\nInvesting that time upfront really does pay off, not just in results but in creating a true partnership.\n\nThanks for sharing these actionable steps!\"",
            "userName": "Juan Emilio Guzman",
            "userProfileURL": "https://www.linkedin.com/in/juan-e-guzman",
            "dataId": "urn:li:comment:(activity:7289975622779445248,7289978661619838976)"
          },
          {
            "commentText": "Juan Emilio Guzman That's true! Thanks for sharing your insights!",
            "userName": "Kaye Chew",
            "userProfileURL": "https://www.linkedin.com/in/kaye-chew-a70996228",
            "dataId": "urn:li:comment:(activity:7289975622779445248,7289989592655532032)"
          }
        ],
        "commentAdded": "Great insights! Proper onboarding truly sets the foundation for success. Investing time now pays dividends later. Thanks for sharing! 🚀"
      },
      {
        "postId": "urn:li:activity:7290220669768765440",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290220669768765440",
        "url": "https://www.linkedin.com/in/argha-das-366739199?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAC6Plb4B3HXzmMwmoDO-wQiD4o4cfBQwHY4",
        "name": "Argha Das\nArgha Das",
        "content": "I’m happy to share that I’m starting a new position as Consultant at Deloitte!",
        "reactions": {
          "likes": "481",
          "comments": "86 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Happy for you  many congratulations ",
            "userName": "Sudipta Chakrabarty",
            "userProfileURL": "https://www.linkedin.com/in/sudipta-chakrabarty-a79249188",
            "dataId": "urn:li:comment:(ugcPost:7290220669026385920,7290234496556113920)"
          },
          {
            "commentText": "Thanks Sudipta!",
            "userName": "Argha Das",
            "userProfileURL": "https://www.linkedin.com/in/argha-das-366739199",
            "dataId": "urn:li:comment:(ugcPost:7290220669026385920,7290237620817666048)"
          },
          {
            "commentText": "Many congratulations Argha! All the very best! ",
            "userName": "Avinash Ahuja",
            "userProfileURL": "https://www.linkedin.com/in/avinashahuja25",
            "dataId": "urn:li:comment:(ugcPost:7290220669026385920,7290320747795812353)"
          },
          {
            "commentText": "Thanks Avinash!",
            "userName": "Argha Das",
            "userProfileURL": "https://www.linkedin.com/in/argha-das-366739199",
            "dataId": "urn:li:comment:(ugcPost:7290220669026385920,7290347795599790081)"
          }
        ],
        "commentAdded": "Congratulations on your new role! Excited to see the great contributions youll make at Deloitte. Wishing you all the best on this journey!"
      },
      {
        "postId": "urn:li:activity:7290190011684044801",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290190011684044801",
        "url": "https://www.linkedin.com/in/angelagillnelms?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAkdZI0BRIXsVQk88XGJqfr-PLk6wp0ZhLo",
        "name": "Angela Gill Nelms\nAngela Gill Nelms",
        "content": "If you want to learn about firing toxic clients, fostering company culture, and promoting workplace inclusion, listen to this conversation with Anne Chow (She/Her), the former CEO of AT&T Business and author of Lead Bigger.\n\nThe full episode drops tomorrow!!",
        "reactions": {
          "likes": "4",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/6c8888fd-d553-4b73-a9e5-7cedea3910fc",
        "comments": [],
        "commentAdded": "Excited for this conversation! Anne Chows insights on fostering culture and inclusion are invaluable for any leader. Cant wait to listen!"
      },
      {
        "postId": "urn:li:activity:7290270564751941632",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290270564751941632",
        "url": "https://www.linkedin.com/in/mayank-gupta-writes?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAE42bMoBhcBHinhc3NXl3_YIiMp6kCMmHAU",
        "name": "Mayank Gupta\nMayank Gupta",
        "content": "Now, even ChatGPT is learning AI tools to keep up with \nhashtag\n#deepseek. ",
        "reactions": {
          "likes": "4",
          "comments": "5 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Mayank Gupta I hope it doesn't kill any further jobs. ",
            "userName": "Sourish Bujarbaruah 📌",
            "userProfileURL": "https://www.linkedin.com/in/sourish-bujarbaruah-%F0%9F%93%8C-358151292",
            "dataId": "urn:li:comment:(activity:7290269623801802753,7290270551116333057)"
          },
          {
            "commentText": "Sourish Bujarbaruah  mere according... creative jobs ko koi dikkat nhi hogi. Ai will only replace mundane jobs",
            "userName": "Mayank Gupta",
            "userProfileURL": "https://www.linkedin.com/in/mayank-gupta-writes",
            "dataId": "urn:li:comment:(activity:7290269623801802753,7290271542855278592)"
          },
          {
            "commentText": "Mayank Gupta true. It's just a wave. Mundane jobs are definitely in threat.",
            "userName": "Sourish Bujarbaruah 📌",
            "userProfileURL": "https://www.linkedin.com/in/sourish-bujarbaruah-%F0%9F%93%8C-358151292",
            "dataId": "urn:li:comment:(activity:7290269623801802753,7290271988042940417)"
          }
        ],
        "commentAdded": "Exciting to see AI tools evolving! Collaboration between platforms like #ChatGPT and #deepseek will drive innovation forward."
      },
      {
        "postId": "urn:li:activity:7290345452770582530",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290345452770582530",
        "url": "https://www.linkedin.com/in/mkoesterer?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAJ9iiAB5bh6NL9kMz59hr5JCHi31nuQIM8",
        "name": "Mark R. Koesterer\nMark R. Koesterer",
        "content": "Day 29 The Rocky Steps Challenge, Unlocking Influence\n\nMy Letter to Major League Baseball (MLB) (A True Story)\n\nToday's case study features a driven Sports Management student eager to land a summer internship at MLB.\n\nThe challenge? He lacked direct connections within the league.\nWe discussed the power of:\n️ Building a Strong Profile: Crafting a professional profile that showcases his skills, experiences, and passion for the sports industry.\n️ Establishing a Professional Brand: Demonstrating his knowledge, expertise, and unique value proposition.\n️ Leveraging the Power of Connections: Identifying and connecting with professionals at MLB, leveraging his existing network, and strategically expanding his reach.\n\nThe key takeaway? Don't wait until the last minute! Start building your professional network now.\n\nListen HERE:\n\n, Beyond the Playbook: Empowering the Whole You",
        "reactions": {
          "likes": "2",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Love this insight! Building connections early is essential in sports management. Let’s empower each other to seize these opportunities! 🌟 #Networking"
      },
      {
        "postId": "urn:li:activity:7290341349751504896",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290341349751504896",
        "url": "https://www.linkedin.com/in/vanessabraun?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAA455rsB7q9QakMaPL-130ZNrod7v9W9B2M",
        "name": "Vanessa Braun\nVanessa Braun",
        "content": "Tired of feeling ignored when you speak? Here’s 12 tips to make sure your message is heard loud and clear!\n\nCommunication isn’t just about words.\n\nIt’s about how we make others feel.\n\nPeople need to feel understood,\nvalued, and heard.\n\nYes, it’s not always easy.\n\nSometimes…\nYou feel like you’re speaking, but no one engages.\nYour message gets lost in the noise.\nYour intentions are misinterpreted, and frustration builds.\n\nOne powerful tip to improve your communication is\nEngage with your audience.\n\nHᴇʀᴇ ᴀʀᴇ 12 Tɪᴘꜱ ᴛᴏ Bᴏᴏꜱᴛ Yᴏᴜʀ Cᴏᴍᴍᴜɴɪᴄᴀᴛɪᴏɴ Sᴋɪʟʟꜱ:\n\n𝟭. 𝗟𝗶𝘀𝘁𝗲𝗻 𝗔𝗰𝘁𝗶𝘃𝗲𝗹𝘆\nPay full attention to the speaker.\nDon’t interrupt.\nParaphrase to confirm understanding.\n\nExample:\n“Just to make sure I understand, you're saying...”\n\nThis shows you value their perspective.\n\n𝟮. 𝗕𝗲 𝗖𝗹𝗲𝗮𝗿\nCommunicate simply and directly.\nAvoid jargon.\nKeep your sentences short and straightforward.\n\n𝟯. 𝗦𝗵𝗼𝘄 𝗘𝗺𝗽𝗮𝘁𝗵𝘆:\nRecognize and validate emotions.\nAcknowledge feelings and\navoid brushing them off.\nIt creates trust.\n\n𝟰. 𝗚𝗶𝘃𝗲 & 𝗧𝗮𝗸𝗲 𝗙𝗲𝗲𝗱𝗯𝗮𝗰𝗸:\nShare constructive feedback\nand ask for it.\nAppreciate the input\nand make improvements.\n\n𝟱. 𝗕𝗲 𝗛𝗼𝗻𝗲𝘀𝘁:\nTransparency matters.\nBe truthful and clear,\neven when it’s difficult.\nIt builds credibility.\n\n𝟲. 𝗧𝗲𝗹𝗹 𝗦𝘁𝗼𝗿𝗶𝗲𝘀:\nUse real-life examples\nto connect with others.\nPeople remember stories far\nbetter than facts alone.\n\n𝟳. 𝗨𝘀𝗲 𝗕𝗼𝗱𝘆 𝗟𝗮𝗻𝗴𝘂𝗮𝗴𝗲:\nMake eye contact,\nsmile, and maintain an open posture.\nNon-verbal signals\nstrengthen your message.\n\n𝟴. 𝗧𝗶𝗺𝗲 𝗬𝗼𝘂𝗿 𝗠𝗲𝘀𝘀𝗮𝗴𝗲:\nDeliver your message at the right moment.\nChoose calm, focused times\nfor important conversations.\n\n𝟵. 𝗖𝗿𝗲𝗮𝘁𝗲 𝗢𝗽𝗲𝗻 𝗗𝗶𝗮𝗹𝗼𝗴𝘂𝗲:\nEncourage two-way communication.\nAsk open-ended questions\n\nSuch as:\n\"What are your thoughts on this?\"\n\"How do you feel about this idea?\"\n\"What would you suggest as a solution?\"\nand invite participation from everyone.\n\n𝟭𝟬. 𝗔𝗱𝗮𝗽𝘁 𝘁𝗼 𝗬𝗼𝘂𝗿 𝗔𝘂𝗱𝗶𝗲𝗻𝗰𝗲:\nChange your communication style\nbased on the person or group you’re talking to.\n\nIn a meeting: Focus on clear, actionable steps.\nOne-on-one: Speak casually and show empathy.\nTo leaders: Share big ideas with data support.\n\nMake sure your message resonates.\n\n𝟭𝟭. 𝗔𝘀𝗸 𝗤𝘂𝗲𝘀𝘁𝗶𝗼𝗻𝘀:\nEngage others by asking insightful questions.\n\n\"What do you think?\"\n\"How can we improve?\"\n\"Any suggestions?\"\n\nThis shows you care about their input\nand sparks new ideas.\n\n𝟭𝟮. 𝗟𝗲𝗮𝗱 𝗯𝘆 𝗘𝘅𝗮𝗺𝗽𝗹𝗲:\nPractice what you preach.\n\nBe a role model for the behaviors\nand values you want to see in others.\n\n\n𝙒𝙝𝙞𝙘𝙝 𝙤𝙛 𝙩𝙝𝙚𝙨𝙚 𝙘𝙤𝙢𝙢𝙪𝙣𝙞𝙘𝙖𝙩𝙞𝙤𝙣 𝙨𝙩𝙚𝙥𝙨 𝙙𝙤 𝙮𝙤𝙪 𝙨𝙩𝙧𝙪𝙜𝙜𝙡𝙚 𝙬𝙞𝙩𝙝 𝙩𝙝𝙚 𝙢𝙤𝙨𝙩?\n\n\n\n—————————\nRepost if this resonated . Thanks!\nFollow meand tap the () on my profile!\nI write daily about personal development.",
        "reactions": {
          "likes": "22",
          "comments": "16 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Great list Vanessa Braun! Active listening and adapting to your audience make a huge difference. Leading by example is my favorite tip!",
            "userName": "Damesha Craig, Leadership Coach and Startup Advisor",
            "userProfileURL": "https://www.linkedin.com/in/dameshacraig",
            "dataId": "urn:li:comment:(ugcPost:7290331790144090112,7290341330885525505)"
          },
          {
            "commentText": "Damesha Craig, Leadership Coach and Startup Advisor Thanks! Leading by example is a powerful one—it sets the tone for meaningful communication. Glad you connected with the list! :)",
            "userName": "Vanessa Braun",
            "userProfileURL": "https://www.linkedin.com/in/vanessabraun",
            "dataId": "urn:li:comment:(ugcPost:7290331790144090112,7290343760117276672)"
          }
        ],
        "commentAdded": "Great tips! Engaging your audience is key. Listening actively can transform conversations. Which tip resonates most with you? #CommunicationSkills"
      },
      {
        "postId": "urn:li:activity:7290247162469265408",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290247162469265408",
        "url": "https://www.linkedin.com/in/devraj-gorai-506024274?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAELsP9YB_ZYq0FN9pl3ItwtamKy7HFig7Ng",
        "name": "Devraj Gorai\nDevraj Gorai",
        "content": "️ The Indian Startup Fund Cycle \n\nNavigating the Fund Cycle: A Deep Dive into the Journey of an Indian Startup \n\n⭐The journey of an Indian startup is a dynamic one, marked by distinct phases of growth and funding.\n\n1. Ideation & Seed Stage: It begins with a spark of innovation, followed by meticulous business planning and the crucial search for seed funding from angels, VCs, or even personal networks. This phase focuses on validating the idea, developing a Minimum Viable Product (MVP), and building a strong foundation.\n2. Scaling Up with Series A: As traction grows, companies seek Series A funding to accelerate growth, expand operations, and build a robust team. This stage is pivotal for scaling and establishing a strong market presence.\n3. Growth & Expansion: Subsequent funding rounds (Series B, C, and beyond) fuel aggressive expansion, market penetration, and product diversification. This phase demands strategic decision-making, navigating competition, and adapting to the evolving market landscape.\n4. Exit Strategies: The ultimate goal for many startups is a successful exit, whether through an IPO, acquisition by a larger company, or a buyback by founders.\n\n️ Key Challenges for Indian Startups:\n\n1. Navigating the Regulatory Landscape: India's diverse regulatory environment presents unique challenges for startups.\n2. Talent Acquisition: Accessing and retaining top talent remains a critical hurdle.\n3. Infrastructure & Logistics: While improving, India's infrastructure still presents challenges in areas like logistics and supply chain management.\n4. Intense Competition: The Indian market is highly competitive, demanding continuous innovation and adaptability.\n\nThe fund cycle and its inherent challenges is crucial for the success of any Indian startup. By carefully planning, adapting to the evolving market, and building a strong foundation, Indian companies can navigate the complexities of this journey and achieve sustainable growth. Share your insights below \n\nFound this valuable?\n️ Repost to your network\n Follow Devraj Gorai for more insights\n\nWant to level up your Carrier Game Changer In Your Life? \nVisit Our Website",
        "reactions": {
          "likes": "21",
          "comments": "10 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Securing funding is just one part of the startup journey,navigating regulatory challenges, hiring the right talent, and staying competitive are equally critical. Indian startups that balance financial strategy with adaptability and strong execution stand a better chance of long-term success.",
            "userName": "Nerea Arregui Exposito",
            "userProfileURL": "https://www.linkedin.com/in/nereaarreguiqa",
            "dataId": "urn:li:comment:(activity:7290215619956772865,7290247180601241600)"
          }
        ],
        "commentAdded": "Great breakdown of the Indian startup journey! 🌟 Understanding the fund cycle is crucial for navigating the challenges ahead. Excited to see future innovations!"
      }
    ],
    "errors": [
      {
        "postId": "urn:li:activity:7290026730084319232",
        "url": "https://www.linkedin.com/in/dharmrakshit?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAKWj-sB6x80ECGXMwTKy07AJ_bBhYyROds",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7290100509309353984",
        "url": "https://www.linkedin.com/in/lmacvittie?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAy8E0BPFfMw7MRTpGDUlojYK0uvWk5Q0A",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7290081420398448640",
        "url": "https://www.linkedin.com/in/ayush-kaushal-1a147b228?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADkFskkBfudZl9ImS2SRfPxkexpaVyZf2ks",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7290346483843776512",
        "url": "https://www.linkedin.com/in/kaye-chew-a70996228?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADkZM3QB4RHxsFZSojvyYHzHdaSbbEWQIMo",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7290220669768765440",
        "url": "https://www.linkedin.com/in/argha-das-366739199?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAC6Plb4B3HXzmMwmoDO-wQiD4o4cfBQwHY4",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7290270564751941632",
        "url": "https://www.linkedin.com/in/mayank-gupta-writes?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAE42bMoBhcBHinhc3NXl3_YIiMp6kCMmHAU",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7290345452770582530",
        "url": "https://www.linkedin.com/in/mkoesterer?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAJ9iiAB5bh6NL9kMz59hr5JCHi31nuQIM8",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7290341349751504896",
        "url": "https://www.linkedin.com/in/vanessabraun?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAA455rsB7q9QakMaPL-130ZNrod7v9W9B2M",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7290247162469265408",
        "url": "https://www.linkedin.com/in/devraj-gorai-506024274?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAELsP9YB_ZYq0FN9pl3ItwtamKy7HFig7Ng",
        "errors": [
          "Failed to fetch media URL."
        ]
      }
    ]
  },
  {
    "postsData": [
      {
        "postId": "urn:li:activity:7290187572029353984",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290187572029353984",
        "url": "https://www.linkedin.com/in/ruby-raley?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAALikcBJAxS7H2_7F8vu7nVZ3W9lLNA-aM",
        "name": "Ruby Raley\nRuby Raley",
        "content": "Looking for a citizen developer. Self-service is here.\n\nWith the rise of automation and AI agents, revolutionary new approaches are emerging. Development speed is accelerating and the technical knowledge needed to implement is minimized. What is the new most wanted skill? Someone with deep knowledge of the process and an affinity for technology.\n\nWe are on the cusp of a revolution in how software is rolled out. Yes, I know and agree that tools will be built by senior engineers but tool-users will be business-oriented technical analysts or technical-oriented business analysts.\n\nWith this approach, we will slash process time and reduce the cost to serve. For logistics, this means connect faster, onboard faster and meet customer demands for connectivity with ease. No need for operations to rekey, call and email to get data into the TMS. No waiting on technology team to provision and configure.\n\nBy the way, 1Logtech is a great organization. Check out the post if you are interested in the future of logistics integration and check out the job description if you know TMS and you are tech savvy.",
        "reactions": {
          "likes": "4",
          "comments": "4 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "That was pretty quick. ",
            "userName": "Edward Burke",
            "userProfileURL": "https://www.linkedin.com/in/edward-burke3",
            "dataId": "urn:li:comment:(activity:7286060965039620096,7286137827027791872)"
          },
          {
            "commentText": "Edward Burke sorry about that. Stay in touch 1LT is growing",
            "userName": "Ruby Raley",
            "userProfileURL": "https://www.linkedin.com/in/ruby-raley",
            "dataId": "urn:li:comment:(activity:7286060965039620096,7286154068190724096)"
          },
          {
            "commentText": "Hiii",
            "userName": "Md Anowar Reja",
            "userProfileURL": "https://www.linkedin.com/in/md-anowar-reja-07b8a0347",
            "dataId": "urn:li:comment:(activity:7286060965039620096,7286097929465974784)"
          }
        ],
        "commentAdded": "Exciting times ahead! Embracing citizen developers is key to transforming logistics. Lets innovate and streamline processes together! 🚀"
      },
      {
        "postId": "urn:li:activity:7290157790973571073",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290157790973571073",
        "url": "https://www.linkedin.com/in/ahonamazumder?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABaJYLABaHBQ8HKYmLxJNi-99xsakiLDdgs",
        "name": "Ahona Mazumder (she/her)\nAhona Mazumder (she/her)",
        "content": "OOO: Living a dream!\n\nNow that I'm back to reality, I wanted to share a cool experience I had last weekend. Lightning struck twice and I had the incredible opportunity to sing my favorite Brandi Carlile song with the writers themselves: Brandi Carlile, Tim, and Phil!\n\nI truly don't remember the last time I felt such pure joy! I've been reflecting on this experience and what it means as I re-enter exhausting reality. All that comes to mind is gratitude. I'm re-energized and inspired to be creative inside and outside of work. The reason we had so much fun up on the stage is because it was joy & love given and received - there's no feeling like it. I learned a few lessons from everyone I encountered that day, that I wanted to share; apart from improving my public speaking skills by singing to over 2000 folks...\n\nBrandi, Tim, and Phil (and most touring musicians) make working so hard look so easy. The greatest lesson they teach me is in how they share endlessly. It's a good reminder for me. Sharing your thoughts, your skills, your joy, your time, and then seeing the beautiful community you create when you do is an amazing thing. I often have a hard time speaking up or sharing my creativity in or outside of work, I want to keep remembering to share.\n\nTheir crew is a champion of the people. They're excellent listeners, quick on their feet, and the way they can put any performer at ease teaches me that anyone can comfort a stranger and help others succeed. These guys are traveling and working some tough hours and still manage to be the nicest people and want to see you succeed. Supporting your \"performers\" starts with listening, anticipating, and adjusting.\n\nEveryone who supported us from that stage (and back home) made the whole experience. There's truly no feeling or no place else like GJWW with the amount of love and belonging radiating from everyone, I smiled at every stranger I encountered. It teaches me that all you gotta do is ask to connect. Most people want to share about themselves and love learning something about you.\n\nI'm just so positively overwhelmed; If this is a community that can rise together and hold each other, how do I take that feeling with me into everyday? It'll take conscious effort but it's not hard to be kind, to take a moment to remember what's important, protect your neighbors and coworkers, to share your joy, and hope it brings others along.\n\nAnyway, the most important lesson I learned is to put yourself out there. You never know what may come of it...like meeting your heroes.",
        "reactions": {
          "likes": "72",
          "comments": "11 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "I love this!!! You go girl! Live your best life!!!",
            "userName": "Latoya R. Conners Gray",
            "userProfileURL": "https://www.linkedin.com/in/latoyarconnersgray",
            "dataId": "urn:li:comment:(ugcPost:7290131133634097152,7290175460515164160)"
          },
          {
            "commentText": "Latoya R. Conners Gray Thank you, Latoya!! I hope all is well with you!",
            "userName": "Ahona Mazumder (she/her)",
            "userProfileURL": "https://www.linkedin.com/in/ahonamazumder",
            "dataId": "urn:li:comment:(ugcPost:7290131133634097152,7290175787570237440)"
          },
          {
            "commentText": "Fantastic!! What’d you sing?",
            "userName": "Annice Tatken",
            "userProfileURL": "https://www.linkedin.com/in/annice-tatken",
            "dataId": "urn:li:comment:(ugcPost:7290131133634097152,7290168303971352576)"
          },
          {
            "commentText": "Annice Tatken You and Me on the Rock ️ it's \"our song\"!",
            "userName": "Ahona Mazumder (she/her)",
            "userProfileURL": "https://www.linkedin.com/in/ahonamazumder",
            "dataId": "urn:li:comment:(ugcPost:7290131133634097152,7290171309517377537)"
          }
        ],
        "commentAdded": "What an inspiring experience! Your reflections on joy, connection, and sharing are a powerful reminder to embrace creativity in all we do. 🎤✨"
      },
      {
        "postId": "urn:li:activity:7288912498345279489",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7288912498345279489",
        "url": "https://www.linkedin.com/in/scottvcaputo?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACpwVDwBL1LIjex8pAwjHoggTDocwlGOtzA",
        "name": "Scott Caputo\nScott Caputo",
        "content": "Stop trying to hire the smartest person.\n\nHire people with these 7 traits instead:⁣\n⁣\n1. Execution Intelligence⁣\n↳ Finishes what they start, no matter what⁣\n↳ Known for rapid, high-quality delivery⁣\n↳ Makes complex promises simple realities⁣\n⁣\n2. Reality Perception⁣\n↳ Sees situations as they are, not as wished⁣\n↳ Accurately gauges their capabilities⁣\n↳ Never oversells or overpromises⁣\n⁣\n3. People Intelligence⁣\n↳ Reads rooms instinctively⁣\n↳ Adapts communication to any audience⁣\n↳ Builds trust through understanding, not authority⁣\n⁣\n4. Strategic Simplification⁣\n↳ Makes the complex feel obvious⁣\n↳ Explains difficult concepts effortlessly⁣\n↳ Reduces everything to its core elements⁣\n⁣\n5. Emotional Command⁣\n↳ Uses pressure as fuel, not friction⁣\n↳ Maintains composure in chaos⁣\n↳ Channels stress into solutions⁣\n⁣\n6. Productive Discomfort⁣\n↳ Seeks out difficult conversations⁣\n↳ Challenges status quo constructively⁣\n↳ Takes calculated risks others avoid⁣\n⁣\n7. Time Mastery⁣\n↳ Protects peak hours religiously⁣\n↳ Creates more time than others consume⁣\n↳ Delivers before deadlines consistently⁣\n⁣\nThese traits are habits, not gifts.⁣\nThey can be developed through deliberate practice.⁣\n⁣\nWhat is the most important trait to you?⁣\nLet me know below! ⁣\n⁣\n️ Followand reshare to help others.⁣\n Save this post for future reference!⁣⁣⁣⁣",
        "reactions": {
          "likes": "1,091",
          "comments": "161 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Scott Caputo Very interesting. Thank you for sharing",
            "userName": "Woodley B. Preucil, CFA",
            "userProfileURL": "https://www.linkedin.com/in/woodley-b-preucil-cfa-5926b010",
            "dataId": "urn:li:comment:(ugcPost:7288708521137733632,7289002816939913216)"
          },
          {
            "commentText": "Smart hires execute, adapt, and simplify under pressure. Skills can be taught, but traits like execution and emotional command drive real results.",
            "userName": "Cassie Lincoln",
            "userProfileURL": "https://www.linkedin.com/in/cassielincolnalm",
            "dataId": "urn:li:comment:(ugcPost:7288708521137733632,7288958193253130240)"
          }
        ],
        "commentAdded": "Great insights! I believe Execution Intelligence stands out as the most crucial trait—turning ideas into impactful results is key! Whats your take?"
      },
      {
        "postId": "urn:li:activity:7290309484650860547",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290309484650860547",
        "url": "https://www.linkedin.com/in/siddhantgarg19?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACs6qaMBmozd1DRMDTQAedYIFAy6qBi1nhg",
        "name": "Siddhant Garg\nSiddhant Garg",
        "content": "Here are 12 Gmail hacks that you shouldn't miss:\n\nGmail boasts 5.4 billion active users globally, yet only a fraction harness its full potential. Unveil these Google\n\n12 Gmail hacks for enhanced productivity:\n\n Get rid of promotional emails:\n\n→ Type 'unsubscribe' in the search bar.\n→ Select all labeled emails.\n→ Hit delete to clear them effortlessly.\n\n Undo sent emails:\n\n→ Access Settings>General.\n→ Enable 'Undo Send' with a 30-second window.\n\n\n\n Send confidential emails:\n\n→ Disable copying, printing, and forwarding by clicking the padlock symbol.\n\n Check Gmail offline:\n\n→ Log in, access settings, and choose 'Offline' for uninterrupted access.\n\n Utilize Keyboard Shortcuts:\n\nShift + I: Mark as read.\n\nCmd/Ctrl + Enter: Send.\n\nCmd/Ctrl + K: Insert link.\n\nC: Compose.\n\n/: Search.\n\nD: Draft in a new tab.\n\n Schedule emails:\n\n→ Opt for ‘Schedule send’ to send emails at specific times seamlessly.\n\n Organize with Labels:\n\n→ Create custom labels like 'Work', 'Personal', or 'Travel' for efficient email sorting.\n\n Templates creation:\n\n→ Save drafts as templates for swift email composition.\n\n Mute Conversations:\n\n→ Reduce overload by muting less crucial email threads.\n\n Archive, don’t delete:\n\n→ Safeguard important emails by archiving them for future reference.\n\n\n This is Useful hashtag\n\nyour network to help valuable things\n\nFollowmore valuable stuff\n\n ATS Resume and remote job, QA , Development material ",
        "reactions": {
          "likes": "364",
          "comments": "72 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": " Get rid of promotional emails:\n\n→ Type 'unsubscribe' in the search bar.\n→ Select all labeled emails.\n→ Hit delete to clear them effortlessly.",
            "userName": "Siddhant Garg",
            "userProfileURL": "https://www.linkedin.com/in/siddhantgarg19",
            "dataId": "urn:li:comment:(ugcPost:7290300054215540736,7290300166144700416)"
          },
          {
            "commentText": "Gmail boasts 5.4 billion active users globally, yet only a fraction harness its full potential. Unveil these Google ",
            "userName": "Siddhant Garg",
            "userProfileURL": "https://www.linkedin.com/in/siddhantgarg19",
            "dataId": "urn:li:comment:(ugcPost:7290300054215540736,7290300100210241536)"
          }
        ],
        "commentAdded": "These Gmail hacks are game changers! 📨 Its amazing how a few simple tweaks can enhance productivity significantly. Thanks for sharing! #ProductivityTips"
      },
      {
        "postId": "urn:li:activity:7290132644552454144",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290132644552454144",
        "url": "https://www.linkedin.com/in/rickconlowservantleadership?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAPUxFwB6p1p6ESvdwgOkdRMuNdW3KDrJTU",
        "name": "Richard A. Conlow\nRichard A. Conlow",
        "content": "ARE YOU COMMITTED TO DOING BETTER THAN THIS? https://buff.ly/42ro59J \nhashtag\n#leadership \nhashtag\n#management \nhashtag\n#servantleadership \nhashtag",
        "reactions": {
          "likes": "0",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Absolutely, commitment to continuous improvement is key! Let’s strive for excellence in leadership and management. #Leadership #ServantLeadership"
      },
      {
        "postId": "urn:li:activity:7290337930252861440",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290337930252861440",
        "url": "https://www.linkedin.com/in/chrisake?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAiQkwABGjALtgmgoBr2MaImCGYlGgj06Fw",
        "name": "Chris Ake\nChris Ake",
        "content": "A big failure I've noticed in management from a small business owner is the following; (myself being very guilty). Also, I'll share ideas how I fixed some of this. \n\nScenario: Someone is working for you in whatever role. You (Chris / I ) get ideas. I send those in Text, Email, Slack, etc.. and don't provide context. In my mind, it's a \"hey, this is an idea we should do sometime, just documenting.\" BUT, usually how people read it is \"Shit... do I do this now? Later? I feel pressure.\"\n\nSometimes that pressure builds up and causes issues without me even knowing, however it was my fault.\n\nWhat I have started doing is reviewing priority lists weekly. I also will document my ideas and go over them at an appropriate time. ALSO, I added in a Tiered system of communications like \"R1 = Request lowest level, not urgent\" \"R2 = Request, somewhat urgent, client or customer.\" and \"R3 = URGENT, client and customer\". Possibly R4, doomsday situation.\n\nIt's not a perfect system. I'm no master. I am learning and these little things have helped improve workflows with others a lot.\n\nHow have you worked on your management or commutation skills?",
        "reactions": {
          "likes": "3",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "We started doing a weekly team member check in sheet via Forms at the end of each week, it's good for feed back and having team members prioritizing and clarifying what they need for the upcoming week. Also we have a weekly 121 meeting each week. We have a running agenda that both of us can add to throughout the week then review on Monday mornings. Cuts down on additional emails and other conversations throughout the week that disrupt day to day work flow",
            "userName": "Gregory Hardy, CERTIFIED FINANCIAL PLANNER™, ACCREDITED ESTATE PLANNER®",
            "userProfileURL": "https://www.linkedin.com/in/gregory-hardy-certified-financial-planner%E2%84%A2-accredited-estate-planner%C2%AE-04237bb",
            "dataId": "urn:li:comment:(activity:7290337930252861440,7290354300071907329)"
          }
        ],
        "commentAdded": "Great insights, Chris! Clarity in communication is key. Love the tiered system—definitely a game changer for team workflows!"
      },
      {
        "postId": "urn:li:activity:7290015242481278976",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290015242481278976",
        "url": "https://www.linkedin.com/in/egiguere?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAOPFcB_4ORr0IKauLZuAbFaZTrGR2GYic",
        "name": "Eric Giguere\nEric Giguere",
        "content": "𝗧𝗵𝗲 𝗣𝗮𝘁𝗵 𝘁𝗼 𝗖𝗹𝗮𝗿𝗶𝘁𝘆: 𝗟𝗲𝘀𝘀𝗼𝗻𝘀 𝗼𝗻 𝗟𝗲𝗮𝗱𝗲𝗿𝘀𝗵𝗶𝗽, 𝗙𝗼𝗰𝘂𝘀, 𝗮𝗻𝗱 𝗘𝗻𝗲𝗿𝗴𝘆!\n\n\"𝘊𝘭𝘢𝘳𝘪𝘵𝘺 𝘱𝘳𝘦𝘤𝘦𝘥𝘦𝘴 𝘴𝘶𝘤𝘤𝘦𝘴𝘴.\" – Robin Sharma\n\nIn our latest blog, I reflect on a conversation with a tech CEO who shared how\n-her team struggled with juggling priorities like launching a new product,\n-addressing technical debt,\n-and expanding into new markets.\n\nDespite their talent and tools, they often felt like a soccer team chasing the ball—busy but not productive.\n\nSound familiar?\n\nThis piece explores why so many teams face these challenges and, more importantly, how to overcome them.\n\n 𝗥𝗲𝗮𝗱 𝘁𝗵𝗲 𝗙𝘂𝗹𝗹 𝗔𝗿𝘁𝗶𝗰𝗹𝗲\n\n𝗪𝗵𝘆 𝗧𝗵𝗶𝘀 𝗠𝗮𝘁𝘁𝗲𝗿𝘀: 𝗕𝗲𝗰𝗮𝘂𝘀𝗲 𝘆𝗼𝘂𝗿 𝗯𝗼𝘁𝘁𝗼𝗺 𝗹𝗶𝗻𝗲 𝗱𝗲𝗽𝗲𝗻𝗱𝘀 𝗼𝗻 𝗶𝘁!\n\nClear priorities and focused execution are the keys to meaningful progress, energized teams, and your path to success.",
        "reactions": {
          "likes": "6\nEric Giguere and 5 others",
          "comments": "2 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/aec1ab65-3dd6-4e56-8884-bf549cea3738",
        "comments": [
          {
            "commentText": "This is actually what a lot of small business owners do, keep busy on little things and admistrivia and not make the big moves. Love the analogy of soccer",
            "userName": "Tracy Wiseman",
            "userProfileURL": "https://www.linkedin.com/in/tracywiseman1",
            "dataId": "urn:li:comment:(ugcPost:7290015241470369792,7290099259578716161)"
          },
          {
            "commentText": "Eric Giguere, This line caught my attention: \"Despite their talent and tools, they often felt like a soccer team chasing the ball—busy but not productive. \" This is a killer of motivation and engagement. Helping leaders recognize this and then take sustainable action is crucial.",
            "userName": "Judy Cirullo, PT, ACC, CPC, C-IQ Certified",
            "userProfileURL": "https://www.linkedin.com/in/judycirullo",
            "dataId": "urn:li:comment:(ugcPost:7290015241470369792,7290061402373820416)"
          }
        ],
        "commentAdded": "Great insights! Prioritizing clarity is essential for driving productivity and success. Excited to read more about overcoming these challenges!"
      },
      {
        "postId": "urn:li:activity:7290192711276539904",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290192711276539904",
        "url": "https://www.linkedin.com/in/brion-carroll-ii?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAATW_VsBDonlpEZwmQL3Jv50L27Womig6fo",
        "name": "Brion Carroll (II)\nBrion Carroll (II)",
        "content": "Great time ! At PTC User Summit in \nhashtag\n#NOLA - Day 2 with good friend and colleagues Tim Curran Van Gresham Dave Hadfield Purnima Krishnan Howard Schimmoller",
        "reactions": {
          "likes": "23\nBrion Carroll (II) and 22 others",
          "comments": "2 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "I forgot I got the Eric H. fan club tee shirt lol ",
            "userName": "Brion Carroll (II)",
            "userProfileURL": "https://www.linkedin.com/in/brion-carroll-ii",
            "dataId": "urn:li:comment:(ugcPost:7290192710164959232,7290196879047344128)"
          },
          {
            "commentText": "Brion Carroll (II) how can you forget me?!?!",
            "userName": "Eric H.",
            "userProfileURL": "https://www.linkedin.com/in/horneric",
            "dataId": "urn:li:comment:(ugcPost:7290192710164959232,7290201298749075457)"
          }
        ],
        "commentAdded": "Sounds like an amazing experience! Networking with great minds always sparks innovation. Looking forward to hearing more insights from #NOLA!"
      },
      {
        "postId": "urn:li:activity:7290355112781209600",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290355112781209600",
        "url": "https://www.linkedin.com/in/ashishmisal?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAEU0BfQBK74-py6lvLp4BueQPSFpFrQqrUU",
        "name": "Ashish Misal\nAshish Misal",
        "content": "Why I Recommend Avoiding JWT ? and Alternative Authentication Solutions\n\nIn my experience working with various web and mobile applications, I’ve come to realize that while JWT (JSON Web Tokens) is widely popular, it isn’t always the best choice. Here’s why:\n\n1. 𝗖𝗼𝗺𝗽𝗹𝗲𝘅𝗶𝘁𝘆 𝗶𝗻 𝗧𝗼𝗸𝗲𝗻 𝗠𝗮𝗻𝗮𝗴𝗲𝗺𝗲𝗻𝘁\nManaging JWTs can become tricky, especially as your app scales. Storing and refreshing tokens on different devices and platforms can lead to confusion and errors.\n\n2. 𝗦𝗲𝗰𝘂𝗿𝗶𝘁𝘆 𝗥𝗶𝘀𝗸𝘀\nJWTs come with potential vulnerabilities—if the signing key is compromised, attackers can forge tokens and impersonate users.\n\n3. 𝗟𝗮𝗰𝗸 𝗼𝗳 𝗙𝗶𝗻𝗲-𝗚𝗿𝗮𝗶𝗻𝗲𝗱 𝗔𝗰𝗰𝗲𝘀𝘀 𝗖𝗼𝗻𝘁𝗿𝗼𝗹\nJWTs don’t provide an easy way to manage complex user permissions, making it necessary to implement custom solutions that add unnecessary complexity.\n\n4. 𝗧𝗼𝗸𝗲𝗻 𝗦𝗶𝘇𝗲 & 𝗢𝘃𝗲𝗿𝗵𝗲𝗮𝗱\nAs the number of claims in a JWT grows, the size can become problematic, adding overhead and slowing down network requests.\n\n5. 𝗧𝗼𝗸𝗲𝗻 𝗘𝘅𝗽𝗶𝗿𝘆 & 𝗥𝗲𝘃𝗼𝗰𝗮𝘁𝗶𝗼𝗻\nOnce a JWT is issued, you can’t easily revoke or manage its expiration, complicating security.\n\n6. 𝗦𝗰𝗮𝗹𝗶𝗻𝗴 𝗜𝘀𝘀𝘂𝗲𝘀\nAs your app grows, scaling JWTs becomes challenging. Multiple servers need synchronized access to valid tokens, which can introduce bugs.\n\n𝗦𝗼, 𝗪𝗵𝗮𝘁 𝗮𝗹𝘁𝗲𝗿𝗻𝗮𝘁𝗶𝘃𝗲𝘀 𝘀𝗵𝗼𝘂𝗹𝗱 𝘆𝗼𝘂 𝗰𝗼𝗻𝘀𝗶𝗱𝗲𝗿?\n 𝗢𝗔𝘂𝘁𝗵 2.0: Great for delegating authentication to trusted providers like Google, Facebook, etc. It offers token expiration and revocation management without the complexities of JWT.\n\n 𝗦𝗲𝘀𝘀𝗶𝗼𝗻-𝗕𝗮𝘀𝗲𝗱 𝗔𝘂𝘁𝗵𝗲𝗻𝘁𝗶𝗰𝗮𝘁𝗶𝗼𝗻: A secure, traditional method that stores session data server-side, making token management easier.\n\n 𝗙𝗶𝗿𝗲𝗯𝗮𝘀𝗲 𝗔𝘂𝘁𝗵𝗲𝗻𝘁𝗶𝗰𝗮𝘁𝗶𝗼𝗻: A quick, easy-to-implement solution for mobile apps and web apps that need simplified authentication.\n\n 𝗔𝘂𝘁𝗵0: A comprehensive identity-as-a-service platform that offers secure authentication and advanced features like SSO and MFA.\n\n 𝗞𝗲𝘆𝗰𝗹𝗼𝗮𝗸: Open-source identity and access management, perfect for large-scale applications needing centralized authentication and RBAC.\n\n 𝗣𝗮𝘀𝘀𝗽𝗼𝗿𝘁.𝗷𝘀: A flexible middleware for Node.js that supports over 500 authentication strategies.\n\n 𝗢𝗸𝘁𝗮: Ideal for enterprise-grade authentication with features like SSO, MFA, and user management.\n\nWhile JWT has its place, I’ve found that other tools can simplify authentication and improve security without adding the complexities that JWT often brings.\n\nRead full article here:\n\nJoin my Community:\nWhatsApp :\nTelegram:\n\nFollowfor more insightful content on System Design, JavaScript and MERN Technologies!",
        "reactions": {
          "likes": "41",
          "comments": "13 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "It's fascinating to see how different methods can impact scalability and security.",
            "userName": "Arockia Liborious",
            "userProfileURL": "https://www.linkedin.com/in/arockialiborious",
            "dataId": "urn:li:comment:(activity:7290350699765260288,7290354325535531008)"
          },
          {
            "commentText": "W Your content always stands out for its clarity and depth. Keep up the great work Ashish Misal",
            "userName": "Umakanthreddy Umareddy",
            "userProfileURL": "https://www.linkedin.com/in/umakanthreddy-umareddy-9257b81b0",
            "dataId": "urn:li:comment:(activity:7290350699765260288,7290354981222633474)"
          }
        ],
        "commentAdded": "Great insights! Its refreshing to see a critical take on JWT. Exploring alternatives can truly enhance security and simplify management. Thanks for sharing!"
      },
      {
        "postId": "urn:li:activity:7289985253601853441",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289985253601853441",
        "url": "https://www.linkedin.com/in/sandeep-dinodiya?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAjV68YBDGiWNlfy0lNRRRpHXJVCZj8e8eU",
        "name": "Sandeep Dinodiya\nSandeep Dinodiya",
        "content": "We've tested with Multiple Agents, Multiagents, and Workflows—truly impressive and a game-changer! Big fan of the open-source community. Let's push even harder!",
        "reactions": {
          "likes": "31",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Fantastic work, Sandeep Dinodiya! Your dedication to innovation with Multiple Agents and Workflows is truly inspiring. Excited to see where this amazing journey with SimplAI DeepSeek AI leads!",
            "userName": "Jason Woo",
            "userProfileURL": "https://www.linkedin.com/in/jason-woo-100074205",
            "dataId": "urn:li:comment:(activity:7289985253601853441,7290023422590361600)"
          }
        ],
        "commentAdded": "Absolutely! The power of open-source innovation is remarkable. Excited to see what breakthroughs well achieve together! 🚀"
      }
    ],
    "errors": [
      {
        "postId": "urn:li:activity:7290187572029353984",
        "url": "https://www.linkedin.com/in/ruby-raley?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAALikcBJAxS7H2_7F8vu7nVZ3W9lLNA-aM",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7290157790973571073",
        "url": "https://www.linkedin.com/in/ahonamazumder?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABaJYLABaHBQ8HKYmLxJNi-99xsakiLDdgs",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7288912498345279489",
        "url": "https://www.linkedin.com/in/scottvcaputo?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACpwVDwBL1LIjex8pAwjHoggTDocwlGOtzA",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7290309484650860547",
        "url": "https://www.linkedin.com/in/siddhantgarg19?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACs6qaMBmozd1DRMDTQAedYIFAy6qBi1nhg",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7290132644552454144",
        "url": "https://www.linkedin.com/in/rickconlowservantleadership?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAPUxFwB6p1p6ESvdwgOkdRMuNdW3KDrJTU",
        "errors": [
          "Failed to fetch reactions.",
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7290337930252861440",
        "url": "https://www.linkedin.com/in/chrisake?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAiQkwABGjALtgmgoBr2MaImCGYlGgj06Fw",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7290192711276539904",
        "url": "https://www.linkedin.com/in/brion-carroll-ii?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAATW_VsBDonlpEZwmQL3Jv50L27Womig6fo",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7290355112781209600",
        "url": "https://www.linkedin.com/in/ashishmisal?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAEU0BfQBK74-py6lvLp4BueQPSFpFrQqrUU",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7289985253601853441",
        "url": "https://www.linkedin.com/in/sandeep-dinodiya?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAjV68YBDGiWNlfy0lNRRRpHXJVCZj8e8eU",
        "errors": [
          "Failed to fetch media URL."
        ]
      }
    ]
  }
]