{
  "posts": [
    {
      "postId": "urn:li:activity:7285343864708640769",
      "url": "https://www.linkedin.com/in/walterlcrosby?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABnRy4BfAi04dsWOrVfiDq5Fz8C2uALVWA",
      "name": "Walter Crosby\nWalter Crosby",
      "content": "Not making progress is something that drives entrepreneurs nuts.\n\nHaving to solve the same problem repeatedly for salespeople is one of the things I hear a lot. They come to you looking for you to solve their problem or answer a simple question.\n\nHere is my recommendation - stop giving them the answer. Let me explain.\n\nThey bring you problems because you solve them. Create a habit of asking them 5 questions before you answer.\n\n1) Have you ever encountered this problem before?\n2) What did you do that time?\n3) Did that work?\n4) Why or Why not?\n5) How is this problem the same or different?\n6) What do you think you should do this time?\n\nHelp them solve their problem and they will own the answer, and you can go celebrate with a cigar.",
      "reactions": {
        "likes": "1 comment",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "I recommend trying this exercise a couple of times. Be conversational. Be interested. Be patient. It works with teenagers too.",
          "userName": "Walter Crosby",
          "userProfileURL": "https://www.linkedin.com/in/walterlcrosby",
          "dataId": "urn:li:comment:(activity:7285343864708640769,7285343867128758277)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7285324935533621248",
      "url": "https://www.linkedin.com/in/jess-v?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADhA4-wBonIYd_89R3ry3ymDyYyzQZBAAwI",
      "name": "Jess V.\nJess V.",
      "content": "What the what? \nWhat does ENSHITTIFICATION mean? . . . Well, we are living it  \n\nDoctorow explains that platforms initially provide high-quality services to attract users. Once a substantial user base is established, the platform begins to prioritize business customers, often at the expense of user experience. Eventually, the platform focuses on maximizing profits for shareholders, leading to further degradation of service quality for both users and business customers (Netflix is a great example of this).\n\nThis concept has gained recognition, with the American Dialect Society selecting \"enshittification\" as its 2023 Word of the Year, and the Macquarie Dictionary following suit for 2024.\n\nPerhaps, unironically, the\nWord of the Year (a branch of my favorite dictionary - the\n, because yes, I'm a geek like that) is:\n\n brain rot\n\nDefined as, \"the supposed deterioration of a personas mental or intellectual state, especially viewed as a result of overconsumption of material (now particularly online content) considered to be trivial or unchallenging. Also: something characterized as likely to lead to such deterioration.\"\n\nWhat platforms do you see enshittification front and center right now?\n\nP.S.\nThis may be one of my favorite words to say right now. Some words just slide off the tongue, like \"serendipity\" and \"defenestration\" (I jokingly threaten my kids with that one all the time )\n\n\n#2024",
      "reactions": {
        "likes": "5",
        "comments": "2 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "My favorite word is phantasmagorical !!",
          "userName": "Leslie Venetz",
          "userProfileURL": "https://www.linkedin.com/in/leslievenetz",
          "dataId": "urn:li:comment:(activity:7285306018740273152,7285324913664499713)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7284891107191066624",
      "url": "https://www.linkedin.com/in/vaidehi-bhinde-b806541b2?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADGS3pABeuLcBK2eTtep_w6z9oKvcocqE9M",
      "name": "Vaidehi Bhinde\nVaidehi Bhinde",
      "content": "This grabbed my attention in a \nhashtag\n#blink —no, really! \nhashtag\n#SwiggyInstamart is literally soaring back into the game. \n\nThe witty copy, the artistic kite-shaped hoarding, and that clever 3D cut? It’s like the marketing team tied a masterstroke to a string and let it fly!Great Job Guys",
      "reactions": {
        "likes": "1,282",
        "comments": "14 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "\"Kat Gayi\" was personal  \nNot much relating to kites (It is) but the present trend.",
          "userName": "Sushil Jaiswal",
          "userProfileURL": "https://www.linkedin.com/in/sushil-jaiswal-0842601b1",
          "dataId": "urn:li:comment:(activity:7283150254399533056,7285269771338588164)"
        },
        {
          "commentText": "Mayur Hola and team ",
          "userName": "Saptarshi Prakash",
          "userProfileURL": "https://www.linkedin.com/in/saptarshipr",
          "dataId": "urn:li:comment:(activity:7283150254399533056,7283732712929009664)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7285343861722300416",
      "url": "https://www.linkedin.com/in/mezanurrahman?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABDF9ZQBt9lAHqUiQ8G927PZesUlAJsptWE",
      "name": "Mezanur Rahman\nMezanur Rahman",
      "content": "\"Social Media Treasure Hunt\"\nObjective: Increase brand awareness, engage your audience, and drive social media interaction.\nHow it Works:\n1.     Announce the Treasure Hunt:\no  Create a compelling post on your social media channels to announce the start of the treasure hunt.\no  Explain that participants will need to follow clues to find hidden messages or codes on your website or social media pages.\n2.     Create Clues and Challenges:\no  Develop a series of fun and intriguing clues related to your products, services, or brand values.\no  Share these clues over a period of days or weeks on different social media platforms (e.g., Facebook, Instagram, Twitter, LinkedIn).\n3.     Engage with Participants:\no  Encourage participants to like, share, and comment on the posts to increase engagement.\no  Offer hints or additional clues in response to user interactions to keep the activity lively and interactive.\n4.     Hidden Messages/Codes:\no  Hide messages or codes on your website or social media pages. These could be found in blog posts, product descriptions, or behind images.\no  Each hidden message or code should lead to the next clue or be part of a larger puzzle.\n5.     Rewards and Incentives:\no  Offer attractive rewards for participants who complete the treasure hunt. These could include discounts, freebies, or exclusive access to new products.\no  Announce winners on your social media channels and encourage them to share their experiences.\n6.     Measure and Analyze:\no  Track engagement metrics, such as likes, shares, comments, and website traffic, to measure the success of the campaign.\no  Collect feedback from participants to understand what they enjoyed and how you can improve future activities.\nBenefits:\nIncreases brand visibility and awareness.\nEncourages user-generated content and word-of-mouth promotion.\nStrengthens community engagement and loyalty.\nProvides valuable insights into customer preferences and behavior.",
      "reactions": {
        "likes": "1",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": []
    },
    {
      "postId": "urn:li:activity:7282765524311105536",
      "url": "https://www.linkedin.com/in/raglantribe?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAZmzUB0dHfZ5iOhjfCZ0MjbFjRJThsyoI",
      "name": "Raglan Tribe\nRaglan Tribe",
      "content": "I have spent 21 years consulting Toyota, Hyundai and Siemens and I hear this one sentence all the time from tech companies:\n\n\"Our technology is too advanced - customers don't understand it.\"\n\nThey think their biggest challenge is product complexity.\n\nThey're wrong.\n\nThe real problem:\n\nEngineers mistake technical capability for market value.\n\nIn one automotive project, the team had created remarkable autonomous driving features. Yet sales were stagnant.\n\nBecause they focused on explaining how it worked rather than why it mattered.\n\nWe implemented a three-phase solution:\n\n1)Map capability to customer pain points\n\n2)Translate technical features into business outcomes\n\n3)Build proof cases showing direct value impact\n\nTake one client's autonomous system. Instead of detailing sensor arrays and algorithms, we showed how it reduced fleet accidents by 43% and cut insurance costs by 38%.\n\nSales pipeline grew 5x in six months. Same technology, completely different story.\n\nIn technology selling, the gap isn't technical understanding - it's value translation.",
      "reactions": {
        "likes": "94",
        "comments": "10 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Attracted by the emerging technologies, it’s easy to lose sight of the core principle that the foundation of any successful product lies in addressing customer pain points. The most impactful businesses often begin by identifying and solving real problems, as highlighted in one of the YC lessons for founders. Starting with a solution in search of a problem—such as jumping onto buzzwords like blockchain or generative AI and then scrambling to build a business case—can be an expensive and inefficient approach. Prioritising the customer’s needs over technology hype is key to building truly effective solutions.",
          "userName": "Yike Fang",
          "userProfileURL": "https://www.linkedin.com/in/yike-fang",
          "dataId": "urn:li:comment:(activity:7282765524311105536,7285290602542321667)"
        },
        {
          "commentText": "Or brag about it this way rather than with technical charts. Amiright, Brittany Tessmer and Tessmer Jeffrey https://usa.nissanstories.com/en-US/releases/technology-1-tension-0",
          "userName": "Brad Nevin",
          "userProfileURL": "https://www.linkedin.com/in/bradnevin",
          "dataId": "urn:li:comment:(activity:7282765524311105536,7285294323334610946)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7285313079981080578",
      "url": "https://www.linkedin.com/in/johnkraski?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABkbm-0Be4xxSTDslQoX9c9qcRoExoNAGWk",
      "name": "John Kraski\nJohn Kraski",
      "content": "You know how super-hot and attractive people get lots of likes and fire emojis on Instagram for nothing other than being super-hot and attractive?\n\nYou always wonder why they are successful.\n\nWell they understand their audience.\n\nWell, that’s me on LinkedIn.\n\nBut l make my community thirsty in a different way.\n\nI load them up with super sexy billboards with stale quotes and generic motivational advice on whiteboards.\n\nThis how you deliver real impact on LinkedIn.\n\nStay thirsty my friends.",
      "reactions": {
        "likes": "127",
        "comments": "134 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "John Kraski this is interesting because it points to something bigger: attention is currency.\n\nSome people spend it quickly on flashy quotes, slick images, or loud opinions. \n\nOthers save it for things that build connection and trust over time.\n\nNeither is right or wrong, it just depends on what you want to create.\n\nFor me, the real art is knowing your audience well enough to give them something they didn’t even realize they needed. That’s where the impact lives.\n\nYour post reminds me that grabbing attention is easy, but what you do with it? That’s where it gets real.  ",
          "userName": "Isabelle LaCroix Vienneau CRP",
          "userProfileURL": "https://www.linkedin.com/in/isabelle-lacroix-vienneau",
          "dataId": "urn:li:comment:(activity:7285299235569188865,7285306460379447296)"
        },
        {
          "commentText": "Great callout Isabelle LaCroix Vienneau CRP !",
          "userName": "John Kraski",
          "userProfileURL": "https://www.linkedin.com/in/johnkraski",
          "dataId": "urn:li:comment:(activity:7285299235569188865,7285336560999268353)"
        },
        {
          "commentText": "I need an Oaty now ",
          "userName": "Natalie Leal Blanco",
          "userProfileURL": "https://www.linkedin.com/in/natalielealblanco",
          "dataId": "urn:li:comment:(activity:7285299235569188865,7285303675290320896)"
        },
        {
          "commentText": "Haha Natalie Leal Blanco ! Me too! About to drop a Thomas Woodhams Oaty shoutout! ",
          "userName": "John Kraski",
          "userProfileURL": "https://www.linkedin.com/in/johnkraski",
          "dataId": "urn:li:comment:(activity:7285299235569188865,7285337786566475776)"
        },
        {
          "commentText": "John Kraski you’ll make me more thirsty ",
          "userName": "Natalie Leal Blanco",
          "userProfileURL": "https://www.linkedin.com/in/natalielealblanco",
          "dataId": "urn:li:comment:(activity:7285299235569188865,7285343960967839744)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7285310142231785472",
      "url": "https://www.linkedin.com/in/walterlcrosby?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABnRy4BfAi04dsWOrVfiDq5Fz8C2uALVWA",
      "name": "Walter Crosby\nWalter Crosby",
      "content": " How's the remote or hybrid working situation going for your team?\n\n Remote workers are definitely here to stay! And let me tell you, my guest Celina Shands on this week's episode of Sales and Cigars ️ has some AMAZING insights to share! \n\n With 20 years of experience managing a creative team ALL remotely, Celina is a true expert in remote management. She's got some real nuggets of wisdom that will help you level up your remote game! \n\nOh, and did I mention she has an epic story about challenging Michael Jordan to a pick-up game?  You definitely don't want to miss that! \n\nSo grab your favorite cigar, sit back, and tune in to our latest episode! \n\n#HelixSalesDevelopment#salesandcigars",
      "reactions": {
        "likes": "0",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": "blob:https://www.linkedin.com/2dbb6c76-037c-4968-85a1-77ddf5fa9952",
      "comments": []
    },
    {
      "postId": "urn:li:activity:7285340216930746368",
      "url": "https://www.linkedin.com/in/lukewilsonsignpostceo?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAfuI5kBl2qBFzTl1Tb5LL34gufpdEd9q-c",
      "name": "Lucas Wilson\nLucas Wilson",
      "content": "Really enjoyed sitting down virtually with https://lnkd.in/gqNveyHS We had a blast discussing building the right team and how much quicker you succeed by having the right team. @megpoag thank you very much for having me.",
      "reactions": {
        "likes": "0",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": []
    },
    {
      "postId": "urn:li:activity:7283770053794127872",
      "url": "https://www.linkedin.com/company/swiggy-in/posts",
      "name": "Swiggy\nSwiggy",
      "content": "Shunder Kumar, it’s been incredible to watch you grow and continuously find solutions to every challenge you face. You’ve truly lived by the value of \"Move Fast, Break Barriers, and Deliver Results.\" Your commitment to these values has kept the whole team inspired and driven, and we’re so proud to have you with us on this journey. Happy Work Anniversary!",
      "reactions": {
        "likes": "112",
        "comments": "14 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "I am writing to highlight my repeated unpleasant experiences with Swiggy. As a loyal Zomato user, I recently decided to try Swiggy after enrolling in Swiggy Black. Unfortunately, my experiences have been consistently disappointing, and the issues are recurring.\n\nI placed an order at 7:00 PM for my 5-year-old daughter, who is unwell. The initial estimated delivery time was 25 minutes. However, 1.5 hours later, the order had still not been delivered.\n\nWhen I reached out to Swiggy’s support team, they extended the delivery time repeatedly, without any meaningful resolution.\n\nDespite knowing this, Swiggy failed to notify me or take corrective action. Instead, they continued to delay the delivery time and offered a Rs. 100 voucher valid for just two days, which felt insincere and dismissive of the situation.\n\nIn contrast, I have never encountered such issues with Zomato, which has consistently provided reliable and prompt service. I strongly urge Swiggy to address these systemic problems, improve its delivery process, and show genuine concern for customers. Until these issues are resolved, I advise potential users to reconsider using Swiggy.",
          "userName": "Manish Giridhar",
          "userProfileURL": "https://www.linkedin.com/in/manish-giridhar-b0991a112",
          "dataId": "urn:li:comment:(ugcPost:7283770052758167552,7285311947393179649)"
        },
        {
          "commentText": "Sriharsha M., Swiggy Cares And Swiggy Is this the level of service I should expect? Such harassment and nuisance. I requested a replacement yesterday, yet all I’ve been told is to email support or that my feedback will be passed on.\n\nIt seems you don’t understand the gravity of the situation. I ordered PLANT-BASED MOMO RAMEN and was sent CHICKEN MOMOS instead.\n\nSending an entirely wrong order gives me the right to demand a full refund and further compensation for the harassment I’ve been dealing with since yesterday. No one has provided a solution, no one was willing to call, no one listened, and even now, no one seems ready to address the issue. This is completely unacceptable.\n\nThis complete lack of professionalism and accountability has caused me significant mental stress. As a paying customer, I expect proper service, respect for my dietary preferences, and immediate resolution. Incidents like this destroy trust in your brand and impact your reputation.\n\nI demand a full refund and additional compensation for the mental stress caused by this ordeal. If I do not receive a resolution within 24 hours, I will escalate the matter to social media and consumer forums.\n\nOrder ID - ORDER #195664382756320",
          "userName": "Tina Mittal",
          "userProfileURL": "https://www.linkedin.com/in/tina-mittal-1457ab258",
          "dataId": "urn:li:comment:(ugcPost:7283770052758167552,7284562708862025728)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7285343817640067073",
      "url": "https://www.linkedin.com/in/matthewbuchalski?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAHq5rcBUODCOiAZTTtYH3Xvrex0EdMFjpA",
      "name": "Matthew Buchalski\nMatthew Buchalski",
      "content": "$2 billion dollars (I hope you said that in your best Dr. Evil voice, lol). Our latest research report from Chi Whitley and our engineering team estimates that TX homeowners left $2BB in tax savings on the table by not protesting their property taxes!! In a time where inflation has already had an impact on all goods and services, compounded by the increase in taxes & insurance, why not appeal your property taxes?\n\nOur sign-up process takes less than 2 minutes to do, and its risk-free (no upfront costs, and you only pay if we are successful!). Go toto sign up!!\n\nRemember the name.",
      "reactions": {
        "likes": "1",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": []
    }
  ],
  "errors": [
    {
      "postId": "urn:li:activity:7285343864708640769",
      "url": "https://www.linkedin.com/in/walterlcrosby?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABnRy4BfAi04dsWOrVfiDq5Fz8C2uALVWA",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285324935533621248",
      "url": "https://www.linkedin.com/in/jess-v?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADhA4-wBonIYd_89R3ry3ymDyYyzQZBAAwI",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7284891107191066624",
      "url": "https://www.linkedin.com/in/vaidehi-bhinde-b806541b2?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADGS3pABeuLcBK2eTtep_w6z9oKvcocqE9M",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285343861722300416",
      "url": "https://www.linkedin.com/in/mezanurrahman?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABDF9ZQBt9lAHqUiQ8G927PZesUlAJsptWE",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7282765524311105536",
      "url": "https://www.linkedin.com/in/raglantribe?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAZmzUB0dHfZ5iOhjfCZ0MjbFjRJThsyoI",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285313079981080578",
      "url": "https://www.linkedin.com/in/johnkraski?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABkbm-0Be4xxSTDslQoX9c9qcRoExoNAGWk",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285310142231785472",
      "url": "https://www.linkedin.com/in/walterlcrosby?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABnRy4BfAi04dsWOrVfiDq5Fz8C2uALVWA",
      "errors": [
        "Failed to fetch reactions."
      ]
    },
    {
      "postId": "urn:li:activity:7285340216930746368",
      "url": "https://www.linkedin.com/in/lukewilsonsignpostceo?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAfuI5kBl2qBFzTl1Tb5LL34gufpdEd9q-c",
      "errors": [
        "Failed to fetch reactions.",
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7283770053794127872",
      "url": "https://www.linkedin.com/company/swiggy-in/posts",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285343817640067073",
      "url": "https://www.linkedin.com/in/matthewbuchalski?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAHq5rcBUODCOiAZTTtYH3Xvrex0EdMFjpA",
      "errors": [
        "Failed to fetch media URL."
      ]
    }
  ]
}