{
  "posts": [
    {
      "postId": "urn:li:activity:7287460194559643648",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287460194559643648",
      "url": "https://www.linkedin.com/in/kunalpandya?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAACL0_MB79gEt9NILd9av4JZlHjtcFSiKmo",
      "name": "Kunal Pandya\nKunal Pandya",
      "content": "Feel like your work in enablement isn’t getting the recognition it deserves? I get it.\n\nBecause I’ve been there.\n\nAt the beginning of my enablement career, I thought I was doing everything right.\n\nI followed the advice that people kept shouting about:\n\n“Track activity metrics like calls and emails.”\n“The product sells itself - just teach reps how to sell better.”\n“Focus on onboarding - it’s what the business cares about.”\n\nHere’s the truth: that advice didn't work.\n\nWhy? Because it was completely out of touch with the challenges I actually faced in my job everyday:\n\n Conflicting demands from sales, leadership, and ops.\n Pressure to justify value in challenging economic climates.\n More savvy buyers and increased competition.\n Minimal guidance on how to tie enablement efforts to business outcomes.\n\nI wasted a lot of time following advice that wasn’t helping me move the needle.\n\nAnd here's what I had to learn the hard way, though. a lot of trial and error: Leadership doesn’t care how many training sessions you run...\n\nThey care about one thing: revenue.\n\nIf you’re not showing how your work ties back to revenue, your efforts will largely go unnoticed.\n\nI wish someone had told me that at the beginning of my enablement career.\n\nIt's also why so many enablers are stuck...\n\n Drowning in overhyped information that’s no longer relevant.\n Burning out doing tactical tasks that don't get them a promotion.\n Trying to piece together advice that doesn't actually solve the bigger challenges enablement faces in 2025.\n\nThe problem isn’t you - it’s the noise.\n\nWhat you need isn’t more generic advice that isn't relevant to the struggles you deal with on a daily basis.\n\nWhat you DO need is clarity, strategy and guidance that aligns with the world enablement is living and breathing in today.\n\nEnablement will only STOP being branded as the \"training and support function\" and START being recognised as a revenue-driving function, when we choose to step up and learn how to demonstrate revenue impact. If there is one skill you master in 2025, let it be THAT!\n\nP.S That’s exactly why I created the Strategic Enablement Blueprint. It’s the roadmap I wish I had when I started. A framework to cut through the noise and show you how to make an impact, get a promotion and remain relevant in today's competitive market. Join the waitlist here:",
      "reactions": {
        "likes": "18",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Great insights! Mastering the art of demonstrating revenue impact is crucial for enablement professionals. Looking forward to the Strategic Enablement Blueprint!"
    },
    {
      "postId": "urn:li:activity:7287498520654168064",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287498520654168064",
      "url": "https://www.linkedin.com/in/jason-portnoy?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAACCJigB5NZbUIOPEYO7RY0oP4URuaLLGNs",
      "name": "Jason Portnoy\nJason Portnoy",
      "content": "ROI is a SHARED outcome!\n\nIt’s not just about the agency and the traffic...\n\nIt’s about alignment between the efforts of BOTH the client and the agency.\n\nThe agency's role is to ensure the traffic sent are highly qualified while managing costs effectively.\n\nThe client’s responsibility is to create a user experience that converts those visitors into leads or sales.\n\nBoth roles are essential.... And when either side isn’t optimized, the ROI suffers.\n\nThe relationship between agency and client is a PARTNERSHIP, not an abdication of the business's responsibilities.",
      "reactions": {
        "likes": "0",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Absolutely! A true partnership fosters success—both agency and client play vital roles in driving ROI. Collaboration is key! 💪🚀"
    },
    {
      "postId": "urn:li:activity:7287274795287621633",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287274795287621633",
      "url": "https://www.linkedin.com/in/hunterdeskin?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABZoVYwBW84CpvTyTZ8fABPRG_hNO3d0YlI",
      "name": "Hunter Deskin\nHunter Deskin",
      "content": "I didn’t even want this. And Cialdini’s Law of Reciprocity struck again. The lesson?\n\n\nI was at sprouts grocery yesterday with my girlfriend getting some dinner and groceries.\n\nThere’s a salad that we really like in the side section…\n\nWe already know we like it.\n\nYet this new one caught our eye.\n\nThe guy saw me looking at it.\n\nI told him I’m good I think we will just keep going.\n\nHe said you sure? I’ll give you a sample?\n\nNow, they’ve done this before.\n\nOffered me samples of stuff I was considering buying.\n\nBut this guy heaped an entire serving size portion of it into a container and handed it to me.\n\nI’m talking 10x what they normally give.\n\nTbh I didn’t even like it.\n\nYet I bought a pound of it anyway.\n\nWhy?\n\nReciprocity.\n\nThe guy was so kind as to give me an entire serving as a sample I couldn’t help but buy some afterwards.\n\nIt felt indebted to him DESPITE knowing this principle and it viscerally playing out before me.\n\nThe lesson?\n\nGive give give.\n\nGive more than you think.\n\nMake your lead magnets and content so full of information and value your prospects can’t HELP but feel indebted to you and like the HAVE to buy your stuff.",
      "reactions": {
        "likes": "4",
        "comments": "1 comment",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Dang twelve bucks a pound for leaves is wild haha",
          "userName": "Kellen Casebeer",
          "userProfileURL": "https://www.linkedin.com/in/kellen-casebeer",
          "dataId": "urn:li:comment:(activity:7287274795287621633,7287286248359043073)"
        }
      ],
      "commentAdded": "Great story! It’s fascinating how the Law of Reciprocity influences our decisions. Truly a reminder to give value and build genuine connections!"
    },
    {
      "postId": "urn:li:activity:7287303252000276480",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287303252000276480",
      "url": "https://www.linkedin.com/in/rickconlowservantleadership?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAPUxFwB6p1p6ESvdwgOkdRMuNdW3KDrJTU",
      "name": "Richard A. Conlow\nRichard A. Conlow",
      "content": "7 Ways to Lead Positively without the Title: https://buff.ly/3fhqH1g \nhashtag\n#leadership \nhashtag\n#management \nhashtag\n#servantleadership \nhashtag",
      "reactions": {
        "likes": "2",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Great insights! Leadership is about influence, not titles. Embracing servant leadership can truly inspire teams to thrive! #leadership #servantleadership"
    },
    {
      "postId": "urn:li:activity:7287365074330034176",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287365074330034176",
      "url": "https://www.linkedin.com/in/arsh-javed-648806254?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAD7EjBgBZNPCXVJwoqAGKFf6mk4XXYpcEzM",
      "name": "Arsh Javed\nArsh Javed",
      "content": "Thank You ACM Student Chapter , Amrita Amritapuri for this amazing national level hackathon \"Evolumin\" in which our team \"Metavoid\" secured a top 10 rank among all the teams participating.and me created a wonderful platform \"MindCare\" helping people with mental problems. Overall it was a wonderful learning experience.",
      "reactions": {
        "likes": "10",
        "comments": "2 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Congrats!",
          "userName": "Rafiq ..",
          "userProfileURL": "https://www.linkedin.com/in/rafiq-b7285a2b5",
          "dataId": "urn:li:comment:(ugcPost:7287365073331802113,7287372685196587009)"
        },
        {
          "commentText": "Rafiq .. thank you",
          "userName": "Arsh Javed",
          "userProfileURL": "https://www.linkedin.com/in/arsh-javed-648806254",
          "dataId": "urn:li:comment:(ugcPost:7287365073331802113,7287374486708895744)"
        }
      ],
      "commentAdded": "Congratulations to Team Metavoid on this impressive achievement! MindCare sounds like a valuable initiative. Excited to see where this journey takes you!"
    },
    {
      "postId": "urn:li:activity:7287442672837947393",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287442672837947393",
      "url": "https://www.linkedin.com/in/aashish-jhunjhunwala?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAB8XZ9YBJJvUNNZOs8VpL1ttPmQexcatCtI",
      "name": "Aashish Jhunjhunwala\nAashish Jhunjhunwala",
      "content": "“Baat pissa ki koni, baat hisaab ki hai!”\nTranslation: It’s never about the money; it’s the calculations that matter most. You can take a Marwari out of the “dhandha,” but never the “dhandha mindset” out of them.\n\nDespite working in the corporate world for 8+ years, my budgeting and investing principles are rooted in lessons from my businessman father:\na) Know how much is coming in and from where.\nb) ALWAYS know how much is being spent and on what.\nc) Hunt for the best deals to ensure you get your money’s worth.\n\nAs someone who loves good deals as much as keeping a hisaab, I rely on multiple credit cards and managing them can get chaotic.\n\nFor years, I’ve been juggling gazillion Excel sheets (because old habits die hard). But now, I useto manage my credit cards effortlessly. And they’ve just made it even better with CheQ Wisor—India’s first AI-driven credit card expert! It gives me:\n- Spending insights – AI helps me understand where my money is going.\n- Reward tracking – No more missing out on free rewards!\n- Smart recommendations – It literally tells me how to optimize my credit card usage!\n\nIt’s still in beta, but it’s already wonderful! It feels like having a super-intelligent Marwari accountant in your pocket!\nCan’t wait to see how this evolves! Big shoutout to& the CheQ team for this game-changer!\n\nWhich apps do you use to track your hisaab of Credit Cards? Let me know in the comments! ",
      "reactions": {
        "likes": "235",
        "comments": "41 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "This hisaab mindset is exactly how it should be! Managing credit should be as easy as a Marwari tracking every rupee and CheQ Wisor will make it even simpler for you! Thanks for the support—keep the feedback coming :)",
          "userName": "Manisha S.",
          "userProfileURL": "https://www.linkedin.com/in/manisha-s-3589b415",
          "dataId": "urn:li:comment:(activity:7287441995277512704,7287512698135748608)"
        },
        {
          "commentText": "Good insight",
          "userName": "Sachin S.",
          "userProfileURL": "https://www.linkedin.com/in/sachin-s-a6236625a",
          "dataId": "urn:li:comment:(activity:7287441995277512704,7287446146162061312)"
        }
      ],
      "commentAdded": "Love this insight! Its amazing how tech like CheQ Wisor can enhance our financial savvy. Excited to see how it evolves! 💡📊"
    },
    {
      "postId": "urn:li:activity:7284567139947040769",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7284567139947040769",
      "url": "https://www.linkedin.com/in/michaelocean?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABRkVVcBdJXrbHnrLNPe5NG3L1FNnS_LDdw",
      "name": "Michael Ocean\nMichael Ocean",
      "content": "If your sales team is crushing it, don't mess with it.\n\n\nHad a great chat with(Director of GTC Programs at Polaris, NY Chapter President at Revenue Enablement Society) about when you actually need a sales methodology - and when you don't.\n\n\nHer take? While methodologies can help struggling teams, there's no reason to change what's already working well.\n\n\nWhen to consider a methodology:\n\n- Your team isn't hitting their numbers and needs a clear framework\n- You want customers to have the same experience, no matter which seller they work with\n- You need better ways to track and measure sales effectiveness\n\n\nIn the full episode, we covered:\n\n- Getting real buy-in from CEO to sales reps\n- Rolling out methodologies without breaking what works\n- Why customer experience drives methodology choice\n- The right balance between structure and sales flexibility\n\n\nFull conversation in the comments ",
      "reactions": {
        "likes": "57",
        "comments": "19 comments",
        "shares": "0"
      },
      "mediaUrl": "blob:https://www.linkedin.com/da971fe4-f559-44ea-b8ec-bf5bb9d60f3f",
      "comments": [
        {
          "commentText": "\"Standardizing how we sell isn't just about internal processes. It's about making sure every customer gets the same amazing experience, regardless of which seller they're working with.\" Smart way to think about sales process.\n\nFull episode here:",
          "userName": "Yana Yabloneva",
          "userProfileURL": "https://www.linkedin.com/in/yana-yabloneva",
          "dataId": "urn:li:comment:(ugcPost:7284566946191167488,7284568178062409728)"
        },
        {
          "commentText": "Yana Yabloneva on-point!",
          "userName": "Michael Ocean",
          "userProfileURL": "https://www.linkedin.com/in/michaelocean",
          "dataId": "urn:li:comment:(ugcPost:7284566946191167488,7284568340554002433)"
        },
        {
          "commentText": "Can't wait to watch this one!",
          "userName": "Marc DeCarli",
          "userProfileURL": "https://www.linkedin.com/in/marcdecarli",
          "dataId": "urn:li:comment:(ugcPost:7284566946191167488,7284574587919515649)"
        },
        {
          "commentText": "Marc DeCarli Michelle is amazing!",
          "userName": "Michael Ocean",
          "userProfileURL": "https://www.linkedin.com/in/michaelocean",
          "dataId": "urn:li:comment:(ugcPost:7284566946191167488,7284582335503581185)"
        },
        {
          "commentText": "Michael Ocean Yes, she is!",
          "userName": "Marc DeCarli",
          "userProfileURL": "https://www.linkedin.com/in/marcdecarli",
          "dataId": "urn:li:comment:(ugcPost:7284566946191167488,7284585281897250816)"
        }
      ],
      "commentAdded": "Great insights! Its crucial to strike that balance between structure and flexibility. Excited to hear more from your conversation!"
    },
    {
      "postId": "urn:li:activity:7287525556919705600",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287525556919705600",
      "url": "https://www.linkedin.com/in/ronenolshansky?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAH0V_UBGGarmr-A_VKi-SXRbOB0LUJVet0",
      "name": "Ronen Olshansky\nRonen Olshansky",
      "content": "You’ll network better by being yourself.\n\nPeople can spot fake from a mile away.\n\nIn this video, you’ll see a group of dolphins swimming their usual patterns, mostly ignoring the crowd.\n\nThen this little girl steps up to the glass.\n\nNo agenda. No performance. Just pure childlike wonder and joy.\n\nOne dolphin noticed. Broke away from the group. Came right to her window.\n\nWhat followed was heartwarming — a pure connection between two beings just happy to share a moment.\n\nThis made me think about networking and connection:\n\n• How often do we overcomplicate things?\n• How many walls do we build with our \"professional personas\"?\n• What if we led with authenticity?\n\nThe best way to connect isn't through polished facades.\n\nYou’ll make more progress being real enough that others feel safe being real too.\n\nWhen was the last time you dropped the corporate mask and let your genuine self shine through?",
      "reactions": {
        "likes": "2",
        "comments": "1 comment",
        "shares": "0"
      },
      "mediaUrl": "blob:https://www.linkedin.com/73de8ad2-cf28-4141-90a8-7cba351d9963",
      "comments": [
        {
          "commentText": "Ronen Olshansky authenticity breaks down walls faster than any polished act ever could; real connections come from being genuinely you! And I'm working on something... Imagine a business event that never ends... and you can join anytime, anywhere. Think of it as your 24/7 social networking!\nIt is something fresh, new and unique - focused on professionals looking for authentic and meaningful connections - ONLY!",
          "userName": "Tomasz Boinski",
          "userProfileURL": "https://www.linkedin.com/in/tomaszboinski",
          "dataId": "urn:li:comment:(ugcPost:7287523377123147776,7287525498144833539)"
        }
      ],
      "commentAdded": "Absolutely love this perspective! Authenticity truly paves the way for deeper connections. Lets embrace our true selves in networking! 🌊✨"
    },
    {
      "postId": "urn:li:activity:7287519427820994562",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287519427820994562",
      "url": "https://www.linkedin.com/in/egiguere?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAOPFcB_4ORr0IKauLZuAbFaZTrGR2GYic",
      "name": "Eric Giguere\nEric Giguere",
      "content": "Well done, thanks for sharing!",
      "reactions": {
        "likes": "0",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Great insights! I appreciate you sharing this valuable information. Looking forward to more of your posts!"
    },
    {
      "postId": "urn:li:activity:7287527796740960256",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287527796740960256",
      "url": "https://www.linkedin.com/in/vpisanka?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADoCqcB1LtmcP5Ecxxm1p-B5_2t6PVGnDM",
      "name": "Slava Pisanka\nSlava Pisanka",
      "content": "I fell into low-bid RFP trap and paid a high price.\n\nBack in 2005 I did an ERP system selection and picked the best contender:\n·      The solution was the right fit for the client\n·      The vendor seemed to have the right expertise\n·      Good reputation\n·      Best price\n\nAfter the selection I led the project as a project manager and the implementation consultant.\n\nThe first few months of the project went OK. But then the SI started delaying on deliverables.\n\nA little later they completely changed the solution, the team, and started asking for more money.\n\nChange request. Cha Ching!\n\nBy that time, we already paid per contract. So, the choice was to break up and sue them or pay.\n\nThe vendor was asking to pay for additional features, expended timeline and many more.\n\nThe client decided to extend the party.\n\nAs the result the project took 2 years instead of 1 year promised, and we went 100% over budget.\n\nNow let’s look at what happened here.\n\nThis system integrator used a playbook that many vendors love:\n1.     Bid low to win the deal. Pretend to be cost competitive.\n2.     Scope creep everything\n3.     Recover revenue that was lost at the beginning\n\nResult for the client?\n·      Budget overrun\n·      Timeline delay\n·      Frustrated stakeholders\n\nHow can you avoid this trap?\n1.     Focus less on a cost but more on the right vendor\n2.     Have an experienced ERP consultant in your team who can see the low bidding\n3.     Hire an independent ERP advisor who can help you spot red flags and make the right decisions\n\nHey, but I have a rock-solid RFP process!\n\nRight. You will find out later.",
      "reactions": {
        "likes": "12",
        "comments": "1 comment",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Great advice",
          "userName": "Daniel Estrada ✔",
          "userProfileURL": "https://www.linkedin.com/in/daniel-estrada-%E2%9C%94-7700ba29",
          "dataId": "urn:li:comment:(activity:7287522472600444928,7287527491286577152)"
        }
      ],
      "commentAdded": "Great insights! Prioritizing the right vendor over the lowest bid can save time and money in the long run. Lessons learned!"
    }
  ],
  "errors": [
    {
      "postId": "urn:li:activity:7287460194559643648",
      "url": "https://www.linkedin.com/in/kunalpandya?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAACL0_MB79gEt9NILd9av4JZlHjtcFSiKmo",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287498520654168064",
      "url": "https://www.linkedin.com/in/jason-portnoy?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAACCJigB5NZbUIOPEYO7RY0oP4URuaLLGNs",
      "errors": [
        "Failed to fetch reactions.",
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287274795287621633",
      "url": "https://www.linkedin.com/in/hunterdeskin?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABZoVYwBW84CpvTyTZ8fABPRG_hNO3d0YlI",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287303252000276480",
      "url": "https://www.linkedin.com/in/rickconlowservantleadership?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAPUxFwB6p1p6ESvdwgOkdRMuNdW3KDrJTU",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287365074330034176",
      "url": "https://www.linkedin.com/in/arsh-javed-648806254?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAD7EjBgBZNPCXVJwoqAGKFf6mk4XXYpcEzM",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287442672837947393",
      "url": "https://www.linkedin.com/in/aashish-jhunjhunwala?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAB8XZ9YBJJvUNNZOs8VpL1ttPmQexcatCtI",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287519427820994562",
      "url": "https://www.linkedin.com/in/egiguere?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAOPFcB_4ORr0IKauLZuAbFaZTrGR2GYic",
      "errors": [
        "Failed to fetch reactions.",
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287527796740960256",
      "url": "https://www.linkedin.com/in/vpisanka?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADoCqcB1LtmcP5Ecxxm1p-B5_2t6PVGnDM",
      "errors": [
        "Failed to fetch media URL."
      ]
    }
  ]
}