{
  "posts": [
    {
      "postId": "urn:li:activity:7285649525845762048",
      "url": "https://www.linkedin.com/in/robertsjeff?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAeZvQUBybFX1rFWHMOHhOcZiZKlyH6HX5k",
      "name": "Jeff Roberts\nJeff Roberts",
      "content": "A recent Time article sheds light on an intriguing shift in AI progress—it's becoming less visible but no less impactful. \n\nIn healthcare, for instance, AI is helping researchers uncover drug treatments faster than ever. In logistics, it's optimizing supply chains, ensuring goods move efficiently across the globe. And in software development, AI tools are quietly enhancing workflows, making coding and debugging more seamless.\n\nThe most transformative innovations often happen behind the scenes, changing how industries operate and setting the stage for future breakthroughs.\n\nHow do you think we can better appreciate and measure the impact of these \"hidden\" advancements in AI?\n\nRead more on Time:",
      "reactions": {
        "likes": "2",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": []
    },
    {
      "postId": "urn:li:activity:7285653272923643906",
      "url": "https://www.linkedin.com/in/theadampboyd?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAACKocEBPj0z4uEHAzd013N-f5ty27yCiIM",
      "name": "Adam P. Boyd\nAdam P. Boyd",
      "content": "Let's talk about pipeline reviews.\n\nYou know the ones where your highly-paid sales team sits around telling stories that sound like:\n\n\"They're on vacation but will get back to us Monday\"\n\"It's going to the CFO for approval\"\n\"They really like us, just need a discount\"\n\nHere's what I've learned after 20 years:\n\nEvery time you hear \"I think\" or \"I feel\" in a pipeline review.\n\nSubtract 30% from your forecast.\n\nYes, your pipeline might go negative.\n\nBut at least now we're dealing in reality.\n\nWant to know what actually works?\n\nHere's what we train our clients to ask \n\n\"What's at stake for the buyer?\" (Not your contact … the check writer)\n\"Would you bet $5,000 of your own money on this deal?\"\n\"Who's the highest person we're ACTIVELY talking to?\"\n\"Did the prospect actually commit to that close date?\".\n\nQuick reality check:\n\nSelling to managers? Max 20% close rate\nDirectors? 45% tops\nVPs? Maybe 60%\nC-suite? Now we're talking\n\n—--------\n\nI help mid-market companies turn pipeline fairy tales into predictable revenue through practical sales training. Starting with how to run pipeline reviews that actually work.\n\nWant to know what this could look like for your team? DM me.\n\nOr just want to dip your toe in?\nStart here - our 6 week boot camp... spots limited.",
      "reactions": {
        "likes": "12",
        "comments": "2 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Adam, the thing that drives me bonkers in pipeline reviews is when salespeople answer with, \"I think...\" or \"I'm not sure...\" or \"My best guess is...\" \n\nSpecific questions require specific answers and anything else is California smoke.",
          "userName": "Dave Kurlan",
          "userProfileURL": "https://www.linkedin.com/in/davekurlan",
          "dataId": "urn:li:comment:(activity:7285653272923643906,7285656148517519360)"
        },
        {
          "commentText": "That second question...so good. Huge trap for professional sellers to forsake income so they can avoid an uncomfortable reality check.",
          "userName": "Bill Piper",
          "userProfileURL": "https://www.linkedin.com/in/billpiper",
          "dataId": "urn:li:comment:(activity:7285653272923643906,7285671219146678272)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7285570581826084865",
      "url": "https://www.linkedin.com/in/saxenarajiv?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABxLikBsYhPfAZox0oCtbQcevMZFANTIyA",
      "name": "Rajiv Saxena\nRajiv Saxena",
      "content": "B2B Sales & the B2C Buying Experience",
      "reactions": {
        "likes": "9",
        "comments": "2 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Insightful breakdown! B2B SaaS purchasing is, as we've discussed, a far cry from B2C eCommerce—it isn't simply a transaction, far from it, it occurs at a scale with tangible implications on their businesses.\n\nThe focus on those research, consideration and comparison phases further highlights the layered complexity of B2B decisions. The takeaways you can take action on—ROI-driven content, human-centric support, and tailored use cases—are gold for SaaS marketers who want to hit buyers where it hurts.\n\nAnd this is a great reminder that earning trust and adding value is not just about the sales process, it is about building a long-term relationship. It is well written and very topical for 2025!",
          "userName": "Swati Paliwal",
          "userProfileURL": "https://www.linkedin.com/in/swatipaliwal1",
          "dataId": "urn:li:comment:(ugcPost:7285570581414977537,7285675784097218560)"
        },
        {
          "commentText": "Hi maddam",
          "userName": "Mahmudul Hussain",
          "userProfileURL": "https://www.linkedin.com/in/mahmudul-hussain-5205a6313",
          "dataId": "urn:li:comment:(ugcPost:7285570581414977537,7285709700958932992)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7285685859700408322",
      "url": "https://www.linkedin.com/in/jimfielden?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAJrVjgBaEuh8p1VHpzjpv1LTOwD2Ac2GY4",
      "name": "Jim Fielden\nJim Fielden",
      "content": " Your Career Growth Starts with Your Network \n\nDid you know that LinkedIn is more than just a digital resume? It’s a powerful networking tool and a gateway to your next opportunity! According to Business Insider, LinkedIn has transformed how professionals connect, collaborate, and land jobs—especially at the executive and C-suite level.\n\nHere are some key tips to maximize LinkedIn for career growth:\n\n Polish Your Profile: Your headline and summary should showcase your unique value proposition.\n Engage Regularly: Comment on industry posts, share insights, and start meaningful conversations.\n Leverage Connections: Your network is your greatest asset—reach out to mentors, peers, and recruiters.\n Show Thought Leadership: Publish articles or share updates that demonstrate your expertise and passion.\n\nAs a career coach, I’ve seen firsthand how LinkedIn opens doors to roles in the hidden job market and builds personal brands that stand out. Whether you’re navigating a transition, seeking your next executive role, or expanding your influence, the right LinkedIn strategy can make all the difference.\n\n How do YOU use LinkedIn to elevate your career?\n?\n\nShare your thoughts below! ",
      "reactions": {
        "likes": "1 comment",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": " Boost Your Career with LinkedIn \nLinkedIn is more than a resume—it's your gateway to opportunities. Here’s how to maximize it:\n Polish Your Profile: Craft a standout headline and summary.\n Engage Regularly: Comment, share, and start conversations.\n Leverage Connections: Network with mentors, peers, and recruiters.\n Show Expertise: Publish posts that highlight your thought leadership.\n Pair your LinkedIn strategy with RiseON Suite:\n Create dynamic, interactive resumes that link to your profile.\n Use AI tools to align your personal brand across platforms.\nStart your 100-hour free trial:\nYour next opportunity is just one connection away! ",
          "userName": "Naheeda Afreen",
          "userProfileURL": "https://www.linkedin.com/in/naheeda-afreen-30aa6220b",
          "dataId": "urn:li:comment:(activity:7285685859700408322,7285694793504976896)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7285672505841786880",
      "url": "https://www.linkedin.com/in/neil-sarkar?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABKnLrYBWIfe92kUUbuVo2pyeF57kK5ZyMY",
      "name": "Neil Sarkar\nNeil Sarkar",
      "content": "Did you know 80% of Salesforce admins are making these common mistakes?\n\nWhen I started working with Salesforce, I made my fair share of blunders (hello, automation disasters!). But over time, I’ve learned how to turn chaos into clarity—and that’s what I want to share today.\n\n5 COMMON MISTAKES AND FIXES:\n\nField Overload: Too many fields clutter your org and confuse users. Use Schema Builder to clean it up.\nData Hygiene Ignored: Duplicates create a mess. Salesforce’s Duplicate Management tools = lifesavers.\nOver-Permissioning: Giving everyone admin rights? Big no. Set boundaries with Profiles & Permission Sets.\nRunaway Automations: Overzealous workflows can wreak havoc. Test in sandbox, keep it simple.\nNot Listening to Users: Your org isn’t about you. Regular check-ins = better, user-friendly solutions.\n\nWe all make mistakes, but the real win is learning, adapting, and building smarter. At, we help Salesforce admins prevent these pitfalls before they happen\n\nCheck out the video to dive deeper into these tips, and let me know in the comments: What’s your most epic Salesforce “oops” moment? Let’s learn together!",
      "reactions": {
        "likes": "10",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": "blob:https://www.linkedin.com/b896dd16-e1a6-4b55-9479-8344b4e5684e",
      "comments": []
    },
    {
      "postId": "urn:li:activity:7285657068794003457",
      "url": "https://www.linkedin.com/in/veroniquebarrot?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAECMC0wBQseYZa4ZPmFaqdp3me6FWJi2Abg",
      "name": "Véronique Barrot\nVéronique Barrot",
      "content": "Waiting a little longer for what you truly deserve is always worth it.\n\nI’ve been there.\n\nStanding in a classroom, teaching Maths to college students eager to learn.\n\nI loved teaching. It felt meaningful.\n\nBut the long hours, endless marking,\nAnd the sense of living on autopilot wore me down.\n\nWalking away felt terrifying.\n\nBut staying felt worse.\n\nSo, I took the leap.\n\nI left the safety of a traditional career to start my own business.\n\nIt was hard. Scary. But freeing.\n\nHere’s what I learned:\n\n1. Starting over isn’t starting from scratch.\n↳ It’s starting with experience, clarity, and the courage to create something better.\n\n2. A career is meant to fit your life.\n↳ Not the other way around.\n↳ When you design your life first, the right path becomes obvious.\n\n3. If it feels wrong, it probably is.\n↳ Your gut is your best guide.\n↳ It knows what your mind hasn’t caught up to yet.\n\n4. Bold choices create fulfilling lives.\n↳ The magic doesn’t happen when you’re comfortable.\n↳ It happens when you step into the unknown.\n\n5. Sometimes, the hardest thing is waiting.\n↳ But settling for what feels “safe” often costs you what’s truly aligned.\n\nWaiting isn’t easy.\nBut settling for a career that doesn’t align with your vision will always leave you feeling stuck.\n\nWhat’s one bold step you’ve taken to create a life you love? \n\n️ Repost to help others who need the courage to take that next bold step in their career.\n\n If you’re ready to go all on LinkedIn, this is for you:\n\nI'm offering a free consultation call for you to get ahead.\nSign up here:\n\nFollowfor more actionable insights on career growth, personal development, and designing a life you truly love.",
      "reactions": {
        "likes": "397",
        "comments": "214 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Taking the time to align your career with your true purpose, instead of settling for what's comfortable, leads to more fulfillment and success in the long run.",
          "userName": "Damesha Craig, Leadership Coach and Startup Advisor",
          "userProfileURL": "https://www.linkedin.com/in/dameshacraig",
          "dataId": "urn:li:comment:(activity:7285653275226329088,7285657036049018882)"
        },
        {
          "commentText": "Couldn't agree more. Aligning your career with your true purpose brings so much more fulfillment. Thanks, Damesha Craig, Leadership Coach and Startup Advisor. ",
          "userName": "Véronique Barrot",
          "userProfileURL": "https://www.linkedin.com/in/veroniquebarrot",
          "dataId": "urn:li:comment:(activity:7285653275226329088,7285661962401660929)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7285672194519572480",
      "url": "https://www.linkedin.com/in/aditya-b-raghav-854020196?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAC3rxsABmoBo1W7fe7xXqFj1IhViTQ3h9kU",
      "name": "Aditya B. Raghav\nAditya B. Raghav",
      "content": "So Sad. It hurts my soul, whenever, I hear this. \n\n⭕ Your graduation or post-graduation degree university rarely matters. These degrees are just a letter to join as an employee of any top companies. Take an example ofearly corporate life or's early life. The organization, I am working, one of my friend, who is senior to me. He did his graduation degree from St. Paul University at Kolkata, did his post grad in some private university, but at just an age of 27 years, he is Senior Manager!!! College does not matter, where you will land in your corporate life, what really matters, is your behavior, your mindset and the change to power, you carry.\n\n⭕ I strongly advise to all Indian Parents, don't force your child to do engineering or doctor from IIT or NIT, AIIMS, instead your goal should be to brainstorm your child's mind, skill up, learn all latest skills in sports or career.\n\n⭕ Let me tell you, my story: From birth till my graduation, I was fumbled to speak, hesitant to be in crowd, poor in my academics, until my 12th. I never scored above 70 marks, silent and hide to all, in fact my parents also. But month after month, year after year, I learned, fall from my mistakes, scolded for my manner from my parents. But look, today I think, act and vision my task like an 'excellence strategist or founder'.\n\n\n⭕ Your degree, institutions, family background, net worth, rarely matters in your life. These are just a few pillars which our society have made and so much hyped it, that students like this young gentlemen.\n\nLastly toand all, why have we so much hyped on, so called 'Reservations'? Please, now stop this quota systems forever and let people, like him to rise above. ",
      "reactions": {
        "likes": "1",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": []
    },
    {
      "postId": "urn:li:activity:7285666762912604160",
      "url": "https://www.linkedin.com/in/krishnakirang?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAE8zYQBfa2YXjIfujz5uSYm1zup6Hu1aRc",
      "name": "Krishna Kiran\nKrishna Kiran",
      "content": "Pick one. Growing your character or an easy life.\n\nEither is not a wrong choice. But wanting both at the same time is the surprising reason for lot of avoidable misery.\n\nTo get one you pay with the other.\n\nJust pick one you truly want and go all in for the next 6 months. Then reassess.\n\nThe quality of your thinking = the quality of the ideas you consume.",
      "reactions": {
        "likes": "17",
        "comments": "1 comment",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Live Sessions: https://lnkd.in/gPu-YdPy\nSelf-Paced Workshops: https://lnkd.in/grVUWnQB",
          "userName": "Krishna Kiran",
          "userProfileURL": "https://www.linkedin.com/in/krishnakirang",
          "dataId": "urn:li:comment:(activity:7285666762912604160,7285674812172025858)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7285476823939858433",
      "url": "https://www.linkedin.com/groups/121615?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A121615-7285442971024461824",
      "name": "JavaScript\nJavaScript",
      "content": "Every time I encounter an error in my code, I do a push-up. At this rate, I'll have a six-pack and a chest to rival a bodybuilder! \n\nOn a serious note, debugging is an essential part of the development process. Each error is a learning opportunity, bringing me one step closer to cleaner, more efficient code. Persistence and resilience are key in both coding and fitness—it's all about continuous improvement.",
      "reactions": {
        "likes": "920",
        "comments": "21 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "This is both hilarious and inspiring!  At this rate, coding errors might just replace gym memberships. A healthy way to debug and stay fit!",
          "userName": "Davit Gasparyan",
          "userProfileURL": "https://www.linkedin.com/in/david-gasparian",
          "dataId": "urn:li:comment:(groupPost:121615-7285442971024461824,7285589782347288578)"
        },
        {
          "commentText": "Davit Gasparyan Becoming fit while writing the best code",
          "userName": "Mugambi Lewis",
          "userProfileURL": "https://www.linkedin.com/in/mugambi-lewis-64051332b",
          "dataId": "urn:li:comment:(groupPost:121615-7285442971024461824,7285606696599642112)"
        },
        {
          "commentText": "Mugambi Lewis,  ",
          "userName": "Davit Gasparyan",
          "userProfileURL": "https://www.linkedin.com/in/david-gasparian",
          "dataId": "urn:li:comment:(groupPost:121615-7285442971024461824,7285624643695091712)"
        },
        {
          "commentText": "So we should keep writing buggy code !",
          "userName": "Yawahang Rai",
          "userProfileURL": "https://www.linkedin.com/in/yawahang",
          "dataId": "urn:li:comment:(groupPost:121615-7285442971024461824,7285613550612398080)"
        },
        {
          "commentText": "Yawahang Rai Unless you want us to become body builders ",
          "userName": "Mugambi Lewis",
          "userProfileURL": "https://www.linkedin.com/in/mugambi-lewis-64051332b",
          "dataId": "urn:li:comment:(groupPost:121615-7285442971024461824,7285620407951368193)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7285712944682680320",
      "url": "https://www.linkedin.com/in/soban-raza?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADKb_DYB1StZrWMz3zY1qpjghQqNB-fu9dk",
      "name": "Soban Raza\nSoban Raza",
      "content": "There are two types of models.\n\nBeautiful models.\nAnd ...\n\nOh wait, I was supposed to talk about AI models.\n\n- White box models\n- Black box models\n\nExamples of black box models are GPT4o or Claude where you don't have access to the model weights.\n\nFor these models, one reliable way to evaluate their response is to use another evaluator model.\n\nYou can train these evaluator models to rank the original model's outputs on certain qualities, such as\n- Completeness\n- Conciseness\n- Relevance\n(If you're measuring reasoning for example).\n\nTo learn more about how to do that, read the link in the comments.",
      "reactions": {
        "likes": "7",
        "comments": "3 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "https://antedote.antematter.io/p/reasoning-about-reasoning-iii",
          "userName": "Soban Raza",
          "userProfileURL": "https://www.linkedin.com/in/soban-raza",
          "dataId": "urn:li:comment:(activity:7285708592853229568,7285708657130885121)"
        },
        {
          "commentText": "Interesting way of getting attention ",
          "userName": "Muhammad Hamza",
          "userProfileURL": "https://www.linkedin.com/in/muhammadhamza101",
          "dataId": "urn:li:comment:(activity:7285708592853229568,7285710862462390272)"
        },
        {
          "commentText": "Muhammad Hamza I am proud of it and not proud of it at the same time",
          "userName": "Soban Raza",
          "userProfileURL": "https://www.linkedin.com/in/soban-raza",
          "dataId": "urn:li:comment:(activity:7285708592853229568,7285711655584305152)"
        }
      ]
    }
  ],
  "errors": [
    {
      "postId": "urn:li:activity:7285649525845762048",
      "url": "https://www.linkedin.com/in/robertsjeff?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAeZvQUBybFX1rFWHMOHhOcZiZKlyH6HX5k",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285653272923643906",
      "url": "https://www.linkedin.com/in/theadampboyd?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAACKocEBPj0z4uEHAzd013N-f5ty27yCiIM",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285570581826084865",
      "url": "https://www.linkedin.com/in/saxenarajiv?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABxLikBsYhPfAZox0oCtbQcevMZFANTIyA",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285685859700408322",
      "url": "https://www.linkedin.com/in/jimfielden?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAJrVjgBaEuh8p1VHpzjpv1LTOwD2Ac2GY4",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285657068794003457",
      "url": "https://www.linkedin.com/in/veroniquebarrot?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAECMC0wBQseYZa4ZPmFaqdp3me6FWJi2Abg",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285672194519572480",
      "url": "https://www.linkedin.com/in/aditya-b-raghav-854020196?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAC3rxsABmoBo1W7fe7xXqFj1IhViTQ3h9kU",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285666762912604160",
      "url": "https://www.linkedin.com/in/krishnakirang?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAE8zYQBfa2YXjIfujz5uSYm1zup6Hu1aRc",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285476823939858433",
      "url": "https://www.linkedin.com/groups/121615?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A121615-7285442971024461824",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285712944682680320",
      "url": "https://www.linkedin.com/in/soban-raza?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADKb_DYB1StZrWMz3zY1qpjghQqNB-fu9dk",
      "errors": [
        "Failed to fetch media URL."
      ]
    }
  ]
}