{
  "posts": [
    {
      "postId": "urn:li:activity:7287886095667576833",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287886095667576833",
      "url": "https://www.linkedin.com/in/christopherstanford?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABc4aIgB_ZhsDldqdhzBrlLncpO2TnW2w-M",
      "name": "Christopher S.\nChristopher S.",
      "content": "Building the business case for \nhashtag\n#AI is no small feat. From calculating ROI to addressing objections, operations leaders face real challenges when advocating for AI adoption. But we’re here to help. Read the whitepaper.",
      "reactions": {
        "likes": "6",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Great insights! 🌟 Building a solid business case is crucial for successful #AI adoption. Excited to dive into the whitepaper for more details!"
    },
    {
      "postId": "urn:li:activity:7287614267577491456",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287614267577491456",
      "url": "https://www.linkedin.com/in/shelli-spence-cru?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADANnkB5ZpTVBZxrTGNPo5c-fpB_v-tKB8",
      "name": "Shelli K. Spence, CRU\nShelli K. Spence, CRU",
      "content": "\"Operations is boring. Sales is where the action's at!\"\n\nSaid someone who’s never seen elite ops in action.\n\nSure, ops doesn’t bring in revenue directly…\nBut without it, sales can’t deliver.\n\nA high-performing ops team is sexy as hell. Here’s why:\n→ Less chaos = higher morale.\n→ Efficient systems = more profits.\n→ Smooth workflows = fewer bottlenecks.\n→ Seamless processes make Sales look good.\n→ Execution becomes an art form; precision is hot.\n→ It attracts top talent; pros want a company that delivers.\n→ It creates happy clients. Happy clients mean more sales.\n\nBottom line?\n\nAs an ops leader, I've seen this firsthand:\n\nSales is the driver, but ops is the engine.\n\nWithout a well-oiled machine,\nEven the best driver can't win the race.\n\nHave you ever benefited from a rock star ops team? OR:\nOn the other hand, have you ever worked on one?",
      "reactions": {
        "likes": "48",
        "comments": "51 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "And product is everything… almost :)",
          "userName": "Jon Leslie 🔵",
          "userProfileURL": "https://www.linkedin.com/in/jondavidleslie",
          "dataId": "urn:li:comment:(activity:7287612434477920257,7287614263488086017)"
        },
        {
          "commentText": "Jon Leslie  In some ways yes (more \"dopamine hits\" in that kind of work), but in other ways, no. Like when a sale falls through.",
          "userName": "Shelli K. Spence, CRU",
          "userProfileURL": "https://www.linkedin.com/in/shelli-spence-cru",
          "dataId": "urn:li:comment:(activity:7287612434477920257,7287617521384407040)"
        }
      ],
      "commentAdded": "Absolutely! A stellar ops team fuels success. It’s the backbone that empowers sales to shine. Cheers to the unsung heroes of the business!"
    },
    {
      "postId": "urn:li:activity:7287791048938897408",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287791048938897408",
      "url": "https://www.linkedin.com/in/neil-sarkar?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABKnLrYBWIfe92kUUbuVo2pyeF57kK5ZyMY",
      "name": "Neil Sarkar\nNeil Sarkar",
      "content": "We talked to 50 sales teams and got an earful about their admin nightmares. Turns out, admin work isn’t just a headache—it’s a full-blown vibe killer. \n\nHere’s what they had to say:\n\n1. CRMs: Love-Hate Relationship: CRMs are supposed to help, but they often feel like a black hole for time and energy.\nOne rep confessed, “Updating the CRM is my Sunday night punishment for having a life.”\nAnother joked, “If I wanted to write essays, I’d go back to school.”\n\n2. Reports: The Weekly Slog Reports are the necessary evil everyone loves to hate. Sales reps spend hours making them look pretty for leadership.\n“I didn’t sign up to be a spreadsheet artist,” one rep sighed.\nThe average rep loses 6 hours a week to reporting—that’s a lot of coffee breaks lost.\n\n3. Manual Processes: Seriously? From commission calculations to approval requests, manual tasks are productivity killers. “Why are we doing this manually in 2025? Did automation skip our office?” the reps quipped.\n\n4. Collaboration Chaos Sales, CS, and Marketing: the Bermuda Triangle of communication.\nReps described it as “herding cats with different KPIs.”\n\nWhat’s the Fix? It’s not another overpriced SaaS tool or trust-fall exercises at the next offsite. The solution is better processes and smarter tools that actually save time.\n\nThat’s where we come in.\n\nAt, we design AI agents that seamlessly integrate with Salesforce to automate the mind-numbing stuff—like data updates, report generation, and manual approvals. So your team can stop being admins and start being closers.\n\nTAKEAWAY: Your sales team doesn’t need more pep talks or pizza parties. They need freedom from admin drudgery. Free them, and watch their productivity (and morale) skyrocket.\n\nWhat’s the admin task your team complains about the most? Drop it in the comments—unless you’re too busy updating your CRM.",
      "reactions": {
        "likes": "8",
        "comments": "1 comment",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "One of my favorite interview questions is “what’s your opinion of CRM systems?” It’s purposefully open ended. \n\nIn regards to reporting, alignment on core KPI’s from the c suite to the sales rep is important. There a a lot of inefficiencies that arise when different levels of the org are evaluating different data points.",
          "userName": "Brian Soudant",
          "userProfileURL": "https://www.linkedin.com/in/briansoudant",
          "dataId": "urn:li:comment:(activity:7287791048938897408,7287793929997987840)"
        }
      ],
      "commentAdded": "Great insights! Its time we prioritize efficiency and let our sales teams focus on what they do best—closing deals! Whats your teams biggest admin hurdle?"
    },
    {
      "postId": "urn:li:activity:7287861569428865025",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287861569428865025",
      "url": "https://www.linkedin.com/in/sweatystartup?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABuK9UABrBqqHNStzFRDtgknb5hJ9zX5Fl4",
      "name": "Nick Huber\nNick Huber",
      "content": "If you aren’t rich, every single business you start needs to be cashflow positive within two months.\n\nIf it isn’t, go get a job working for somebody who knows how to make money or a rich person with a big idea.\n\nSounds silly but this is why most people fail. Poor early decisions.",
      "reactions": {
        "likes": "45",
        "comments": "16 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Solid advice—early cash flow is the lifeline of any new business, especially without a safety net. Learning from those who’ve mastered the game is a shortcut to gaining valuable insights and avoiding costly mistakes.",
          "userName": "Ari Loeb",
          "userProfileURL": "https://www.linkedin.com/in/ari-loeb-9501b01b9",
          "dataId": "urn:li:comment:(activity:7287831463532642304,7287884734938972161)"
        },
        {
          "commentText": "What keeps my business sustainable is not assuming success too early.\n\nI don’t calculate how much I could make if I quit my job right now.\nInstead, I’m waiting for my business to completely replace, or exceed my day job income before making that move.",
          "userName": "Jamal Marshall",
          "userProfileURL": "https://www.linkedin.com/in/jamal-marshall-969738343",
          "dataId": "urn:li:comment:(activity:7287831463532642304,7287885066037260290)"
        }
      ],
      "commentAdded": "Great insight! Early cash flow is crucial to sustainability. Learning from others can lead to better decision-making and eventual success."
    },
    {
      "postId": "urn:li:activity:7287455145880125440",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287455145880125440",
      "url": "https://www.linkedin.com/in/jasondbay?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAALMmvEB8ydb7nIx2qecEofDJaaKftLOivA",
      "name": "Jason Bay\nJason Bay",
      "content": "Sure, cold email is hard right now. \n\nBut dude, we gotta stop playing the blame game. \n\nIt's not because of poor deliverability rates. It's not because of spam filters. And it's not because people don't use email anymore.\n\nIt's because your email probably sucks. You use copy/paste templates. Sending the same emails to multiple people with different jobs.\n\nAnd not personalizing.\n\nWhat do you expect to happen?\n\nAlright, rant over. Let's talk about what to do about it.\n\nLesson today: Make sure your emails are \"mobile ready.\"\n\nhas some great data on cold emails:\n\n- Prospects are 8x more likely to open emails on their phone\n- Short and mobile-optimized emails see 83% more replies\n- Emails under 50 words get 60% more replies than emails with 150+ words\n\nIf your emails aren’t short and mobile-optimized, you will not likely get a response.\n\n- Word count: Keep emails under 75 words\n- Mobile ready: Use short, 1-2 sentence paragraphs\n\nThe basic formula looks like this:\n\n Reason: Why you’re reaching out to the prospect\n Problem: Speaks to the prospect’s potential problem(s)\n Social proof: References relevant work with similar companies\n Call-To-Action (CTA): Speaks to prospect’s priorities and problems\n\n===\n\nExample #1: A company that sells electronic document capture software to clinical operations leaders\n\nSubject line variations:\n- FAPI\n- Startup timelines\n- FDA approval\n\nHi Frank,\n\nReason  Saw that you just got FDA approval to proceed with the Fibroblast Activation Protein Inhibitor (FAPI) clinical trial.\n\nProblem  As you launch this trial, we usually hear that manual paper systems and Excel databases create extra work that could delay startup dates.\n\nSocial Proof  We’re helping operations leaders capture trial data more easily to shorten startup timelines to under 4 weeks.\n\nCTA  Worth a quick chat?\n\nJason\n\n===\n\nExample #2: A company that sells software to help contact centers reduce incoming calls\n\nSubject: Interconnection cost reduction\n\nReason  Saw the announcement of the interconnection cost reduction initiative, Anne.\n\nProblem  Usually, that means there’s a focus on reducing incoming support calls and pushing customers to self-serve. Support leaders oftentimes run into challenges knowing which digital investments are actually deflecting calls.\n\nSocial Proof  We helped Constellation dramatically reduce cost to serve by finding the sources of increased call volumes.\n\nCTA  Can I share those insights with you?\n\n\n===\n\n\nYou can't get away with mediocre cold emails anymore.\n\nTighten up your message. Optimize for mobile. And invest more time to improve your copywriting skills.\n\nTomorrow, I'm partnering up withto teach the Cold Email playbook we've taught to AE/SDR teams at Shopify, Gong, Rippling, Zoom, and many more.\n\nRegister here to join us:",
      "reactions": {
        "likes": "239",
        "comments": "39 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "I’m starting to disagree. Outbound is more about not sounding like every other salesperson than applying best practices.\n\nSingle line sentences + specific detail in every line will become the new gold standard - BC this is where AI struggles",
          "userName": "Mike Isernio",
          "userProfileURL": "https://www.linkedin.com/in/mike-isernio-0135b07b",
          "dataId": "urn:li:comment:(activity:7287455145880125440,7287463461079429120)"
        },
        {
          "commentText": "Mike Isernio it's definitely both",
          "userName": "Jason Bay",
          "userProfileURL": "https://www.linkedin.com/in/jasondbay",
          "dataId": "urn:li:comment:(activity:7287455145880125440,7287491839434055680)"
        },
        {
          "commentText": "This is a solid framework to start with. I hope more sellers prospect see this",
          "userName": "Alex Newmann",
          "userProfileURL": "https://www.linkedin.com/in/alexnewmann",
          "dataId": "urn:li:comment:(activity:7287455145880125440,7287483567335460864)"
        },
        {
          "commentText": "Alex Newmann thanks",
          "userName": "Jason Bay",
          "userProfileURL": "https://www.linkedin.com/in/jasondbay",
          "dataId": "urn:li:comment:(activity:7287455145880125440,7287491618734047232)"
        }
      ],
      "commentAdded": "Great insights! Personalization and brevity are key. Excited to see the Cold Email playbook in action—thanks for sharing this valuable info! 🚀"
    },
    {
      "postId": "urn:li:activity:7287822058934173696",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287822058934173696",
      "url": "https://www.linkedin.com/in/daniel-goodman2001?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAeS6L0BdHsGXRto-nWwwPVPt8hNYJ4niZI",
      "name": "Dan Goodman\nDan Goodman",
      "content": "From HR Troll to client referral. I had a full circle moment. \n\nI post regularly about deceitful HR practices to warn unsuspecting and trusting employees not to be taken advantage of.\n\nHR and many in leadership don’t like it. I am exposing their wrongful and harmful practices, making it harder for them to get away with it. Encouraging people to stand up to it. To call it out and expose it and the people doing it.\n\nAs a result, I get some pretty ridiculous and insulting comments from these supposed leaders. We can all see right through what their intent is. They never address the point of the post, rather questioning my motivation, my experience, or how often it actually happens, rather than the fact that it happens at all.\n\nAnyway, I digress. I had a full circle moment when I got a private DM from an HR person who on occasion gives me a hard time on my posts. Which BTW when done with respect and logic is welcomed and appreciated.\n\nMy new HR friend was friendly with a female VP at her company who was being mistreated by their employer. She reached out to me to help her get a better severance offer and stand up against the wrongdoing.\n\nIt just goes to show, the people protecting their turf know what really goes on, whether they want to admit it or argue the opposite for the sake of protecting their turf.\n\nThey know how bad it is, they’ve seen it happen or been forced to do it repeatedly.\n\nPretty wild stuff. From HR troll to referral.",
      "reactions": {
        "likes": "129",
        "comments": "25 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "you post about deceitful HR practices then blast this for all to comment and talk about on LinkedIn - Just curious but do ytou know what Confidential means?",
          "userName": "Anthony Mendoza",
          "userProfileURL": "https://www.linkedin.com/in/anthonysmendoza",
          "dataId": "urn:li:comment:(activity:7287822058934173696,7287877215977943041)"
        },
        {
          "commentText": "I feel like HR gets a bad rap. HR is sent to do the C levels dirty work.. and this just proves it! ",
          "userName": "Denise Cushaney",
          "userProfileURL": "https://www.linkedin.com/in/cushaney",
          "dataId": "urn:li:comment:(activity:7287822058934173696,7287837437530185729)"
        }
      ],
      "commentAdded": "Incredible journey! Your courage to expose HR issues can truly empower others. Heres to standing up for whats right! 💪✨ #ChangeMaker"
    },
    {
      "postId": "urn:li:activity:7287886969945145345",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287886969945145345",
      "url": "https://www.linkedin.com/in/andmoreira?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAppuI0BSuTcPP5d5bhLoZ97Y5bqeKOyKZk",
      "name": "Anderson Moreira\nAnderson Moreira",
      "content": "Oracle's latest set of \nhashtag\n#AI agents are designed to help sales teams streamline processes and focus more on the customer. Reuters has the details:",
      "reactions": {
        "likes": "2",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Exciting developments! These AI agents could truly revolutionize sales strategies and enhance customer relationships. Looking forward to seeing the impact!"
    },
    {
      "postId": "urn:li:activity:7287858820033257474",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287858820033257474",
      "url": "https://www.linkedin.com/in/richeleblack?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAByccoBGlw2yRT5jhFqjHqLVKbxkV96JtQ",
      "name": "Richele Black 🥕\nRichele Black 🥕",
      "content": "A few weeks ago, a leader asked me to look at his writing.\n\nOn the surface, it checked all the boxes:\n\n It read smoothly.\n It showcased his expertise.\n It looked polished and professional.\n\nBut as I reviewed his words, I realized something important was missing…\n\n️ HEART\n\nWhen he spoke about his work, you could hear the passion in his voice.\n\nBut on “paper”? It was nowhere to be found.\n\n_____\n\nThis is a common pitfall for many B2B leaders.\n\nThey stick to the basics:\n\n🟠 We’re raising more funding\n🟠 We’re speaking at this conference\n🟠 We’re introducing these new product features\n\nBut they often leave out the human side — stories, experiences, or insights like:\n\n🟠 The problem the funding will help solve\n🟠 The customer challenge that sparked their conference talk\n🟠 The groundbreaking research that drove them to expand their solution\n\n______\n\nHere’s why the “just the facts” approach falls short:\n\nPeople buy with emotion. Then, justify with facts.\n\nIf your content doesn’t make people feel something, it won’t inspire them to act.\n\nAnd that means it won’t help you achieve your goals.\n\n______\n\nOnce I explained this to the leader, he made a few simple changes:\n\n Added a real-world example\n Shared a behind-the-scenes moment\n Highlighted a relevant customer success story\n\nJust like that, his straightforward info turned into a compelling narrative that made his content much more interesting and persuasive.\n\n_____\n\nRemember, your goal isn’t just to share what you’ve accomplished.\n\nIt’s to inspire your audience to take action.\n\nSo, the next time you create content, don’t stop at the facts.\n\nBring in the heart ️\n\nBecause facts alone don’t win customers.\n\n______\n\nP.S. What's one way you bring more heart into your writing? Let me know in the comments.",
      "reactions": {
        "likes": "5\nAuroriele Hans and 4 others",
        "comments": "3 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "So true! A founder shared what confidence meant to her the other day, and it moved me, inspiring me to be strong during this challenging time for SaaS.",
          "userName": "Auroriele Hans",
          "userProfileURL": "https://www.linkedin.com/in/auroriele-hans-b2b-saas-email-strategist-and-conversion-copywriter",
          "dataId": "urn:li:comment:(activity:7287857126377435136,7287858772423720960)"
        },
        {
          "commentText": "Love this, Auroriele Hans!",
          "userName": "Richele Black 🥕",
          "userProfileURL": "https://www.linkedin.com/in/richeleblack",
          "dataId": "urn:li:comment:(activity:7287857126377435136,7287859469202399233)"
        }
      ],
      "commentAdded": "Absolutely love this perspective! Adding heart transforms messages and drives genuine connections. Storytelling is key! 💡❤️ #Inspiration"
    },
    {
      "postId": "urn:li:activity:7287833529810337792",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287833529810337792",
      "url": "https://www.linkedin.com/in/michal-choinski-49373112a?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAB_JsG8B8ml_6hEUq3duUXz9bAtdk6PPF_I",
      "name": "Michał Choiński\nMichał Choiński",
      "content": "Consistent planning and performance monitoring is a leverage for growth  \n\nOn the beginning of the year we have reviewed our Q4 2024 delivery and concluded 2024 for Digital Experience Tribe in. Quarter PI Planning is a great platform for summary and review our performance . End of the year is great opportunity to summarize our last year achievement. Let’s share a bit of our key results for 2024:\n\n First Introduction our new One View application that will support all sales and care processes for individual clients and small businesses\n Extension of our fix internet coverage up to 10 mio householed by cooperation and integration withand\n Changes enhancing Magenta Home experience by boosting WiFi coverage, network security and TV multiroom functionality\n Changes enhancing roaming experience\n Our OneApp team engagement and adjustments help reach 1 mio 400 tho. active clients in Magenta Moments loyalty program\n Adjusting our processes, functionalities to Electronic Communication Law (PKE)\n Migration all most important applications to the AWS cloud\n 300% more application production releases\n… and many, many more bigger and smaller functionalities that are improving life of our clients and work of our teams \n\nIt was exciting year in which we were supporting our commercial efforts and transformation programs. In the same time we were improving our Agile at Scale and DevOps practices ️\n\nIt wouldn’t be possible without our leadership Team:,,,, Maciej Ciemny,,,,,, Flaga Dariusz,,,,, Paziewski Adam,,,,,,,,,,,,,,,,,,,,,,Wiśniecka Aleksandra and ALL Tribe members.\n\nThank you for your great daily effort and contribution. \nIt's a pleasure to be part of\n️‍\n\n@Scale",
      "reactions": {
        "likes": "53",
        "comments": "23 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "   ",
          "userName": "Nerea Arregui Exposito",
          "userProfileURL": "https://www.linkedin.com/in/nereaarreguiqa",
          "dataId": "urn:li:comment:(ugcPost:7287796665850155008,7287833526178054145)"
        },
        {
          "commentText": "Nerea Arregui Exposito ",
          "userName": "Michał Choiński",
          "userProfileURL": "https://www.linkedin.com/in/michal-choinski-49373112a",
          "dataId": "urn:li:comment:(ugcPost:7287796665850155008,7287886069088292866)"
        }
      ],
      "commentAdded": "Incredible achievements! 🎉 Your teams dedication to enhancing digital experiences is truly inspiring. Excited to see what’s next! 🚀"
    },
    {
      "postId": "urn:li:activity:7284456639384985601",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7284456639384985601",
      "url": "https://www.linkedin.com/in/beerbiceps?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABRvDGgBUDKf31KasHdmgvySw4Pen6ybAes",
      "name": "Ranveer Allahbadia\nRanveer Allahbadia",
      "content": "One of modern day football's icons - İlkay Gündoğan appears on an Indian podcast, The Ranveer Show.\n\nIn my eyes, this one is for INDIAN FOOTBALL. Hope this conversation furthers football culture in our beautiful country.\n\nBut of course, if you're a fan of European football, like so many of us... this conversation is a deep dive into the mind of a world class baller.\n\n-Germany national team captain.\n-Man City, Borussia Dortmund & FC Barcelona Legend.\n-Champions league winner.\n-Part of a treble winning team (League champs, European Champs and National Cup champs... happens very rarely in football)\n\nBut what are his vulnerabilities?\nHow has he gotten so far as a professional athlete?\nHow does a day in his life look like?\nHow's men's mental health evolving in world football?\n\nA must watch conversation for football fans as well as podcast listeners globally.\n\nThe plan is to further collaborate with Manchester City & other premier league clubs.\n\nDo spread the word, wish to make football mainstream in our homeland!\n\nWatch now, onpodcast:",
      "reactions": {
        "likes": "2,262",
        "comments": "54 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "An inspiring conversation! It's great to see efforts towards growing football culture in India and sharing insights from world-class athletes.",
          "userName": "Asti Infotech ",
          "userProfileURL": "https://www.linkedin.com/company/asti-infotech-pvt-ltd/posts",
          "dataId": "urn:li:comment:(ugcPost:7284425507322957824,7284524857076170753)"
        },
        {
          "commentText": "A Game-Changer for Indian Football\nThe appearance of İlkay Gündoğan, a modern-day football icon, on an Indian podcast is a monumental moment—not just for football enthusiasts but for the future of the sport in our country.\nThis conversation bridges the gap between Indian and global football, offering a rare glimpse into the life of a true legend. From captaining the German national team to leaving a legacy at clubs like Manchester City, Borussia Dortmund, and FC Barcelona, Gündoğan has achieved what many only dream of. Yet, this podcast isn’t just about his triumphs; it’s a deep dive into his vulnerabilities, his mental resilience, and what it truly takes to stay at the pinnacle of world football.\nIt’s an inspiration for aspiring footballers in India and a step toward building a vibrant football culture in our homeland. By showcasing such profound discussions, we’re not just celebrating a legend but setting the stage for collaborations with Premier League clubs and global powerhouses like Manchester City.\nLet’s spread the word and make football mainstream in India, uniting fans and players alike under one beautiful game. This isn’t just a podcast—it’s a movement.",
          "userName": "sanjeev sona",
          "userProfileURL": "https://www.linkedin.com/in/sanjeev-sona-a94926340",
          "dataId": "urn:li:comment:(ugcPost:7284425507322957824,7284458897296269313)"
        }
      ],
      "commentAdded": "Exciting to see İlkay Gündoğan share his insights! This is a fantastic step towards elevating Indian football. 🌟⚽ #FootballForAll"
    }
  ],
  "errors": [
    {
      "postId": "urn:li:activity:7287886095667576833",
      "url": "https://www.linkedin.com/in/christopherstanford?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABc4aIgB_ZhsDldqdhzBrlLncpO2TnW2w-M",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287614267577491456",
      "url": "https://www.linkedin.com/in/shelli-spence-cru?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADANnkB5ZpTVBZxrTGNPo5c-fpB_v-tKB8",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287791048938897408",
      "url": "https://www.linkedin.com/in/neil-sarkar?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABKnLrYBWIfe92kUUbuVo2pyeF57kK5ZyMY",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287861569428865025",
      "url": "https://www.linkedin.com/in/sweatystartup?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABuK9UABrBqqHNStzFRDtgknb5hJ9zX5Fl4",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287455145880125440",
      "url": "https://www.linkedin.com/in/jasondbay?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAALMmvEB8ydb7nIx2qecEofDJaaKftLOivA",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287822058934173696",
      "url": "https://www.linkedin.com/in/daniel-goodman2001?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAeS6L0BdHsGXRto-nWwwPVPt8hNYJ4niZI",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287886969945145345",
      "url": "https://www.linkedin.com/in/andmoreira?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAppuI0BSuTcPP5d5bhLoZ97Y5bqeKOyKZk",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287858820033257474",
      "url": "https://www.linkedin.com/in/richeleblack?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAByccoBGlw2yRT5jhFqjHqLVKbxkV96JtQ",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287833529810337792",
      "url": "https://www.linkedin.com/in/michal-choinski-49373112a?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAB_JsG8B8ml_6hEUq3duUXz9bAtdk6PPF_I",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7284456639384985601",
      "url": "https://www.linkedin.com/in/beerbiceps?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABRvDGgBUDKf31KasHdmgvySw4Pen6ybAes",
      "errors": [
        "Failed to fetch media URL."
      ]
    }
  ]
}