[
  {
    "postsData": [
      {
        "postId": "urn:li:activity:7289703730843656192",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289703730843656192",
        "url": "https://www.linkedin.com/in/ezxpo?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAIjGYB6b_NDVVPDgshQzRZBv-z3gmsaT0",
        "name": "Matt Fok\nMatt Fok",
        "content": "The Power of Collaboration Like Never Before  \n \nSynergy AI stands apart with its Smart Community collaboration, ensuring everyone grows together.\n\n Key Benefit No One Matches:\nStakeholders share resources, insights, and opportunities to achieve success faster and smarter.\n\n Why It’s Revolutionary:\n\nEliminates siloed operations.\nMagnifies visibility and impact for every member.\nOffers a network effect that drives collective growth.\n\n Be part of this next-gen AI-powered collaboration!",
        "reactions": {
          "likes": "0",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Absolutely love this approach! Collaborative synergy is the future of innovation—let’s harness our collective strengths for greater success! 🚀"
      },
      {
        "postId": "urn:li:activity:7289701437834416129",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289701437834416129",
        "url": "https://www.linkedin.com/in/beccapchambers?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAG09JIBBwFH88CYYSQNJUGA5q_v0d--Yyc",
        "name": "Becca Chambers ✨\nBecca Chambers ✨",
        "content": "Another sign of how tough the job market is right now?\n\nSo many people I know won’t even apply to jobs unless they have an internal reference or someone to make an intro for them.\n\nJobs they’re not only qualified for—but genuinely excited about.\n\n\n\nAnd they’re not wrong, either.\n\nAs I’ve been searching for my next full-time role, I’ve found myself doing the exact same thing.\n\nI’ll see an interesting job, and if I don’t know someone who works there, the first thing I do is check LinkedIn to see if I’m connected to anyone who can refer me to someone who does.\n\nIf I can’t make the connection, I move on. I don’t even apply—to roles I’d crush.\n\n\n\nIt’s not because I’m a quitter. It’s because when there are 1,500 applicants for VP or C-level roles, it feels almost impossible to stand out.\n\nAnd that’s incredibly depressing because it means:\n\n1️⃣ Job seekers are too discouraged to even apply to roles they’d thrive in.\n\n2️⃣ Companies are missing out on incredible talent because people feel like their resumes will disappear into a black hole.\n\nLose-lose.\n\n\n\nWhat can job seekers do in this reality when they find a job they’re a great fit for but don’t have a connection—besides skipping over opportunities they’d typically pursue?\n\nIf you’re like me, you double down and reach out to *every corner* of your network:\n\n️ Leverage 2nd-degree connections. Find someone in your network who can introduce you to an employee at the company. Many companies offer great incentives for referrals, so even folks who don’t know you personally may be happy to refer you.\n\n️ Use LinkedIn’s “People” search feature. Identify employees at the company and send personalized connection requests. Mention the role you’re excited about, and ask if they’d be open to a quick chat about their experience there. Genuine curiosity can go a long way.\n\n️ Reach out directly to the hiring manager. Send a note explaining why you’d be a great fit and what excites you about the role. As someone who’s hired for many positions, I can tell you that a thoughtful, personality-filled message that’s relevant to the role will absolutely stand out.\n\n\n\nThe crappy reality is that in today’s market, your network really is everything—no matter how amazing you are at your job—so lean on it AND keep building it.\n\n(And while not the focus of this post, this also underscores the importance of building your personal brand—now more than ever.)\n\nGood luck out there, jobseekers. I feel your pain. This market is unlike anything else.\n\n",
        "reactions": {
          "likes": "153",
          "comments": "35 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "In my most recent search, (which took nearly 3 months) I did not have a single interview without having a reference or better. Not one application submitted resulted in even an initial interview. Applying for open positions is not how we get roles anymore.",
            "userName": "William (Wil) Klusovsky",
            "userProfileURL": "https://www.linkedin.com/in/wilklu",
            "dataId": "urn:li:comment:(activity:7289690609416630273,7289692822604005377)"
          },
          {
            "commentText": "William (Wil) Klusovsky yep. Same! And even sometimes with a reference, I’d get an auto-rejection before even a screener call—make it make sense!",
            "userName": "Becca Chambers ✨",
            "userProfileURL": "https://www.linkedin.com/in/beccapchambers",
            "dataId": "urn:li:comment:(activity:7289690609416630273,7289693301568339968)"
          },
          {
            "commentText": "William (Wil) Klusovsky Networking is the key. Networking is the key. Networking is the key…..",
            "userName": "Robert Fortner, CISSP",
            "userProfileURL": "https://www.linkedin.com/in/robert-fortner-1054b051",
            "dataId": "urn:li:comment:(activity:7289690609416630273,7289695505515782146)"
          },
          {
            "commentText": "Bang on! If you're not walked into the interview process, don't bother. That seems to be the message, sadly. So the question begs: how valuable is LinkedIn as a job board resource? ",
            "userName": "Chris Heinemann",
            "userProfileURL": "https://www.linkedin.com/in/chrisheinemann",
            "dataId": "urn:li:comment:(activity:7289690609416630273,7289691601050734592)"
          },
          {
            "commentText": "Chris Heinemann it’s still the best way to network, no question. So that alone makes it valuable. Hiring game is definitely changing, I hope someone is able to come disrupt that market in a positive way.",
            "userName": "Becca Chambers ✨",
            "userProfileURL": "https://www.linkedin.com/in/beccapchambers",
            "dataId": "urn:li:comment:(activity:7289690609416630273,7289692220998209536)"
          }
        ],
        "commentAdded": "Absolutely! Leveraging your network is key in today’s market. Its all about connections. Lets keep supporting each other! 💪 #JobSearch #Networking"
      },
      {
        "postId": "urn:li:activity:7289702582351015936",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289702582351015936",
        "url": "https://www.linkedin.com/in/garettm?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAxhx8oBrMrQ4Rb6q9ZLv7KibK_ydWLFZCE",
        "name": "Garett Moreau 🇺🇸\nGarett Moreau 🇺🇸",
        "content": "BREAKING:  DeepSeek, the rising AI star, hit by a \"large-scale malicious\" cyberattack!  \n\nNew user registrations disrupted.",
        "reactions": {
          "likes": "0",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Such a tough situation for DeepSeek! Cybersecurity is more crucial than ever in todays digital landscape. Wishing the team a swift recovery!"
      },
      {
        "postId": "urn:li:activity:7289702278305853441",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289702278305853441",
        "url": "https://www.linkedin.com/in/yarocelis?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAHEm9EBv2iwPw2Xrew4Hq7KE7qWEBazObQ",
        "name": "Yaro Celis\nYaro Celis",
        "content": "Monday Update Fellow Readers, A lot to unpack today! \n\nU.S. military planes carrying undocumented immigrants have been landing in Latin America, creating tensions between the U.S. and local governments, we will dive into the tech arsenal powering this immigration enforcement.\n\nMeanwhile, China has developed an artificial sun, capable of meeting the growing energy demands of AI technologies and data centers. Don’t miss our AI Tools and Trends section for more details, and feel free to share your thoughts!!",
        "reactions": {
          "likes": "0",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Fascinating developments! The intersection of immigration and tech is crucial. Excited to hear more about the AI tools powering these changes!"
      },
      {
        "postId": "urn:li:activity:7289702978616250368",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289702978616250368",
        "url": "https://www.linkedin.com/in/sanghamitradhar?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAc1IpQB3RM8JvGHmzWa58a67FKfcPl1Eo8",
        "name": "Sanghamitra D.\nSanghamitra D.",
        "content": " 𝐘𝐨𝐮 𝐀𝐬𝐤𝐞𝐝 𝐟𝐨𝐫 𝐅𝐞𝐞𝐝𝐛𝐚𝐜𝐤... 𝐍𝐨𝐰 𝐖𝐡𝐚𝐭? \nLet’s face it: asking for criticism sounds brave. But how you react to that criticism? That’s the real test of character (and your sense of humor).\n\nHere’s the thing: The way you ask for feedback and react to it can either build trust or burn bridges faster than a bad stock tip.\n\n Don’t Be That Person:\n\n1️⃣ The \"Fishing for Compliments\" Critic Seeker\nYou ask for feedback but only expect praise. When someone points out a real flaw, suddenly it's, \"Oh, that's just your opinion!\"\n2️⃣ The \"Defensive Defender\"\nSomeone gives thoughtful criticism, and you jump into \"No, but let me explain why you’re wrong\" mode. (Pro tip: Don’t.)\n3️⃣ The Vanisher\nYou ask for feedback and disappear the moment it gets uncomfortable. Ghosting isn’t for professional relationships!\n\n How to Nail It:\n\n1️⃣ Be Clear About What You Want\nInstead of \"What do you think?\" try, \"Can you tell me how this could be better?\"\n2️⃣ Listen Without Arguing\nYes, it stings. Yes, it’s awkward. But stay quiet, take notes, and save the rebuttals for your imaginary shower arguments later.\n3️⃣ Show Gratitude (Even If You’re Crying Inside)\n\"Thank you for your honesty!\" is a lot more productive than \"You just don’t get my genius.\"\n\nWhy It Matters:\n\nReacting well to feedback doesn’t just make you seem more professional—it builds trust. When people see you can handle tough truths without throwing tantrums, they’re more likely to:\n\nRespect your leadership.\nTrust you with more responsibility.\nTell you when your PowerPoint font choices are actually horrible.\n\n Remember:\n\nFeedback isn’t personal—it’s like spinach. You might not love it, but it’s good for you (and everyone will notice if you keep avoiding it).\n\n What’s the best—or worst—reaction to criticism you’ve ever seen? Let’s laugh or learn in the comments!",
        "reactions": {
          "likes": "24",
          "comments": "2 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "It's common to fall into the trap of seeking only praise, but feedback, especially constructive criticism, is where real value lies. Once we receive the feedback, resist the urge to be defensive. No one likes to hear they're not perfect but listening attentively without arguing shows maturity and a willingness to learn (active listening!!). It's tough, but embracing criticism as a tool for improvement is key.",
            "userName": "Leandro Siqueira",
            "userProfileURL": "https://www.linkedin.com/in/leandrocsiqueira",
            "dataId": "urn:li:comment:(activity:7289698001776783360,7289699517858258944)"
          }
        ],
        "commentAdded": "Great insights! Embracing feedback can truly transform our growth. Let’s keep the conversation going—what tips do others have for handling criticism?"
      },
      {
        "postId": "urn:li:activity:7289591020952920065",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289591020952920065",
        "url": "https://www.linkedin.com/in/mayank-qa?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAROVO0Byyl18SqKC0uWiTqzYxQsW2nifHs",
        "name": "Mayank S.\nMayank S.",
        "content": "How do great Project Managers succeed? \n\nThey connect, adapt, and deliver value.\n\nProject management isn’t just about tasks,\n\nit’s about aligning goals with stakeholder needs.\n\nHere’s how you can lead with impact:\n\n1️⃣ Speak Their Language\n\nExecutives care about ROI, risk, and timelines.\nExample: Highlight how a new feature saves $100K annually.\nEnd-users focus on functionality and workflows.\n\nExample: Show how an updated process reduces their workload.\nVendors want clear milestones and deliverables.\nExample: Share specific deadlines and expectations upfront.\n\n2️⃣ Tailor Communication\n\nAvoid jargon; simplify complex ideas.\nExample: Instead of “improved infrastructure scalability,” say “it handles 3x more users now.”\n\nEmphasize what matters to each group.\nExample: For executives, lead with key metrics; for end-users, explain benefits in daily tasks.\n\n3️⃣ Foster Trust Through Action\n\nStay transparent and deliver consistently.\nExample: Provide regular updates and address issues before they escalate.\nShow that their input matters.\n\nExample: Incorporate feedback from end-users into the final product.\n\n4️⃣ Drive Alignment\n\nConnect everyone to the shared goal.\n\nExample: “Here’s how your work contributes to the company saving $500K this year.”\n\nGreat PMs don’t just manage,\nthey inspire.\n\nWhen you adapt, connect, and deliver value, you turn projects into success stories.\n\nDrop a ️ if you like this post.\nLet me know your thoughts in the comments.",
        "reactions": {
          "likes": "2",
          "comments": "2 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Great project managers succeed by prioritizing clarity and empathy. Aligning stakeholders, simplifying communication, and delivering consistent results create trust and drive outcomes. A focus on shared goals is what truly inspires teams to excel.",
            "userName": "Nerea Arregui Exposito",
            "userProfileURL": "https://www.linkedin.com/in/nereaarreguiqa",
            "dataId": "urn:li:comment:(activity:7289544876575133697,7289591015978504194)"
          },
          {
            "commentText": "Nerea Arregui Exposito So accurate!!\nAll the things you mentioned are on point.",
            "userName": "Mayank S.",
            "userProfileURL": "https://www.linkedin.com/in/mayank-qa",
            "dataId": "urn:li:comment:(activity:7289544876575133697,7289657852833533952)"
          }
        ],
        "commentAdded": "Great insights on project management! Adapting communication and fostering trust truly transform how we lead projects. #Inspiration #Leadership"
      },
      {
        "postId": "urn:li:activity:7289702078065635328",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289702078065635328",
        "url": "https://www.linkedin.com/in/fusionphotog?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAB6zI2kBVGMkhYroYDZhWc09HO2DtALECs8",
        "name": "Deevo Tindall\nDeevo Tindall",
        "content": " New Podcast Episode Alert! \n\nMastering Wealth: Income Independence and Smart Investing \n\nOn this episode of The Branding Laboratory, I had the privilege of speaking with, a seasoned investment coach, entrepreneur, and author of Retirement Money Secrets. With over 40 years in the investment industry,shares his fascinating journey and the principles that have guided him to success.\n\n’s story is a masterclass in blending smart investing with impactful branding. Whether you’re a seasoned investor, entrepreneur, or simply looking to take control of your financial future, this episode will inspire and challenge you to think differently about wealth generation.\n\n Listen now! Link in bio.\n Don’t forget to follow, share, and leave your thoughts in the comments. Let’s keep the conversation going!",
        "reactions": {
          "likes": "0",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/d12a8ae9-c2b9-45bb-afff-c276fe0cbfe4",
        "comments": [],
        "commentAdded": "Excited to hear this episode! Blending investment strategies with branding insights is key for financial success. Cant wait to dive in! 🎧💰"
      },
      {
        "postId": "urn:li:activity:7289701127506247681",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289701127506247681",
        "url": "https://www.linkedin.com/in/greg-coquillo?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAPVK1IBJrwyQVly8u2I2FsDHlmOnzGWdr4",
        "name": "Greg Coquillo\nGreg Coquillo",
        "content": "I hope that, with the release of DeepSeek R1, and its proven capabilities to beat ChatGPT on many tasks, we will go back to using deep research to continue to make LLMs better, instead of hyping it up with superficial buzzwords.\n\nHere’s an awesome openbook from Tong Xiao and Jingbo Zhu that I think will help people leverage First Principle Thinking to breakdown complex problems that exist today with LLMs, into smaller digestible gaps, so they can redesign or rebuild from the ground up.\n\nThis is what makes AI cheaper long-term and more accessible to everyone. Race to the bottom is a natural course of technology.\n\nFoundations of Large Language Models explores basics concepts of LLMs such as:\n\nPre-Training methods and model architectures\nBuilding models and scaling to train\nPrompting strategies, like chain-of-thought\nAlignment methods, like RLHF\n\nDo enjoy this one! Looking forward to seeing how researchers continue to disrupt the status quo!",
        "reactions": {
          "likes": "26",
          "comments": "5 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "this perspective is refreshing! foundations are key to sustainable ai advancements.  ",
            "userName": "DataInsta",
            "userProfileURL": "https://www.linkedin.com/company/datainsta/posts",
            "dataId": "urn:li:comment:(ugcPost:7289698398499221505,7289699786088202241)"
          }
        ],
        "commentAdded": "Excited for DeepSeek R1s potential! Diving deep into LLM research is key for meaningful advancements. Thanks for sharing this resource!"
      },
      {
        "postId": "urn:li:activity:7287668163553468416",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287668163553468416",
        "url": "https://www.linkedin.com/in/anandneha?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAF8xnMBAKiIXD5Jthi5Xg9jlDuIoEPak2w",
        "name": "Neha Anand\nNeha Anand",
        "content": "This year, the winds of change are undeniable. From Prime Minister Modi’s inspiring address to the groundbreaking innovations at the Bharat Mobility Auto Expo, electric mobility has truly stepped into the spotlight. However, Internal Combustion Engines (ICE) continue to play a crucial role in the journey toward a sustainable future. It’s about embracing innovations from both worlds to build a more sustainable and balanced mobility landscape.\n\nThe luxury of choice has never been more real. Whether you're drawn to the cutting-edge technology of electric vehicles (EVs) or you still value the reliability and performance of ICE, there is an option for every kind of driver, every kind of family, and every kind of vision. The future is about leveraging the strengths of both ICE and EVs to create a cleaner, more efficient mobility ecosystem.\n\nAt Mahindra, we not just showcased our recently launched ICE models XUV3XO & Thar Roxx, but also the BE6 and XEV 09—our electric origin models, for the very first time to public, that captivated the crowd and set the stage for a future where electric vehicles are not just an aspiration but an accessible reality.\n\nThe atmosphere at the Bharat Mobility Auto Expo was electric—our pavilion was buzzing with excitement, as the BE6 and XEV 09 turned heads and sparked conversations. It was inspiring to witness how the industry is evolving and how quickly electric mobility is becoming a reality. And while electric is accelerating forward, ICE continues to evolve, bringing smarter and more eco-friendly solutions to the table.\n\nInnovation knows no boundaries—whether it's breakthroughs in battery technology for EVs or enhancing the efficiency of ICE through cleaner emissions and next-gen technologies, the commitment to advancing both remains steadfast. By driving innovation across both domains, a sustainable and impactful transition is within reach.\n\nWith government support, corporate partnerships, and a collective push from the entire industry, a future is being built where electric and ICE vehicles coexist, working in tandem to power a greener, more sustainable tomorrow.\n\nThe future is about progress, choice, and balance!\n\nLet’s continue to shape the future, embracing both the power of EV innovation and the enduring capabilities of ICE.",
        "reactions": {
          "likes": "2,895",
          "comments": "33 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "I totally agree Neha , the future is about progress, choice and balance - i will add two more resilence cum innovative mindset. \n\nThe entry of Scorpio changed the whole game. It was marketed beyond expectations and the quality delivered was superb with authentic sustenance. There's No looking back by the Mahndra and with every year they come up with something unique matching the global standards and making the nation proud. Kudos",
            "userName": "Vikrant Bakhshi",
            "userProfileURL": "https://www.linkedin.com/in/vikrant-bakhshi-6953185b",
            "dataId": "urn:li:comment:(ugcPost:7287668161817014272,7287675176492658690)"
          },
          {
            "commentText": "Vikrant Bakhshi let the roads be set in order for 2 wheeler rides first.ground breaking, mountain braking we don't expect we expect a good road and sensible speed brakers.",
            "userName": "Thyagavel Vasudevan",
            "userProfileURL": "https://www.linkedin.com/in/thyagavel",
            "dataId": "urn:li:comment:(ugcPost:7287668161817014272,7288193596703313920)"
          },
          {
            "commentText": "Mahindra Group has consistently inspired millions with their unwavering commitment to SUVs. In a fiercely competitive market, they've stayed true to their DNA, refusing to compromise on their core strength. This unwavering focus on SUVs has allowed them to perfect their craft and deliver exceptional vehicles. I wish Mahindra continued success in inspiring millions across the globe. Good work",
            "userName": "Rizwan Ahmed S Saiyed",
            "userProfileURL": "https://www.linkedin.com/in/rizwanahmed-s-saiyed",
            "dataId": "urn:li:comment:(ugcPost:7287668161817014272,7288980310011105280)"
          }
        ],
        "commentAdded": "Exciting times ahead! Embracing both EVs & ICE is key to a sustainable future in mobility. Heres to innovation and choice for all drivers! 🚗⚡️"
      },
      {
        "postId": "urn:li:activity:7289703273861627904",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289703273861627904",
        "url": "https://www.linkedin.com/in/stevenkamensky?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAKdCREB47gRHqS_iAkoL2KbGVRlpmaERKA",
        "name": "steven kamensky\nsteven kamensky",
        "content": " Happy Monday! \nA new week is here, full of endless possibilities. Let's start this Monday with gratitude, optimism, and determination. Whatever challenges come our way, we’ve got the strength to face them head-on.\nRemember, every small step you take today brings you closer to your goals. Stay focused, stay positive, and let’s make this week one to remember! \nWishing you a week of growth, success, and happiness. You've got this! ",
        "reactions": {
          "likes": "0",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Happy Monday! Love this positive mindset! Here’s to seizing opportunities and supporting one another on our paths to success! 💪✨"
      }
    ],
    "errors": [
      {
        "postId": "urn:li:activity:7289703730843656192",
        "url": "https://www.linkedin.com/in/ezxpo?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAIjGYB6b_NDVVPDgshQzRZBv-z3gmsaT0",
        "errors": [
          "Failed to fetch reactions.",
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7289701437834416129",
        "url": "https://www.linkedin.com/in/beccapchambers?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAG09JIBBwFH88CYYSQNJUGA5q_v0d--Yyc",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7289702582351015936",
        "url": "https://www.linkedin.com/in/garettm?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAxhx8oBrMrQ4Rb6q9ZLv7KibK_ydWLFZCE",
        "errors": [
          "Failed to fetch reactions.",
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7289702278305853441",
        "url": "https://www.linkedin.com/in/yarocelis?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAHEm9EBv2iwPw2Xrew4Hq7KE7qWEBazObQ",
        "errors": [
          "Failed to fetch reactions.",
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7289702978616250368",
        "url": "https://www.linkedin.com/in/sanghamitradhar?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAc1IpQB3RM8JvGHmzWa58a67FKfcPl1Eo8",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7289591020952920065",
        "url": "https://www.linkedin.com/in/mayank-qa?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAROVO0Byyl18SqKC0uWiTqzYxQsW2nifHs",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7289701127506247681",
        "url": "https://www.linkedin.com/in/greg-coquillo?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAPVK1IBJrwyQVly8u2I2FsDHlmOnzGWdr4",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7287668163553468416",
        "url": "https://www.linkedin.com/in/anandneha?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAF8xnMBAKiIXD5Jthi5Xg9jlDuIoEPak2w",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7289703273861627904",
        "url": "https://www.linkedin.com/in/stevenkamensky?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAKdCREB47gRHqS_iAkoL2KbGVRlpmaERKA",
        "errors": [
          "Failed to fetch reactions.",
          "Failed to fetch media URL."
        ]
      }
    ]
  },
  {
    "postsData": [
      {
        "postId": "urn:li:activity:7286734293869969409",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7286734293869969409",
        "url": "https://www.linkedin.com/in/marcmawhinney?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAJWjsgBu2cTod184XtwdLJ8mEZQyy27JvU",
        "name": "Marc Mawhinney\nMarc Mawhinney",
        "content": "If you're doing something for your business, you should be getting an ROI from it.\n\nThere are only so many hours in each day, why waste time doing stuff that isn't monetizing?\n\nIf it isn't giving you revenue, you have two options:\n\n1) Stop doing it. Spend your energy on things that put money in your bank account\n\nor\n\n2) Learn from someone who can show you how to swing it around and monetize it!\n\nAn issue could be a lack of eyeballs on your offer ...\n\nIf that's the case, and you'd like to get your offer in front of about 100,000 coaches, I currently have a few openings to partner with me.\n\nGet the details, and book a chat with me about it, at the link in the comments!",
        "reactions": {
          "likes": "1",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "www.jvwithmarc.com",
            "userName": "Marc Mawhinney",
            "userProfileURL": "https://www.linkedin.com/in/marcmawhinney",
            "dataId": "urn:li:comment:(activity:7286734293869969409,7286734343568306176)"
          }
        ],
        "commentAdded": "Great perspective! Focusing on ROI is crucial for business growth. Excited to see how your partnership can help coaches monetize effectively!"
      },
      {
        "postId": "urn:li:activity:7289477184241479693",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289477184241479693",
        "url": "https://www.linkedin.com/in/neilsahota?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAFJGABEoUR0jN0u6ElMgITICDe3mwaA3I",
        "name": "Neil Sahota\nNeil Sahota",
        "content": "AI vs. Human Expertise: The debate on how artificial intelligence is shaping the future of knowledge and innovation continues. Where do you stand on this evolving conversation?\n\nTo watch the entire Human-AI Symbiosis with  Cedric Chin and Lia DiBello Ph.D on the Commoncog podcast, click here -",
        "reactions": {
          "likes": "551",
          "comments": "196 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/e21c51d5-b645-4c0a-b992-2a5c3ba5c3a0",
        "comments": [
          {
            "commentText": "How do you envision AI reshaping traditional concepts of problem-solving and creativity?",
            "userName": "Jason Bramble",
            "userProfileURL": "https://www.linkedin.com/in/jasonbramble-revcarto",
            "dataId": "urn:li:comment:(ugcPost:7289302396776718336,7289477150615719936)"
          }
        ],
        "commentAdded": "Exciting topic! Balancing AI advancements with human intuition is key to innovation. Looking forward to exploring this further in the podcast!"
      },
      {
        "postId": "urn:li:activity:7286472529840373761",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7286472529840373761",
        "url": "https://www.linkedin.com/in/egiguere?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAOPFcB_4ORr0IKauLZuAbFaZTrGR2GYic",
        "name": "Eric Giguere\nEric Giguere",
        "content": "Love it Judy! I actually start one of my Webinars with a Mark Zuckerberg quote, which I believe is so appropriate here and which is certainly a great way to decide whether you should do a task yourself or delegate it! It's a very simple question: “The question I ask myself like almost every day is, ‘Am I doing the most important thing I could be doing?'” -Mark Zuckerberg",
        "reactions": {
          "likes": "0",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Great quote, Judy! Its a powerful reminder to focus on what truly matters. Thanks for sharing this insightful perspective!"
      },
      {
        "postId": "urn:li:activity:7289703933172760576",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289703933172760576",
        "url": "https://www.linkedin.com/in/adam-j-levinter-sbase?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAD4WMgBf0DBZ78UoNMjOD8jh-2tNP_YZ1w",
        "name": "Adam Levinter\nAdam Levinter",
        "content": "Points Programs Are Dead. \n\nPaid Loyalty Is the Future.\n\nIs your loyalty program driving loyalty at all?\n\nOur clients—and the data—tell a clear story: traditional points programs are fading.\n\nConsumers today want more than the promise of future rewards.\nThey want real value NOW, and they’re willing to pay for it.\n\nAmazon Prime, Walmart+, Uber One, and others know what works:\n\n Exclusive perks that make members feel like VIPs.\n Faster services that meet today’s demand for speed.\n Personalized benefits that deepen connections.\n Cost savings that are clear and measurable.\n\nClients who replaced their points programs with paid memberships saw a 25% increase in ARR and dramatically higher customer engagement.\n\nWhy? Because when customers invest, they engage more. They spend with you first, before considering alternatives.\n\nBuilding loyalty requires your customers to have “skin in the game.”\n\nIt’s time to shift.",
        "reactions": {
          "likes": "44",
          "comments": "24 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "well said! paid loyalty programs are the future no doubt",
            "userName": "Ronen R. Pessar",
            "userProfileURL": "https://www.linkedin.com/in/rpessar",
            "dataId": "urn:li:comment:(activity:7289647639401308160,7289703920694673410)"
          }
        ],
        "commentAdded": "Great insights! Embracing paid loyalty models really does transform customer engagement and boost revenue. Its time to innovate!"
      },
      {
        "postId": "urn:li:activity:7289701526925623296",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289701526925623296",
        "url": "https://www.linkedin.com/in/gary-shapiro?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABMh5sBCgl__h2mpujv-mOHhIUkJZBCLWA",
        "name": "Gary Shapiro\nGary Shapiro",
        "content": "President Trump’s executive orders and announcements cutting government DEI actions and sidelining DEI employees have me flummoxed. On the one hand, I think diversity is a vital part of our national recipe for success. Making employees feel welcome and included in the workplace makes human and business sense. On the other hand, we have to cut government spending and ensure hiring is based on competence above all else.\n\nI was thinking about this as I read a Substack post by marketing genius, who wrote about his experience being mistaken for superstar Jackie Chan. For several years in the 90s I kept hearing how much I looked like Al Gore, which I think is far less of a compliment!\n\nGuy’s piece highlights a fundamental human challenge: we tend to make snap judgments about people. Too often, we tend to gravitate towards people who look like us. That’s just how we as humans evolved – it was a survival skill.\n\nSadly, it can have a major downside. In the tech world, VCs and other people with money tend to be most comfortable investing in those that look like them. That means most tech investment dollars go to companies headed by white and Asian men, and companies on the coasts.\n\nAt CTA, we believe that good ideas can come from anyone, anywhere. (And I saw it again and again in Eureka Park, our home for startups at CES, meeting founders and entrepreneurs leading some of the 1400 startups.) Venture capital access shouldn’t just be about who you know, who you went to school with, or where you live.\n\nThat’s why we created our Innovation for All Fund, which invests in the VC firms funding founder teams of women, people of color, veterans, and other underrepresented entrepreneurs. To date, we’ve invested $10 million through the Innovation for All Fund, and at\n, we announced plans to invest $5 million more. We’re trying to expand the pool of opportunity!",
        "reactions": {
          "likes": "12",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Good balanced perspective on this topic Gary that unlike the majority DOES have a role on LI.",
            "userName": "Cliff Raskind",
            "userProfileURL": "https://www.linkedin.com/in/wirelessanalyst",
            "dataId": "urn:li:comment:(activity:7289696087299301379,7289704143936446465)"
          }
        ],
        "commentAdded": "Great insights! Fostering diversity enhances innovation. Excited to see how the Innovation for All Fund continues to expand opportunity!"
      },
      {
        "postId": "urn:li:activity:7289313288943714304",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289313288943714304",
        "url": "https://www.linkedin.com/in/oliwia-paw%C5%82owska-972412220?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADeXE-YBTNE7Pcb_TX3U0XnPbZ_WKm17-f8",
        "name": "Oliwia Pawłowska\nOliwia Pawłowska",
        "content": "Good day lovely people ️\n\nHappy Social Sunday ️‍️‍️‍\n\nOn this special day let’s enhance our collaboration and connect with each other ️️️‍\n\n️ describe portfolio \n introduce yourself\n connect with great people\n enhance skill set\n️ find the best job offer\n\nToday is day of strength and self believe ️‍️\n\nBelieve and achieve ️️️\n\nLet’s connect and rise ️️‍\n\nLove you ",
        "reactions": {
          "likes": "73",
          "comments": "92 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "*** Please, kindly repost this post for better reach to more connections ️ ***",
            "userName": "Oliwia Pawłowska",
            "userProfileURL": "https://www.linkedin.com/in/oliwia-paw%C5%82owska-972412220",
            "dataId": "urn:li:comment:(activity:7289238250869682176,7289238365843955712)"
          },
          {
            "commentText": "Shivek Maharaj thank you for resharing ️‍️‍️‍",
            "userName": "Oliwia Pawłowska",
            "userProfileURL": "https://www.linkedin.com/in/oliwia-paw%C5%82owska-972412220",
            "dataId": "urn:li:comment:(activity:7289238250869682176,7289260893073268736)"
          }
        ],
        "commentAdded": "Absolutely love this spirit of collaboration! Lets empower each other to reach new heights together. Excited to connect! 🌟 #SocialSunday"
      },
      {
        "postId": "urn:li:activity:7289702263638347776",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289702263638347776",
        "url": "https://www.linkedin.com/in/valentis?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAP18WUBF2kHOo6zzCHXz9XfdUOiZV_F4lE",
        "name": "Stephanie Valenti\nStephanie Valenti",
        "content": "It is that time of year again..... \n\nNo one likes to file taxes.... at least I don't think they do. \n\nAtwe are in the business of solving back office pain and driving financial efficiency ( it is the reason we exist!)\n\nSo it only made sense for us to solve the pain of 1099 filling!!\n\nWant to learn more?? Reach out to your dedicated AM or feel free to drop me a DM or comment and I will get you to the right POC!\n\nCheer's to efficiency in tax filing! ",
        "reactions": {
          "likes": "11\nDaren Lauda and 10 others",
          "comments": "2 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Nope not a fan. Especially with 2 businesses. ",
            "userName": "Leslie Greenwood",
            "userProfileURL": "https://www.linkedin.com/in/leslie-greenwood",
            "dataId": "urn:li:comment:(activity:7289689631845953536,7289701726197071873)"
          },
          {
            "commentText": "Right Leslie Greenwood- awful! ",
            "userName": "Stephanie Valenti",
            "userProfileURL": "https://www.linkedin.com/in/valentis",
            "dataId": "urn:li:comment:(activity:7289689631845953536,7289702132834873345)"
          }
        ],
        "commentAdded": "Great initiative! Tax season can be challenging—excited to see how your solutions simplify 1099 filing. Cheers to efficiency! 🚀"
      },
      {
        "postId": "urn:li:activity:7289491125050978305",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289491125050978305",
        "url": "https://www.linkedin.com/in/nikkiwalkerpr?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADr7FgBlyIeWY7f7v7LUVYM4brGazgvIhY",
        "name": "Nikki Walker\nNikki Walker",
        "content": "Thank you to TechBuzz News for spreading the word about the \n#HouseOfCodeNCulture during Utah Tech Week! \n\n‘The House of Code + Culture addresses the unique needs and challenges faced by the Black community in tech. The event centers on amplifying Black voices, celebrating their experiences, and fostering innovation at the intersection of culture and technology.’\n\nThank you tofor his incredible support ofand I during our first foray into\n!",
        "reactions": {
          "likes": "4",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Thrilled to see this initiative gaining recognition! Empowering Black voices in tech is crucial for fostering diversity and innovation. #Inspiration"
      },
      {
        "postId": "urn:li:activity:7289560415766786049",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289560415766786049",
        "url": "https://www.linkedin.com/in/josephplazo?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAijs4BM-6R4sEkObXeyhUy9vP4ligyY1g",
        "name": "Joseph Riñoza Plazo\nJoseph Riñoza Plazo",
        "content": "How 10 entrepreneurs retarded aging, sleep like kings and jump started cognition\n\nMore information:",
        "reactions": {
          "likes": "427",
          "comments": "88 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/7c60e647-8a2d-4855-879f-b4e490bcea15",
        "comments": [
          {
            "commentText": "Sungazing feels like one of those things that sounds magical until you realize it’s just a bad idea.",
            "userName": "Tom Lawrence",
            "userProfileURL": "https://www.linkedin.com/in/tomlawrencementor",
            "dataId": "urn:li:comment:(ugcPost:7289501264361517056,7289528967026335744)"
          }
        ],
        "commentAdded": "Fascinating insights! Its amazing how innovative approaches can enhance overall well-being and cognitive performance. Excited to learn more!"
      },
      {
        "postId": "urn:li:activity:7287669213043822592",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287669213043822592",
        "url": "https://www.linkedin.com/in/ayesha-f-4867a8161?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACa9BqYBvpf77ZvZJEedtGEPMJRGg01bkN0",
        "name": "Ayesha F.\nAyesha F.",
        "content": " Why Employees Leave: It’s Not Always About the Paycheck \n\nThe truth? People don’t just leave jobs—they leave environments that don’t serve them.\n\nWhen great employees walk away, it’s rarely due to a lack of effort or loyalty. It’s about the culture, leadership, and support they didn’t receive.\n\n What’s Driving People Away?\n\n1️⃣ Toxic Atmosphere\nNegativity spreads fast, leaving employees emotionally drained.\n2️⃣ Burnout Central\nExpecting endless effort without balance leads to exhaustion, not excellence.\n3️⃣ Weak Leadership\nLeaders who micromanage or lack vision create frustration, not inspiration.\n4️⃣ No Growth Path\nWithout opportunities to learn and advance, even motivated employees lose their spark.\n5️⃣ Unfair Compensation\nWhen pay doesn’t reflect effort, it’s hard to stay motivated.\n6️⃣ Work-Life Chaos\nA job that demands your personal time is a recipe for dissatisfaction.\n7️⃣ No Appreciation\nHard work without recognition? That’s a fast track to feeling undervalued.\n8️⃣ Creativity Blocked\nRigid rules that stifle innovation make passionate employees lose interest.\n\n Key Takeaways:\n\n️ Build a culture of respect and transparency.\n️ Recognize and reward effort—big or small.\n️ Prioritize balance and mental health to avoid burnout.\n️ Empower employees to innovate and grow.\n\n Want to retain your top talent? Focus on creating an environment where they feel valued, supported, and inspired. Let’s make workplaces a space people love showing up to!\n\n What’s one thing you’d change in your workplace culture to make it better? Drop your ideas below!\n\n………………….\n\nIf you encounter challenges in establishing your Brand Identity, marketing,\nor account Growth don't hesitate to get in touch with me for expert guidance and support.\n\nI'll help you manage your account better by freeing up your time.\n\n\n Credits: Jitender Girdhar.\n️ Repost to spread awareness!\n\nFollow me Ayesha F. for more insights on leadership, growth, and workplace culture.",
        "reactions": {
          "likes": "1,345",
          "comments": "129 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Ayesha, you nailed it! It's all about creating a workplace vibe that keeps people happy and engaged.",
            "userName": "Creative Ideas",
            "userProfileURL": "https://www.linkedin.com/company/creative-ideas11/posts",
            "dataId": "urn:li:comment:(ugcPost:7287669211785572352,7287671957976715264)"
          },
          {
            "commentText": "Very informative\n\" I firmly believe that management should adopt a retrospective approach and conduct thorough exit interviews to identify areas for improvement. Moreover, management should be vigilant and recognize signs of 'quiet quitting' among staff members, addressing issues proactively to prevent talent loss (Brain drain )and boost employee engagement.\nAdditionally, managers who exhibit micromanagement tendencies would benefit from training focused on leadership development, enabling them to adopt a more empowering and effective management style.\"",
            "userName": "Dr Rushita Munot",
            "userProfileURL": "https://www.linkedin.com/in/dr-rushita-munot-56b34637",
            "dataId": "urn:li:comment:(ugcPost:7287669211785572352,7287745952289886208)"
          }
        ],
        "commentAdded": "Great insights, Ayesha! Fostering a positive culture is key to employee retention. Lets prioritize appreciation and growth in our workplaces!"
      }
    ],
    "errors": [
      {
        "postId": "urn:li:activity:7286734293869969409",
        "url": "https://www.linkedin.com/in/marcmawhinney?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAJWjsgBu2cTod184XtwdLJ8mEZQyy27JvU",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7286472529840373761",
        "url": "https://www.linkedin.com/in/egiguere?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAOPFcB_4ORr0IKauLZuAbFaZTrGR2GYic",
        "errors": [
          "Failed to fetch reactions.",
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7289703933172760576",
        "url": "https://www.linkedin.com/in/adam-j-levinter-sbase?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAD4WMgBf0DBZ78UoNMjOD8jh-2tNP_YZ1w",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7289701526925623296",
        "url": "https://www.linkedin.com/in/gary-shapiro?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABMh5sBCgl__h2mpujv-mOHhIUkJZBCLWA",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7289313288943714304",
        "url": "https://www.linkedin.com/in/oliwia-paw%C5%82owska-972412220?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADeXE-YBTNE7Pcb_TX3U0XnPbZ_WKm17-f8",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7289702263638347776",
        "url": "https://www.linkedin.com/in/valentis?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAP18WUBF2kHOo6zzCHXz9XfdUOiZV_F4lE",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7289491125050978305",
        "url": "https://www.linkedin.com/in/nikkiwalkerpr?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADr7FgBlyIeWY7f7v7LUVYM4brGazgvIhY",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7287669213043822592",
        "url": "https://www.linkedin.com/in/ayesha-f-4867a8161?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACa9BqYBvpf77ZvZJEedtGEPMJRGg01bkN0",
        "errors": [
          "Failed to fetch media URL."
        ]
      }
    ]
  },
  {
    "postsData": [
      {
        "postId": "urn:li:activity:7288819611431550976",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7288819611431550976",
        "url": "https://www.linkedin.com/in/patelchinmay?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAKtDjUB3hxj4XyYpaaJWU-_CHM3S4Aptwc",
        "name": "Chinmay Patel ☀️\nChinmay Patel ☀️",
        "content": "He just said \"collectible like memecoins and NFTs\".",
        "reactions": {
          "likes": "1",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Absolutely! The rise of collectibles like memecoins and NFTs showcases the evolving landscape of digital assets. Exciting times ahead!"
      },
      {
        "postId": "urn:li:activity:7284901830617153536",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7284901830617153536",
        "url": "https://www.linkedin.com/in/nupurjain28?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACl6Q7EB3VZosvoMaD31EnIUl_EaR6xibvU",
        "name": "Nuwpur Jain\nNuwpur Jain",
        "content": "My dadi died 7 days back BUT she lived an absolutely full life which shocks me even today\n\nHere's what made her extraordinary:\n\n1) The Family Matriarch: She nurtured an incredible legacy of 51 hearts - 6 children, 18 grandchildren, and 27 great-grandchildren. Each one carrying a piece of her boundless love.\n\n2) The Eternal Explorer: At 80+, she had the curiosity of a 21-year-old, traveling from Singapore to Dubai, and finally to Ram Mandir - living life with more enthusiasm than people a quarter her age.\n\n3) The Graceful Goodbye: Seven days ago, she left us exactly how she lived - peacefully, having fulfilled all her wishes, and without suffering. A perfect ending to a life lived perfectly.\n\nHere's to you, Dadi - forever young, forever loved ️",
        "reactions": {
          "likes": "370\nNuwpur Jain and 369 others",
          "comments": "44 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "From Singapore to Ram Mandir - living life with more bucket list checkmarks than my weekend to-do list ️️",
            "userName": "Nuwpur Jain",
            "userProfileURL": "https://www.linkedin.com/in/nupurjain28",
            "dataId": "urn:li:comment:(ugcPost:7284901829795028992,7284902430201335808)"
          },
          {
            "commentText": "51 hearts, 1 incredible dadi, 0 days without being an inspiration ",
            "userName": "Nuwpur Jain",
            "userProfileURL": "https://www.linkedin.com/in/nupurjain28",
            "dataId": "urn:li:comment:(ugcPost:7284901829795028992,7284902255890182144)"
          }
        ],
        "commentAdded": "What a beautiful tribute to your Dadi’s remarkable life! Her legacy and spirit will surely inspire many. Thank you for sharing such a heartfelt story."
      },
      {
        "postId": "urn:li:activity:7289702813503213569",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289702813503213569",
        "url": "https://www.linkedin.com/in/jeremyboerger?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAGY-OABdlR_aEAWwHbNhPw4Be5rUWOfCek",
        "name": "Jeremy Boerger\nJeremy Boerger",
        "content": "𝗦𝘁𝗼𝗽 𝗯𝗲𝗶𝗻𝗴 𝘁𝗵𝗲 𝘀𝗰𝗮𝗽𝗲𝗴𝗼𝗮𝘁 𝗳𝗼𝗿 𝘀𝗼𝗳𝘁𝘄𝗮𝗿𝗲 𝗮𝘂𝗱𝗶𝘁 𝗽𝗲𝗻𝗮𝗹𝘁𝗶𝗲𝘀 \n\nUse the Pragmatic ITAM Method to master your assets, eliminate errors, and ace your audits. \n\nBe the hero, not the victim. Here's how:",
        "reactions": {
          "likes": "0",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Embracing the Pragmatic ITAM Method is a game changer! Let’s turn audits into opportunities and master our software assets. 💪 #ITAM"
      },
      {
        "postId": "urn:li:activity:7289702527195889664",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289702527195889664",
        "url": "https://www.linkedin.com/in/varun1175?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACKnKlcBjbVuNxmqTWxj41k1DP__pQV5F-w",
        "name": "VARUN YADAV\nVARUN YADAV",
        "content": "Life of a Software Developer -\n\n1. Born\n2. Working on My System\n3. Death\n\n\n\n\nTemplate by",
        "reactions": {
          "likes": "1",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Love this humorous take on the journey of a software developer! It truly captures the dedication and passion we bring to our craft. 🚀"
      },
      {
        "postId": "urn:li:activity:7289589870887333891",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289589870887333891",
        "url": "https://www.linkedin.com/in/daniel-korenblum?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADiPgH0BiOO5C2dN2GImGcw-ojHTXkFrbKQ",
        "name": "Daniel Korenblum\nDaniel Korenblum",
        "content": "2025 LinkedIn algorithm explained\n\n(save this for later)\n\nThe 3 positive signals you know:\n\n→ Likes\n→ Reposts\n→ Comments\n\nThe other 8 signals you probably missed:\n\n1. Direct Messages\n↳ 70% more likely to see your posts\n Invite other people to DM you\n\n2. Saving Posts\n↳ The top signal for the algorithm\n Post valuable information\n\n3. General Clicks\n↳ Every click boosts engagement\n Add clickable elements (images)\n\n4. View Time\n↳ The longer it is, the better\n Post infographics & carousels\n\n5. New Connections\n↳ Two weeks of boosted content\n Maintain consistency and quality\n\n6. External Shares\n↳ Off-platform shares help your reach\n□ Not sure how to influence this one...\n\n7. Profile Visits\n↳ 50% chance they see your new posts\n Use a poppy background + short headline\n\n8. Frequent Views\n↳ Regular interaction = more visibility\n Build relationships with other creators\n\nContent creation is the game.\n\nBeating the algo is the game-changer.\n\nP.S. Repost if you found this useful ️",
        "reactions": {
          "likes": "831",
          "comments": "587 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Likes and comments aren't enough to get through LinkedIn now Daniel Korenblum \n\nWhat makes the difference is an authentic brand",
            "userName": "Blessing Ikpia",
            "userProfileURL": "https://www.linkedin.com/in/blessing-ikpia-54b790244",
            "dataId": "urn:li:comment:(ugcPost:7289350707260870656,7289589862008025088)"
          },
          {
            "commentText": "Blessing Ikpia being genuine goes a long way ",
            "userName": "Daniel Korenblum",
            "userProfileURL": "https://www.linkedin.com/in/daniel-korenblum",
            "dataId": "urn:li:comment:(ugcPost:7289350707260870656,7289593368752365569)"
          }
        ],
        "commentAdded": "Great insights on the LinkedIn algorithm! 📈 Understanding these signals can significantly boost our content strategy. Thanks for sharing!"
      },
      {
        "postId": "urn:li:activity:7289684638296424448",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289684638296424448",
        "url": "https://www.linkedin.com/groups/1814785?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A1814785-7289490333099319297",
        "name": "Artificial Intelligence, Deep Learning, Machine Learning\nArtificial Intelligence, Deep Learning, Machine Learning",
        "content": "𝗧𝗵𝗲 𝗣𝗲𝗿𝗰𝗲𝗽𝘁𝗿𝗼𝗻 𝗔𝗹𝗴𝗼𝗿𝗶𝘁𝗵𝗺: 𝗔 𝗖𝗹𝗮𝘀𝘀𝗶𝗰 𝗙𝗼𝘂𝗻𝗱𝗮𝘁𝗶𝗼𝗻 𝗳𝗼𝗿 𝗠𝗼𝗱𝗲𝗿𝗻 𝗠𝗮𝗰𝗵𝗶𝗻𝗲 𝗟𝗲𝗮𝗿𝗻𝗶𝗻𝗴\n\nThe Perceptron Algorithm was the first-ever machine learning model proposed for classification tasks, marking a pivotal moment in the evolution of AI. While it comes with limitations, its simplicity and intuitiveness make it an essential concept for anyone stepping into the world of machine learning. Here’s why it remains relevant:\n\n𝗖𝗼𝗿𝗲 𝗖𝗼𝗻𝗰𝗲𝗽𝘁 𝗼𝗳 𝗖𝗹𝗮𝘀𝘀𝗶𝗳𝗶𝗰𝗮𝘁𝗶𝗼𝗻: The Perceptron introduces the fundamental idea of separating data into classes using a linear decision boundary.\n𝗕𝘂𝗶𝗹𝗱𝗶𝗻𝗴 𝗕𝗹𝗼𝗰𝗸 𝗳𝗼𝗿 𝗔𝗱𝘃𝗮𝗻𝗰𝗲𝗱 𝗠𝗼𝗱𝗲𝗹𝘀: It forms the conceptual basis for understanding modern algorithms like Logistic Regression, Support Vector Machines, and Neural Networks.\n𝗛𝗶𝘀𝘁𝗼𝗿𝗶𝗰𝗮𝗹 𝗦𝗶𝗴𝗻𝗶𝗳𝗶𝗰𝗮𝗻𝗰𝗲: As the starting point of supervised learning, it demonstrates how AI has evolved from simple rules to sophisticated models.\n𝗨𝗻𝗱𝗲𝗿𝘀𝘁𝗮𝗻𝗱𝗶𝗻𝗴 𝗟𝗶𝗺𝗶𝘁𝗮𝘁𝗶𝗼𝗻𝘀 𝗮𝗻𝗱 𝗘𝘃𝗼𝗹𝘂𝘁𝗶𝗼𝗻: Studying the Perceptron highlights challenges such as its inability to handle non-linearly separable data, which inspired the development of more powerful algorithms.\n\nWhether you're new to machine learning or deepening your expertise, revisiting the Perceptron Algorithm helps connect foundational principles to cutting-edge innovations in the field.\n\n𝘚𝘵𝘢𝘺 𝘶𝘱𝘥𝘢𝘵𝘦𝘥 𝘸𝘪𝘵𝘩 𝘮𝘰𝘳𝘦 𝘴𝘶𝘤𝘩 𝘦𝘯𝘨𝘢𝘨𝘪𝘯𝘨 𝘤𝘰𝘯𝘵𝘦𝘯𝘵 𝘣𝘺 𝘴𝘶𝘣𝘴𝘤𝘳𝘪𝘣𝘪𝘯𝘨 𝘵𝘰 𝗩𝗶𝘇𝘂𝗮𝗿𝗮’𝘀 𝗔𝗜 𝗡𝗲𝘄𝘀𝗹𝗲𝘁𝘁𝗲𝗿:\n𝘓𝘦𝘵’𝘴 𝘦𝘮𝘣𝘢𝘳𝘬 𝘰𝘯 𝘵𝘩𝘪𝘴 𝘭𝘦𝘢𝘳𝘯𝘪𝘯𝘨 𝘫𝘰𝘶𝘳𝘯𝘦𝘺!",
        "reactions": {
          "likes": "27",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Absolutely agree! The Perceptron Algorithm is a stepping stone that elegantly showcases the evolution of AI. A must-know for all ML enthusiasts! 🌟"
      },
      {
        "postId": "urn:li:activity:7289677369701720064",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289677369701720064",
        "url": "https://www.linkedin.com/in/efroelich?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADQoIacBwM5k4Xf9Vtg7DUzDyrOu2fgFeco",
        "name": "Ethan Froelich\nEthan Froelich",
        "content": "Busy is a stupid word. It's a crutch. Do you take control or just let things happen?\n\nI learned a lot havingfromon the podcast.\n\nIf you want to learn how he went from going door-to-door passing out flyers to working with companies like, give it a listen!\n\nDo you agree with what Logan is saying?\n\nLink is in the comments :)",
        "reactions": {
          "likes": "1",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/44e2df68-6645-4247-abcb-eacafb3b81ad",
        "comments": [
          {
            "commentText": "Here's the full episode: https://open.spotify.com/episode/300IK19jLjliHw1rVUIB1n?si=a4758ddb9ab8426f ",
            "userName": "Ethan Froelich",
            "userProfileURL": "https://www.linkedin.com/in/efroelich",
            "dataId": "urn:li:comment:(ugcPost:7289677294309179393,7289677809717837825)"
          }
        ],
        "commentAdded": "Absolutely agree! Taking control of our time is key to success. Excited to check out the podcast and learn more from Logans journey!"
      },
      {
        "postId": "urn:li:activity:7289688470652928001",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289688470652928001",
        "url": "https://www.linkedin.com/in/chuck-h-securityexecutive?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAC-toB4skrS8pVEa4Zv-ERwHRJBBeLbhw",
        "name": "Chuck Herrin, CISSP, CCSP, NACD.DC\nChuck Herrin, CISSP, CCSP, NACD.DC",
        "content": "A world of AI is a world of APIs - check out how F5 API Sscurity and RedHat Openshift AI work seamlessly together!",
        "reactions": {
          "likes": "1",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Exciting collaboration! The synergy between F5 API Security and RedHat OpenShift AI showcases the future of seamless AI integration. Well done!"
      },
      {
        "postId": "urn:li:activity:7289650813793095680",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289650813793095680",
        "url": "https://www.linkedin.com/in/brad-woessner-493398320?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAFE29a8BHw9OO4VYefY1mprsqdkdIRxu79I",
        "name": "Brad Woessner\nBrad Woessner",
        "content": "Retail Owners, struggling to hit your sales goals?\n\nYou can’t hit your sales goals without doing this one thing!\n\nAfter 40+ Years in retail sales, I’ve uncovered this truth.\n\nAnd it’s more important than you might think.\n\n“Be smart about your sales targets.”\n\nHere’s the reality:\nMany retail businesses set ambitious sales goals without factoring in the realities of their business.\n\nImagine this:\nYou’ve just set an ambitious target for the quarter, but it doesn’t account for seasonality, your sales team’s historical performance, or key industry shifts.\n\nBy month two, you’re already falling short.\n\nSound familiar?\n\nHere’s a better way:\n1️. Account for Key Variables: Incorporate recurring revenue, product life cycles, and industry shifts into your forecast.\n\n2️. Engage Your Team: Your sales reps have on-the-ground insights. Use them to set practical targets.\n\n3️. Switch to Rolling Forecasts: Flexibility is key. Adjust as you go to tackle risks and seize new opportunities.\n\nBy embracing this data-driven approach, you’ll build momentum, boost morale, and drive sustainable growth.\n\nI’ve helped retail owners reach their sales goals. Now it’s your turn!\nIt’s FREE, but slots are filling fast!\n Comment “READY” below, and I’ll send you a link to schedule a 𝗙𝗥𝗘𝗘 𝟯𝟬-𝗠𝗜𝗡𝗨𝗧𝗘 𝗖𝗢𝗡𝗦𝗨𝗟𝗧𝗔𝗧𝗜𝗢𝗡 with me.",
        "reactions": {
          "likes": "9",
          "comments": "8 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Spot on! Smart forecasting is key, not just aiming high.",
            "userName": "Neil Sarkar",
            "userProfileURL": "https://www.linkedin.com/in/neil-sarkar",
            "dataId": "urn:li:comment:(activity:7289643320396455936,7289650810227937280)"
          },
          {
            "commentText": "Neil Sarkar Exactly! Aiming high is important, but smart forecasting bridges the gap between ambition and execution. It’s about having a roadmap to hit those lofty targets. What’s your go-to strategy for keeping forecasts both bold and realistic?",
            "userName": "Brad Woessner",
            "userProfileURL": "https://www.linkedin.com/in/brad-woessner-493398320",
            "dataId": "urn:li:comment:(activity:7289643320396455936,7289658652439834625)"
          }
        ],
        "commentAdded": "Great insights! Setting realistic targets is crucial for success. Excited to see how this approach can transform retail sales! #SalesStrategy"
      },
      {
        "postId": "urn:li:activity:7289603615160176643",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289603615160176643",
        "url": "https://www.linkedin.com/in/amishapatel-personal-branding-strategist?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACSUYYgBYBfytW-ZkAK_EnBP-vFgnzBQwVI",
        "name": "Amisha Patel\nAmisha Patel",
        "content": "I often find myself so caught up in the race for success…\n\nRight now, I'm hustling, pushing myself to grow, scale my business, and reach new heights.\n\nAnd I know there are many out there doing the same and how in this journey every day feels like a race against time, where success is always at the forefront of my mind.\n\nI'm achieving things I never thought possible, but there's something I sometimes forget... my people.\n\nMy tribe. My family. My friends.\n\nIn the pursuit of milestones, We sometimes lose sight of the small, yet precious moments - the laughter of a close friend, sipping evening tea with family, those meaningful conversations we keep postponing for \"later.”\n\nThe truth I am realizing through this journey is that success doesn’t feel as fulfilling without them by my side.\n\nThe celebrations will feel hollow. The achievements will feel incomplete.\n\nThere’s no point in success if I don’t have my people to share it with.\n\nAnd so, I’m learning to step back, slow down, and be present in the moments that matter most.\n\nBecause at the end of the day, success is so much sweeter when shared with those I love.\n\nSo, if you're in the thick of your own journey like I am, take a moment to remember - It’s the people you surround yourself with that make success truly worth it.\n\n Nurture relationships\n Make time for those who matter\n Success is sweeter when shared\n\nTo all my fellow hustlers - don’t forget to pause, look around, and cherish your tribe. ️",
        "reactions": {
          "likes": "447",
          "comments": "54 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Amisha Patel The sincerity and vulnerability displayed in your post is truly humbling. Your dedication to personal growth and pursuit of success is commendable, but your recognition of the importance of relationships is even more so. It's easy to lose sight of the \"small\" moments when we're focused on bigger milestones. Your reminder to \"step back, slow down, and be present in the moments that matter most,\" sends a powerful message about what true success means.\n\nYour acknowledgment of the significance of loved ones in the journey of success resonates deeply. You are absolutely right, success is incomplete without people to celebrate it with.",
            "userName": "Venkatesh B.",
            "userProfileURL": "https://www.linkedin.com/in/venkaatb",
            "dataId": "urn:li:comment:(activity:7289601791904690177,7289649572916645888)"
          }
        ],
        "commentAdded": "What a powerful reminder! Success shines brightest when shared with loved ones. Lets cherish those moments that truly matter. 🌟"
      }
    ],
    "errors": [
      {
        "postId": "urn:li:activity:7288819611431550976",
        "url": "https://www.linkedin.com/in/patelchinmay?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAKtDjUB3hxj4XyYpaaJWU-_CHM3S4Aptwc",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7284901830617153536",
        "url": "https://www.linkedin.com/in/nupurjain28?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACl6Q7EB3VZosvoMaD31EnIUl_EaR6xibvU",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7289702813503213569",
        "url": "https://www.linkedin.com/in/jeremyboerger?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAGY-OABdlR_aEAWwHbNhPw4Be5rUWOfCek",
        "errors": [
          "Failed to fetch reactions.",
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7289702527195889664",
        "url": "https://www.linkedin.com/in/varun1175?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACKnKlcBjbVuNxmqTWxj41k1DP__pQV5F-w",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7289589870887333891",
        "url": "https://www.linkedin.com/in/daniel-korenblum?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADiPgH0BiOO5C2dN2GImGcw-ojHTXkFrbKQ",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7289684638296424448",
        "url": "https://www.linkedin.com/groups/1814785?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A1814785-7289490333099319297",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7289688470652928001",
        "url": "https://www.linkedin.com/in/chuck-h-securityexecutive?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAC-toB4skrS8pVEa4Zv-ERwHRJBBeLbhw",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7289650813793095680",
        "url": "https://www.linkedin.com/in/brad-woessner-493398320?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAFE29a8BHw9OO4VYefY1mprsqdkdIRxu79I",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7289603615160176643",
        "url": "https://www.linkedin.com/in/amishapatel-personal-branding-strategist?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACSUYYgBYBfytW-ZkAK_EnBP-vFgnzBQwVI",
        "errors": [
          "Failed to fetch media URL."
        ]
      }
    ]
  },
  {
    "postsData": [
      {
        "postId": "urn:li:activity:7289649195941076992",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289649195941076992",
        "url": "https://www.linkedin.com/in/walterlorwin?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAACaWEEBNxC-bSADQ9mK-4Q3JS_dwfTq0ow",
        "name": "Larry Orwin\nLarry Orwin",
        "content": "The battle for AI talent continues...\nhttps://lnkd.in/e3Apa4r6?",
        "reactions": {
          "likes": "0",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Absolutely! As AI evolves, so does the competition for top talent. Exciting times ahead for innovation and collaboration! 🚀 #AITalent"
      },
      {
        "postId": "urn:li:activity:7288612580506431489",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7288612580506431489",
        "url": "https://www.linkedin.com/in/cstone1?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAADUbUBF_tbtwrVRkQpE9YYbjHAB13qiVk",
        "name": "Rich Rosen\nRich Rosen",
        "content": "I believe in all outreach - Email, text, the Blue Devil that is Linkedin, and my favorite, the phone. -It made me wonder how many in sales have a personalized outbound message on their vmail",
        "reactions": {
          "likes": "6",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Great reflection! Personalizing outreach, especially voicemails, can truly make a difference. What’s your top tip for effective vmail messaging?"
      },
      {
        "postId": "urn:li:activity:7288546512924487684",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7288546512924487684",
        "url": "https://www.linkedin.com/in/alok-kumar-1255a760?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAzm1e0BXxpmGcdQf718KMrDjfe-aQaWvUs",
        "name": "Alok Kumar\nAlok Kumar",
        "content": "Bharat Mobility Expo - Key Highlights [My Views]\n\n1. Flex Fuel Readiness:\n• While many OEMs have announced plans for flex-fuel vehicles, the industry faces challenges in ensuring adequate demand and a stable supply of ethanol.\n\n2. Diverse Powertrain Options:\n• The two-wheeler and commercial vehicle segments are witnessing intense competition, with a variety of powertrains such as CNG, ethanol, battery electric vehicles (BEVs), hybrids, and fuel cells being showcased.\n\n3. Passenger Car Strategies:\n• Mahindra is focusing on bold and innovative product offerings.\n• Tata Motors is emphasizing affordability and safety as its core value propositions.\n\n4. Commitment to Sustainability:\n• Sustainability is no longer just a buzzword; all OEMs are demonstrating a strong commitment to eco-friendly practices and sustainable mobility solutions.",
        "reactions": {
          "likes": "106",
          "comments": "4 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Thank you for sharing your views; the details you provided will be incredibly helpful for those who were unable to attend the Bharat Mobility Expo. You have managed to summarize the key points in just a few sentences, yet they are packed with meaning and valuable insights. Great ",
            "userName": "Dr.PraBhaKar Bhangare",
            "userProfileURL": "https://www.linkedin.com/in/prabhakaryb",
            "dataId": "urn:li:comment:(ugcPost:7288546510038831104,7288705353897164800)"
          },
          {
            "commentText": "Dr.PraBhaKar Bhangare thank u sir",
            "userName": "Alok Kumar",
            "userProfileURL": "https://www.linkedin.com/in/alok-kumar-1255a760",
            "dataId": "urn:li:comment:(ugcPost:7288546510038831104,7288841139334324224)"
          },
          {
            "commentText": "",
            "userName": "Sanjay Tank",
            "userProfileURL": "https://www.linkedin.com/in/sanjay-tank-24193414",
            "dataId": "urn:li:comment:(ugcPost:7288546510038831104,7288784956468686848)"
          }
        ],
        "commentAdded": "Great insights! Its exciting to see the industrys commitment to sustainability and diverse powertrains. Innovation is the way forward! 🚀"
      },
      {
        "postId": "urn:li:activity:7289597096217763840",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289597096217763840",
        "url": "https://www.linkedin.com/in/hamzaraufkhan?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADWPxjQBv4Kdj8skZvKjcMXVriLrMtOXLZ8",
        "name": "Hamza Rauf Khan\nHamza Rauf Khan",
        "content": "From Gaddha Gari to Hong Kong\nA journey of Determination..\n\nMeet Shoaib Muhammad, a hardworking guy from Dera Ghazi Khan.\nComing from a poor family, he never let his circumstances stop him.\nHe completed his BS locally, then his MS in Islamabad, all while working in the fields to support his family.\n\nDetermined to pursue a PhD, Shoaib applied for study visas abroad.\nAfter 3 years of relentless effort, in 2024, he secured a research job with a scholarship at one of Hong Kong’s top universities...\n\nWhen you put in the work, no matter the struggles,\nGod doesn’t waste your effort.\nHard work always finds a way...",
        "reactions": {
          "likes": "920",
          "comments": "73 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "The journey may be tough, but if you keep pushing, success will find its way..",
            "userName": "Javeriya Ahsan",
            "userProfileURL": "https://www.linkedin.com/in/javeriyaahsan-brandingstrategist",
            "dataId": "urn:li:comment:(activity:7289566868451803136,7289567460586905601)"
          },
          {
            "commentText": "Javeriya Ahsan Yes, Shoaib's journey is the proof",
            "userName": "Hamza Rauf Khan",
            "userProfileURL": "https://www.linkedin.com/in/hamzaraufkhan",
            "dataId": "urn:li:comment:(activity:7289566868451803136,7289571267597258752)"
          },
          {
            "commentText": "Success stories like these remind us to keep pushing forward against all odds.",
            "userName": "Marika Nayan",
            "userProfileURL": "https://www.linkedin.com/in/thelifestrategist333",
            "dataId": "urn:li:comment:(activity:7289566868451803136,7289570691866075136)"
          },
          {
            "commentText": "Marika Nayan Absolutely",
            "userName": "Hamza Rauf Khan",
            "userProfileURL": "https://www.linkedin.com/in/hamzaraufkhan",
            "dataId": "urn:li:comment:(activity:7289566868451803136,7289571160114057216)"
          }
        ],
        "commentAdded": "Incredible journey, Shoaib! Your determination is truly inspiring. Wishing you all the best as you continue to achieve great things in Hong Kong!"
      },
      {
        "postId": "urn:li:activity:7284663872106414082",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7284663872106414082",
        "url": "https://www.linkedin.com/in/patelchinmay?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAKtDjUB3hxj4XyYpaaJWU-_CHM3S4Aptwc",
        "name": "Chinmay Patel ☀️\nChinmay Patel ☀️",
        "content": "I really wish there was an HTTPS type protocol/standard for AI agent actions. \n\nThat way apps can build actions for one AI platform and it would automatically work for all other platforms.\n\nI'm surewould be great in making it happen ....",
        "reactions": {
          "likes": "1",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Absolutely! Standardizing AI actions would foster innovation and collaboration across platforms, benefiting everyone in the ecosystem. #FutureofAI"
      },
      {
        "postId": "urn:li:activity:7289552391547359232",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289552391547359232",
        "url": "https://www.linkedin.com/in/cristian-mudure-9506183?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAACgBEwBcZH6muplFsd2Ji_GcjfawFvto5E",
        "name": "Cristian Mudure\nCristian Mudure",
        "content": "My motivation and convictions for data protection and Europe’s digital sovereignty\n\nI often hear the claim that I advocate for data protection and a sovereign Europe solely to promote my product. Today, I want to clarify this:\n\nI am not a bandwagon jumper exploiting data protection as a trend or a unique selling point. Stackfield has existed as a company since 2012, and from day one, our goal has been clear: we are a privacy-first company.\n\nEven in our first release, we integrated end-to-end encryption. In 2013, when Edward Snowden shook the world, we gained significant attention for this approach.\n\nFor us as a company and for me personally digital independence and protecting a country's data are top priorities. There are areas where I firmly believe that data must be so securely protected, on a technical level, that no other country can access it, regardless of their legal framework. These areas include government agencies, law firms, energy providers, banks, and the healthcare sector. Thousands of customers from precisely these industries already place their trust in us.\n\nSome argue that Germany is no better than the USA. While that may be true in some respects, Germany will always prioritize the interests of its own citizens. And as citizens, we are bound solely by the laws of our country.\n\nDo I personally use U.S.-based tools? Yes. We are all on platforms like LinkedIn, Instagram, and others, and I, too, use various tools to optimize my daily work with the help of AI.\n\nBut do we allow such tools within the Stackfield context in a way that could lead to customer data leaving the EU? Absolutely not! We also ensure that all subcontractors have no parent company in the U.S. In other words, no Azure, AWS, or similar platforms.\n\nThe truth is:\n\n𝐈 𝐝𝐨 𝐧𝐨𝐭 𝐚𝐝𝐯𝐨𝐜𝐚𝐭𝐞 𝐟𝐨𝐫 𝐝𝐚𝐭𝐚 𝐩𝐫𝐨𝐭𝐞𝐜𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝐝𝐢𝐠𝐢𝐭𝐚𝐥 𝐬𝐨𝐯𝐞𝐫𝐞𝐢𝐠𝐧𝐭𝐲 𝐭𝐨 𝐩𝐫𝐨𝐦𝐨𝐭𝐞 𝐦𝐲 𝐜𝐨𝐦𝐩𝐚𝐧𝐲, 𝐈 𝐟𝐨𝐮𝐧𝐝𝐞𝐝 𝐒𝐭𝐚𝐜𝐤𝐟𝐢𝐞𝐥𝐝 𝐨𝐮𝐭 𝐨𝐟 𝐭𝐡𝐢𝐬 𝐯𝐞𝐫𝐲 𝐜𝐨𝐧𝐯𝐢𝐜𝐭𝐢𝐨𝐧.\n\nWe live in a time where it is clearer than ever that every country prioritizes its own interests.\n\nAnd in light of recent developments in the U.S., we are called upon more than ever to take our destiny into our own hands and put our country's interests first.\n\nWe can only achieve this by ensuring that we do not allow other countries to control our knowledge.",
        "reactions": {
          "likes": "28",
          "comments": "2 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Great clarification and consistent positioning. Thanks Cristian Mudure, thanks Stackfield\n\n(FYI - regarding AI and Europe, maybe Langdock might be interesting)",
            "userName": "Sebastian Kamilli",
            "userProfileURL": "https://www.linkedin.com/in/sebastiankamilli",
            "dataId": "urn:li:comment:(activity:7289552391547359232,7289640327991209984)"
          },
          {
            "commentText": "Thanks Sebastian!",
            "userName": "Cristian Mudure",
            "userProfileURL": "https://www.linkedin.com/in/cristian-mudure-9506183",
            "dataId": "urn:li:comment:(activity:7289552391547359232,7289647405094871040)"
          }
        ],
        "commentAdded": "Strongly support your commitment to data protection and European sovereignty! Its crucial for building trust in todays digital landscape. 🌍🔒"
      },
      {
        "postId": "urn:li:activity:7289645498573930496",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289645498573930496",
        "url": "https://www.linkedin.com/in/adam-rahmouni?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAC9WL7sBq5WTs1WYL_doMhyx589mkPm6-5Y",
        "name": "Adam Rahmouni\nAdam Rahmouni",
        "content": "Cold outbound hack: Learn how to write a CTA\n\n1. Keep it clear and action-oriented.\n2. Make it easy to say \"yes.\"\n3. Don’t be too pushy.\n\nThese are not just tips. It's persuasion science.\n\nA great CTA is the difference between a reply and no reply.\nIt’s why some emails get ignored while others spark action.\nIt’s why clarity and simplicity always win in cold outreach.\n\nHere’s the trick:\n\nFocus on one clear action.\nUse language that reduces friction.\nAnd always give a reason to act now.\n\nMaster this, and your outbound results will change forever.",
        "reactions": {
          "likes": "47",
          "comments": "32 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Simple and clear always wins. No one has time for ambiguity in cold outreach.",
            "userName": "Neil Sarkar",
            "userProfileURL": "https://www.linkedin.com/in/neil-sarkar",
            "dataId": "urn:li:comment:(ugcPost:7289443645856862208,7289645482396565504)"
          },
          {
            "commentText": "Neil Sarkar if they struggle to understand your message you’re already losing",
            "userName": "Adam Rahmouni",
            "userProfileURL": "https://www.linkedin.com/in/adam-rahmouni",
            "dataId": "urn:li:comment:(ugcPost:7289443645856862208,7289653687365324800)"
          }
        ],
        "commentAdded": "Great insights! A strong CTA truly can transform outreach efforts. Clarity and urgency are key to driving meaningful responses! 🚀"
      },
      {
        "postId": "urn:li:activity:7289332916327747584",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289332916327747584",
        "url": "https://www.linkedin.com/in/gail-stepanik-keber?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAJUtFQBSRO-8Yi5dU6AhbdmrnwF3ClmhxU",
        "name": "Gail Stepanik-Keber\nGail Stepanik-Keber",
        "content": "It was a celebratory night Edmonton Chamber of Commerce Gold Ball with my University Hospital Foundation colleagues, International Women's Forumfriends, incoming Chamber Chair, andsponsor and chamber board member. Congrats toandfor a stellar night.",
        "reactions": {
          "likes": "113",
          "comments": "5 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Thank you so much for joining us last night! ",
            "userName": "Edmonton Chamber of Commerce",
            "userProfileURL": "https://www.linkedin.com/company/edmonton-chamber-of-commerce/posts",
            "dataId": "urn:li:comment:(ugcPost:7289331458391846912,7289338261599109120)"
          },
          {
            "commentText": "Looking great team!",
            "userName": "Dr. Jodi Abbott, C.M., ICD.D",
            "userProfileURL": "https://www.linkedin.com/in/dr-jodi-abbott-250a8026",
            "dataId": "urn:li:comment:(ugcPost:7289331458391846912,7289501318442893313)"
          }
        ],
        "commentAdded": "What a fantastic evening! Celebrating achievements with such inspiring individuals truly highlights the power of collaboration. Kudos to all! 🎉"
      },
      {
        "postId": "urn:li:activity:7289524006288805888",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289524006288805888",
        "url": "https://www.linkedin.com/in/ezike-ruth-nnenna-094360275?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAEMmWnABA4jKLyutN4usQy5nNBOjiSZhB5Y",
        "name": "Ezike Ruth Nnenna\nEzike Ruth Nnenna",
        "content": "Big Dreams Start with Small Steps\n\n\n\n\n\nHave you ever looked at someone’s success and thought, “How did they get there?” Often, it’s not about giant leaps, but about small, consistent steps taken over time.\n\n\n\n\nIn a world that celebrates overnight success, it’s easy to overlook the power of persistence and daily effort. But here’s the truth: every big achievement is built on small, seemingly insignificant actions repeated consistently.\n\n\n\nI remember a time when I doubted the value of what I was doing daily. The progress felt slow, and I wondered if it was worth it. But looking back now, I realize those small steps were the foundation for where I am today.\n\n\n\nMaybe you're building a business, learning a skill, or chasing a dream that feels far away. It’s okay to feel overwhelmed—but don’t stop. Every email you send, every task you complete, and every effort you make is adding up in ways you might not see yet.\n\n\n\nSuccess isn’t about perfection; it’s about progress. Trust the process, stay consistent, and remember that even the smallest steps forward are steps in the right direction.\n\n\n\nYour future self will thank you for not giving up.\n\n\n\nWhat’s one small step you’re taking today toward your dreams? Share it in the comments—I’d love to hear about your Journey",
        "reactions": {
          "likes": "97",
          "comments": "136 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Success is truly the result of consistent small steps.Progress may feel slow, but the impact compounds over time.",
            "userName": "Nerea Arregui Exposito",
            "userProfileURL": "https://www.linkedin.com/in/nereaarreguiqa",
            "dataId": "urn:li:comment:(activity:7289478516696383488,7289523956166873088)"
          },
          {
            "commentText": "Nerea Arregui Exposito Exactly  ",
            "userName": "Ezike Ruth Nnenna",
            "userProfileURL": "https://www.linkedin.com/in/ezike-ruth-nnenna-094360275",
            "dataId": "urn:li:comment:(activity:7289478516696383488,7289550075964342272)"
          }
        ],
        "commentAdded": "Absolutely agree! Every small step shapes our journey. Today, Im dedicating time to learn a new skill—what about you?"
      },
      {
        "postId": "urn:li:activity:7289701653165817858",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289701653165817858",
        "url": "https://www.linkedin.com/in/brion-carroll-ii?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAATW_VsBDonlpEZwmQL3Jv50L27Womig6fo",
        "name": "Brion Carroll (II)\nBrion Carroll (II)",
        "content": "Good morning from PTC /USER in New Orleans! Kicked off the day with my good friend Eric Horn—it’s always better starting the day with great company and even better conversations.\n\nThis week is packed with amazing sessions, and you have to check outpresentation on the Digital Value Accelerator (DVA) —don’t miss it! And of course, I’m thrilled to share my own session on smart manufacturing. Trust me, it’s going to be incredible.\n\nWhether you’re looking to dive deep into digital transformation or just want to chat about\nand\n, come join us! Swing by our sessions or stop by the booth—I’d love to connect. Let’s make it a week to remember!",
        "reactions": {
          "likes": "3",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/6dabaa77-ae02-4fd9-8695-1a72b0685a81",
        "comments": [],
        "commentAdded": "Sounds like an amazing start to the week! Excited for your session on smart manufacturing—looking forward to connecting! 🌟 #DigitalTransformation"
      }
    ],
    "errors": [
      {
        "postId": "urn:li:activity:7289649195941076992",
        "url": "https://www.linkedin.com/in/walterlorwin?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAACaWEEBNxC-bSADQ9mK-4Q3JS_dwfTq0ow",
        "errors": [
          "Failed to fetch reactions.",
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7288612580506431489",
        "url": "https://www.linkedin.com/in/cstone1?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAADUbUBF_tbtwrVRkQpE9YYbjHAB13qiVk",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7288546512924487684",
        "url": "https://www.linkedin.com/in/alok-kumar-1255a760?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAzm1e0BXxpmGcdQf718KMrDjfe-aQaWvUs",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7289597096217763840",
        "url": "https://www.linkedin.com/in/hamzaraufkhan?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADWPxjQBv4Kdj8skZvKjcMXVriLrMtOXLZ8",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7284663872106414082",
        "url": "https://www.linkedin.com/in/patelchinmay?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAKtDjUB3hxj4XyYpaaJWU-_CHM3S4Aptwc",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7289552391547359232",
        "url": "https://www.linkedin.com/in/cristian-mudure-9506183?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAACgBEwBcZH6muplFsd2Ji_GcjfawFvto5E",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7289645498573930496",
        "url": "https://www.linkedin.com/in/adam-rahmouni?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAC9WL7sBq5WTs1WYL_doMhyx589mkPm6-5Y",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7289332916327747584",
        "url": "https://www.linkedin.com/in/gail-stepanik-keber?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAJUtFQBSRO-8Yi5dU6AhbdmrnwF3ClmhxU",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7289524006288805888",
        "url": "https://www.linkedin.com/in/ezike-ruth-nnenna-094360275?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAEMmWnABA4jKLyutN4usQy5nNBOjiSZhB5Y",
        "errors": [
          "Failed to fetch media URL."
        ]
      }
    ]
  },
  {
    "postsData": [
      {
        "postId": "urn:li:activity:7289700206755885057",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289700206755885057",
        "url": "https://www.linkedin.com/in/chrisake?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAiQkwABGjALtgmgoBr2MaImCGYlGgj06Fw",
        "name": "Chris Ake\nChris Ake",
        "content": "If you have not casted your votes yet (Jan 31st cut off date) - I would suggest voting \"The Harris Building\" as one of the best wedding venues ;) PS: You don't have to vote on every single one, you can pick and choose. Thank you for all of your support!",
        "reactions": {
          "likes": "1 comment",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "The Party is in May at the Goei Center. ",
            "userName": "Chris Ake",
            "userProfileURL": "https://www.linkedin.com/in/chrisake",
            "dataId": "urn:li:comment:(activity:7289700206755885057,7289700313882599425)"
          }
        ],
        "commentAdded": "Absolutely agree! The Harris Building offers a stunning ambiance for weddings. Every vote helps highlight its charm! 🌟 #SupportLocalVenues"
      },
      {
        "postId": "urn:li:activity:7289694381534572544",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289694381534572544",
        "url": "https://www.linkedin.com/in/kevin-rapp-consulting?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAA94vUBAjs5PEGjiukZNewlau4jI1BCtUM",
        "name": "Kevin Rapp\nKevin Rapp",
        "content": "\"We're award-winning storytellers!\"\n\nThey don't care.\n\n\"We're passionate about the craft!\"\n\nThey don't care.\n\n\"We're an extension of your team!\"\n\nYou're not. If they wanted that, they'd be hiring, not outsourcing.\n\n\"We're a full-service studio!\"\n\nWhat, do you wash their windows?\n\n\"We're able to create anything, from concept to completion!\"\n\nOkay, but what do you ACTUALLY make?\n\nMost messaging by creatives doesn't pass a basic test: Why the hell should they care?\n\nEvery time you write a line on your website, in social promotion, for a capabilities deck, stop and ask the question:\n\n\"Do the people I'm speaking to actually care about this?\"",
        "reactions": {
          "likes": "59",
          "comments": "25 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Constant problem: getting metrics that show the value of what I create.",
            "userName": "Jonan Grobler",
            "userProfileURL": "https://www.linkedin.com/in/jonan-grobler",
            "dataId": "urn:li:comment:(activity:7289689548056379394,7289704747220029440)"
          }
        ],
        "commentAdded": "Great reminder! Focusing on genuine value rather than buzzwords truly resonates with clients. Lets speak their language!"
      },
      {
        "postId": "urn:li:activity:7289669258278559744",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289669258278559744",
        "url": "https://www.linkedin.com/in/sujay-u?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADsDuL4B9SWlgzSFZqhQsouXXQH6gPnbPQ0",
        "name": "Sujay U\nSujay U",
        "content": "Welcome to adulthood, where your paycheck is basically a guest in your life.\n\nComing in, saying hi, and leaving faster than your weekend plans.\n\nHere is how you can make it better.\n\n1) 50% Needs- these are your necessities (rent, groceries, Insurance)\n\n2) 30% Wants- these are your non desires (Travel, Dining out, Entertainment)\n\n3) 20% Savings- this is where the game changes, use this completely to invest which helps you to compound your wealth.\n\n|",
        "reactions": {
          "likes": "59",
          "comments": "25 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Adulthood hits hard when you realize how fast that paycheck disappears. But learning to manage it wisely is the key to making it work for you, not the other way around.",
            "userName": "Desma Rovina D'Souza 🎙",
            "userProfileURL": "https://www.linkedin.com/in/desmarovinadsouza",
            "dataId": "urn:li:comment:(activity:7289667797566033920,7289684070010085378)"
          }
        ],
        "commentAdded": "Great breakdown! Mastering the 50/30/20 rule is key to financial freedom. Lets make that paycheck stay a little longer! 💸"
      },
      {
        "postId": "urn:li:activity:7288759780314157056",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7288759780314157056",
        "url": "https://www.linkedin.com/in/anand-vaishampayan?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAACuTK8BKBxGXjrDMLiM78ZvzPEONbrrcAs",
        "name": "Anand Vaishampayan\nAnand Vaishampayan",
        "content": "Manager's Salary: 19 LPA\nTeam Member's Salary: 13 LPA\nTeam Member's New Job Offer: 20 LPA\n\nIs this a shocking reality for the manager?\n\nNot really.\n\nThis happens all the time.\n\nWhy?\n\nBecause...\n\nThe manager hasn't changed their Project/Tech stack/Company in 10+ years.\n\nThe team member switched 2 jobs in 5 years and stayed tech-savvy and in demand.\n\nOf course, at different phases of our lives -> We have different priorities!\n\nBut this highlights an important truth:\n\nThe job market rewards adaptability.\n\nIT professionals with 15+ years of experience,\nneed to understand:\n\n↳ The job world is evolving faster than ever.\n↳ Your comfort zone is your biggest trap.\n↳ Taking no risks is the riskiest move.\n↳ Your network is your net worth: build it.\n↳ Continuous learning isn’t optional, it’s survival.\n↳ Embrace change before it forces you to adapt.\n↳ Staying updated with trends is non-negotiable.\n\nThe time to reinvent yourself is HERE and NOW.\n\nAgree?\n\n  \n\nP.S.: Data points are for illustration only, but the situation is absolutely real.",
        "reactions": {
          "likes": "1,696",
          "comments": "82 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Aman Mehrotra Amogh Tripathi ROHIT LAGARKHA Atul Kimothi",
            "userName": "Jatin Tiwari",
            "userProfileURL": "https://www.linkedin.com/in/jatin-tiwari999",
            "dataId": "urn:li:comment:(activity:7288759780314157056,7288776228004630528)"
          },
          {
            "commentText": "Sadly, job market rewards only technological adaptability. \nWhile I agree on the need for self upskilling, comparison with a team member's salary is irrelevant and out of context. Scrum/Agile/PMP concepts do not evolve as rapidly as technologies, and hence you can't expect the middle management to start adapting and switch jobs every 2 years or start coding on any fine morning, they have their own shows to run that benefit the non technical aspects of a project. Team management, stakeholder relationship, risk management, business impacts and most important - resource management (that involves planning and hiring a new team member worth 20lpa so that the project delivers) are often neglected KPIs when middle management is evaluated, across both internal and external job market.",
            "userName": "Alok Deshpande",
            "userProfileURL": "https://www.linkedin.com/in/deshpandealok",
            "dataId": "urn:li:comment:(activity:7288759780314157056,7288906116804067328)"
          },
          {
            "commentText": "Alok Deshpande These are temporary.. Whenever there is a fall in new projects and there is a dry spell in the market, functional managers will be off demand.. When the market blossoms, managers will be on demand to deliver big ticket projects",
            "userName": "Sivaramakrishnan Sankar",
            "userProfileURL": "https://www.linkedin.com/in/sivaramakrishnan-sankar-43805239",
            "dataId": "urn:li:comment:(activity:7288759780314157056,7289657830754631680)"
          }
        ],
        "commentAdded": "Absolutely agree! In todays fast-paced market, adaptability is key. Lets embrace change and keep our skills sharp! #ContinuousLearning"
      },
      {
        "postId": "urn:li:activity:7289649196482056192",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289649196482056192",
        "url": "https://www.linkedin.com/in/nick-abraham?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACmm1X8BX1f303z6K3f1VUOCnIzhteY6x4M",
        "name": "Nick Abraham\nNick Abraham",
        "content": "Today, my agency sends 1,500,000 cold emails per month for >150 clients.\n\n5 years ago, we sent 0 cold emails for 0 clients.\n\nI compiled the 17 cold email tips I wish I knew 5 years ago that will help you master cold email in 2025.\n\n...and put them into one document for you to read, save, and send to your friends in outbound.\n\nI hope you love it. If you have any questions, let me know!",
        "reactions": {
          "likes": "59",
          "comments": "40 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Great tips! Cold emails are definitely an art. Excited to apply these!",
            "userName": "Neil Sarkar",
            "userProfileURL": "https://www.linkedin.com/in/neil-sarkar",
            "dataId": "urn:li:comment:(ugcPost:7288305506283134976,7289649173728047105)"
          },
          {
            "commentText": "Neil Sarkar So glad to hear! ",
            "userName": "Nick Abraham",
            "userProfileURL": "https://www.linkedin.com/in/nick-abraham",
            "dataId": "urn:li:comment:(ugcPost:7288305506283134976,7289656023529795584)"
          }
        ],
        "commentAdded": "Impressive growth! Excited to read your tips—mastering cold emails is key in todays market. Thanks for sharing your insights! 🚀"
      },
      {
        "postId": "urn:li:activity:7289676091517009920",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289676091517009920",
        "url": "https://www.linkedin.com/groups/762547?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A762547-7289676090204147713",
        "name": "Big Data 🟥 Data Science | Machine Learning | Deep Learning | Artificial Intelligence\nBig Data 🟥 Data Science | Machine Learning | Deep Learning | Artificial Intelligence",
        "content": "BIOMIMICRY CONTINUUM – Part 4 – Update Agent LEARNING\nFundamental evidence of learning is the ability to recall and utilize what is learned. Receiving and integrating new information is a starting point. It is not learning, but an exceedingly small subset.\nRecent research published in Nature uncovered that Concept Cells help our brain abstract information and build memories. (,)\n\nA report in Quanta magazine () provides an example: The idea of a “bank” has its own set of concept cells, maybe millions of them. Concept neurons fire for their concept no matter how it is presented: in real life or a photo, in text or speech, on television or in a podcast. “It’s more abstract, really different from what you’re seeing,” said Elizabeth Buffalo, a neuroscientist at the University of Washington.\n\nThese discoveries support and align with the abstraction methodology discussed in Part 2 and the contextualization methodology in Part 3.\n\n\n\nIn contrast to how the brain learns, LLMs:\n-process all ingested data rather than filtering for relevance, and\n-output the detailed words and pixels based on statistical proximity rather than conceptual value\nThe aim is to pass the Turing test, output that imitates the appearance of intelligence sufficiently to deceive the user.\n\nThe correctness of the result is dependent on the concentrations of relevant data in the training content. AI speed hides the fact that the model does not “know” anything but rather recomputes even identical prompts.\n\nOn the other hand, by imitating the learning and memory architecture and methodology of the brain the Agentic Expertise Ecosystem creates a library of reusable expertise and continues to learn. Imagine the applications when expertise is in high demand but sparse due to \"brain drain\" scenarios, new science and technology, or economic constraints.\n\nIn part 5 I will discuss the curation methodology.",
        "reactions": {
          "likes": "1",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Fascinating insights on the learning process! Bridging neuroscience and AI opens doors for innovative expertise solutions. Excited for Part 5!"
      },
      {
        "postId": "urn:li:activity:7289658544394489857",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289658544394489857",
        "url": "https://www.linkedin.com/in/angelagillnelms?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAkdZI0BRIXsVQk88XGJqfr-PLk6wp0ZhLo",
        "name": "Angela Gill Nelms\nAngela Gill Nelms",
        "content": "Charting the Course of Recovery:\n\nRecovery is more than a process—it's a profound journey that invites healing and fosters a deeper understanding of oneself. Each small step, no matter how challenging, is a victory to be celebrated, a testament to the traveler's courage and perseverance.\n\nLet’s honor each other's paths of recovery, acknowledging the bravery it takes to walk this road. Share your own triumphs, no matter how modest they may seem, or uplift someone on their journey with your words of support and encouragement.\n\nTogether, every step taken is a shared triumph in the collective human experience.",
        "reactions": {
          "likes": "2",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Absolutely! Every step in recovery is significant. Let’s continue to support one another and celebrate all victories, big or small. 💪✨"
      },
      {
        "postId": "urn:li:activity:7289653894949834753",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289653894949834753",
        "url": "https://www.linkedin.com/in/esteraanghelescu?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADD5McBKT8HNRtqwrN--meVnFclIxK_7dY",
        "name": "Estera Anghelescu, M.B.A.\nEstera Anghelescu, M.B.A.",
        "content": "Throwback to When Job Applications Were Sent by Courier!\n\nYes, you read that right.\nOver 20 years ago, applying for a job meant sending a physical folder with my resume - by courier - to the company’s address.\n\nIt feels surreal to think about how much has changed since then. No online forms, no LinkedIn, no “click to apply.” Just a neatly packed envelope, a courier, and a lot of hope.\n\nBut that’s not even the most surprising part of my journey to Kaufland Romania!\n\n Watch the video below to discover the unique way I landed my first role - and why it still makes me smile today.\n\n Do you remember how you applied for your first job? Share your story in the comments, I’d love to hear it!\n\n️ Share to inspire your network.\n Follow to see more of my insights:",
        "reactions": {
          "likes": "93",
          "comments": "73 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/8101c81d-7f04-467f-abbd-e17bcbc31290",
        "comments": [
          {
            "commentText": "Times have surely changed. I love the video. Turned out great, Estera Anghelescu, M.B.A.",
            "userName": "Natalia Cano",
            "userProfileURL": "https://www.linkedin.com/in/natcano",
            "dataId": "urn:li:comment:(ugcPost:7276878061877252096,7289683622775652355)"
          }
        ],
        "commentAdded": "What a fascinating throwback! It’s amazing how job applications have evolved. I remember sending mine via mail too! Excited to hear your story!"
      },
      {
        "postId": "urn:li:activity:7288286485949161472",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7288286485949161472",
        "url": "https://www.linkedin.com/company/yamaha-corporation/posts",
        "name": "Yamaha Corporation\nYamaha Corporation",
        "content": "“This might be one of my favorite pianos ever!” - Alicia Keys\n\nWe are delighted to say that we are showcasing the extraordinary one-of-a-kind piano meticulously crafted for Alicia Keys at2025.\n\nThis unique instrument represents the craftsmanship across our entire product range, showcasing our dedication to pushing the boundaries of sound and design.\n\nFrom the initial concept to the final touches, the journey of its creation is a testament to the dedication and passion that drives us.\n\nDelve into the captivating story behind the creation of this incredible piano crafted for Alicia Keys here:",
        "reactions": {
          "likes": "313",
          "comments": "11 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Yamaha instruments and equipment are unparalleled in quality. I've been playing Yamaha keyboards since 2001, and their exceptional customer service, product reliability, and competitive pricing make Yamaha my top choice.",
            "userName": "Tony Marino",
            "userProfileURL": "https://www.linkedin.com/in/tony-marino-4271561b4",
            "dataId": "urn:li:comment:(activity:7287771028213186562,7287886451038404608)"
          },
          {
            "commentText": "Spend 30 minutes banging out Les Mis on my father 8n law's DGX 670, great action, inherited his P80 for the band room.",
            "userName": "Dr. Craig Walker",
            "userProfileURL": "https://www.linkedin.com/in/dr-craig-walker-6b6b2b9b",
            "dataId": "urn:li:comment:(activity:7287771028213186562,7287824248570593281)"
          }
        ],
        "commentAdded": "What an inspiring showcase! 🎹 Excited to see how this extraordinary piano reflects the passion and craftsmanship behind your innovative designs."
      },
      {
        "postId": "urn:li:activity:7289433210864697344",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289433210864697344",
        "url": "https://www.linkedin.com/company/the-aispace-podcast-with-host-sanjay-kalluvilayil/posts",
        "name": "The AI Space Podcast with Host Sanjay Kalluvilayil\nThe AI Space Podcast with Host Sanjay Kalluvilayil",
        "content": "What’s the difference between supervised and unsupervised learning? Luigi LENGUITO of BforeAI breaks it down and explains how his company uses supervised learning to tackle phishing, ransomware, and fraud detection.”\n\nBy tagging and training systems with labeled data, supervised learning provides businesses with precise, actionable insights. Luigi also explores how AI-powered solutions are redefining security measures, paving the way for smarter and safer digital ecosystems.\n\nLearn more in the full episode of The AI Space Podcast, hosted by, here:",
        "reactions": {
          "likes": "31",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/5492b022-ac8f-4766-8285-f2c2068dc9c4",
        "comments": [
          {
            "commentText": "Before I get the Data Scientist and Engineers in my team to LOL at me, I'm not the expert on the topic ... just trying to make it easy to understand from the non experts like me!",
            "userName": "Luigi LENGUITO",
            "userProfileURL": "https://www.linkedin.com/in/llenguito",
            "dataId": "urn:li:comment:(ugcPost:7287938906874933248,7289601033259872257)"
          }
        ],
        "commentAdded": "Exciting insights, Luigi! Supervised learning is transforming security measures. Cant wait to dive into the full podcast episode! #AI #Cybersecurity"
      },
      {
        "postId": "urn:li:activity:7289641435316768768",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289641435316768768",
        "url": "https://www.linkedin.com/in/quotaleague?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABVHzusBxs_lZXvA8Khdlcgs9P5J_kEPYVg",
        "name": "Christian Krause\nChristian Krause",
        "content": "5 mistakes sellers make in the final days of Q4:\n\n1. Offering desperate discounts\n↳ You kill your own commissions\n↳ You destroy your pricing credibility\n↳ You repel prospects with desperation\n\n2. Pushing deals that aren't ready\n↳ False commitments from buyers fall through\n↳ You waste time that could go to better deals\n↳ Closing without proper onboarding backfires\n\n3. Living in your inbox\n↳ Refreshing emails won't close deals faster\n↳ You must pick up the phone to create urgency\n↳ Don't settle on what you have in the pipe\n\n4. Neglecting proper discovery\n↳ Skipping steps leads to surprise objections\n↳ Quality discovery = faster closing\n↳ Slow down to speed up\n\n5. Working alone\n↳ Your entire team wants to help\n↳ Leverage everybody for the final push\n↳ Get together for closing week!\n\nHere's what top performers do in the final days:\n\n• Focus on real deals with pain & budget\n• Multi-thread to speed up decisions\n• Get executives involved early\n• Plan for worst case scenarios\n• Start building Q1 pipeline\n\nEnd of quarter pressure is real.\nBut panic leads to bad decisions.\n\nStay focused on value.\nThe quota will follow.\n\nWhat's your best Q4 closing tip?\n\n️ Repost to help your sales team close the FY strong!\n Followfor daily tips to hit your quota\n\nPS: Happy closing to all sellers who have their end of Q4 this week!",
        "reactions": {
          "likes": "196",
          "comments": "36 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Panic has never closed a deal. Focus on the real opportunities, keep it steady, and let value lead the way. Q4’s about finishing smart, not frantic",
            "userName": "Neil Sarkar",
            "userProfileURL": "https://www.linkedin.com/in/neil-sarkar",
            "dataId": "urn:li:comment:(activity:7289628271762096129,7289637303814107136)"
          },
          {
            "commentText": "Neil Sarkar Well said, Neil. A steady, value-driven approach always outperforms frantic efforts in the long run.",
            "userName": "Christian Krause",
            "userProfileURL": "https://www.linkedin.com/in/quotaleague",
            "dataId": "urn:li:comment:(activity:7289628271762096129,7289646531362648066)"
          }
        ],
        "commentAdded": "Great insights! Staying focused on value is key. Looking forward to hearing everyone’s best strategies for a strong finish! 💪 #SalesSuccess"
      },
      {
        "postId": "urn:li:activity:7288982712441319424",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7288982712441319424",
        "url": "https://www.linkedin.com/in/mkoesterer?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAJ9iiAB5bh6NL9kMz59hr5JCHi31nuQIM8",
        "name": "Mark R. Koesterer\nMark R. Koesterer",
        "content": "Building Champions Beyond the Game\n\nPlease follow us at The Players NIL",
        "reactions": {
          "likes": "3",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Looks great!",
            "userName": "Stephen L. Henkle",
            "userProfileURL": "https://www.linkedin.com/in/stephen-l-henkle-50390460",
            "dataId": "urn:li:comment:(ugcPost:7288617812552548354,7289066649201057792)"
          }
        ],
        "commentAdded": "Fantastic initiative! Empowering athletes to succeed off the field is crucial. Excited to see how The Players NIL will drive this forward! 🏆"
      },
      {
        "postId": "urn:li:activity:7289642679410343936",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289642679410343936",
        "url": "https://www.linkedin.com/in/sourish-bujarbaruah-%F0%9F%93%8C-358151292?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAEbbSbQBQ1yJDc_BGln6hqJUzcOAV7M699s",
        "name": "Sourish Bujarbaruah 📌\nSourish Bujarbaruah 📌",
        "content": "Do not let negative words stop your progress! Be like the lotus , it is pure and unsoiled by the mud around and emerges whole and beautiful.\n\nGood leaders avoid negativity and stay positive.\n\nI always say, \"Negative people need drama like oxygen. Stay positive, it will take their breath away\".\n\nRemember, in our journey of progress, it is positivity that will enable us to thrive.\n\nLife is about balance. Be kind, but don't allow others' words or opinions affect your growth.\n1. Forge self-awareness and acceptance.\n2. Give cognitive reappraisal a whirl!\n\nAnd at times (when you're overwhelmed), just breathe and affirm:\n\"I am strong enough to handle my challenges, wise enough to find solutions and capable enough to do whatever that needs to be done\".\n\nNote: I was not in India and hence didn't post for a week. However I was definetly active and all your lovely posts added a lot of value to my learning.",
        "reactions": {
          "likes": "144",
          "comments": "119 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/344b4049-8505-4b24-b67b-9bffcae9c917",
        "comments": [
          {
            "commentText": "Growth isn’t always easy, but positivity makes it possible!\n\nThanks a ton, Sourish Bujarbaruah  Sir, for sharing such a thoughtful perspective on negativity!",
            "userName": "Chitra Lele—Spirit-Tech Synergist",
            "userProfileURL": "https://www.linkedin.com/in/chitraleleauthorandsoftwareengineer",
            "dataId": "urn:li:comment:(ugcPost:7289642661433524224,7289698544716808192)"
          },
          {
            "commentText": "Chitra Lele—Spirit-Tech Synergist thank you for being there, always. Although I may not write as great as you do, but your support means a lot.",
            "userName": "Sourish Bujarbaruah 📌",
            "userProfileURL": "https://www.linkedin.com/in/sourish-bujarbaruah-%F0%9F%93%8C-358151292",
            "dataId": "urn:li:comment:(ugcPost:7289642661433524224,7289699046443663361)"
          },
          {
            "commentText": "\"Negative words? No match for a resilient spirit! \nBe like the lotus: pure, unshaken, and thriving amidst challenges. \n\nYour positivity uplifts, and your words inspire.",
            "userName": "Malaika Asif",
            "userProfileURL": "https://www.linkedin.com/in/malaikaasif",
            "dataId": "urn:li:comment:(ugcPost:7289642661433524224,7289645326729146368)"
          },
          {
            "commentText": "Malaika Asif always welcome.",
            "userName": "Sourish Bujarbaruah 📌",
            "userProfileURL": "https://www.linkedin.com/in/sourish-bujarbaruah-%F0%9F%93%8C-358151292",
            "dataId": "urn:li:comment:(ugcPost:7289642661433524224,7289646293994389504)"
          }
        ],
        "commentAdded": "Absolutely love this perspective! Embracing positivity truly fosters growth and resilience. Lets keep shining like the lotus! 🌟"
      },
      {
        "postId": "urn:li:activity:7289657047342559232",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289657047342559232",
        "url": "https://www.linkedin.com/in/fowlerinternational?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAADYLABKV1pJExQh3hmg5AhCU7Gt_GUkA8",
        "name": "Gary Fowler\nGary Fowler",
        "content": " Breaking Barriers: Simplenight Redefines Global Commerce with AI!\n\nDiscover how Simplenight is creating a seamless digital ecosystem uniting industries like travel, finance, government, and more! \n\nImagine planning trips, optimizing operations, and getting personalized recommendations—all in one platform. With over 10M bookable products and AI-powered solutions, Simplenight is transforming the way we connect and do business.\n\n Why wait? See how Simplenight is leading the future of global innovation and earning recognition from The Globe and Mail.\n\n Click here to learn more:",
        "reactions": {
          "likes": "8",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Exciting times ahead! Simplenights innovation is paving the way for a seamless global commerce experience. Cant wait to see whats next! 🚀"
      },
      {
        "postId": "urn:li:activity:7289666925016584192",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289666925016584192",
        "url": "https://www.linkedin.com/in/soniahunt?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAAfioBZ9Sc_-P9Ib4GOMlSuYFbV6Afko4",
        "name": "Sonia Hunt\nSonia Hunt",
        "content": "Leadership is about holding yourself accountable.\n(and a little humor doesn't hurt!)\n\n\nPhilly's Mayor, Cherelle Parker, had an E-L-G-S-E-S moment while celebrating thebig win yesterday!\n\nCriticism poured in.\nMost of it super harsh and unfair.\n\nAll for a leader who's turning around a tough city.\n\nBut, Mayor Parker stood tall.\nShe owned her mistake⎯publicly.\nShe corrected it⎯publicly.\nAnd even poked fun at herself as the moment went viral.\n\nHow many leaders actually do this? Very little.\n\nWhether it’s a viral slip-up or a private team conversation,\nwhen leaders hold themselves accountable, everyone wins.\n\nThe opposite creates distrust and undermines leadership.\nAnd we don't need any more of this.\n\nLeaders don't need to be perfect.\nThey can show they're human too.\nThat what we need more of.\n\nHere’s to leadership accountability &self-awareness!\nAnd GOin Super Bowl LIX!\n\n\nWatch clip:",
        "reactions": {
          "likes": "3",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Kudos to Mayor Parker for exemplifying true leadership! Accountability and a sense of humor go a long way. Here’s to more authentic leaders! 👏🎉"
      },
      {
        "postId": "urn:li:activity:7289701291725832192",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289701291725832192",
        "url": "https://www.linkedin.com/in/greerprocich?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAtnfZsBFpglYMKiCm5IXPt_6lahyRXqIOg",
        "name": "Greer Procich, M.A., sHRBP\nGreer Procich, M.A., sHRBP",
        "content": "January has already been quite the year, amirite?\n\n \n\nAfter everything 2025 has already thrown our way, prioritizing mental wellness isn’t just important, it’s essential.\n\nI’m excited to share some thoughts and have real conversations about how we can navigate these challenges and do better together. Plus, getting to learn from some of the greats like,, and? Can't wait for this one.\n\nClick's link below and be sure to sign up.",
        "reactions": {
          "likes": "13",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Well I know two of the four are awesome cause I've experienced their awesomeness so it's gotta be pretty awesome. ",
            "userName": "Trip Barnes",
            "userProfileURL": "https://www.linkedin.com/in/trip-barnes",
            "dataId": "urn:li:comment:(ugcPost:7289667787885625344,7289681419843366912)"
          }
        ],
        "commentAdded": "Absolutely agree! Prioritizing mental wellness is crucial. Looking forward to the insights and discussions ahead! Let’s support each other. 🌟"
      },
      {
        "postId": "urn:li:activity:7289702277882204160",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289702277882204160",
        "url": "https://www.linkedin.com/in/realariharrison?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAbzkk8B0-9GsRjLh_YWhCg-aL9rJf4E4uw",
        "name": "Ari Harrison\nAri Harrison",
        "content": "DeepSeek’s recent rise to the top of the App Store has been a defining moment. While some have called it a \"surprise,\" those of us tracking AI advancements over the past 18 months know this was anything but. Chinese LLMs have consistently pushed boundaries, with models like Alibaba’s Qwen family leading the charge. When Qwen-2.5 launched in September 2024, it quickly became a benchmark for open-source excellence.\n\nBut what truly sets DeepSeek apart is its groundbreaking efficiency. DeepSeek v3 was trained on just 1,500 GPUs at a cost of $5.5 million—a fraction of what Western counterparts typically spend. This was made possible by architectural innovations like their advanced MoE (Mixture of Experts) framework, multi-headed latent attention, and cutting-edge quantization techniques (FP16 to FP8). These breakthroughs highlight how creativity can thrive even under constraints.\n\nThe U.S. chip export bans, initially seen as a setback, may have inadvertently accelerated innovation in China. By limiting access to compute resources, these restrictions forced a sharper focus on algorithmic and data efficiency. As the saying goes, *necessity is the mother of invention.*\n\nSo, what does this mean for the future of AI? A few thoughts:\n\n1️⃣ Compute vs. Architecture: The narrative that compute is the ultimate differentiator in AI is shifting. As we approach the limits of scaling laws, architectural ingenuity—like DeepSeek’s—will likely take center stage. AI might be entering its own \"compression era,\" where smarter, not bigger, models lead the way.\n\n2️⃣ Impact on Chipmakers: While Nvidia’s stock has dipped recently, the long-term demand for GPUs remains strong. The majority of compute needs are already shifting toward inference, meaning smaller pretraining runs won’t drastically alter the market.\n\n3️⃣ Open-Source Parity: For the first time, an open-source model (DeepSeek) has achieved near parity with closed-source giants. History shows that when open-source catches up, developers overwhelmingly flock to it. If this trend continues, DeepSeek could reshape global AI development, challenging U.S. leadership in the space.\n\n4️⃣ A Win for Global AI: Beyond geopolitics, DeepSeek’s success is a testament to the power of innovation and collaboration. Their openness in sharing knowledge is a win for the entire AI community. Innovation knows no borders, and DeepSeek’s achievements deserve recognition without asterisks.\n\nKudos to the DeepSeek team for pushing the boundaries of what’s possible. I’m excited to see what they’ll do next—and how their work will inspire the next wave of AI breakthroughs. ",
        "reactions": {
          "likes": "2\nSarah Lloyd Favaro and 1 other",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Incredible insights! DeepSeek’s success showcases the power of innovation and collaboration in AI. Excited to see where this leads next! 🚀"
      },
      {
        "postId": "urn:li:activity:7289289248346656768",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289289248346656768",
        "url": "https://www.linkedin.com/in/maththinking?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAD5LcBBZCNJ3T89euZhuJxAmL1RWcykg4",
        "name": "Ju Rao\nJu Rao",
        "content": "Life, the Universe and Everything: 42 Fundamental Questions - https://lnkd.in/esqgTuHA\nLook for \"Read and Download Links\" section to download. Follow/Connect me if you like this post.",
        "reactions": {
          "likes": "16",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Great resource! Excited to explore these fundamental questions. Thanks for sharing! 🌌✨ #LifelongLearning"
      },
      {
        "postId": "urn:li:activity:7289643774366912512",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289643774366912512",
        "url": "https://www.linkedin.com/in/deeannturner?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAA0GNdEBG_PWneygzeNGHuYxGgew756MQZQ",
        "name": "Dee Ann Turner®\nDee Ann Turner®",
        "content": "Are you willing to take big risks to Crush Your Career? My young client did and it paid off! Sometimes you have to “Do it Afraid.”",
        "reactions": {
          "likes": "15",
          "comments": "2 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/e6498988-8916-46c3-9201-45b6bd637165",
        "comments": [
          {
            "commentText": "Dee Ann you are a super star! Thank you for your continued goal of serving others together. ",
            "userName": "Bill Forster",
            "userProfileURL": "https://www.linkedin.com/in/forsterbill",
            "dataId": "urn:li:comment:(ugcPost:7289641138771099649,7289643754792042496)"
          }
        ],
        "commentAdded": "Absolutely! Taking calculated risks is often the key to unlocking new opportunities. Kudos to your client for embracing their journey! 🌟"
      },
      {
        "postId": "urn:li:activity:7289551715555508224",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289551715555508224",
        "url": "https://www.linkedin.com/in/ahmed-rashed974?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAArkZoEBtj4T0zB8xZgeROCj7Y0X7FQG24Q",
        "name": "Ahmed Rashed 🚀\nAhmed Rashed 🚀",
        "content": " A Moment That Will Last a Lifetime  \n\nCristiano Ronaldo once again showed why he’s not just a football legend but also a class act off the pitch. During the *Globe Soccer Awards* in Dubai last December, where he was honoured as the Best Middle Eastern Player and the All-Time Top Goalscorer, Ronaldo made a young fan’s dream come true.\n\nNew footage captures the heartwarming moment when the Portuguese icon brushed off security to personally sign a young boy’s football shirt and ball. The boy, visibly excited, approached Ronaldo with his memorabilia and a pen, and Ronaldo didn’t hesitate to make time for him.\n\n Why this matters: It’s a reminder that success isn’t just about achievements—it’s about the impact you have on others. Small gestures like this can leave a lasting impression and inspire the next generation.\n\nWhat’s your take on moments like these? Let’s celebrate the power of kindness and connection! ",
        "reactions": {
          "likes": "2,074",
          "comments": "364 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/fcd20dbe-b25a-4294-8710-87a3de7f8add",
        "comments": [
          {
            "commentText": "Looking to supercharge your Career, Mindset, or Creativity? These influencers are changing the game in their fields and are a must-follow for daily inspiration and actionable insights: Steve Davis | Shikha Gupta (L.I.O.N) | Philipp Kozin, PhD, MBA||||||",
            "userName": "Ahmed Rashed 🚀",
            "userProfileURL": "https://www.linkedin.com/in/ahmed-rashed974",
            "dataId": "urn:li:comment:(ugcPost:7289323353289478145,7289540864551378945)"
          },
          {
            "commentText": "Ahmed Rashed  Absolutely, those influencers are worth following for a boost in inspiration and practical advice!\nIt’s incredible how powerful their insights can be in transforming our careers and mindsets.\nHave you had any particularly impactful moments or advice from them that you've applied in your journey?",
            "userName": "LORESCAR SL",
            "userProfileURL": "https://www.linkedin.com/company/lorescar-sl/posts",
            "dataId": "urn:li:comment:(ugcPost:7289323353289478145,7289545395133673472)"
          },
          {
            "commentText": "What a truly heartwarming moment! Ahmed Rashed   Cristiano Ronaldo continues to redefine what it means to be a role model, both on and off the field.\nHis willingness to interact with that young fan not only highlights his incredible character but also sets a powerful example for everyone, especially for those in positions of influence.\n\n\nIn a world often driven by competition and accolades, Ronaldo’s actions remind us that genuine connections and acts of kindness can have a tremendous impact.\nIt’s moments like these that can shape a young person’s life and inspire future leaders.\nIt’s not just about the trophies and records; it's about the memories we create and the people we touch along the way.\n⭐️\n\nThis story reinforces the idea that no matter how successful we become, it’s essential to remain approachable and kind.\nAfter all, we have the potential to inspire countless others with our gestures, no matter how small they may seem.\n\n\nWhat do you think about the responsibility of public figures in setting such positive examples?\nLet’s keep the conversation going!\n",
            "userName": "LORESCAR SL",
            "userProfileURL": "https://www.linkedin.com/company/lorescar-sl/posts",
            "dataId": "urn:li:comment:(ugcPost:7289323353289478145,7289537430670483456)"
          },
          {
            "commentText": "LORESCAR SL Absolutely agree!\nMoments like this truly reflect the essence of being a role model.\nRonaldo's actions reinforce the idea that kindness can leave a profound impact on young minds.\nIt's inspiring to see public figures like him prioritizing connection over accolades.\nWhat do you think are some effective ways for influencers to promote kindness in their communities?\nLet's dive deeper!",
            "userName": "Ahmed Rashed 🚀",
            "userProfileURL": "https://www.linkedin.com/in/ahmed-rashed974",
            "dataId": "urn:li:comment:(ugcPost:7289323353289478145,7289541075382231041)"
          }
        ],
        "commentAdded": "Incredible to see icons like Ronaldo making genuine connections! Its the small acts of kindness that truly inspire future generations. 🌟 #Inspiration"
      }
    ],
    "errors": [
      {
        "postId": "urn:li:activity:7289700206755885057",
        "url": "https://www.linkedin.com/in/chrisake?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAiQkwABGjALtgmgoBr2MaImCGYlGgj06Fw",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7289694381534572544",
        "url": "https://www.linkedin.com/in/kevin-rapp-consulting?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAA94vUBAjs5PEGjiukZNewlau4jI1BCtUM",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7289669258278559744",
        "url": "https://www.linkedin.com/in/sujay-u?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADsDuL4B9SWlgzSFZqhQsouXXQH6gPnbPQ0",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7288759780314157056",
        "url": "https://www.linkedin.com/in/anand-vaishampayan?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAACuTK8BKBxGXjrDMLiM78ZvzPEONbrrcAs",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7289649196482056192",
        "url": "https://www.linkedin.com/in/nick-abraham?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACmm1X8BX1f303z6K3f1VUOCnIzhteY6x4M",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7289676091517009920",
        "url": "https://www.linkedin.com/groups/762547?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A762547-7289676090204147713",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7289658544394489857",
        "url": "https://www.linkedin.com/in/angelagillnelms?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAkdZI0BRIXsVQk88XGJqfr-PLk6wp0ZhLo",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7288286485949161472",
        "url": "https://www.linkedin.com/company/yamaha-corporation/posts",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7289641435316768768",
        "url": "https://www.linkedin.com/in/quotaleague?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABVHzusBxs_lZXvA8Khdlcgs9P5J_kEPYVg",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7288982712441319424",
        "url": "https://www.linkedin.com/in/mkoesterer?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAJ9iiAB5bh6NL9kMz59hr5JCHi31nuQIM8",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7289657047342559232",
        "url": "https://www.linkedin.com/in/fowlerinternational?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAADYLABKV1pJExQh3hmg5AhCU7Gt_GUkA8",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7289666925016584192",
        "url": "https://www.linkedin.com/in/soniahunt?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAAfioBZ9Sc_-P9Ib4GOMlSuYFbV6Afko4",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7289701291725832192",
        "url": "https://www.linkedin.com/in/greerprocich?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAtnfZsBFpglYMKiCm5IXPt_6lahyRXqIOg",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7289702277882204160",
        "url": "https://www.linkedin.com/in/realariharrison?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAbzkk8B0-9GsRjLh_YWhCg-aL9rJf4E4uw",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7289289248346656768",
        "url": "https://www.linkedin.com/in/maththinking?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAD5LcBBZCNJ3T89euZhuJxAmL1RWcykg4",
        "errors": [
          "Failed to fetch media URL."
        ]
      }
    ]
  }
]