{
  "posts": [
    {
      "postId": "urn:li:activity:7287861620599336960",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287861620599336960",
      "url": "https://www.linkedin.com/in/yuhelenyu?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADPqtcBN8ROzfTXJfYivUVJiimQhHSyo-U",
      "name": "Helen Yu\nHelen Yu",
      "content": "What sets leading companies apart in leveraging AI to create value? \n\nAccording to's AI Radar report for 2025:\n Three-quarters of executives see AI as a top-three strategic priority for 2025.\n Companies plan to increase their GenAI investments by 60% over the next three years.\n One in three companies plan to spend $25 million or more on AI in 2025.\n Less than 10% of executives expect a decrease in headcount due to AI automation\n AI agents are already being used by 15% of companies, with 67% considering them as a complement to human talent.\n Executives envision AI and humans working side by side, with 64% of them supporting this view.\n\nLeading companies allocate over 80% of their AI investments to reshaping critical functions and inventing new products and services with the following priorities:\n Deploying AI in everyday tasks for 10-20% productivity gains\n Reshaping critical functions to boost efficiency and effectiveness by 30-50%\n Inventing new products and services for long-term competitive advantage\n Focusing on an average of 3.5 AI use cases (compared to 6.1 for others), leading to 2.1 times greater anticipated ROI on AI initiatives\n Setting clear goals and tracking top- and bottom-line impact, although 60% of companies fail to define or monitor financial KPIs related to AI value creation\n Leaders follow the 10-20-70 Principle to create value: 10% Algorithms; 20% Technology; 70% People and processes\n\nWhat many companies still struggle with:\n Reimagining workflows and driving cultural change\n Hiring AI talent and upskilling their workforce\n\nTo maximize AI value creation,\nshould focus on:\n Breaking through AI's imagination gap\n Targeting and prioritizing AI efforts\n Putting AI at the service of enterprise ambition\n Leading cultural and organizational change\n Preparing for what’s next in AI\n\nWhat have you done getting your company ready to close the AI impact gap? Please share.\n\n\nWant more insights on\nand\n?\n Subscribe to the\nnewsletter hereor our YouTube channel here.",
      "reactions": {
        "likes": "2",
        "comments": "1 comment",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Wow great insights.",
          "userName": "Timothy Goebel",
          "userProfileURL": "https://www.linkedin.com/in/timothygoebel",
          "dataId": "urn:li:comment:(ugcPost:7287558391210688512,7287862243461865473)"
        }
      ],
      "commentAdded": "Great insights! It’s clear that AIs true power lies in collaboration with human talent. Excited to see how companies bridge the AI impact gap!"
    },
    {
      "postId": "urn:li:activity:7287854488286031872",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287854488286031872",
      "url": "https://www.linkedin.com/in/bleamjennifer?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAdS_MgB_9odrFWIpkQ2HIOknAy8Z19gx7E",
      "name": "Jennifer Bleam, Sales Sherpa\nJennifer Bleam, Sales Sherpa",
      "content": "Channel events aren’t just booths and banners; they’re golden opportunities to drive measurable results. \n\nBut with budgets tightening and ROI under the microscope, how do you make sure every event truly delivers?\n\nJoin me,, andfor Beyond the Booth, where we reveal how to transform events into revenue-generating machines.\n\nYou’ll walk away with actionable strategies, battle-tested frameworks, and real-world examples to make every event a high-impact success.\n\nHere’s what we’ll cover:\n⭐ Master Your Prep: Define clear goals and build a strategy that sets you up to win.\n⭐ Booth Brilliance: Capture attention, spark meaningful conversations, and walk away with leads.\n⭐ Follow-Up That Closes Deals: Turn event buzz into actual revenue.\n⭐ Prove Your ROI: Show leadership exactly why events are worth the investment.\n\nWho Should Attend?\nIf you’re ready to elevate your event strategy, prove its value, and drive real growth, this session is for you.\n\nIt’s time to stop seeing events as just another budget line item. Let’s turn them into the growth engines they were always meant to be. \n\nGrab your spot now!",
      "reactions": {
        "likes": "3",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Excited for Beyond the Booth! Transforming events into growth engines is a game changer—cant wait to learn more about actionable strategies! 🌟"
    },
    {
      "postId": "urn:li:activity:7287862380233965569",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287862380233965569",
      "url": "https://www.linkedin.com/in/iankoniak?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAFLnMABFRGo_S75dhEwpmkTwAeJfDCXGBM",
      "name": "Ian Koniak\nIan Koniak",
      "content": "My #1 goal in life:\n\nRaise my children in a happy, peaceful home.\n\nWhen I bring home stress from work, it effects everybody.\n\nMy kids pick up on my energy and act out.\n\nMy wife tenses up.\n\nMy negative energy is contagious, even if it’s unintentional.\n\nOn the flip side, when I am grateful, present, and joyful from the daily blessing of being with my family, everything changes.\n\nMy wife lights up.\n\nMy children laugh and smile.\n\nAnd I’m much happier.\n\nGratitude and presence bring peace to your home.\n\nBut this doesn't always come naturally.\n\nWe must set our intention and let go of whatever we come home with.\n\nWhy is this important?\n\nBecause our family deserves it.\n\nIf you want peace in your home, your must be peaceful and lead by example.\n\nI know I still have lots of work to do, but this is a goal that I can strive for daily.\n\nHope you will join me and lead by example.",
      "reactions": {
        "likes": "29",
        "comments": "3 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "couldn't agree more—peace starts with us!",
          "userName": "Ronen R. Pessar",
          "userProfileURL": "https://www.linkedin.com/in/rpessar",
          "dataId": "urn:li:comment:(activity:7287858301940178944,7287862360109723649)"
        }
      ],
      "commentAdded": "What a powerful reminder! Leading by example truly creates a nurturing environment. Here’s to intentional presence and boundless gratitude! 🌟"
    },
    {
      "postId": "urn:li:activity:7287847784655794176",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287847784655794176",
      "url": "https://www.linkedin.com/in/sameerranjan009?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABjl9l0Bkk6w4b5EjM9ImD-uc_WJvdkFo-w",
      "name": "Sameer Ranjan\nSameer Ranjan",
      "content": "I see a $500B investment in AI infrastructure as a massive opportunity for the rise of blue-collar jobs; I believe this move will strategically place many Americans back to work and start running the micro-economy, including shops and better revenue values during long weekends and festivals. This is a capitalist economy 101, where an infusion of money is going to reach a newer segment of society that was economically not very strong in the last few years. It might also lose better interest rates on construction materials, balanced labor costs, and increased consumption of workplace-based health insurance firms. Right now, the future looks symbiotically well for both white-collar and blue-collar jobs.",
      "reactions": {
        "likes": "7",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Absolutely! This investment could transform the job landscape, fostering growth for both blue-collar and white-collar sectors. Exciting times ahead!"
    },
    {
      "postId": "urn:li:activity:7287540511412740096",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287540511412740096",
      "url": "https://www.linkedin.com/in/yash-kumar-b9348b1a5?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAC_yWN8Bt99bHcBFY8Sgwq-XnHXLBWjCei4",
      "name": "Yash Kumar\nYash Kumar",
      "content": "You WON’T make $10,000 a month if:\n\nYou have the ‘ wrong offer’ . Here’s what I mean:\n\n↳ All businesses have something to sell.\n\n↳ They know their audience.\n\n↳ Yet, some don’t even acquire thier first client in years.\n\nNeed more ‘ Clients ‘?\n\nBuild a ‘ Micro Offer ‘ in just two steps:\n\n1.Sell something small that helps your audience.\n\nExample:\n\n1. Provide personalised consultation or audits.\n\n2. Sell something completely FREE first.\n\nExamples :\n\n1. Build lead magnets  ( PS: they work really well. )\n\n2. 0% Risk Pricing Model ( check comment for the example ).\n\nResults:\n\n→ 2 Meetings Booked in last 3 three days.\n\n→ If I can, you can do it too. \n\nRemember:\n\nThe Offer is the bridge between your service and your ideal client.\n\nBuild a strong one, so your clients walk towards you.\n\nBecause you deserve to make $10,000 a month. ️",
      "reactions": {
        "likes": "6",
        "comments": "2 comments",
        "shares": "0"
      },
      "mediaUrl": "blob:https://www.linkedin.com/921422fa-e349-4ac4-a401-49676a1d9a5d",
      "comments": [
        {
          "commentText": " 0% Risk Pricing: \n\nExample: Pay-Per-Lead pricing model. \n\nI provide FREE qualified leads to my clients.\n\nMy clients don’t pay until meetings are booked.\n\nThis is exactly how I booked 2 meetings in last 3 days.\n\nTakeaway: No Brainer Offers → Client’s Risk Eliminated. ",
          "userName": "Yash Kumar",
          "userProfileURL": "https://www.linkedin.com/in/yash-kumar-b9348b1a5",
          "dataId": "urn:li:comment:(ugcPost:7287540500549496832,7287543215715418112)"
        },
        {
          "commentText": " PS: ThIs is the bridge I was talking about. \n\nYou are just a comment away from a FREE personalised bridge. I meant Offer. ",
          "userName": "Yash Kumar",
          "userProfileURL": "https://www.linkedin.com/in/yash-kumar-b9348b1a5",
          "dataId": "urn:li:comment:(ugcPost:7287540500549496832,7287548940835540995)"
        }
      ],
      "commentAdded": "Great insights! A strong offer truly is the key. Excited to implement these strategies and attract more clients! 🚀"
    },
    {
      "postId": "urn:li:activity:7287754701792575489",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287754701792575489",
      "url": "https://www.linkedin.com/in/rokify?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABxZHjQBwoL1hLv1_W5bo9o1aNiKtx1yAFY",
      "name": "Roki Hasan\nRoki Hasan",
      "content": "Shoutout to Glenn Lai from FR8Labs!\n\nIn Podcast Episode 3, I had the privilege of sitting down with Glenn, the founder of FR8Labs, to dive into his journey of scaling a business.\n\nGlenn shared valuable insights on overcoming challenges in sales, hiring, and market expansion, and discussed how building a strong sales team and integrating AI can drive significant growth.\n\nIf you’re focused on scaling your business, this episode is filled with practical lessons that can make a real difference.\n\nI’ll be highlighting my favorite takeaways throughout the week, but if you’re ready to dive in now, the full episode link is in the comments below.\n\nWhat’s the biggest challenge you’re facing in scaling your business? Let me know in the comments.",
      "reactions": {
        "likes": "620",
        "comments": "285 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": " https://open.spotify.com/episode/4xeC4ZfCPxX7C3pMo02Ik9?si=7BlmC0-UT0uwh-kRAgTb0Q",
          "userName": "Roki Hasan",
          "userProfileURL": "https://www.linkedin.com/in/rokify",
          "dataId": "urn:li:comment:(activity:7287714280257298432,7287714493848051713)"
        },
        {
          "commentText": " https://youtu.be/1jjcU97teVQ",
          "userName": "Roki Hasan",
          "userProfileURL": "https://www.linkedin.com/in/rokify",
          "dataId": "urn:li:comment:(activity:7287714280257298432,7287714421114597376)"
        }
      ],
      "commentAdded": "Great insights! Glenns experience is a treasure trove for those looking to scale. Excited to hear your favorite takeaways! 🎧🚀"
    },
    {
      "postId": "urn:li:activity:7287862317759836160",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287862317759836160",
      "url": "https://www.linkedin.com/in/duebendorfer?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAXbp8BCWsWE1RS_1K9mldHq26X0mXMPms",
      "name": "Thomas Dübendorfer\nThomas Dübendorfer",
      "content": "A wake-up call for Europe & Switzerland: US president Donald Trump just cancelled the AI regulations in the US that imposed registration and notification duties on new AI models and announced a new USD 500 billion (!!!) investment in the AI joint venture \"Stargate\" backed by OpenAI, Oracle, and Softbank. The goal is to create 100,000 new jobs in five years and to win the AI race and the first tranche of USD 100 billion will be invested this year.\n\nEurope's path currently seems to try to eliminate potential AI threats rather than taking advantage of our amazing AI talent and let them build the most elaborate AI systems to solve mankind's complex problems. The biggest danger seems to me losing the AI race and becoming heavily dependent on others to get access to AI services.\n\n\n\nSource:",
      "reactions": {
        "likes": "47",
        "comments": "7 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "It's worrying because it means that some of the smartest people on the planet have managed to convince the political powers that such an insane quantity of money is genuinely going to change the future. Elon Musk before his stupid antics referred to the administration as a \"win for civilisation\". This means there is institutional grade change on the horizon for just about every business.\n\nI hope it makes people here wake up rather than dip their head. Europe is lucky to have incredibly smart minds to work and to solve the problems. My main worry will be that they will be sucked out of Europe incredibly quickly if they don't feel they can be competitive here and be part of that change.\n\nCurrently working on solving an institutional problem myself and was already told bluntly by several that we should be raising in USA immediately.",
          "userName": "Thomas Wallace",
          "userProfileURL": "https://www.linkedin.com/in/thomasjudewallace",
          "dataId": "urn:li:comment:(activity:7287855670773579777,7287862787211448322)"
        },
        {
          "commentText": "ah well. the race was already pretty much decided or not? If you look at the investments done by the Big Tech firms I don't think anyone can honestly think Europe could compete here. The reality is that we lost every single tech wave race in the last 30-40 years and that weights too much, not giving us the means to compete with \"gleiche Spiesse\".\n\nQuo vadis now? Try to: 1) finally face reality and not claim we are still leaders as I can hear all the time, 2) think long-term what should be done, 3) learn from the leaders, 4) give it highest priority and not just a side show",
          "userName": "Ralf Haller",
          "userProfileURL": "https://www.linkedin.com/in/ralfhaller",
          "dataId": "urn:li:comment:(activity:7287855670773579777,7287860727434940416)"
        }
      ],
      "commentAdded": "This is a pivotal moment! Europe must harness its AI talent and innovate, not just regulate, to remain competitive on the global stage."
    },
    {
      "postId": "urn:li:activity:7287861786068893698",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287861786068893698",
      "url": "https://www.linkedin.com/in/cindyrayfield?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAFQwKQB-F8oXPqamZC25pBkeLT53MdCgkw",
      "name": "Cindy Rayfield\nCindy Rayfield",
      "content": "𝗟𝗲𝘃𝗲𝗹 𝗨𝗽 𝗬𝗼𝘂𝗿 𝗙𝗿𝗮𝗻𝗰𝗵𝗶𝘀𝗲 𝗶𝗻 𝟮𝟬𝟮𝟱: 𝗦𝗲𝘁 𝗦𝗠𝗔𝗥𝗧 𝗚𝗼𝗮𝗹𝘀 𝗳𝗼𝗿 𝗦𝘂𝗰𝗰𝗲𝘀𝘀  \n\nReady to make 2025 your most successful year yet? \n\nSetting clear and achievable goals is essential for any business, especially when you're building a franchise.\n\nIntroducing the power of SMART goals – Specific, Measurable, Attainable, Relevant, and Time-bound – and how to use them to drive your franchise's success.\n\nLearn how to set ambitious yet achievable targets and create a roadmap for achieving your business dreams in the new year! ",
      "reactions": {
        "likes": "0",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Great insights! Embracing SMART goals can truly transform franchise success. Excited to see how we can implement these strategies in 2025! 🚀"
    },
    {
      "postId": "urn:li:activity:7287773801109495809",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287773801109495809",
      "url": "https://www.linkedin.com/in/darrellodonnell?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAA9NMBTk2yMWzQELTGCCgzHHA3smV-jOA",
      "name": "Darrell O'Donnell\nDarrell O'Donnell",
      "content": "Great panel about government and private sector roles (and delineation) for interoperable wallets - at House of Switzerland World Economic Forum in \nhashtag\n#Davos. With a new focus on governments role,is taking on a critical mission.\n\n\nDigital wallets are a critical piece for digital trust. That’s whatis all about - we are a forum where leaders are doing the hard work of rebuilding trust in our digital world.\n\nI look forward to working withmore closely this year to help each other.",
      "reactions": {
        "likes": "20",
        "comments": "2 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "PoA",
          "userName": "Darrell O'Donnell",
          "userProfileURL": "https://www.linkedin.com/in/darrellodonnell",
          "dataId": "urn:li:comment:(ugcPost:7287773799888953344,7287775677167083520)"
        },
        {
          "commentText": "Incredible assembly of governments, enterprises, entrepreneurs, and technologists! We are committed to help drive greater innovation, adoption, use, and value for learners everywhere. Digital Educational Credentials Pearson Credly by Pearson",
          "userName": "David Treat",
          "userProfileURL": "https://www.linkedin.com/in/davidbtreat",
          "dataId": "urn:li:comment:(ugcPost:7287773799888953344,7287775645621784576)"
        }
      ],
      "commentAdded": "Exciting insights on digital wallets role in trust building! Looking forward to collaborating for a stronger, interoperable future. #Davos"
    },
    {
      "postId": "urn:li:activity:7287835545613832193",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287835545613832193",
      "url": "https://www.linkedin.com/in/brian-rollins-39026329?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAXpJFwB9YzFb1-VWjqretaHbb0LuyEiDxA",
      "name": "Brian Rollins\nBrian Rollins",
      "content": "Have you ever flushed a dollar down the toilet?\n\nYour business is flushing money. \n\nA customer journey is generally,\n\n1. Awareness\n2. Consideration\n3. Purchase\n4. Support\n\nYou’re lose customers during consideration, and are struggling with support.\n\nConsideration takes follow up and activating pain points.\n\nFollow up is so easy and nobody does it!\n\nYou can easily use Ai for follow up and generate revenue rather quickly.\n\nSupport is the same way! There’s a lot of wasted costs in support. Ai rids you of a ton of those costs and keeps focus strictly on supporting.\n\nAi is not some crazy expensive system that is difficult to implement.\n\nHumans are a crazy expensive system to implement!!\n\nWhat are the biggest stoppers of using customer facing Ai in your business?",
      "reactions": {
        "likes": "1",
        "comments": "1 comment",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Brian Rollins, implementing ai strategically in customer touchpoints can significantly optimize costs while enhancing service quality. have you explored specific solutions? ",
          "userName": "Oleksandr Khudoteplyi",
          "userProfileURL": "https://www.linkedin.com/in/olkh",
          "dataId": "urn:li:comment:(activity:7287835545613832193,7287838334322708480)"
        }
      ],
      "commentAdded": "Great insights! Embracing AI for customer engagement can truly transform the journey and enhance support while reducing costs. What tools are you considering?"
    }
  ],
  "errors": [
    {
      "postId": "urn:li:activity:7287861620599336960",
      "url": "https://www.linkedin.com/in/yuhelenyu?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADPqtcBN8ROzfTXJfYivUVJiimQhHSyo-U",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287854488286031872",
      "url": "https://www.linkedin.com/in/bleamjennifer?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAdS_MgB_9odrFWIpkQ2HIOknAy8Z19gx7E",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287862380233965569",
      "url": "https://www.linkedin.com/in/iankoniak?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAFLnMABFRGo_S75dhEwpmkTwAeJfDCXGBM",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287847784655794176",
      "url": "https://www.linkedin.com/in/sameerranjan009?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABjl9l0Bkk6w4b5EjM9ImD-uc_WJvdkFo-w",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287754701792575489",
      "url": "https://www.linkedin.com/in/rokify?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABxZHjQBwoL1hLv1_W5bo9o1aNiKtx1yAFY",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287862317759836160",
      "url": "https://www.linkedin.com/in/duebendorfer?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAXbp8BCWsWE1RS_1K9mldHq26X0mXMPms",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287861786068893698",
      "url": "https://www.linkedin.com/in/cindyrayfield?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAFQwKQB-F8oXPqamZC25pBkeLT53MdCgkw",
      "errors": [
        "Failed to fetch reactions.",
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287773801109495809",
      "url": "https://www.linkedin.com/in/darrellodonnell?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAA9NMBTk2yMWzQELTGCCgzHHA3smV-jOA",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287835545613832193",
      "url": "https://www.linkedin.com/in/brian-rollins-39026329?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAXpJFwB9YzFb1-VWjqretaHbb0LuyEiDxA",
      "errors": [
        "Failed to fetch media URL."
      ]
    }
  ]
}