{
  "posts": [
    {
      "postId": "urn:li:activity:7288948905273171970",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7288948905273171970",
      "url": "https://www.linkedin.com/in/cindyrayfield?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAFQwKQB-F8oXPqamZC25pBkeLT53MdCgkw",
      "name": "Cindy Rayfield\nCindy Rayfield",
      "content": " 𝗝𝘂𝗴𝗴𝗹𝗶𝗻𝗴 𝗮 𝗙𝗿𝗮𝗻𝗰𝗵𝗶𝘀𝗲? 𝗗𝗼𝗻'𝘁 𝗟𝗲𝘁 𝗣𝗲𝗿𝘀𝗼𝗻𝗮𝗹 𝗕𝗿𝗮𝗻𝗱𝗶𝗻𝗴 𝗦𝗹𝗶𝗽! \n\nIt's easy to get overwhelmed running your business, but building your personal brand can be easier than you think! \n\n Here's how to make it work:\n\n 𝗧𝘂𝗿𝗻 𝗱𝗮𝗶𝗹𝘆 𝘁𝗮𝘀𝗸𝘀 𝗶𝗻𝘁𝗼 𝗰𝗼𝗻𝘁𝗲𝗻𝘁: Share your experiences solving problems, training staff, and negotiating deals. Your insights are valuable! \n 𝗠𝘂𝗹𝘁𝗶𝗽𝗹𝘆 𝘆𝗼𝘂𝗿 𝗲𝗳𝗳𝗼𝗿𝘁𝘀: Repurpose one piece of content across different platforms (LinkedIn, Twitter, blog, etc.). Efficiency is key! ⏰\n 𝗘𝗺𝗯𝗿𝗮𝗰𝗲 𝘆𝗼𝘂𝗿 𝗹𝗼𝗰𝗮𝗹 𝗰𝗼𝗺𝗺𝘂𝗻𝗶𝘁𝘆: Engage with local businesses and share your involvement in community events. Build genuine connections! \n\nBuilding a strong personal brand sets you apart and attracts customers. Start today! ",
      "reactions": {
        "likes": "0",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": []
    },
    {
      "postId": "urn:li:activity:7272878723400441856",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7272878723400441856",
      "url": "https://www.linkedin.com/company/fpt-software/posts",
      "name": "FPT Software\nFPT Software",
      "content": "Vietnam’s tech transformation goes beyond its major hubs. Cities like Hue, Da Nang, Quy Nhon, Nha Trang, and Can Tho are emerging as rising stars in the country’s digital journey. Beyond travel destinations, these cities boast immense potential for tech infrastructure, smart city initiatives,\nand data science research, semiconductors, and talent pool.\n\nis leveraging this potential by making significant investments to foster a future-ready tech workforce and sustainable innovation, establishing them as innovation and off-shore delivery hubs.\n\n Discover how the cities are poised to redefine Vietnam’s tech landscape:\n\n",
      "reactions": {
        "likes": "1,172",
        "comments": "19 comments",
        "shares": "0"
      },
      "mediaUrl": "blob:https://www.linkedin.com/50b4afd9-2fb1-4575-8ad5-a07559824fc6",
      "comments": [
        {
          "commentText": "Wow, looks like Vietnam's tech scene is going on a city tour!  From Hue to Can Tho, it's like the Avengers of tech innovation assembling across the country.  Can't wait to see these cities shine brighter than my laptop screen at 2 AM!  Kudos to FPT Software for leading the charge! ",
          "userName": "MD. MARJAN AHMED",
          "userProfileURL": "https://www.linkedin.com/in/md-marjan-ahmed",
          "dataId": "urn:li:comment:(ugcPost:7272878297049370625,7288943625709707265)"
        },
        {
          "commentText": "Exciting to see Vietnam's tech landscape expanding beyond its major hubs!  It's inspiring how cities like Hue, Da Nang, and Quy Nhon are becoming innovation hotspots. Kudos to FPT Software for investing in talent and sustainable innovation.  Looking forward to seeing how these initiatives shape the future of tech in Vietnam! ",
          "userName": "Md. Mahmood Hassan",
          "userProfileURL": "https://www.linkedin.com/in/affiliatea",
          "dataId": "urn:li:comment:(ugcPost:7272878297049370625,7288932341207482370)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7288911003524694016",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7288911003524694016",
      "url": "https://www.linkedin.com/in/mkoesterer?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAJ9iiAB5bh6NL9kMz59hr5JCHi31nuQIM8",
      "name": "Mark R. Koesterer\nMark R. Koesterer",
      "content": "Day 25 the Rocky Steps challenge\n\nKey Opportunities for Young Athletes on Linkedin\n\n: The Undisputed Champion of Professional Networking\nLinkedIn is an indispensable tool for any serious professional, especially athletes.\nIt's not just a platform; it's a dynamic ecosystem for:\n* Building your professional brand: Showcase your skills, experience, and accomplishments.\n* Connecting with industry leaders: Network with potential employers, mentors, and collaborators.\n* Sharing your expertise: Amplify your voice and build thought leadership.\n* Conducting in-depth research: Gain valuable insights into companies, industries, and potential career paths.\n\nEvery athlete, regardless of their sport or stage in their career, should leverage LinkedIn to:\n* Expand their professional network: Connect with coaches, agents, scouts, and industry professionals.\n* Explore career opportunities: Discover potential career paths beyond professional sports.\n* Build their brand: Share their story, values, and aspirations with the world.\n\nDon't let this powerful platform go to waste! You can start building your LinkedIn profile today.\n\n\nYou can listen to more of my thoughts HERE:",
      "reactions": {
        "likes": "6",
        "comments": "1 comment",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Great points, Young athletes should use LinkedIn to open up doors for the future. Mark R.",
          "userName": "Tess Cheng M.",
          "userProfileURL": "https://www.linkedin.com/in/tess-cheng-ms",
          "dataId": "urn:li:comment:(activity:7288911003524694016,7288913388070424576)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7288574047427207169",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7288574047427207169",
      "url": "https://www.linkedin.com/in/avikashar?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAM8VzgBHtWK2yCdgFmLTodmnRLXizaDyDM",
      "name": "Avik Ashar\nAvik Ashar",
      "content": "We have officially hit peak f***ing AI. \n\nI just got pitched by:\n\n> Someone making an AI comment engine, which reads through posts, premium can watch videos, then posts a comment\n\n>> Someone making AI video making, from script generation to AI human talking, basically a full AI influencer\n\nSo effectively, AI makes, AI likes, Human … reads an actual made-from-paper book in Bali? (that's the dream).\n\nHowever until we create basic human income and unlimited energy (where I REALLY REALLY hoped billions of research dollars were being funnelled into, as opposed to job destruction), it looks like content is taking the nosedive of it's life.\n\n2025 ... looks interesting",
      "reactions": {
        "likes": "639",
        "comments": "223 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "AI is unstoppable like the internet and mobile before; but winning AI market share as a startup is hard with everyone doing AI like a bubble; big tech companies Google, Microsoft, Amazon, etc. may ultimately dominate the AI services, causing the 97% of AI startups to fail. AI is the riskiest bet.\n\nAI contrarian investor: Many people hate AI-generated posts and comments, even wrongly accusing those who use certain words or styles of being AI bots.\nSo, invest in ways to ban AI use, like mandating the typing of all text by hand and input fields with disabled copy-paste and tool access.\n\nIs it impossible? AI texts may be generated elsewhere and re-typed, so you can make some automation slower, not remote the AI-generated content publishing, unless you introduce a witness, which is impractical.\n\nThere may be no way to detect or limit AI content publishing, and it is 97% unlikely that you will make a serious profit from AI unless you're a big tech corporation. So, do not invest in AI or anti-AI; both are unlikely profitable.",
          "userName": "Fabio Ciucci",
          "userProfileURL": "https://www.linkedin.com/in/fciucci",
          "dataId": "urn:li:comment:(activity:7288454732061233152,7288908567657521152)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7270093673529331712",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7270093673529331712",
      "url": "https://www.linkedin.com/company/geartechnologies/posts",
      "name": "Gear Technologies\nGear Technologies",
      "content": "The Arkanoid Simulation shows how Gear.exe redefines what’s possible for Ethereum Mainnet onchain performance.\n\nAll with near-zero gas fees, NO fragmentation and NO latency ↓\n\nWhat is the Arkanoid Simulation?\n\nIt’s not just a game. It’s a high-load simulation designed to test onchain performance.\n\nEach “game” involves intensive calculations—tracking ball physics, collisions, and game logic—all processed onchain.\n\nWhy does this matter?\n\n- Ethereum struggles with latency and heavy computations due to its gas limits.\n- Layer 2 solutions like Arbitrum improve scalability but inherit EVM performance limits and come with fragmentation.\n\nOn the other hand...\n\nGear.exe is an Ethereum network extension that executes multiple simulations in a single block with near-zero gas fees and comes without fragmentation.\n\nThe Setup:\n\nWe tested the same simulation on:\n- Ethereum: Baseline test to measure performance and costs.\n- Arbitrum EVM: Cheaper, but same gas logic as Ethereum.\n- Arbitrum Nitro: Optimized with WASM, 1,000 iterations per block.\n- Gear.exe: Parallel execution of 16 games in a single Ethereum block.\n\nWhy Gear.exe stands out:\n\n- Runs 16 high-load simulations simultaneously in a single block.\n- Near-zero gas costs and and low latency for massive computations.\n- Drastically improved UX: avoids fragmentation and latency on user a side.\n- Fully compatible with Ethereum (MetaMask, Etherscan).\n- Network extension - value accrual on Ethereum mainnet.\n\nImagine the possibilities:\n\nThis simulation demonstrates that Gear.exe isn’t just for gaming—it’s a game-changer for any high-load computation on Ethereum mainnet.\n\n• DeFi protocols? Check.\n• Machine learning models? Check.\n• Real-time gaming? Check.\n\nAnd we kept the receipts to prove it:",
      "reactions": {
        "likes": "4,013",
        "comments": "67 comments",
        "shares": "0"
      },
      "mediaUrl": "blob:https://www.linkedin.com/8f79c0f7-b7fc-4ead-b8bd-47805ade8aec",
      "comments": [
        {
          "commentText": "\"Impressive strides in redefining onchain performance!  The Arkanoid Simulation not only highlights Gear.exe’s groundbreaking capabilities but also opens the door to limitless possibilities for Ethereum Mainnet scalability.\nAt ITabet, we recognize the immense potential of such advancements in reshaping industries—whether it’s real-time gaming, DeFi, or even machine learning applications.\nWith our expertise in web development, Android solutions, UI/UX design, and beyond, we’re excited to see how tools like Gear.exe can further power decentralized applications with seamless user experiences.\nKudos to the team behind this innovative leap! Looking forward to seeing how this transforms high-load computations. ",
          "userName": "ITabet",
          "userProfileURL": "https://www.linkedin.com/company/it-abet/posts",
          "dataId": "urn:li:comment:(ugcPost:7270093552490012672,7282593421721006081)"
        },
        {
          "commentText": "Great to hear about the AI-powered LMS!\nWe specialize in creating exceptional e-learning content—videos, SCORM packages, simulations, and story-driven training tailored for sales, leadership, and compliance. Our solutions have driven 95% compliance rates and boosted engagement by 35%, helping organizations achieve impactful results.\nTo see how we do it, check out our e-learning cheat sheet here:and explore more about our work:.\nLet’s connect and shape the future of e-learning together!",
          "userName": "Sentientia Interactive Services Pvt. Ltd.",
          "userProfileURL": "https://www.linkedin.com/company/sentientia/posts",
          "dataId": "urn:li:comment:(ugcPost:7270093552490012672,7285966279151165440)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7288422424126074880",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7288422424126074880",
      "url": "https://www.linkedin.com/in/sandeep-dinodiya?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAjV68YBDGiWNlfy0lNRRRpHXJVCZj8e8eU",
      "name": "Sandeep Dinodiya\nSandeep Dinodiya",
      "content": "How easy can you solve the complex problems as a credit risk analyst. Let’s try this out. ",
      "reactions": {
        "likes": "17\nPrabhat Pankaj and 16 others",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": []
    },
    {
      "postId": "urn:li:activity:7288546052213747712",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7288546052213747712",
      "url": "https://www.linkedin.com/in/natcano?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADe6bkBfPFbXIN9FxF-PzJGXzJ2Rs7baZ0",
      "name": "Natalia Cano\nNatalia Cano",
      "content": "The worst advice for anyone struggling in their career:\n\n“Stay positive\"\n\nYes, it is well-intentioned.\n\nBut it can do more harm than good.\n\nHere's why:\n\n Invalidates Emotions\n↳ Everyone is allowed to experience disappointment\n\n Oversimplifies Complex Situations\n↳ Making people feel like they're failing\n\n Places the Burden on the Individual\n↳ Suggesting that a better attitude is the solution\n\n Dismissive and Insensitive\n↳ Conveying their struggles aren't being taken seriously\n\nInstead:\n\nTry these 5 supportive actions\n\n(and make a real difference in someone's career):\n\n1. Validate and Acknowledge\n↳ \"It sounds like you're going through a tough time.\"\n↳ \"Losing a job can be incredibly disappointing.\"\n\n2. Offer Practical Support\n↳ \"I'm here for you.\"\n↳ \"How can I support you during this time?\"\n\n3. Be Present and Listen\n↳ \"I'm here to listen if you want to talk.\"\n↳ \"I'm happy to be a sounding board for you.\"\n\n4. Focus on Understanding:\n↳ \"I can only imagine how challenging this must be.\"\n↳ \"What are you feeling most concerned about?\"\n\n5. Offer Encouragement and Perspective\n↳ \"I know this is a setback, but I also know how resilient you are.\"\n↳ \"You've overcome challenges before, and I believe you'll navigate this one as well.\"\n\nRemember:\n\n'Showing up' is more powerful than 'cheering up'.\n\nDo you agree?\n\nLet me know below in the comments\n\n‾‾‾‾‾‾‾‾‾\n️ Repost to share help others offer meaningful support\nFollow mefor daily content like this",
      "reactions": {
        "likes": "764",
        "comments": "225 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Absolutely Natalia Cano. Offering empathy and practical support far outweighs empty platitudes. Acknowledging someone's struggles can create the space they need to heal and move forward.",
          "userName": "Damesha Craig, Leadership Coach and Startup Advisor",
          "userProfileURL": "https://www.linkedin.com/in/dameshacraig",
          "dataId": "urn:li:comment:(activity:7288541069892370432,7288545999457828865)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7285641992007495680",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7285641992007495680",
      "url": "https://www.linkedin.com/company/filestack/posts",
      "name": "Filestack\nFilestack",
      "content": " Optimizing Amazon S3 Uploads with Python\nUploading large files to Amazon S3? Learn how multipart uploads can make the process faster and more efficient in this comprehensive guide.\nRead the full tutorial here:",
      "reactions": {
        "likes": "12",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": []
    }
  ],
  "errors": [
    {
      "postId": "urn:li:activity:7288948905273171970",
      "url": "https://www.linkedin.com/in/cindyrayfield?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAFQwKQB-F8oXPqamZC25pBkeLT53MdCgkw",
      "errors": [
        "Failed to fetch reactions.",
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7288911003524694016",
      "url": "https://www.linkedin.com/in/mkoesterer?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAJ9iiAB5bh6NL9kMz59hr5JCHi31nuQIM8",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7288574047427207169",
      "url": "https://www.linkedin.com/in/avikashar?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAM8VzgBHtWK2yCdgFmLTodmnRLXizaDyDM",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7288422424126074880",
      "url": "https://www.linkedin.com/in/sandeep-dinodiya?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAjV68YBDGiWNlfy0lNRRRpHXJVCZj8e8eU",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7288546052213747712",
      "url": "https://www.linkedin.com/in/natcano?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADe6bkBfPFbXIN9FxF-PzJGXzJ2Rs7baZ0",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285641992007495680",
      "url": "https://www.linkedin.com/company/filestack/posts",
      "errors": [
        "Failed to fetch media URL."
      ]
    }
  ]
}