{
  "posts": [
    {
      "postId": "urn:li:activity:7287507341434933248",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287507341434933248",
      "url": "https://www.linkedin.com/company/forbes-magazine/posts",
      "name": "Forbes\nForbes",
      "content": "Introducing Forbes 2025 Canada's Best Employers:\n\nTo determine the ranking, Forbes partnered with market research firm Statista to survey more than 40,000 Canada-based employees working for companies and institutions that employ at least 500 individuals within Canada.\n\nCheck out the 2025 list, here:",
      "reactions": {
        "likes": "8",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Exciting to see the focus on employee satisfaction! Kudos to all the employers fostering a positive work environment. Cant wait to explore the list!"
    },
    {
      "postId": "urn:li:activity:7287453218962374657",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287453218962374657",
      "url": "https://www.linkedin.com/in/christinalangdoncoachconsultant?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAFTKXUBfbA1AVJGERPumW45HsdACxqLq8E",
      "name": "Christina Langdon - Success Coach\nChristina Langdon - Success Coach",
      "content": "We're all in our own heads. It's why we only scratch the surface of what we are capable of. \n\nLast week, I led a workshop with CEOs, founders, and high-achievers to explore what holds us back from our reaching \"impossible\" goals and full potential.\n\nWhat struck me wasn't the differences between us – it was the similarities.\n\n\"I'm not disciplined enough.\"\n\"I don't have the right connections.\"\n\"I'm scared of scaling.\"\n\"I need to be more confident.\"\n\nThese weren't the voices of newbies. These were the honest reflections from achievers who've already proven themselves – yet still wrestle with the same doubts we all do.\n\nThen something wonderful happened.\n\nWe flipped the script. Instead of focusing on what we lacked, we imagined who we needed to become.\n\nThe energy shifted from \"I can't\" to \"What if?\"\n\nThe most powerful realization: Your impossible goal isn't about having all the answers – it's about being willing to question your assumptions about what's possible for you, for your business and for what you want most.\n\nOne CEO summed it up perfectly: \"I am my past self's dream.\"\n\nThink about that for a moment. You've already achieved what once seemed impossible to your younger self.\n\nYour next impossible goal is just waiting for you to reimagine what's possible.\n\nAfter all, imagination doesn't just help us dream – it helps us see opportunities where others see constraints.\n\nWhat's your impossible goal for 2025?\n\nMore importantly, who do you need to become to achieve it?\n\n_________________________________\n\nIn 2025, you could look back at this moment as the turning point where you decided to become the person who achieves the impossible. Let's map out that journey together.\n\nI work with accomplished executives to break through self-imposed limitations and achieve what they once thought impossible. We'll transform your \"someday\" goals into actionable steps through a unique blend of imagination expansion and strategic planning.\n\nBook a complimentary Impossible Possibility Strategy Session to explore how we can make your biggest goals a reality.",
      "reactions": {
        "likes": "5",
        "comments": "2 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Loved this Christina Langdon - Success Coach \n\nImagination is more than a creative tool.\n\nIt’s what lets us rewrite the rules we’ve unconsciously been living by.\n\nAnd sometimes.\n\nAll it takes is one small, bold step to prove to yourself that the impossible isn’t as far away as it seems",
          "userName": "Tripti Agarwal 🎸",
          "userProfileURL": "https://www.linkedin.com/in/tripti-agarwal-%F0%9F%8E%B8-b69394273",
          "dataId": "urn:li:comment:(activity:7287453218962374657,7287461172826513408)"
        },
        {
          "commentText": "Tripti Agarwal  We are the only species who can imagine, yet it is one of our most underused superpowers. Imagination is not about creativity, but about asking, What If? Imagination questions why processes exist as they do. Imagination is seeing possibilities in place of constraints. The most successful companies leverage awareness (strengths, weaknesses, capabilities and capacities) with a practice to imagine extraordinary outcomes.",
          "userName": "Christina Langdon - Success Coach",
          "userProfileURL": "https://www.linkedin.com/in/christinalangdoncoachconsultant",
          "dataId": "urn:li:comment:(activity:7287453218962374657,7287506979151900672)"
        }
      ],
      "commentAdded": "Inspiring insights! Breaking through self-imposed limits is key. Excited to explore whats possible when we challenge our assumptions! 🚀"
    },
    {
      "postId": "urn:li:activity:7287478047631462401",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287478047631462401",
      "url": "https://www.linkedin.com/in/sahilkataria?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAeUmF8BKZv-laaK4cpNPbgYOMgv_jRnUeM",
      "name": "Sahil Kataria\nSahil Kataria",
      "content": "Today I faced very something very new,\n\nthe younger generation faces unique challenges that can sometimes be hard to understand. Recently, I've noticed a trend where new employees experience a \"mind block\" on their first day, leading them to reconsider their job commitment.\n\nIt's crucial for us as employers and colleagues to recognize and address these challenges. Creating a supportive and understanding work environment can make a significant difference.\n\nLet's focus on:\n\nOpen Communication: Encourage new hires to share their concerns and experiences without fear of judgment.\n\nMentorship Programs: Pairing new employees with experienced mentors can provide guidance and support.\n\nMental Health Resources: Offering resources and support for mental well-being can help employees navigate their initial hurdles.\n\nBy fostering a culture of empathy and support, we can help the next generation thrive in their careers.\n\nLet's work together to make our workplaces more inclusive and understanding.\n\nComment if you have faced any such issues or do you think people are very previldged these days to say this?",
      "reactions": {
        "likes": "0",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Great insights! Creating a culture of support is vital. Open communication and mentorship can truly transform the onboarding experience."
    },
    {
      "postId": "urn:li:activity:7287461472576630787",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287461472576630787",
      "url": "https://www.linkedin.com/in/michaelocean?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABRkVVcBdJXrbHnrLNPe5NG3L1FNnS_LDdw",
      "name": "Michael Ocean\nMichael Ocean",
      "content": "From one-off training to everboarding: How JLL keeps 600+ sellers sharp.\n\n\n(Director of Learning Design at JLL, previously led revenue enablement at Outreach) was on my podcast the other day. She shared how their Power Hour program is transforming traditional sales training into an engaging weekly rhythm that actually sticks.\n\n\nHere's what caught my attention:\n\n- They run weekly sessions split by audience\n- Global, Client Growth, Solutions Development, and Leaders\n- Every session starts with thought leadership topics (like how to discuss AI in commercial real estate)\n- Leaders preview and shape content a month in advance\n- The program reaches 600+ revenue professionals globally\n\n\nIn the full episode, we covered:\n\n- Why everboarding beats traditional onboarding\n- How to avoid the \"vending machine\" approach to sales enablement\n- Strategies for engaging remote teams effectively\n- Building frameworks that work for both startups and established enterprises\n- The role of AI in modern sales enablement\n\n\nWant to learn how JLL structures their sales enablement for a 250 year old company?\n\nCheck out the full conversation in the comments ",
      "reactions": {
        "likes": "10",
        "comments": "8 comments",
        "shares": "0"
      },
      "mediaUrl": "blob:https://www.linkedin.com/b10db158-f8ce-41c4-b491-7b15e30e608c",
      "comments": [
        {
          "commentText": "Full episode here: https://studio.youtube.com/video/CPPVmmgtHqY/edit",
          "userName": "Michael Ocean",
          "userProfileURL": "https://www.linkedin.com/in/michaelocean",
          "dataId": "urn:li:comment:(ugcPost:7286903355468099584,7287462192080191488)"
        },
        {
          "commentText": "Everboarding for the WIN. Just don’t go overboard  srsly, with every new initiative, ya gotta make sure everyone is onboard… another solid pod with great insights! Thank you Michael",
          "userName": "Mike D'Angelo",
          "userProfileURL": "https://www.linkedin.com/in/mdangelo",
          "dataId": "urn:li:comment:(ugcPost:7286903355468099584,7287468056736325632)"
        },
        {
          "commentText": "Mike D'Angelo “just don’t go overboard” Sometimes we think giving more to our reps is the best solution, but in fact, it only creates distractions! Every program should be designed to genuinely benefit the end user—there’s no way around it. Thanks for your continued support ma man!",
          "userName": "Michael Ocean",
          "userProfileURL": "https://www.linkedin.com/in/michaelocean",
          "dataId": "urn:li:comment:(ugcPost:7286903355468099584,7287489339477929984)"
        },
        {
          "commentText": "Michael here to support the cause. JIT > JIC\n\nJust in time is always better than “just in case” enablement\n\nBonus points if you put it into the flow of the sellers work.",
          "userName": "Mike D'Angelo",
          "userProfileURL": "https://www.linkedin.com/in/mdangelo",
          "dataId": "urn:li:comment:(ugcPost:7286903355468099584,7287500839378694148)"
        }
      ],
      "commentAdded": "Exciting insights on evolving sales training! Love the focus on engaging, tailored sessions. Cant wait to listen to the full episode! 🎧"
    },
    {
      "postId": "urn:li:activity:7287465172800094208",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287465172800094208",
      "url": "https://www.linkedin.com/in/garettm?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAxhx8oBrMrQ4Rb6q9ZLv7KibK_ydWLFZCE",
      "name": "Garett Moreau 🇺🇸\nGarett Moreau 🇺🇸",
      "content": "It appears a massive botnet powered by 13,000 hijacked MikroTik routers is sending malicious emails to bypass email protections and launch malware campaigns.\n\nThe attack leverages misconfigured DNS and SPF records, making it easier for threat actors to spoof legitimate domains.",
      "reactions": {
        "likes": "4",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "This highlights the urgent need for robust security configurations! Staying ahead of threats like this is crucial for protecting our digital assets."
    },
    {
      "postId": "urn:li:activity:7287456811404697601",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287456811404697601",
      "url": "https://www.linkedin.com/in/nsodhi4696?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABvDwhYBeOQsVdZL_UsEagVey2rO5-gt01E",
      "name": "Niharikaa Kaur Sodhi\nNiharikaa Kaur Sodhi",
      "content": "I'm going to write something difficult today about how I completely screwed up my LinkedIn strategy. I hope this helps you grow and print some $$$$.\n\nYou see, I've been writing LinkedIn only for fun—all ad hoc stuff. I didn't use it to sell until a student told me that they didn't know of my offerings because they never saw them.\n\nThen I saw the power of LinkedIn to print money. Most of my customers are from here.\n\nI made one mistake - I know you'll say CRINGE.\n\nI used my personal photos because the algorithm promotes them. This gave me an array of likes and followers—so many of them.\n\nI still like them, even on others, but not all the time. I think they add a personal touch but irrelevant selfies are, well... irrelevant.\n\nSo I pivoted my strategy a few months ago where I used more quotes. Here's what happened:\n likes went down\n went down\n⬆️ engagement increased\n⬆️ SALES increased $$$$$\n\nBecause I was putting relevant content.\n\nThis relevant content did not have\n- my personal diary thoughts\n- 'how to grow on LinkedIn'\n- 'how to grow personal brand'\n- paid engagement (fun fact: any post that has the same number of comments as likes = paid comments )\n\nI feel all this has been easy to do because I love, love, and write for the love of it. I don't care about the numbers increasing online (only in my bank account ).\n\nI have no attachment to the outcome.\n\nI hope this helps you.\n\nThis is one of the many instances over the last three years in the creator economy that keep proving that likes/followers and money aren't directly proportional.",
      "reactions": {
        "likes": "424",
        "comments": "147 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "My LinkedIn mantra: Give, Give, and Give so much value to the people so they won't ignore you and feel eager to pay back to you.\nNiharikaa Kaur Sodhi",
          "userName": "Ankit Sharma",
          "userProfileURL": "https://www.linkedin.com/in/heyankitsharma",
          "dataId": "urn:li:comment:(activity:7287454071731433473,7287454918536302592)"
        },
        {
          "commentText": "Ankit Sharma Absolutely, value always comes back tenfold.",
          "userName": "Niharikaa Kaur Sodhi",
          "userProfileURL": "https://www.linkedin.com/in/nsodhi4696",
          "dataId": "urn:li:comment:(activity:7287454071731433473,7287458444104646656)"
        },
        {
          "commentText": "Ankit Sharma agree with you",
          "userName": "MD Sallauddin",
          "userProfileURL": "https://www.linkedin.com/in/mdsallauddin",
          "dataId": "urn:li:comment:(activity:7287454071731433473,7287461109261905920)"
        },
        {
          "commentText": "I've noticed that a lot of people are using paid engagement to boost their numbers. \n\nIt's definitely a quick way to get more likes and comments, but I don't think it's a sustainable strategy in the long run.\n\nPeople can tell when a post is inauthentic, and it can actually hurt your credibility.",
          "userName": "Aashish Singhal",
          "userProfileURL": "https://www.linkedin.com/in/aashish-singhal-virtualcfo",
          "dataId": "urn:li:comment:(activity:7287454071731433473,7287457904880730112)"
        },
        {
          "commentText": "Aashish Singhal authenticity always wins in the end.",
          "userName": "Niharikaa Kaur Sodhi",
          "userProfileURL": "https://www.linkedin.com/in/nsodhi4696",
          "dataId": "urn:li:comment:(activity:7287454071731433473,7287461117973475328)"
        }
      ],
      "commentAdded": "Thanks for sharing your journey! Its a powerful reminder that genuine, relevant content drives real results. Keep inspiring us! 🚀"
    },
    {
      "postId": "urn:li:activity:7287507998128619520",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287507998128619520",
      "url": "https://www.linkedin.com/in/meredithsims?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAHSh-ABN29gVRjGDr1KMTQ6uv8f-qqWj1E",
      "name": "Meredith Sims, ChFC®, CSRIC®\nMeredith Sims, ChFC®, CSRIC®",
      "content": "Prosperity Planning 2025: Tip #1 Purposeful Spending\n\nEvery dollar you spend has the power to shape your life. But let’s face it—it’s easy for spending to drift away from what really matters.\n\nPurposeful spending isn’t about cutting back or feeling guilty. It’s about making sure your money works for the things you truly care about. Here’s how to bring more intention to your spending:\n\n1. Clarify Your Core Values. Start by writing down what’s most important to you—whether it’s family, adventure, giving back, or achieving financial peace of mind. These values will serve as a guide for your financial decisions.\n\n2. Set Goals That Inspire You. Big or small, goals give you a reason to spend with intention. Whether it’s saving for a dream vacation, helping loved ones, or supporting a cause, make them personal.\n\n3. Track Where Your Money Goes. Take a month to review your spending through the lens of your values. Look for patterns and ask yourself, “Does my spending reflect what’s important to me?”\n\n4. Simplify Your Spending Plan. A plan doesn’t have to be complicated or restrictive. Focus on covering your needs, saving for the future, and spending on what brings you joy.\n\n5. Pause Before You Purchase. Before you hit “buy,” take a moment to ask yourself: “Will this bring me joy? Does it align with my values and support my goals?” A small pause can help you avoid regret and make choices you feel good about.\n\n6. Invest in Line with Your Values. Your investments can reflect what you stand for too. Consider supporting companies and industries that align with your principles—whether it’s renewable energy, ethical business practices, or groundbreaking innovations.\n\nPurposeful spending turns everyday decisions into steps toward a more fulfilling, meaningful life. It’s not about less—it’s about better.",
      "reactions": {
        "likes": "3\nJon W. Lassiter and 2 others",
        "comments": "3 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Pausing before purchasing helps distinguish between emotional spending and strategic choices that truly align with your goals.",
          "userName": "Jon W. Lassiter",
          "userProfileURL": "https://www.linkedin.com/in/jon-w-lassiter",
          "dataId": "urn:li:comment:(activity:7287490840808095746,7287507991497449472)"
        }
      ],
      "commentAdded": "Great insights! Purposeful spending truly transforms our financial decisions into powerful tools for living our values. Let’s spend wisely! 💡💰"
    },
    {
      "postId": "urn:li:activity:7287498935298932737",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287498935298932737",
      "url": "https://www.linkedin.com/in/retentionadam?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAn6cNQB-3DeWLieTXNmiuo8Bs-0VvHPgYA",
      "name": "Adam Robinson\nAdam Robinson",
      "content": "In 2024, I got 21M views, added 61k followers and drove $4M ARR from Linkedin. But I spent 65% of my time creating content, going on podcasts, hosting events. Here’s how I’m optimizing my Linkedin playbook for 2025:\n\n2024 Playbook:\n\n- 1 work-in-public LinkedIn post\n- 2 “thought leadership” LinkedIn posts\n- 1 narrative LinkedIn post (starting 6/1/24)\n- 3-5 podcast guest slots (did 9 last week alone)\n- 1 Inbound-Led Outbound Workshop (every Tuesday)\n- 1 keynote per month at IRL events (SaaSStock 3/14!)\n- 1 new season of Billion Dollar Challenge (coming Oct)\n- 1 newsletter: event promo, top content, feature updates\n- AudiencePlus video/Linkedin content “Binge Bin” (7/1/204)\n- All guest slot podcasts and short-form talking head videos to Spotify & Apple\n- Responding to (nearly) EVERY single Linkedin comment I get daily\n\n2025 Playbook:\n\n- 5 LinkedIn Posts per week, planned and written 1-2mo in advance\n- Diana posts 1/wk, grows to 3x/week\n- “RB2B Insiders” Weekly Live Workshop - w/ bigger and bigger guests\n- Grow $10m ARR Club founder community to 1,000 paying members\n- “SWAG-Led-Outbound” over-investment in swag\n- 6 keynotes - Pavilion, SaaSOpen, YPO Marketing Conf, more TBD\n- Host 3 Pavilion Austin CEO dinners\n- 1 newsletter per week\n- 1-2 podcast guest slots per week (but larger shows)\n- Weekly workshop audio + guest slots go on apple pod & spotify\n- Weekly workshop video goes on YT channel\n- Get my religion again about responding to every comment\n\nLinkedin has changed my life.\n\nTwo months ago I crossed 100,000 followers.\n\nThat means I’m now legally considered an Influencer™.\n\nAnd I am obligated to post a Day in the Life of Adam Robinson vlog.\n\nSo here’s a peak at how I got to 100k followers while launching.\n\nAnd an inside look at how we’re going to get to 200k! ",
      "reactions": {
        "likes": "84",
        "comments": "20 comments",
        "shares": "0"
      },
      "mediaUrl": "blob:https://www.linkedin.com/2d54c3cb-47cd-4aa8-aad9-0b96f30bb0e3",
      "comments": [
        {
          "commentText": "There are multiple hurdles to becoming an influencer .... You need to invest time, learn how to speak on camera, write down what you want to say, and invest in audio, a soundproof room, and light ...\n\nBUT WHAT IS MOST IMPORTANT is to have valuable IDEAS to share. And, that somehow gets overlooked, and then it will just not work ...",
          "userName": "Andy Zhulenev",
          "userProfileURL": "https://www.linkedin.com/in/andreyzhulenev",
          "dataId": "urn:li:comment:(ugcPost:7287300202397409280,7287507476583796738)"
        },
        {
          "commentText": "Love the Mac stand ! Scrappy for the win ",
          "userName": "Kyle Hitchcox",
          "userProfileURL": "https://www.linkedin.com/in/kylehitchcox",
          "dataId": "urn:li:comment:(ugcPost:7287300202397409280,7287508503823368192)"
        }
      ],
      "commentAdded": "Incredible growth, Adam! Your playbook is inspiring. Excited to see how you leverage that momentum for 2025 and beyond! 🚀 #InfluencerGoals"
    },
    {
      "postId": "urn:li:activity:7287019784414662657",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287019784414662657",
      "url": "https://www.linkedin.com/in/beerbiceps?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABRvDGgBUDKf31KasHdmgvySw4Pen6ybAes",
      "name": "Ranveer Allahbadia\nRanveer Allahbadia",
      "content": "Stress is who you think you should be. Peace is who you are.",
      "reactions": {
        "likes": "5,483",
        "comments": "115 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Peace comes from within.\n\nStress happens when we try to be someone else. Peace comes when we are ourselves. It’s okay to stop trying so hard. Be who you are. It’s enough. We don’t need to compare.\n\nJust be happy with who you are, right now. Let go of the stress. Find your peace.",
          "userName": "Maheshwaran Tharali Chandrasekar",
          "userProfileURL": "https://www.linkedin.com/in/maheshwarantharalichandrasekar",
          "dataId": "urn:li:comment:(activity:7287019784414662657,7287020666397085696)"
        },
        {
          "commentText": "Uplifting words",
          "userName": "Asif MD",
          "userProfileURL": "https://www.linkedin.com/in/asifruk",
          "dataId": "urn:li:comment:(activity:7287019784414662657,7287493910841511938)"
        }
      ],
      "commentAdded": "Beautifully said! Embracing our true selves can lead to greater peace and fulfillment in both our personal and professional lives."
    },
    {
      "postId": "urn:li:activity:7285076450423029761",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7285076450423029761",
      "url": "https://www.linkedin.com/in/westmcdonaldco?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAEvxMQBQ77AN3_0OXUHuUpKcY6AMaxm8us",
      "name": "West McDonald\nWest McDonald",
      "content": "GoWest.ai was thrilled to share \nhashtag\n#AI business strategies at \nhashtag\n#ECS25 to help dealers navigate and profit from the changes in how business is done. Great group of peers!",
      "reactions": {
        "likes": "20",
        "comments": "1 comment",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Awesome panel !",
          "userName": "Michael Stramaglio",
          "userProfileURL": "https://www.linkedin.com/in/michael-stramaglio-4274886",
          "dataId": "urn:li:comment:(ugcPost:7285076449701568514,7285236488336764928)"
        }
      ],
      "commentAdded": "Exciting insights from #ECS25! Empowering dealers with #AI strategies is key to thriving in todays evolving business landscape. Well done, GoWest.ai!"
    }
  ],
  "errors": [
    {
      "postId": "urn:li:activity:7287507341434933248",
      "url": "https://www.linkedin.com/company/forbes-magazine/posts",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287453218962374657",
      "url": "https://www.linkedin.com/in/christinalangdoncoachconsultant?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAFTKXUBfbA1AVJGERPumW45HsdACxqLq8E",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287478047631462401",
      "url": "https://www.linkedin.com/in/sahilkataria?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAeUmF8BKZv-laaK4cpNPbgYOMgv_jRnUeM",
      "errors": [
        "Failed to fetch reactions.",
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287465172800094208",
      "url": "https://www.linkedin.com/in/garettm?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAxhx8oBrMrQ4Rb6q9ZLv7KibK_ydWLFZCE",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287456811404697601",
      "url": "https://www.linkedin.com/in/nsodhi4696?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABvDwhYBeOQsVdZL_UsEagVey2rO5-gt01E",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287507998128619520",
      "url": "https://www.linkedin.com/in/meredithsims?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAHSh-ABN29gVRjGDr1KMTQ6uv8f-qqWj1E",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287019784414662657",
      "url": "https://www.linkedin.com/in/beerbiceps?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABRvDGgBUDKf31KasHdmgvySw4Pen6ybAes",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285076450423029761",
      "url": "https://www.linkedin.com/in/westmcdonaldco?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAEvxMQBQ77AN3_0OXUHuUpKcY6AMaxm8us",
      "errors": [
        "Failed to fetch media URL."
      ]
    }
  ]
}