{
  "posts": [
    {
      "postId": "urn:li:activity:7287833176197013505",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287833176197013505",
      "url": "https://www.linkedin.com/in/tomaszboinski?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAT6i3EBTB8A6x-CZu_4t39xy5C77FfuZhM",
      "name": "Tomasz Boinski\nTomasz Boinski",
      "content": "𝐒𝐭𝐚𝐫𝐭𝐢𝐧𝐠 𝐰𝐢𝐭𝐡 𝐍𝐨𝐭𝐡𝐢𝐧𝐠: 𝐀 𝐒𝐦𝐚𝐫𝐭 𝐁𝐮𝐬𝐢𝐧𝐞𝐬𝐬 𝐒𝐭𝐫𝐚𝐭𝐞𝐠𝐲\nIn their book Bootstrapping Your Business, Gianforte and Gibson (2007) argue that starting a business with little to no money can actually be beneficial. This idea might seem counterintuitive, but there are several reasons why it works.\n\nFirst, starting without waiting for funding means you can take action immediately. Instead of relying on potential investors to write you a check, you can begin building your business right away, with nothing holding you back.\n\nSecond, bootstrapping helps you learn faster. Most successful businesses thrive because entrepreneurs engage with suppliers, customers, and partners. Relying on cash can discourage you from seeking these valuable interactions, slowing your learning process.\n\nThird, limited resources force you to avoid waste. With money in hand, it’s easy to spend on ideas that don’t pan out. But when funds are tight, you naturally focus on what truly matters.\n\nFourth, having little money limits your losses. Mistakes are inevitable in business, but without a large financial investment, those mistakes tend to be smaller and less damaging.\n\nFifth, starting without outside funding allows you to keep more equity in your business. When you take investment, you often give up ownership. By bootstrapping, you maintain control and maximize your eventual rewards.\n\nFinally, constraints foster creativity. Studies show that working with limited resources pushes people to find innovative solutions. Without money to spend, you’re forced to think outside the box and come up with creative ways to succeed.\n\nMost businesses around the world operate without external funding, focusing instead on managing risks and staying afloat. Bootstrapping encourages early feedback from customers, helping refine your idea and build valuable partnerships. It also forces you to test your idea in the real world quickly. If the business fails, you do so cheaply and without losing much control.\n\nIn the end, starting a venture with little or no capital may be one of the smartest moves an entrepreneur can make. It encourages learning, creativity, and efficiency, setting the stage for long-term success.\n\n\n\n\nAt, we champion entrepreneurs and innovators who embrace challenges and turn them into opportunities. Starting with nothing doesn’t mean you’re at a disadvantage—it means you’re building a business on a foundation of resilience, adaptability, and forward thinking.",
      "reactions": {
        "likes": "1",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Love this perspective! Bootstrapping not only fosters creativity but also builds invaluable resilience. Its all about making the most of what youve got!"
    },
    {
      "postId": "urn:li:activity:7287854332551540736",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287854332551540736",
      "url": "https://www.linkedin.com/in/scottleese?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADGy5cBVXZTLZ8eNXz17x3ThAGT-5ckscg",
      "name": "🏄‍♂️ Scott Leese\n🏄‍♂️ Scott Leese",
      "content": "Average performers will always find reasons not to do things. This is never more obvious than looking at how sales leaders do their job.\n\nA sales leaders job is not to sit around and audit opportunities and look busy.\n\nA sales leaders job is to:\n\n- train\n- assist\n- coach\n- develop\n- facilitate\n\nIf you are not improving your reps, and not making their jobs easier; you are failing as a sales leader.\n\nI can hear weak sales leaders now saying: \"you don't understand the pressure I'm under to deliver results. I don't have time to do that stuff.\"\n\nYes you do. You're letting the pressure get to you and you're scared.\n\nPressure comes when someone calls on you to perform a task for which you are unprepared. Paralyzing fear leads to reactive defensive action, the wrong kind.\n\nBut when you're prepared nothing a boss demands from you matters.\n\nFear that is converted into kinetic energy and execution...that is part of the fuel that drives the best leaders I know.",
      "reactions": {
        "likes": "73",
        "comments": "20 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "spot on—real leaders turn pressure into progress and focus on building their team!",
          "userName": "Ronen R. Pessar",
          "userProfileURL": "https://www.linkedin.com/in/rpessar",
          "dataId": "urn:li:comment:(activity:7287846478524350465,7287854309751304193)"
        }
      ],
      "commentAdded": "Absolutely! Sales leadership is about empowering your team, not just hitting numbers. Preparation and coaching make all the difference!"
    },
    {
      "postId": "urn:li:activity:7287851502264569856",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287851502264569856",
      "url": "https://www.linkedin.com/in/jondavidleslie?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABu-s4B50TpraNCLboiGWes3m1D2rP1sHk",
      "name": "Jon Leslie 🔵\nJon Leslie 🔵",
      "content": "When leading remote teams, there’s a heavy reliance on tools.\n\nThere’s simply no way around it.\n\nHowever, HOW the tools are used can make or break remote organizations.\n\nThe most significant advantage of remote work is reduced distractions.\n\nDespite this fact, some managers struggle with not being able to see teams working and continue to rely on office-based methods to lead and track progress toward goals.\n\nThis typically results in tool-based distractions:\n\n️ Slack DM check-ins\n️ “Quick” Slack Huddles\n️ Daily Zoom status update meetings\n\nLeaders need to stop trying to replicate the office.\n\nIt doesn’t work with remote & distributed teams and leads to dreaded RTOs.\n\nInstead, trust the teams and visualize their work.\n\nYou can reduce reliance on Zoom and Slack with a good collaboration & planning tool.\n\nMapping team workflows to a modern collaboration tool helps the teams work together remotely and allows leaders to see progress without distracting the teams.\n\nTeam members want to know what fellow team members are working on…\n Look at the team board\n\nLeaders need to see deliverable/goal progress…\n Look at the team board\n\nOne team held up by another team’s work…\n Look at the team board\n\nNo need to break focused work with distracting Zoom meetings and Slack DMs.\n\nA good collaboration tool will also have built-in messaging, keeping the conversations asynchronous and relevant to the work and eliminating the frustration of having to check multiple tools for context.\n\nYes, tools are necessary for successful remote work, but use them to embrace remote work instead of negating its advantages.\n\n-\n\n DM me if you want to see what I'm talking about in action",
      "reactions": {
        "likes": "12",
        "comments": "4 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "We need successful remote leaders to speak up and share on LinkedIn. Show the working world how you succeed with remote—no more gatekeeping, please  Remote work needs you ",
          "userName": "Dan Salcius",
          "userProfileURL": "https://www.linkedin.com/in/dansalcius",
          "dataId": "urn:li:comment:(activity:7287851502264569856,7287856155769376769)"
        },
        {
          "commentText": "Dan Salcius Yes, the bigger the remote-first org, the better. Remote at scale is truly impressive and absolutely not impossible. ",
          "userName": "Jon Leslie 🔵",
          "userProfileURL": "https://www.linkedin.com/in/jondavidleslie",
          "dataId": "urn:li:comment:(activity:7287851502264569856,7287857892005670915)"
        },
        {
          "commentText": "Tools and frameworks need to scale.",
          "userName": "Michael Illingworth BSc.(Hons)Computing, MAPM, MBCS, MIIM",
          "userProfileURL": "https://www.linkedin.com/in/michael-illingworth-bsc-hons-computing-mapm-mbcs-miim-8347682a7",
          "dataId": "urn:li:comment:(activity:7287851502264569856,7287852236171325441)"
        },
        {
          "commentText": "Michael Illingworth BSc.(Hons)Computing, MAPM, MBCS, MIIM Very true. The collaboration tool I'm most fond of does exactly that. ",
          "userName": "Jon Leslie 🔵",
          "userProfileURL": "https://www.linkedin.com/in/jondavidleslie",
          "dataId": "urn:li:comment:(activity:7287851502264569856,7287853720329990145)"
        }
      ],
      "commentAdded": "Great insights! Embracing the right tools can foster trust and enhance collaboration while minimizing distractions. Let’s lead with purpose!"
    },
    {
      "postId": "urn:li:activity:7287803692638965760",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287803692638965760",
      "url": "https://www.linkedin.com/in/theshraddhashah?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADCkFDABF98n2bl5AeVFTorIANRy3Lke6vY",
      "name": "Shraddha Shah\nShraddha Shah",
      "content": "Honored to Be a Special Guest at Gajera Global School's Annual Function  Gajera Trust Gajera Global School \n\nIt was an absolute privilege to be part of Plant a Smile, the annual function at Gajera Global School. Witnessing the vibrant energy and talent of young minds was truly inspiring! \n\nThe theme, “Plant a Smile,” resonated deeply with my personal mission of spreading healing and happiness. These young performers reminded me how creativity and joy can light up the world.\n\n\nTogether, let’s continue planting smiles and nurturing dreams. ",
      "reactions": {
        "likes": "19",
        "comments": "1 comment",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Nice to see you as a Celebrity( special guest) at Gajera Global School's Annual Function, ",
          "userName": "Azhar Hussain Ansari",
          "userProfileURL": "https://www.linkedin.com/in/azhar-hussain-ansari-b0b50135",
          "dataId": "urn:li:comment:(ugcPost:7283090093630763008,7287815663694286849)"
        }
      ],
      "commentAdded": "What an inspiring event! 🌟 It’s wonderful to see creativity and joy in action. Together, we can make a lasting impact! #PlantASmile"
    },
    {
      "postId": "urn:li:activity:7287858106397532160",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287858106397532160",
      "url": "https://www.linkedin.com/in/thomashelfrich?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAGOfVEBWgldhLmFyii51qvvI5RpCSUcAoU",
      "name": "Thomas Helfrich\nThomas Helfrich",
      "content": "\"Build it and they will come? Nah, not in the real world.\" \n\nRishi Khanna dropped this truth bomb on the latest episode of Never Been Promoted. Startups often waste time building solutions no one needs.\n\nWhy? Because they don’t stop to answer the basics:\n\n What problem am I solving?\n\n Who actually has this problem?\n\n Will they pay for the solution?\n\nIt’s like being a hammer searching for a nail—cool, but useless if there’s no demand.\n\nAs someone who’s been there (hello, lessons learned the hard way), I can’t emphasize enough: Talk to your customers. Validate the pain point. Make sure your solution hits home.\n\nDon’t just build. SOLVE.\n\nCatch the full conversation with Rishi Khanna! It's packed with insights for entrepreneurs navigating today’s market:",
      "reactions": {
        "likes": "4",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Absolutely! Understanding customer needs is crucial. Lets focus on solving real problems, not just building products. Great insights, Rishi!"
    },
    {
      "postId": "urn:li:activity:7287854040758075392",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287854040758075392",
      "url": "https://www.linkedin.com/in/nona-prather-b5663010a?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABuAYXIBi7sSvrYjNrRn52Kia7vOCxjVrRM",
      "name": "Nona Prather\nNona Prather",
      "content": "Where do you get your best nutrients as professional speaker?\n- Katie Hornor",
      "reactions": {
        "likes": "2",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": "blob:https://www.linkedin.com/355d79c7-d7c2-450d-9421-b8e7e1d8f35a",
      "comments": [],
      "commentAdded": "Great question, Katie! I find inspiration in diverse experiences and conversations. Its amazing how much we can learn from each other!"
    },
    {
      "postId": "urn:li:activity:7287819747730104320",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287819747730104320",
      "url": "https://www.linkedin.com/in/tomaszboinski?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAT6i3EBTB8A6x-CZu_4t39xy5C77FfuZhM",
      "name": "Tomasz Boinski\nTomasz Boinski",
      "content": "Proud to be part of LISA’s 5th Anniversary celebration as a Mover & Shaker! by LISA - Stanford GSB LEAD Incubator & Startup Accelerator\nThis event brings together innovators from around the world to share ideas, build connections, and inspire change.\nLet’s create a future that’s bold enough to dream big and brave enough to make it happen!\n March 11, 2025\n Stanford Faculty Club\nRegister now:\n\nparticipants only!",
      "reactions": {
        "likes": "4",
        "comments": "3 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Congratulations Tomasz Boinski !",
          "userName": "John Kraski",
          "userProfileURL": "https://www.linkedin.com/in/johnkraski",
          "dataId": "urn:li:comment:(activity:7287819747730104320,7287828694591549441)"
        },
        {
          "commentText": "You should join me ",
          "userName": "Tomasz Boinski",
          "userProfileURL": "https://www.linkedin.com/in/tomaszboinski",
          "dataId": "urn:li:comment:(activity:7287819747730104320,7287828832051412992)"
        },
        {
          "commentText": "Great opportunity",
          "userName": "Mark Johnson (MJ)",
          "userProfileURL": "https://www.linkedin.com/in/markjohnson68",
          "dataId": "urn:li:comment:(activity:7287819747730104320,7287835461438390272)"
        }
      ],
      "commentAdded": "Congratulations on this milestone for LISA! Excited to see the innovations that will emerge from this inspiring gathering. Let’s dream big together!"
    },
    {
      "postId": "urn:li:activity:7287853811996454912",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287853811996454912",
      "url": "https://www.linkedin.com/in/jeffmartincareercoach?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAbLE18Bbc2v0366j3gguCiH6jZUT35o5Fk",
      "name": "Jeff Martin\nJeff Martin",
      "content": "Your mind is either your greatest weapon or your fastest killer.\n\nThe truth? Most of the stuff you’re stressing over right now is completely out of your control.\n\nSomeone else’s opinion of you? Out of your control.\n\nThe way a situation plays out? Out of your control.\n\nUnexpected challenges that hit like a freight train? Guess what? Out of your control.\n\nBut how you respond? That’s where you have power. Your mindset is the game-changer. Stressing over what you can’t control is like pouring gasoline on a fire. It burns you out before you even get started.\n\nThe world will throw chaos at you—that’s a given. Your job? Stay focused. Stay sharp. Redirect that energy to the things you can control: your discipline, your effort, your attitude.\n\nWhen you master your mind, you master the game.\n\nNow go crush it.",
      "reactions": {
        "likes": "186",
        "comments": "23 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "This is something we all need to be reminded of every now and then.",
          "userName": "George Novik",
          "userProfileURL": "https://www.linkedin.com/in/nov3k",
          "dataId": "urn:li:comment:(activity:7287807592381231104,7287825923683303424)"
        },
        {
          "commentText": "Staying positive and proactive is key in navigating whatever life throws at us",
          "userName": "Jvaghn Chandler",
          "userProfileURL": "https://www.linkedin.com/in/theellingtonjay",
          "dataId": "urn:li:comment:(activity:7287807592381231104,7287837096654815232)"
        }
      ],
      "commentAdded": "Absolutely! Mastering our mindset is key to thriving amidst chaos. Lets focus on what we can control and elevate our game! 💪"
    },
    {
      "postId": "urn:li:activity:7286396940265627648",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7286396940265627648",
      "url": "https://www.linkedin.com/in/ezxpo?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAIjGYB6b_NDVVPDgshQzRZBv-z3gmsaT0",
      "name": "Matt Fok\nMatt Fok",
      "content": " Rethink How You Innovate \nTraditional trade shows are a thing of the past. \n\nWith the AI Digital Health Network:\n* Save up to 80%.\n* Connect with peers globally.\n* Keep innovating beyond events.\n Make the shift today:",
      "reactions": {
        "likes": "2",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Exciting shift towards innovation! Embracing digital connectivity is key to staying ahead. Cant wait to see the evolution unfold! 🚀"
    },
    {
      "postId": "urn:li:activity:7287835163990900736",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287835163990900736",
      "url": "https://www.linkedin.com/in/westmcdonaldco?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAEvxMQBQ77AN3_0OXUHuUpKcY6AMaxm8us",
      "name": "West McDonald\nWest McDonald",
      "content": "#AI can transform how you and your people work, but you can do it really wrong too. So wrong people will shy away from it. GoWest.ai has seen businesses run into the same roadblocks over and over. Here are three common mistakes to watch out for:\n\n1️⃣ \"Free Tools Are Enough\"\n\"ChatGPT is free. We let our team use it already.\"\nFree tools are fine for personal use, but for businesses? Not so much. Without proper security or advanced features, they can actually hold you back. Investing in the right AI solution can save time, money, and headaches.\n2️⃣ Throwing in the Towel Too Soon\n\"We tried AI. It didn’t work. We’ll wait until it’s ready.\"\nAI isn’t magic—it’s a process. Early attempts might not go perfectly, but with the right training and tweaks, it can revolutionize how you work. The key is to stick with it and keep learning.\n3️⃣ No Strategic Plan\nNot treating AI like a big initiative.\nIf AI isn’t part of your overall strategy, it becomes just another tool collecting dust. The most successful companies have a clear roadmap for how AI fits into their goals.\n\nAI doesn’t have to be overwhelming. It just takes focus and a bit of patience to see real results. What’s been your biggest AI challenge so far?\nWe're here when you're ready to talk.",
      "reactions": {
        "likes": "2",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Great insights! Embracing AI with a strategic approach is key. Lets keep the conversation going on how to overcome these challenges! 🚀"
    }
  ],
  "errors": [
    {
      "postId": "urn:li:activity:7287833176197013505",
      "url": "https://www.linkedin.com/in/tomaszboinski?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAT6i3EBTB8A6x-CZu_4t39xy5C77FfuZhM",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287854332551540736",
      "url": "https://www.linkedin.com/in/scottleese?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADGy5cBVXZTLZ8eNXz17x3ThAGT-5ckscg",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287851502264569856",
      "url": "https://www.linkedin.com/in/jondavidleslie?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABu-s4B50TpraNCLboiGWes3m1D2rP1sHk",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287803692638965760",
      "url": "https://www.linkedin.com/in/theshraddhashah?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADCkFDABF98n2bl5AeVFTorIANRy3Lke6vY",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287858106397532160",
      "url": "https://www.linkedin.com/in/thomashelfrich?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAGOfVEBWgldhLmFyii51qvvI5RpCSUcAoU",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287819747730104320",
      "url": "https://www.linkedin.com/in/tomaszboinski?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAT6i3EBTB8A6x-CZu_4t39xy5C77FfuZhM",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287853811996454912",
      "url": "https://www.linkedin.com/in/jeffmartincareercoach?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAbLE18Bbc2v0366j3gguCiH6jZUT35o5Fk",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7286396940265627648",
      "url": "https://www.linkedin.com/in/ezxpo?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAIjGYB6b_NDVVPDgshQzRZBv-z3gmsaT0",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287835163990900736",
      "url": "https://www.linkedin.com/in/westmcdonaldco?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAEvxMQBQ77AN3_0OXUHuUpKcY6AMaxm8us",
      "errors": [
        "Failed to fetch media URL."
      ]
    }
  ]
}