{
  "postsData": [
    {
      "postId": "urn:li:activity:7289628226744684544",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289628226744684544",
      "url": "https://www.linkedin.com/in/clairemdavis?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAFCGXoB6nWioiigFFst9Mz-mJ5Ku6Q5o1Q",
      "name": "✒️Claire M. Davis🖋️\n✒️Claire M. Davis🖋️",
      "content": "Early on, in interviews, \nI was afraid to admit I wasn't always\nthe best. That I made (shh!) mistakes...until...\n\n*loosens collar*\n\n...I realized I had to walk a hiring manager through my 1, 2 3...layoffs.\n\nThere is literally NO WAY to tell that story\nwithout sharing a few imperfections here and there.\nThe hard lessons + serious learning curves along the way.\n\nBut you know what I found?\n\nThose stories resonated BETTER\nthan the \"I'm a perfect sales-and-marketer\" ones ever did.\n\n___________________________\n\nIf you're always the hero in your career stories,\nyou think you're coming off like a pro\n\nbut\n\nit doesn't hit quite right.\n\n___________________________\nIf you're always the hero you're making a mistake.\n\n...you're missing the impact\n...the grit and guts\n...the humanity\n\nand the connection with your target\n(the Hiring Manager)\n\nthe reason?\n\n>> You can't inspire others if they feel they could never \"do it, too.\" <<\n\n___________________________\n\nThe truth is, I didn't pop into the working world\nwith consultative selling stamped on my forehead.\n\nI didn't happen to know the entire rolodex\nof MDs and \"connections\" at Cedars-Sinai.\n\nThere wasn't a \"foolproof business plan\"\nthat was gifted to me by angels above.\n\n___________________________\n\nI learned it just like anyone else does.\n\nWorking\nStudying\nFeeling dumb\nTrying\nFailing\nDoing It Anyway\nAsking Others\nMessing up\nTweaking\n...and sometimes, winning ;)\n\n___________________________\n\nThink of a time you failed or struggled.\n\nWhat happened to get you out to the other side?\n\nTHAT is how you tell a story that sticks and inspires others\n\n___________________________\n\nIt creates connection\nIt brings interest\nIt binds you two\n\nYep.\n\nBecause, that person interviewing you?\n\nTHEY are not perfect either.\n\nAnd they're sitting on the other side of the screen\nPRAYING you're the right hire\nso they can look good\nto their investors\nleadership\n& clients\n\nThey're \"putting their best foot forward.\"\n\nSo, if you want to break the ice.\nLike crack and crush it,\nshow them that it's okay to \"level with you.\"\n\nWhen you admit that you've been there, too\nand share what outside influences\nor new strategies you tried\nto overcome that hurdle,\nyou give them HOPE that they can overcome their challenges, too.\n\nAnd instead of hinging your career story (only) on glorious wins -- try the glorious JOURNEY of getting to the win (and what challenges you overcame along the way)\n\nIt'll make your:\n\n>> interview answers\n>> promotion pitches\n>> marketing / sales efforts\n\n...stick.\n\nYou'll find a whole new kinship with those you're looking to impact.\n\nAnd your words will carry a whole new gravity.\n\n______________________\n\nDid you try it?\n\n______________________",
      "reactions": {
        "likes": "36",
        "comments": "26 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Such a powerful reminder! Embracing our imperfections makes us relatable and inspires others. Authentic stories create genuine connections. 💪"
    },
    {
      "postId": "urn:li:activity:7289606821353328640",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289606821353328640",
      "url": "https://www.linkedin.com/in/swarraj?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAEx1TsBfrIpqnzbg93ty9my-JhYMHoMQsw",
      "name": "Swarraj Kulkarni\nSwarraj Kulkarni",
      "content": "I am thrilled to have participated in the GITPRO World Conference 2025: Gen AI & Emerging Tech, in Milpitas, California! \n\nThe event was an incredible platform for connecting with AI experts, startup founders, VCs, and visionaries driving innovation in Generative AI. I had the privilege of showcasing Yavi and demonstrating how our platform accelerates Gen AI-driven business and domain solutions and unlocks unparalleled value for enterprises.\n\nAnother highlight was joining the panel on No-Code platforms and tools, where I shared my thoughts on how to shape the future of this space.\n\nHere are my key takeaways from the conference:\n1. The GenAI opportunity is NOW—focus on 10X impact and disruptive innovation.\n2. With LLMs and infrastructure ecosystems stabilizing, the focus should shift to domain-specific, ROI-driven applications.\n3. Build SaaS solutions for agents, empowering workflows and automation beyond just human users.\n\nA huge thank you to the GITPRO organizers and volunteers for creating such a vibrant and engaging platform for collaboration. Events like these fuel innovation and inspire us to build a brighter future with technology.",
      "reactions": {
        "likes": "20",
        "comments": "1 comment",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "It was really nice meeting and learning from you. Thank you for the takeaways!",
          "userName": "Deepak Subramanian",
          "userProfileURL": "https://www.linkedin.com/in/deepak-subramanian-uiuc",
          "dataId": "urn:li:comment:(ugcPost:7289606819843379200,7289635754551451648)"
        }
      ],
      "commentAdded": "Congratulations on an inspiring event! Your insights on Gen AI and no-code platforms are invaluable as we drive innovation forward. Excited for what’s next!"
    },
    {
      "postId": "urn:li:activity:7289554784280289280",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289554784280289280",
      "url": "https://www.linkedin.com/in/unnati-lasiyal-39326a227?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADjQM58BFpkvKHL6UmE8qEB3LQhYUEKlZvA",
      "name": "Unnati Lasiyal\nUnnati Lasiyal",
      "content": "Opportunities Are Everywhere… But Are We Ready to See Them?\n\nOpportunities surround us, yet many of us fail to notice them. Why? Because we're often stuck in the past or worried about the future, leaving us blind to the power of NOW.\n\nThe truth is, living in the present moment is the key to unlocking your potential and grabbing the opportunities right in front of you. Here's how we (yes, me too!) can start working on this:\n\n1️⃣ Stop looking back.\nYour past doesn’t define your present. You've grown, learned, and become more capable than you were before. Trust in your journey.\n\n2️⃣ Appreciate the little wins.\nBe grateful for the small moments—kind people, small recognitions, or even ticking off tasks from your to-do list. These moments make your NOW valuable.\n\n3️⃣ Don't compare journeys.\nYour beginning is not someone else's end. Everyone has ups and downs, even if it doesn’t seem that way. Focus on your unique path.\n\n4️⃣ Trust the process.\nYour work today is shaping your tomorrow. Don't stress about the future; just give your best to the present, and the rest will follow.\n\n5️⃣ Believe in your unstoppable self.\nYou have the power to achieve everything you dream of—one step, one opportunity at a time.\n\nSo, let's stop chasing the past or fearing the future. Let's embrace NOW and make the most of every moment!",
      "reactions": {
        "likes": "21\nMegha Chaudhary and 20 others",
        "comments": "1 comment",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Love this",
          "userName": "Megha Chaudhary",
          "userProfileURL": "https://www.linkedin.com/in/megha-chaudhary-0961561b1",
          "dataId": "urn:li:comment:(activity:7289467722424299520,7289554768773951488)"
        }
      ],
      "commentAdded": "Absolutely agree! Embracing the present is vital for growth. Let’s seize every opportunity in our NOW! 🌟 #Mindfulness #GrowthMindset"
    },
    {
      "postId": "urn:li:activity:7289671413374828544",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289671413374828544",
      "url": "https://www.linkedin.com/in/podolski?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAmnHsBzAzwD9km7B-hDfzveBYRBJxy0CI",
      "name": "Stan Podolski\nStan Podolski",
      "content": "The latest research highlights IoT’s expanding role in healthcare, where smart devices monitor and respond to critical conditions in real time.\n\nPatient outcomes improve through early intervention and data-driven decisions. But scaling these solutions brings challenges in data security, latency, and reliability.\n\nTherefore, innovations like BLE Mesh and edge computing are essential for creating resilient, secure networks that enable this life-saving technology.\n\nIoT is connecting care, driving better outcomes where they matter most.",
      "reactions": {
        "likes": "0",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Exciting developments in IoT for healthcare! Addressing challenges with BLE Mesh and edge computing will be key to enhancing patient care and outcomes."
    },
    {
      "postId": "urn:li:activity:7289641637956263936",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289641637956263936",
      "url": "https://www.linkedin.com/in/jonbrosio?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABERfGYB8htpaFCfMDMxwMfIE6Bsd3nqsUM",
      "name": "Jon Brosio\nJon Brosio",
      "content": "Posting just daily content to attract leads isn’t enough anymore.\n\nBecause most creators make three big mistakes.\n\nLet’s break it down...\n\nI worked with a coach who wanted to scale their business.\n\nThey were posting daily — carousels, short-form, long-form you name it.\n\nBut something wasn’t clicking.\n\nThe content was valuable:\n\n• Guides\n• Checklists,\n• Infographics\n\nThe engagement was great:\n\n• Thousands of impressions\n• Scores of comments\n• Hundreds of likes\n\nBut the leads? Crickets.\n\nWhy?\n\nThey had commoditized themselves.\n\n(The worst part is they didn't even know it).\n\nPeople came for the free information but weren’t taking the next step.\n\nWe had to rethink everything.\n\nHere’s what we did to turn it around:\n\nStep 1: Tie all content back to their core offer.\n\nInstead of just “valuable” posts, we created content that gave their audience clarity on the path to their goals.\n\nHer offer became the foundation for every post. Each piece was like a puzzle piece, showing how they solved problems that no free checklist could.\n\nStep 2: Share insights, not just value.\n\nValue attracts freeloaders.\nInsights attract serious buyers.\n\nFor example:\n\nValue: “Here’s a checklist to grow your business.”\n\nInsight: “Most people struggle to grow because they focus on X. Here’s what I’ve learned working with 100+ clients.”\n\nOne shows you know how to solve a problem.\nThe other shows why they need you to solve it.\n\nStep 3: Speak to fears, frustrations, and desires.\n\nWe dug into the ICP’s pain points:\n\n• What keeps them awake at night?\n• What outcomes do they dream of achieving?\n• What frustrates them about their current situation?\n\nEvery post aimed to:\n\n• Show empathy.\n• Address those debilitating fears.\n• Paint a vision of what was possible (with their help).\n\nThe result?\n\nFewer likes and shares.\n\nWay more DMs.\n\nAnd an in inbound leads in 30 days.\n\nDaily content can’t just attract.\nIt has to awaken your sleeping leads.\n\nHere’s the formula:\n\n• Let offer guide the content.\n• Emphasize insights over value.\n• Target fears, frustrations, desires.\n\nDo this and watch your audience turn into clients.\n\n---\n\nOn January 27th I'm doing a live training.\n\nYou'll walk away with:\n\n30 days of lead-generating content Created in less than 20 minutes\n\nThat attracts your dream client\n\nThis link will tell you more about it:",
      "reactions": {
        "likes": "193",
        "comments": "109 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "This is such a smart approach. It’s more than just creating content - it’s creating content that actually leads to clients",
          "userName": "Codie A. Sanchez",
          "userProfileURL": "https://www.linkedin.com/in/codiesanchez",
          "dataId": "urn:li:comment:(activity:7289635897203982337,7289642803276521476)"
        },
        {
          "commentText": "Codie A. Sanchez Bingo.\n\nYou hit the nail right on the head.",
          "userName": "Jon Brosio",
          "userProfileURL": "https://www.linkedin.com/in/jonbrosio",
          "dataId": "urn:li:comment:(activity:7289635897203982337,7289645753830920192)"
        },
        {
          "commentText": "Codie A. Sanchez Interesting how this applies here but not on a platform like YouTube.",
          "userName": "Evan Weselyk",
          "userProfileURL": "https://www.linkedin.com/in/evanweselyk",
          "dataId": "urn:li:comment:(activity:7289635897203982337,7289662930583777280)"
        },
        {
          "commentText": "Good posts make people message you, not just like.",
          "userName": "Benjamin Bohman",
          "userProfileURL": "https://www.linkedin.com/in/benbohman",
          "dataId": "urn:li:comment:(activity:7289635897203982337,7289641417017020417)"
        },
        {
          "commentText": "Benjamin Bohman And that's the goal.\n\nHave people reach out to you for help.",
          "userName": "Jon Brosio",
          "userProfileURL": "https://www.linkedin.com/in/jonbrosio",
          "dataId": "urn:li:comment:(activity:7289635897203982337,7289645889734803457)"
        }
      ],
      "commentAdded": "Great insights! Transforming content strategy is key to converting leads. Excited to see how your training will help others! 🌟 #LeadGeneration"
    },
    {
      "postId": "urn:li:activity:7289675875510341632",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289675875510341632",
      "url": "https://www.linkedin.com/in/mtr-coaching?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAZfmIYBRgj-0quRQRoQD1VXT8T4EdrrLtU",
      "name": "Mark Tanchoco Reid\nMark Tanchoco Reid",
      "content": "\"There is no shortcut to any place worth going.\" - Beverly Sills \n\nLife's greatest achievements take time, and that's what makes them valuable! Every step forward - big or small - is part of your story.\n\nLike this photo - taken of me in Santorini.\n\nMistakes? They're proof you're growing and trying new things.\n\nUnexpected turns often lead to discoveries that the straight path would have missed.\n\nTake a breath. Release the pressure to rush. Your journey is unfolding exactly as it should.\n\n⭐ Trust your path. Every step counts. \n\nRemember...Stay purposeful, Stay connected.   ",
      "reactions": {
        "likes": "10",
        "comments": "2 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Nice. Beautiful scenery.",
          "userName": "Marina Padovan",
          "userProfileURL": "https://www.linkedin.com/in/marinapadovan",
          "dataId": "urn:li:comment:(activity:7289652663745429505,7289658260108828674)"
        },
        {
          "commentText": "Marina Padovan it was beautiful. Breath taking scenery. A romantic place too!",
          "userName": "Mark Tanchoco Reid",
          "userProfileURL": "https://www.linkedin.com/in/mtr-coaching",
          "dataId": "urn:li:comment:(activity:7289652663745429505,7289661317282476034)"
        }
      ],
      "commentAdded": "Beautifully said! Embracing the journey and each lesson along the way truly leads to growth. Here’s to trusting our unique paths! 🌟"
    },
    {
      "postId": "urn:li:activity:7289685426825482240",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289685426825482240",
      "url": "https://www.linkedin.com/in/jonathanhwestover?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAFBTEMBbJ2WaW7hW_NVOY2y6b8exCAonPA",
      "name": "Jonathan H. Westover, PhD, MPA, AF-CIPD, SFHEA\nJonathan H. Westover, PhD, MPA, AF-CIPD, SFHEA",
      "content": "Check out my latest Human Capital Leadership Review article, \"Managing Panic Attacks at Work: Practical Strategies for Leaders and Employees.\"\n\nAbstract: The article explores strategies for managing panic attacks in the workplace, informed by research. It first provides an overview of what constitutes a panic attack and how to recognize the symptoms. It then outlines coping techniques for individuals experiencing an attack, such as deep breathing, muscle relaxation, and self-talk. The article also discusses the role of leaders in accommodating employees with panic disorders through confidentiality, flexible schedules, and open communication. Additionally, it highlights how coworkers can provide support by checking in, offering calming aids, and shielding the individual from disruption. Lastly, the article recommends that employers establish comprehensive support systems, including mental health education, designated allies, benefits, and anti-stigma policies, to cultivate a workplace environment that prioritizes mental wellness alongside performance. Overall, the article emphasizes the importance of implementing evidence-based strategies to manage panic attacks respectfully and effectively, benefiting both employers and employees.\n\nTake a look at or listen to the full article and leave your comments below!",
      "reactions": {
        "likes": "1",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "This is such an important topic! Supporting mental health in the workplace is key to fostering a positive and productive environment. Great insights!"
    },
    {
      "postId": "urn:li:activity:7289632505622638592",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289632505622638592",
      "url": "https://www.linkedin.com/in/nealconlon?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAhYvx4BQsaUxum6g_YrZe0lxTaVFqxCY9o",
      "name": "Neal Conlon\nNeal Conlon",
      "content": "We are headed to Vegas next... And you should join us.\n\nWe create unforgettable experiences!  The Lone Star Cyber Shootout 2025 brought together the best in cybersecurity for an event packed with insights, tactical challenges, and genuine connections.\n\nA massive THANK YOU to all our sponsors, volunteers, and attendees—you made this event truly special. Your energy, support, and enthusiasm brought this vision to life. \n\n We’re already planning the next big event in Las Vegas this summer during BlackHat/Defcon! Expect even more high-impact networking, hands-on action, and opportunities to build real connections.\n\n Msg us to apply for our next event.\n\n Watch the sizzle reel below and relive the highlights!\n\n\n\nThank you to our Sponsors:\n\nMake sure to reserve your spot as an attendee or sponsor, slots will fill quickly! reach out to Neal Conlon or Aaron C. Crow or email us at\n\nDavid Seth Cohen\n\n#",
      "reactions": {
        "likes": "9",
        "comments": "4 comments",
        "shares": "0"
      },
      "mediaUrl": "blob:https://www.linkedin.com/356a410d-0adf-4f4c-adb2-12436c3bf32d",
      "comments": [
        {
          "commentText": "Scott MacGregor Adam Jay ️ Brian Solis  Edward Preston Michael Xavier Burns III️ Mark J. O'Neil",
          "userName": "Neal Conlon",
          "userProfileURL": "https://www.linkedin.com/in/nealconlon",
          "dataId": "urn:li:comment:(ugcPost:7289632317323530241,7289641660320239617)"
        },
        {
          "commentText": "Neal Conlon Madyson James",
          "userName": "Neal Conlon",
          "userProfileURL": "https://www.linkedin.com/in/nealconlon",
          "dataId": "urn:li:comment:(ugcPost:7289632317323530241,7289651604973060096)"
        },
        {
          "commentText": "I absolutely loved this experience and can't wait to attend the next event. The amount of camaraderie we all experienced and the relations we developed will endure. Amazing job Neal Conlon and Aaron C. Crow! ",
          "userName": "Harold Rivas",
          "userProfileURL": "https://www.linkedin.com/in/haroldrivas",
          "dataId": "urn:li:comment:(ugcPost:7289632317323530241,7289682454125133825)"
        }
      ],
      "commentAdded": "Exciting news! Can’t wait to see the amazing connections and insights that await in Vegas. Let’s make it another unforgettable event! 🎉✨"
    },
    {
      "postId": "urn:li:activity:7289628416692150272",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289628416692150272",
      "url": "https://www.linkedin.com/in/anthonywentzel?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADZN2sBr5ZUAlKZK2QwVQvOE9B6pnFHXt8",
      "name": "Anthony Wentzel\nAnthony Wentzel",
      "content": "The future of technology looks like:\n\n• @ElonMusk\n• @DeepMind\n• @OpenAI\n• @SpaceX\n\nStudy these 4.\n\nThey are onto something BIG.",
      "reactions": {
        "likes": "1",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Exciting times ahead! 🤖🚀 These innovators are reshaping our world. Looking forward to seeing their next breakthroughs! #FutureTech"
    },
    {
      "postId": "urn:li:activity:7289619207304925185",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289619207304925185",
      "url": "https://www.linkedin.com/in/jimshorkeyjr?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABf9QEgB2KO7YDxoUJp08UPWnjkRClY5cF4",
      "name": "Jim Shorkey\nJim Shorkey",
      "content": "Turning No  into Opportunity : Master Sales Strategies \nWe explore how every 'no' brings us closer to a 'yes' in sales. Discover our approach to overcoming objections and effectively communicating with customers to drive results – ensuring they feel valued throughout the process. It’s all about confidence and understanding!",
      "reactions": {
        "likes": "1",
        "comments": "1 comment",
        "shares": "0"
      },
      "mediaUrl": "blob:https://www.linkedin.com/487dd6c8-276e-44fd-adf5-83316aaa66fe",
      "comments": [
        {
          "commentText": "Turning a 'no' into a 'yes' is all about listening and showing how you can actually solve their problem. Keep it real and keep pushing.",
          "userName": "Neil Sarkar",
          "userProfileURL": "https://www.linkedin.com/in/neil-sarkar",
          "dataId": "urn:li:comment:(ugcPost:7289613181935595520,7289619203295232000)"
        }
      ],
      "commentAdded": "Great insights! Embracing every no as a learning opportunity is key to sales success. Looking forward to applying these strategies! 🚀"
    },
    {
      "postId": "urn:li:activity:7289663675777380353",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289663675777380353",
      "url": "https://www.linkedin.com/groups/961087?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A961087-7289638950116229120",
      "name": "Machine Learning Community (Moderated)\nMachine Learning Community (Moderated)",
      "content": "Roadmap to Master Prompt Engineering: Step-by-Step Guide\n\n1. AI Fundamentals\nStart with the basics by understanding AI, ML concepts, and natural language processing (NLP).\n\n2. Prompting Basics\nLearn to craft initial prompts and analyze AI responses effectively for better results.\n\n3. Types of Prompts\nExperiment with informative and creative prompts to explore their potential applications.\n\n4. Prompt Formulation\nUse concise language and define specific goals to achieve precise outputs.\n\n5. Testing Prompts\nTest and analyze responses to refine prompts and improve relevance.\n\n6. Iterative Refinement\nContinuously refine prompts to optimize clarity and information delivery.\n\n7. Contextual Prompting\nSet clear contexts to control the scope of AI outputs effectively.\n\n[ Explore more in the post ]",
      "reactions": {
        "likes": "74",
        "comments": "2 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Activation functions are key to neural networks! They introduce non-linearity, allowing models to capture complex patterns. Without them, the network would be limited to linear relationships, making learning intricate data structures impossible.",
          "userName": "Divanshu Anand",
          "userProfileURL": "https://www.linkedin.com/in/ananddivanshu",
          "dataId": "urn:li:comment:(groupPost:961087-7289638950116229120,7289674181267341313)"
        },
        {
          "commentText": "Good to know!",
          "userName": "Lokeswara H S",
          "userProfileURL": "https://www.linkedin.com/in/lokeswara",
          "dataId": "urn:li:comment:(groupPost:961087-7289638950116229120,7289670925682102272)"
        }
      ],
      "commentAdded": "Great roadmap! Mastering prompt engineering can truly unlock the full potential of AI. Excited to see how these steps enhance our AI applications!"
    },
    {
      "postId": "urn:li:activity:7289681320891293697",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289681320891293697",
      "url": "https://www.linkedin.com/in/tinagravel?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAAb5sBbhYlVMp_YkONjO0YzKzlJeoVn1w",
      "name": "Tina Gravel\nTina Gravel",
      "content": "Congratulations Jo Peterson it is a huge honor!",
      "reactions": {
        "likes": "1",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "right?",
          "userName": "Jo Peterson",
          "userProfileURL": "https://www.linkedin.com/in/jopeterson1",
          "dataId": "urn:li:comment:(activity:7289681320891293697,7289685756573347842)"
        }
      ],
      "commentAdded": "Congratulations, Jo! Your dedication and hard work truly deserve this recognition. Excited to see where this honor takes you next!"
    },
    {
      "postId": "urn:li:activity:7289664263789424640",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289664263789424640",
      "url": "https://www.linkedin.com/in/hudsonhector?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAgkwt4B_wQJlF09zUwObxwx_V8QMnXfUFk",
      "name": "Hudson Hector\nHudson Hector",
      "content": "Do you ever look at your big goals and feel completely overwhelmed?\n\nHere’s the secret: You don’t have to tackle everything at once. Success is built one small step at a time.\n\nWaking up 10 minutes earlier to journal.\n\nSending that email you’ve been avoiding.\n\nTaking 5 minutes to plan your priorities for the day.\n\nThese small actions may not seem like much, but over time, they create momentum.\n\nSo today, ask yourself:\n\nWhat’s one small win I can create right now?\n\nHow can I celebrate the progress I’m making, no matter how small?\n\nBecause success isn’t about doing everything at once—it’s about doing the next right thing, one step at a time.",
      "reactions": {
        "likes": "1",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Great reminder! It’s often the small steps that lead to significant progress. Celebrating those wins keeps us motivated! What’s your small win today?"
    },
    {
      "postId": "urn:li:activity:7288193764022464514",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7288193764022464514",
      "url": "https://www.linkedin.com/in/braghav?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAJ0fFMBWj6tuoDegR2h6vkeUCBSOq1v9Ms",
      "name": "Raghav Balasubramanian\nRaghav Balasubramanian",
      "content": "A-players punch above their weight class.\n\nThe secret is stupidly simple.\n\nPrioritization - they are masters at it!\n\nHere are 5 habits they never waste time on:\n\n1. Chasing Perfection\n↳ A-players understand that perfection is the enemy of progress.\n↳ They focus on getting things done efficiently instead of obsessing over every tiny detail.\n\n2. Saying Yes to Everything\n↳ Top performers know their limits.\n↳ They say “no” to tasks that don’t align with their goals or priorities.\n\n3. Overthinking Decisions\n↳ Instead of getting stuck in analysis paralysis, A-players make decisions quickly.\n↳ They trust their instincts & use feedback to improve.\n\n4. Micromanaging\n↳ Top performers trust their team.\n↳ They delegate effectively & empower others to take ownership of tasks.\n\n5. Unnecessary Meetings\n↳ A-players avoid long, unproductive meetings that don’t have a clear agenda or outcome.\n↳ If it can be solved in an email or quick chat, they’ll take that route.\n\nMastering the art of prioritization is what separates top performers from the rest.\n\nWhich of these habits do you struggle with?\n\nIf you found this post helpful, ️ repost this to your network & givea follow for more!",
      "reactions": {
        "likes": "44",
        "comments": "30 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Fully agree. There's a trap though in fast decision making that's worth mentioning. Most of the time, you need some level of input. Your team and peers probably have insights that are relevant. Make sure they are heard. That you've thoughtfully considered.\n\nFast decision making is often a mask for someone who can't tolerate a bit of uncertainty.",
          "userName": "Ian Christie",
          "userProfileURL": "https://www.linkedin.com/in/ianchristie",
          "dataId": "urn:li:comment:(ugcPost:7288083425125703680,7288200380780290049)"
        },
        {
          "commentText": "Ian Christie Absolutely! Fast decisions can overlook key insights. Thanks for the comment. ",
          "userName": "Raghav Balasubramanian",
          "userProfileURL": "https://www.linkedin.com/in/braghav",
          "dataId": "urn:li:comment:(ugcPost:7288083425125703680,7288201398788268034)"
        },
        {
          "commentText": "Raghav Balasubramanian I think this comes with time and experience. When you realise that your time is a limited resource, you cannot do everything at once, or you cannot do all things, you stop overthinking and just run. Meetings require much time, so you should ask the right questions to see if you can achieve without the meeting.",
          "userName": "Audra A.",
          "userProfileURL": "https://www.linkedin.com/in/audraa",
          "dataId": "urn:li:comment:(ugcPost:7288083425125703680,7288231315466866688)"
        },
        {
          "commentText": "Audra A. Beautifully put ",
          "userName": "Raghav Balasubramanian",
          "userProfileURL": "https://www.linkedin.com/in/braghav",
          "dataId": "urn:li:comment:(ugcPost:7288083425125703680,7288236424078729217)"
        }
      ],
      "commentAdded": "Great insights! Mastering prioritization truly sets A-players apart. I struggle with overthinking decisions—definitely a work in progress!"
    },
    {
      "postId": "urn:li:activity:7289646954681114624",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289646954681114624",
      "url": "https://www.linkedin.com/in/contactprasadasriya?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAEP2oLgBBRY-9BPz1b_Zn1HIVXQvY3n30i4",
      "name": "PRASADA SRIYA\nPRASADA SRIYA",
      "content": "Dear connections! \n\n\"I'm excited to share my recent projects and learning experiences!\n\nproject : ATM User Account System (Python)\n\nI developed a comprehensive ATM system that enables users to:\n\n- Withdraw and deposit money\n- Check account balance\n- Change PIN\n- Validate user data\n\nundergoing full stack development coaching with Qspiders",
      "reactions": {
        "likes": "2\nPRASADA SRIYA and 1 other",
        "comments": "1 comment",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Impressive",
          "userName": "Prasada Roopa",
          "userProfileURL": "https://www.linkedin.com/in/prasada-roopa-83b02833b",
          "dataId": "urn:li:comment:(ugcPost:7289646953196371969,7289649564163203073)"
        }
      ],
      "commentAdded": "Congratulations on your exciting project! Your work on the ATM User Account System sounds impressive—great to see your skills in action! 🌟"
    },
    {
      "postId": "urn:li:activity:7287242348600651777",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287242348600651777",
      "url": "https://www.linkedin.com/in/rickconlowservantleadership?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAPUxFwB6p1p6ESvdwgOkdRMuNdW3KDrJTU",
      "name": "Richard A. Conlow\nRichard A. Conlow",
      "content": "How Servant Leadership Can Change your Career Trajectory: https://buff.ly/3z7ADHb \n#leadership \n#management \n#servantleadership ",
      "reactions": {
        "likes": "2",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Great read! Embracing servant leadership can truly transform how we lead and inspire our teams. Excited to implement these insights! #LeadershipGrowth"
    },
    {
      "postId": "urn:li:activity:7285370311481405440",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7285370311481405440",
      "url": "https://www.linkedin.com/in/lukewilsonsignpostceo?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAfuI5kBl2qBFzTl1Tb5LL34gufpdEd9q-c",
      "name": "Lucas Wilson\nLucas Wilson",
      "content": "I enjoyed this sunny conversation. ",
      "reactions": {
        "likes": "5",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": "blob:https://www.linkedin.com/08d31ea9-67c1-43a6-8e57-7c9b165466fa",
      "comments": [],
      "commentAdded": "Sounds like a delightful exchange! Sunshine always brings out the best conversations. ☀️ Looking forward to more enriching discussions!"
    },
    {
      "postId": "urn:li:activity:7289377546578653185",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289377546578653185",
      "url": "https://www.linkedin.com/in/juliangoldieseo?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAep3-4B9OlK-gjL-56ir-8zhw9EZITJa0Y",
      "name": "Julian Goldie\nJulian Goldie",
      "content": "This is a powerful and relatable story. Knowing when to move on is crucial, and these questions are a great guide for anyone feeling stuck. It's so important to prioritize our well-being and what truly matters.",
      "reactions": {
        "likes": "864",
        "comments": "67 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "This resonates with me, Julian. I've felt that lack of excitement before.",
          "userName": "Jason Bramble",
          "userProfileURL": "https://www.linkedin.com/in/jasonbramble-revcarto",
          "dataId": "urn:li:comment:(activity:7289367058759254016,7289377497861742592)"
        }
      ],
      "commentAdded": "Absolutely agree! Reflecting on our priorities can spark growth and clarity. Thanks for sharing such insightful guidance!"
    },
    {
      "postId": "urn:li:activity:7289650073657884672",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289650073657884672",
      "url": "https://www.linkedin.com/in/olivia-diallo-%F0%9F%8F%B3%EF%B8%8F%E2%80%8D%F0%9F%8C%88-775703220?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADeiLIkByzrLxLL6zkhLMWil8uQQcTAoVeM",
      "name": "Olivia Diallo 🏳️‍🌈\nOlivia Diallo 🏳️‍🌈",
      "content": "No one is reading your emails because they're way too long.\n\n\n\n\nOne of's recent posts made me recall an article from Gong I read last year: according to their data, no one is reading emails longer than can fit on a phone screen.\n\nAnd, anecdotally, this is so true.\n\nEnter, \"The Phone Screen Test:\" If it's longer than can fit on a phone screen, I edit the email.\n\nI mean it– trim the fat. Don't get into the weeds about your 15 integrations. Definitely get rid of the salutation.\n\nWhen I started doing this, my reply rates nearly doubled AND the folks I was able to reach were closer to my ideal ICP. This makes sense– C-suite at fast-growing companies don't have time to read novel-length emails.\n\nThe sweet spot is spending time on personalization (love some\n, thanksand!) while making sure the email is direct and brief. That way, the personalization effort you put in has a much higher chance of actually being read.",
      "reactions": {
        "likes": "4",
        "comments": "2 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "So glad that post was thought provoking Olivia Diallo ️‍ \n\nI use the inbox pop up from Regie.ai to make sure my emails look great on mobile!!",
          "userName": "Leslie Venetz",
          "userProfileURL": "https://www.linkedin.com/in/leslievenetz",
          "dataId": "urn:li:comment:(activity:7289642720850034689,7289650245729234945)"
        },
        {
          "commentText": "this is such a great idea, thank you Leslie! i'll definitely have to try Regie.ai– i'm always looking for ways to make my tech stack more efficient. recently i've been using Fyxer AI which almost feels like cheating with how easy it makes writing emails ",
          "userName": "Olivia Diallo 🏳️‍🌈",
          "userProfileURL": "https://www.linkedin.com/in/olivia-diallo-%F0%9F%8F%B3%EF%B8%8F%E2%80%8D%F0%9F%8C%88-775703220",
          "dataId": "urn:li:comment:(activity:7289642720850034689,7289651769368842240)"
        }
      ],
      "commentAdded": "Great insights! Keeping emails concise not only boosts engagement but also respects our recipients time. Personalization is key! 📩✨"
    },
    {
      "postId": "urn:li:activity:7289665617358438400",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289665617358438400",
      "url": "https://www.linkedin.com/in/chrisclayton1?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAA44cQBQx55H4hZXvRNXNXNyODn2RH2uQM",
      "name": "Chris Clayton\nChris Clayton",
      "content": "Thus begins Utah Tech Week…\n\nLots of things happening all over the place. I love the energy that surrounds this event and all the people that work so hard to make it happen. Having seen the venue for tonight’s opening party, I’m super excited for everything happening.\n\nI mentioned a few weeks ago that I’m starting a side hustle. With the snow that fell over the weekend here in Salt Lake, it was clear to me that what I’m building will significantly impact businesses and people that require a certain type of service. I’m more excited than ever to be building this solution, and excited to announce it in the near future.\n\nIn the meantime, as you start to prepare your taxes, and if you have high tax liability, I suggest you take a look atand. We literally help people continue to be able to build, create, and innovate through creative strategies that save them their hard-earned money.\n\nLooking forward to connecting and reconnecting with friends and colleagues. Have a great week!",
      "reactions": {
        "likes": "9\n📱 Zach Barney and 8 others",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Exciting times ahead! Love your enthusiasm for both Utah Tech Week and your new side hustle. Can’t wait to see what you announce!"
    },
    {
      "postId": "urn:li:activity:7289667523774435328",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289667523774435328",
      "url": "https://www.linkedin.com/in/mauryrogow?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABWcMEBaQ0Vt8GBOP24e5zTvMF_On-IIgk",
      "name": "Maury Rogow, CEO\nMaury Rogow, CEO",
      "content": "The only thing that can save us is cooperation.\n\nIf we work together we can solve any problem. \n\nSalute to these men who aided the deer in need. May their act be an inspiration to us all.\n\nWe can all make a difference if we just try. AmIrite?\n\n\n\nI share storytelling and creativity to help you and your company sell more and grow.\nLet's Connect!\n\n1. My AI course on LinkedIn Learning:\n\n\n2. Join 10,000 others learning weekly growth tips at:\nUse the 3-Act E.P.I.C Structure to turn stories into sales:\n\n\n3. 3 Ways To Grow Guide:(no sign-up needed)",
      "reactions": {
        "likes": "54",
        "comments": "36 comments",
        "shares": "0"
      },
      "mediaUrl": "blob:https://www.linkedin.com/5fc4d62d-e346-4cd5-bc2a-351ae6e821ed",
      "comments": [
        {
          "commentText": "We could all learn a thing or two from these men who put the needs of an innocent animal before their own.",
          "userName": "Alexandre Mello",
          "userProfileURL": "https://www.linkedin.com/in/alexandremelloenglishexpert",
          "dataId": "urn:li:comment:(ugcPost:7289667478719262721,7289670694596993025)"
        },
        {
          "commentText": "Alexandre Mello We should always help other when we have the opportunity",
          "userName": "Maury Rogow, CEO",
          "userProfileURL": "https://www.linkedin.com/in/mauryrogow",
          "dataId": "urn:li:comment:(ugcPost:7289667478719262721,7289673537529741312)"
        },
        {
          "commentText": "Compassion and kindness know no bounds",
          "userName": "Bianca Buenconsejo",
          "userProfileURL": "https://www.linkedin.com/in/biancabuenconsejo",
          "dataId": "urn:li:comment:(ugcPost:7289667478719262721,7289673208176242690)"
        },
        {
          "commentText": "Bianca Buenconsejo Exactly!",
          "userName": "Maury Rogow, CEO",
          "userProfileURL": "https://www.linkedin.com/in/mauryrogow",
          "dataId": "urn:li:comment:(ugcPost:7289667478719262721,7289673682375827457)"
        }
      ],
      "commentAdded": "Absolutely! Cooperation is key to overcoming challenges. Lets be inspired to make a difference together—great message! 🌟 #Community #Collaboration"
    },
    {
      "postId": "urn:li:activity:7289680791557554179",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289680791557554179",
      "url": "https://www.linkedin.com/in/chapmanandre?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAGzEEQBigmdGIjO-_XDJI43z9CIzfhC2I0",
      "name": "Andre Chapman\nAndre Chapman",
      "content": "We have some exciting opportunities available for experienced \n#DataEngineers and \n#SolutionArchitects with \n#Databricks experience. \n\nThese opportunities would put you at the forefront of innovation in the Data and AI space helping Life Sciences and Financial Services customers leverage Databricks to drive business value.\n\nReach out if you are are considering your next opportunity or DM me below for more information....",
      "reactions": {
        "likes": "8",
        "comments": "2 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "I'm interested",
          "userName": "Saurav Arun Dudulwar",
          "userProfileURL": "https://www.linkedin.com/in/sauravdudulwar",
          "dataId": "urn:li:comment:(activity:7289680791557554179,7289681839470862336)"
        },
        {
          "commentText": "Hi Andre,\nKindly share full Job Description at sapna@convextech.com",
          "userName": "Sapna Chhetri",
          "userProfileURL": "https://www.linkedin.com/in/sapna-chhetri-73b387227",
          "dataId": "urn:li:comment:(activity:7289680791557554179,7289681759389048832)"
        }
      ],
      "commentAdded": "Exciting opportunities ahead! 🔍 If youre passionate about Data and AI, this could be the perfect next step in your career! 🚀 #JoinTheTeam"
    },
    {
      "postId": "urn:li:activity:7289657528471207936",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289657528471207936",
      "url": "https://www.linkedin.com/in/veroniquebarrot?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAECMC0wBQseYZa4ZPmFaqdp3me6FWJi2Abg",
      "name": "Véronique Barrot\nVéronique Barrot",
      "content": "11 Brutal Career Truths \n\nYou Need to Hear Today\n\nSuccess doesn’t happen overnight.\nIt’s built through tough lessons and smart moves.\n\nHere’s the truth:\n\nTop performers don’t wait for opportunities to fall into their lap.\nThey face challenges head-on and keep pushing forward.\n\nMaster these 11 truths to grow\nYour career and mindset:\n\n1. Mistakes are unavoidable - so is the growth they spark\n↳ Every setback carries a lesson.\n↳ The sooner you embrace failure, the faster you progress.\n\n2. Anxiety is a sign, not a roadblock.\n↳ Discomfort often means it’s time to level up.\n↳ Growth lives outside your comfort zone.\n\n3. Every job is a stepping stone.\n↳ Absorb, contribute, and keep evolving.\n↳ No experience is wasted if you apply what you learn.\n\n4. Failures don’t define you, but your response does.\n↳ Resilience matters more than perfection.\n↳ Keep moving forward, no matter what.\n\n5. Your reputation is your greatest asset.\n↳ It follows you everywhere - guard it wisely.\n↳ Trust is built over time but lost in seconds.\n\n6. Success isn’t luck - it’s built daily.\n↳ Hard work compounds over time.\n↳ Stay focused on long-term wins.\n\n7. Burnout is real - protect your energy.\n↳ Sustainable success requires balance.\n↳ Your well-being fuels your career longevity.\n\n8. Trust, but always verify.\n↳ Healthy skepticism protects you from costly mistakes.\n↳ Blind trust can derail your career.\n\n9. Know your value - and own it.\n↳ Confidence isn’t arrogance; it’s self-awareness.\n↳ Don’t sell yourself short to fit in.\n\n10. Credibility takes years to build, seconds to lose.\n↳ Integrity and consistency are everything.\n↳ Every decision shapes your professional legacy.\n\n11. Work friendships need boundaries.\n↳ Relationships matter, but professionalism comes first.\n↳ Don’t blur the lines at the cost of your growth.\n\nSuccess isn’t about luck—it’s about habits.\n\n Which lesson hit home for you?\nDrop it in the comments below ⬇️\n\n️ Repost to help someone who needs to hear these brutal career truths today.\n Followfor more actionable career growth insights.",
      "reactions": {
        "likes": "195",
        "comments": "198 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "I completely agree with the point about burnout being real and the importance of protecting your energy Véronique Barrot. As leaders, we often feel the pressure to give our all at work, but sustainable success is rooted in balance.",
          "userName": "Damesha Craig, Leadership Coach and Startup Advisor",
          "userProfileURL": "https://www.linkedin.com/in/dameshacraig",
          "dataId": "urn:li:comment:(ugcPost:7289630046422462465,7289657520099336192)"
        }
      ],
      "commentAdded": "Great reminders! Id say #3 resonates most with me—every experience truly builds our path forward. Thanks for sharing these insights!"
    },
    {
      "postId": "urn:li:activity:7289664085044981760",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289664085044981760",
      "url": "https://www.linkedin.com/in/fusionphotog?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAB6zI2kBVGMkhYroYDZhWc09HO2DtALECs8",
      "name": "Deevo Tindall\nDeevo Tindall",
      "content": "My Latest Op-Ed on Leadership! HINT: It's not what you might think it is...\n\nI just wrapped up my monthly article for Mountain Island Lake magazine, where I was tasked with sharing my perspective on \"Leadership.\"\n\nTo give this piece more depth, I reached out to some incredible leaders I admire and included their insights. Their perspectives added so much value, and I’m thrilled to share the final result with you.\n\nCheck out the article here: Leadership Is Not What You Think It Is\n\n\nI’d love to hear your thoughts—what does leadership mean to you? Drop your take in the comments below!\n\n@courtneykulitsch @sudev",
      "reactions": {
        "likes": "1",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Excited to read your thoughts on leadership! Engaging with diverse perspectives is key to growth. Looking forward to the insights!"
    },
    {
      "postId": "urn:li:activity:7285459363274645504",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7285459363274645504",
      "url": "https://www.linkedin.com/in/llenguito?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAC8HlMBkxkXGbjqfdHpbnGm_SZ8GDKx7EA",
      "name": "Luigi LENGUITO\nLuigi LENGUITO",
      "content": "Why did we choose Titanium Ventures?\n\n\n\nFirst and foremost the impressive listening skills and excitement for, I have had countless founders telling me how important is to have a shareholder that is your first cheerleader. And Ti is no different from our previous investors,,,\n\nSecond their expertise and accelerating B2B enterprise Go To Market into CIO of large organizations.\n\nThird because they showed care even when during the diligence process we hit an anmoying hiccup, that others would be distracted from.\n\n\nIt's so humbling and motivating to have such a strong set of firms backing us up in our mission to deter the next cyberattack with",
      "reactions": {
        "likes": "39",
        "comments": "5 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Oh, and Marcus Bartram is a ️",
          "userName": "Luigi LENGUITO",
          "userProfileURL": "https://www.linkedin.com/in/llenguito",
          "dataId": "urn:li:comment:(activity:7285459363274645504,7285617581984501760)"
        },
        {
          "commentText": "Luigi LENGUITO Their genuine enthusiasm for BforeAI and proven track record in accelerating B2B enterprise go-to-market strategies make them an ideal partner. \n\nIt's impressive how they demonstrated unwavering support even during unexpected challenges in the diligence process.",
          "userName": "Anish Verma",
          "userProfileURL": "https://www.linkedin.com/in/anishverma",
          "dataId": "urn:li:comment:(activity:7285459363274645504,7285562121554141184)"
        },
        {
          "commentText": "Anish Verma thanks for this spontaneous comment!",
          "userName": "Luigi LENGUITO",
          "userProfileURL": "https://www.linkedin.com/in/llenguito",
          "dataId": "urn:li:comment:(activity:7285459363274645504,7285617700653989888)"
        }
      ],
      "commentAdded": "Exciting to see such a strong partnership! Listening and expertise truly make a difference in navigating challenges. Looking forward to your success!"
    },
    {
      "postId": "urn:li:activity:7289610724073496577",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289610724073496577",
      "url": "https://www.linkedin.com/in/aydan?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAUjCskB5EcIsM-pXzw_irDdEWQFJ7Z5rHg",
      "name": "Aydan Al-Saad\nAydan Al-Saad",
      "content": "Over 300 Million views from asking one simple question…\n\nWhat’s Your Dream?\n\n\nMeet(if you haven’t already!)\n\nSimon’s journey is nothing short than incredible.\n\nFrom homeless at 15 to investing in 79 businesses.\n\nTo now building arguably his biggest project yet.\n\n\n\nSimon & I have had a quite a few interactions over the past 18 months.\nMost notably on a TikTok live when I just started!\n\nSimon shared some hard truths with me about where I was going.\nAnd I listened!\n\nI can say it was one of the most impactful conversations in my ”creator\n& entrepreneurial” life \n\nSometimes one person can have an impact on you like that.\nIt’s up to you how you action from it!\n\n18 months later we had the chance to collaborate together.\n\nWhat I love most about this interview was our common purpose to help others.\n\nPositive social media is the future!\n\n️ Repost to spread the positivity to your network.\n___\n\nIf you enjoyed this post...\n\n️ Follow mefor daily motivation, inspiration and insight on all things Careers, Content & Entrepreneurship.",
      "reactions": {
        "likes": "56",
        "comments": "19 comments",
        "shares": "0"
      },
      "mediaUrl": "blob:https://www.linkedin.com/b692be46-8a9b-42ac-8a94-7ddceff2f24c",
      "comments": [
        {
          "commentText": "Somehow we never bumped into each other on the streets of London while filming - but we managed to Dubai! Shoutout to 1 Billion Followers Summit",
          "userName": "Aydan Al-Saad",
          "userProfileURL": "https://www.linkedin.com/in/aydan",
          "dataId": "urn:li:comment:(ugcPost:7289578240338251779,7289578812537819137)"
        },
        {
          "commentText": "A purposeful life is a life of purpose ",
          "userName": "Aydan Al-Saad",
          "userProfileURL": "https://www.linkedin.com/in/aydan",
          "dataId": "urn:li:comment:(ugcPost:7289578240338251779,7289578894855200769)"
        }
      ],
      "commentAdded": "Incredible journey, Simon! Your story is a testament to the power of resilience and community. Excited to see how you continue to inspire others! 🚀🌟"
    },
    {
      "postId": "urn:li:activity:7289678816715649025",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289678816715649025",
      "url": "https://www.linkedin.com/in/joshuastreets?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAVW7eABJnXNdDAo9YzkoO2wqAuNmSInVMQ",
      "name": "Josh Streets\nJosh Streets",
      "content": "A well written piece that I was interviewed for by CX Dive. A simple feature that should be enabled on any call queue (especially inbound sales).",
      "reactions": {
        "likes": "0",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Great insights on the dearth of callbacks, Josh!\n\nIt's interesting that companies would avoid callbacks as a way of \"punishing\" customers who call by subjecting them to long wait times.\n\nCallbacks can help reduce costs in this situation. They can smooth the demand curve and reduce customer frustration.\n\nIn one study of 29,000+ calls, handle time increased 25% when the customer became angry after calling. That 25% waste seems like a far easier target for cost-savings!",
          "userName": "Jeff Toister",
          "userProfileURL": "https://www.linkedin.com/in/jefftoister",
          "dataId": "urn:li:comment:(activity:7289678816715649025,7289686177064890368)"
        }
      ],
      "commentAdded": "Great insights! Enabling this feature can truly enhance customer experiences and streamline sales processes. Looking forward to more discussions!"
    },
    {
      "postId": "urn:li:activity:7287499524346925059",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287499524346925059",
      "url": "https://www.linkedin.com/in/carrieladue?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAOyPSEBZWvKsEDCtGw1nk69sLx8rNVugGk",
      "name": "Dr. Carrie LaDue\nDr. Carrie LaDue",
      "content": "The best leadership advice I can give you for the next decade: \n\n(Here’s what you need to lead the future):\n\nI’ve worked with thousands of leaders.\n\nA pattern I’ve observed in all of them:\n\nThe ones who thrive in the next decade won’t be the ones who grind harder.\n\nThey’ll be the ones who:\n- Lean into change\n- Adapt with purpose\n- Embrace the trends reshaping leadership\n\nHere’s what’s coming and how you can get ahead of it:\n\n1) The rise of AI and technology\n\nAI isn’t going away.\n\nIf you want to win, stop trying to outwork the machines.\n\nInstead, figure out how to use them.\n\nYou need to ask:\n- “What tools actually help us achieve our goals?”\n- “Which ones are a waste of our time?”\n\nUpskilling your team (and yourself) is non-negotiable.\n\n2) Deep connection in a tech-driven world\n\nAs technology handles more tasks, people are craving something machines can’t give:\n\nReal connection.\n\nLeaders who create cultures of belonging will thrive.\n\nIt’s about being present.\nAnd letting your people know they matter.\n\n3) Intentional growth and learning\n\nThe pace of change isn’t slowing down.\n\nNeither can you.\n\nLeaders who prioritize learning—both for themselves and their teams—will stay ahead.\n\nBuild a culture where curiosity and growth are part of the DNA, and you’ll be ready for whatever comes next.\n\nP.S. What trends are you noticing in leadership currently?\n\nLet's discuss in the comments below.\n\nThanks for reading.\n\nEnjoyed this post?\n\nFollowfor more insights on leadership and high performance—and share this post with your network.\n\nIf you’re ready to lead the future with confidence, pre-order my book, ‘The Trifecta: When Excellence Becomes the Enemy.’\n\nIt’s available until February 10th.\n\nVisit the link in the comments to pre-order now.",
      "reactions": {
        "likes": "114",
        "comments": "38 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "https://carrie-ladue.presale.manuscripts.com/registration/select",
          "userName": "Dr. Carrie LaDue",
          "userProfileURL": "https://www.linkedin.com/in/carrieladue",
          "dataId": "urn:li:comment:(ugcPost:7287499522451095554,7287500458712027137)"
        },
        {
          "commentText": "\"If you want to win, stop trying to outwork the machines.\" \n\nThat is such a great point, Carrie. Not too common these days, but I'll sometimes come across businesses stuck in the stone ages simply because they refuse to adapt.\n\nAI, automation, and tech will be the way. Fighting against it is a losing battle.",
          "userName": "Jordan Nelson",
          "userProfileURL": "https://www.linkedin.com/in/jordan-nelson-salesforce",
          "dataId": "urn:li:comment:(ugcPost:7287499522451095554,7287505336175882241)"
        },
        {
          "commentText": "Jordan Nelson Completely agree, Jordan. Businesses stuck in the past are missing out, and adapting to AI and automation is the smart play.",
          "userName": "Dr. Carrie LaDue",
          "userProfileURL": "https://www.linkedin.com/in/carrieladue",
          "dataId": "urn:li:comment:(ugcPost:7287499522451095554,7287512099918913537)"
        },
        {
          "commentText": "Dm for Gold sale ",
          "userName": "Mack Ben",
          "userProfileURL": "https://www.linkedin.com/in/mack-ben-412822349",
          "dataId": "urn:li:comment:(ugcPost:7287499522451095554,7289661406604324865)"
        }
      ],
      "commentAdded": "Great insights! Embracing change and fostering genuine connections are key. Excited to see how leaders adapt to these trends! #Leadership #Growth"
    },
    {
      "postId": "urn:li:activity:7289615747926962177",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7289615747926962177",
      "url": "https://www.linkedin.com/in/selenarezvani?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAC_Ey0B1gdvKnziSDQKImKmieq2RpUb-vc",
      "name": "Selena Rezvani (she/her)\nSelena Rezvani (she/her)",
      "content": "Three instances where saying less is more at work! Follow me on IG  in my profile! \n#corporatelife \n#corporatecommunication \n#communicationtips ",
      "reactions": {
        "likes": "28",
        "comments": "4 comments",
        "shares": "0"
      },
      "mediaUrl": "blob:https://www.linkedin.com/518cd557-9646-48fd-a997-3a25a4e24143",
      "comments": [
        {
          "commentText": "Love this! When I made mistakes at work, I would overexplain everything to my manager - almost like I was desperately trying to justify why I shouldn't be fired. There's no benefit in letting the situation drag on or become more complicated than it needs to be.",
          "userName": "Gabriella Solimine",
          "userProfileURL": "https://www.linkedin.com/in/gabriellasolimine",
          "dataId": "urn:li:comment:(ugcPost:7289615000845881344,7289668826500063234)"
        },
        {
          "commentText": "SO good!  ",
          "userName": "Lisa Ratner",
          "userProfileURL": "https://www.linkedin.com/in/lisa-ratner-0b5a302",
          "dataId": "urn:li:comment:(ugcPost:7289615000845881344,7289686508201025536)"
        }
      ],
      "commentAdded": "Great insights! Sometimes, concise communication leads to clearer understanding. Looking forward to more tips! #LessIsMore"
    }
  ],
  "errors": [
    {
      "postId": "urn:li:activity:7289628226744684544",
      "url": "https://www.linkedin.com/in/clairemdavis?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAFCGXoB6nWioiigFFst9Mz-mJ5Ku6Q5o1Q",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7289606821353328640",
      "url": "https://www.linkedin.com/in/swarraj?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAEx1TsBfrIpqnzbg93ty9my-JhYMHoMQsw",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7289554784280289280",
      "url": "https://www.linkedin.com/in/unnati-lasiyal-39326a227?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADjQM58BFpkvKHL6UmE8qEB3LQhYUEKlZvA",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7289671413374828544",
      "url": "https://www.linkedin.com/in/podolski?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAmnHsBzAzwD9km7B-hDfzveBYRBJxy0CI",
      "errors": [
        "Failed to fetch reactions.",
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7289641637956263936",
      "url": "https://www.linkedin.com/in/jonbrosio?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABERfGYB8htpaFCfMDMxwMfIE6Bsd3nqsUM",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7289675875510341632",
      "url": "https://www.linkedin.com/in/mtr-coaching?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAZfmIYBRgj-0quRQRoQD1VXT8T4EdrrLtU",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7289685426825482240",
      "url": "https://www.linkedin.com/in/jonathanhwestover?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAFBTEMBbJ2WaW7hW_NVOY2y6b8exCAonPA",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7289628416692150272",
      "url": "https://www.linkedin.com/in/anthonywentzel?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADZN2sBr5ZUAlKZK2QwVQvOE9B6pnFHXt8",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7289663675777380353",
      "url": "https://www.linkedin.com/groups/961087?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A961087-7289638950116229120",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7289681320891293697",
      "url": "https://www.linkedin.com/in/tinagravel?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAAb5sBbhYlVMp_YkONjO0YzKzlJeoVn1w",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7289664263789424640",
      "url": "https://www.linkedin.com/in/hudsonhector?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAgkwt4B_wQJlF09zUwObxwx_V8QMnXfUFk",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7288193764022464514",
      "url": "https://www.linkedin.com/in/braghav?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAJ0fFMBWj6tuoDegR2h6vkeUCBSOq1v9Ms",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7289646954681114624",
      "url": "https://www.linkedin.com/in/contactprasadasriya?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAEP2oLgBBRY-9BPz1b_Zn1HIVXQvY3n30i4",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287242348600651777",
      "url": "https://www.linkedin.com/in/rickconlowservantleadership?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAPUxFwB6p1p6ESvdwgOkdRMuNdW3KDrJTU",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7289377546578653185",
      "url": "https://www.linkedin.com/in/juliangoldieseo?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAep3-4B9OlK-gjL-56ir-8zhw9EZITJa0Y",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7289650073657884672",
      "url": "https://www.linkedin.com/in/olivia-diallo-%F0%9F%8F%B3%EF%B8%8F%E2%80%8D%F0%9F%8C%88-775703220?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADeiLIkByzrLxLL6zkhLMWil8uQQcTAoVeM",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7289665617358438400",
      "url": "https://www.linkedin.com/in/chrisclayton1?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAA44cQBQx55H4hZXvRNXNXNyODn2RH2uQM",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7289680791557554179",
      "url": "https://www.linkedin.com/in/chapmanandre?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAGzEEQBigmdGIjO-_XDJI43z9CIzfhC2I0",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7289657528471207936",
      "url": "https://www.linkedin.com/in/veroniquebarrot?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAECMC0wBQseYZa4ZPmFaqdp3me6FWJi2Abg",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7289664085044981760",
      "url": "https://www.linkedin.com/in/fusionphotog?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAB6zI2kBVGMkhYroYDZhWc09HO2DtALECs8",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285459363274645504",
      "url": "https://www.linkedin.com/in/llenguito?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAC8HlMBkxkXGbjqfdHpbnGm_SZ8GDKx7EA",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7289678816715649025",
      "url": "https://www.linkedin.com/in/joshuastreets?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAVW7eABJnXNdDAo9YzkoO2wqAuNmSInVMQ",
      "errors": [
        "Failed to fetch reactions.",
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287499524346925059",
      "url": "https://www.linkedin.com/in/carrieladue?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAOyPSEBZWvKsEDCtGw1nk69sLx8rNVugGk",
      "errors": [
        "Failed to fetch media URL."
      ]
    }
  ]
}