{
  "posts": [
    {
      "postId": "urn:li:activity:7282290111407353856",
      "url": "https://www.linkedin.com/in/matt-bowker-65ba4811?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAJ3xacB4cLUixvVgG2m_gbP10mOYNWzSeY",
      "name": "Matt Bowker\nMatt Bowker",
      "content": "Urban infill sites offer great opportunities to build more homes sustainably. For example, we've helped our client transform this site from two dwellings into 10 homes.\n\nWe are big fans of urban infill housing developments and here are 8 reasons why:\n\n1️⃣ Efficient Use of Resources:\n\nInfill development maximises existing infrastructure, including roads, utilities, and services; it reduces the need for new construction and minimises costs.\n\n2️⃣ Efficient Use of Land:\n\nBy focusing on infill, cities can make more efficient use of previously developed (brownfield) land.\n\n3️⃣ Reduced Urban Sprawl:\n\nBy focusing on infill, cities can contain their outward growth to preserve surrounding greenfields and prevent encroachment into natural habitats and agricultural land.\n\n4️⃣ Enhanced Public Transport Accessibility:\n\nInfill sites are typically located near existing public transport networks, promoting the use of mass transit and reducing reliance on cars, which lowers greenhouse gas emissions.\n\n5️⃣ Revitalisation of Underutilised Areas:\n\nDeveloping infill sites can rejuvenate neglected or declining neighbourhoods, boost local economies, and improve residents' quality of life.\n\n6️⃣ Walkability & Community:\n\nHigher-density developments encourage walkable neighbourhoods, foster community interactions, and reduce dependence on automobiles, which can enhance social cohesion.\n\n7️⃣ Environmental Benefits:\n\nBy preserving green spaces and reducing the need for infrastructure expansion, infill development contributes to lower energy consumption, reduced habitat destruction, and supporting biodiversity.\n\n8️⃣ Economic Strengthening:\n\nInfill development can lead to increased property values and tax revenues, providing funds for public services and community enhancements that ultimately benefit the local economy.\n\nThese reasons underscore the importance of prioritising urban infill as a strategy for delivering more affordable homes, creating stronger communities, promoting sustainable urban development, and preserving green spaces.\n\nThe development shown is the Saplings, a residential development by our client PIC Homes comprising 10 large-family homes in Timperley, Trafford.",
      "reactions": {
        "likes": "1,365",
        "comments": "442 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Sustainable Homes at 'offers over £900k'! Yes, very sutainable....\n\nThe AIA for the site was weak at best. It didn't report on required mitigation i.e. trees for trees lost... Your landscaping plan is laughable! 29 trees removed including beech, limes, sycamore (large natives) and 'replaced' with 16 small ornamentals like Amelanchier and Photinia and the like. This is Green Washing at it's finest! Shame on Trafford Council for allowing a development of this nature to go ahead.\n\n10 'Family Homes', yes like the average family can afford a property over £900K... do yourself a favour and say it like it is... Profit rules all",
          "userName": "Robin Grimes",
          "userProfileURL": "https://www.linkedin.com/in/robin-grimes-8231313a",
          "dataId": "urn:li:comment:(activity:7282290111407353856,7282719495096270849)"
        },
        {
          "commentText": "Phil Donovan, PhD It’s from a US source and there is evidence form cities like Austin that have built lots of homes that prices and rents have gone down as a result.\n\nProblem is we haven’t built anywhere near enough homes in the UK for decades so that, in conjunction with other factors like extremely low interest rates, has meant prices keep going up.",
          "userName": "Matt Bowker",
          "userProfileURL": "https://www.linkedin.com/in/matt-bowker-65ba4811",
          "dataId": "urn:li:comment:(activity:7282290111407353856,7283904585457446912)"
        },
        {
          "commentText": "Matt Bowker sound like Trickle Down Economics! \n\nThat has worked well hasn't it? Not!",
          "userName": "Derek Forsyth",
          "userProfileURL": "https://www.linkedin.com/in/derekforsyth",
          "dataId": "urn:li:comment:(activity:7282290111407353856,7284623964297945088)"
        },
        {
          "commentText": "You are clearly very proud of your achievement & looking forward to £10 million payout once sold  \n\nI'm perplexed why \"we\" believe there's a housing crisis though. It is a term often used to soften the feeling of guilt I've discovered.\n\n Go & visit somewhere in Cornwall like Port Issac for example. How many homes are holiday homes v actual residential lived-in homes  I reckon you would find it very difficult to find a real home. Housing is definitely abundant in Port Issac but they're all empty at the moment because it's all about the money  I went to visit to see for myself just in case I was being naive about what I was told. Yep, I couldn't find locals living in the village!\n\nYou must have missed this BBC News reel about the glut of empty houses in the UK to consider using the word 'crisis'. So I have attached a link for your convenience.\n\nShame about the trees; irreplaceable habitat in our lifetime but yeah, it won't keep you awake at night.\n\nWhat's uncontrolled overgrowth? It's another way of you expressing your feeling of controlling other living organisms perhaps?\n\nYou're seeking acceptance. That's how I interpreted this post. No malice intended.",
          "userName": "Marco Bartolini",
          "userProfileURL": "https://www.linkedin.com/in/marco-bartolini-a652263a",
          "dataId": "urn:li:comment:(activity:7282290111407353856,7283246274538012672)"
        },
        {
          "commentText": "David Hague There are but my point is it’s a lot more expensive and difficult to buy a house now than when you and l bought our 1st house.",
          "userName": "Matt Bowker",
          "userProfileURL": "https://www.linkedin.com/in/matt-bowker-65ba4811",
          "dataId": "urn:li:comment:(activity:7282290111407353856,7283524145466732544)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7283508339840319489",
      "url": "https://www.linkedin.com/in/mynameisalex?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACI1sUEBx9EBTbBeKp0wdvfE1G29dKtBEdI",
      "name": "Alex Nelson\nAlex Nelson",
      "content": "First AE hired. Zero pipeline. No playbook. Just me staring at an empty CRM wondering if I'd made a huge mistake.\n\nHere's my honest story of those first 45 days:\n\n• Week 1-2: Studied the product, started running campaigns & doing mock demos.\n\n• Week 3-4: Started taking sales calls some better than others & expanded to other outreach channels.\n\n• Week 5-6: Felt pretty alone at times but started seeing the light at the end of the tunnel. Other AEs had teammates, but I was testing everything by myself.\n\n• Week 7+ (Present): Averaging a little over 6 demos per day & hitting the ground running prospecting every morning\n\nWhat I learned:\n1. Write down everything - my mistakes will help myself & others avoid them\n2. Accept the chaos - good systems start messy\n3. Make friends first, sell second - early customers help shape everything.\n\nBeing first is a challenge for sure but I'm having fun with it.\n\nFounding AEs: What was your biggest \"I wish someone told me this\" moment?\n\nPS- Happy Friday! Cheers!",
      "reactions": {
        "likes": "833",
        "comments": "135 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Every day I see dorks saying not to take the first sales hire job. Congrats on taking it. No matter what happens, you'll come out the other end a better man.",
          "userName": "Cory Bray",
          "userProfileURL": "https://www.linkedin.com/in/buy-triangleselling",
          "dataId": "urn:li:comment:(activity:7283490108593393664,7283508318587764736)"
        },
        {
          "commentText": "Cory Bray Winner. At one point it felt like I had to choose between two things:\n1) Betting on myself\n2) Doing something safe\n\nCan't tell you how many people have told me how risky it was. But when I see someone or something totally disruptive and in the best way possible, I'm looking to get involved.\n\nThats what I saw here and ive honestly if anything only been more impressed. My decision is such a proud one at this point in retrospect but truly there was never another option",
          "userName": "Alex Nelson",
          "userProfileURL": "https://www.linkedin.com/in/mynameisalex",
          "dataId": "urn:li:comment:(activity:7283490108593393664,7283642501503107072)"
        },
        {
          "commentText": "Cory Bray They sound like cowards",
          "userName": "Andrew Zimmerman",
          "userProfileURL": "https://www.linkedin.com/in/ayzimmerman",
          "dataId": "urn:li:comment:(activity:7283490108593393664,7284334951464882176)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7284328285105184769",
      "url": "https://www.linkedin.com/in/matthew-t-rocha?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACOiQHgBfOIbKH42GFVzDcOt1Lbk16fRBZ4",
      "name": "Matt Rocha\nMatt Rocha",
      "content": "If you run an agency and have a lot of trouble productizing your service and making it repeatable you should probably use Motion.\n\nUnderrated how it almost punishes you for spending time to create something that is a single use project while simultaneously rewarding you for creating something repeatable/executable/understandable by others.\n\nEveryone at B2B Catalyst has used several platforms for project management but I can say that it's probably the only one I've used that is built to get you more clarity quickly.",
      "reactions": {
        "likes": "15",
        "comments": "4 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Innnteresting. Haven’t used the tool but get ads for it…all…the…time. Your charactization actually makes me finally want to jump in. ",
          "userName": "Rex Harris",
          "userProfileURL": "https://www.linkedin.com/in/rexhunterharris",
          "dataId": "urn:li:comment:(activity:7284328285105184769,7284330605440380929)"
        },
        {
          "commentText": "Rex Harris We onboarded the team to it within 2 days. Took a little time to sink in but the AI scheduling for tasks/priorities is great at a granular level. Adds the right amount of micromanagement to the execution part but feeds back into templates you can deploy future iterations off of",
          "userName": "Matt Rocha",
          "userProfileURL": "https://www.linkedin.com/in/matthew-t-rocha",
          "dataId": "urn:li:comment:(activity:7284328285105184769,7284359095480942592)"
        },
        {
          "commentText": "Interesting take, any specific example?",
          "userName": "Raul Hernandez Ochoa",
          "userProfileURL": "https://www.linkedin.com/in/dogoodwork",
          "dataId": "urn:li:comment:(activity:7284328285105184769,7284613747191525376)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7284541315717971969",
      "url": "https://www.linkedin.com/in/guillaume-moubeche-a026541b2?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADGS3aIB50yotmXVjvGJKyqetfg0qhs20-c",
      "name": "Guillaume Moubeche\nGuillaume Moubeche",
      "content": "Here are 5 things I did because I trusted my guts and not the people around me:\n\n1- Started lemlist in the most saturated market ever\nIn 2018, there were thousands of sales automation platforms on the market.\nNo one understood why I wanted to start in such a crowded market.\nAfter running an outbound sales agency and using most tools in that market, I felt like I could create something different to help more people succeed with outbound.\n\n2- Launch multi-product strategy when everyone was telling me it was a loss of focus\nIn 2019, I started a side project while lemlist was growing 2 digits month over month (>30% MoM)\nEveryone told me that it was a de-focus.\n18 months later, I sold that project, and today 4 of the SaaS I run do more than $2M in ARR \n\n3- Let enterprise customers go\nIn 2020 I closed a few deals with enterprise customers.\nOn paper, it’s awesome.\nNo churn, high expansion, yearly upfront payment…\nBut in the end it didn’t fit our ICP nor the product we wanted to build at the time.\nLetting go of some customers is hard but can be necessary in the long run.\n\n4- Choose the deal that didn’t have the best terms.\nIn 2021, we had a lot of VCs and investors reach out with INSANE terms.\nSince we didn’t want to raise, they were all OK to do 100% cash out (which means that money goes directly to our bank account as founder and not to the company’s bank out)\nI received a few term sheets and LOI (letter of intent) but I didn’t choose the one with the best terms\nI chose the one I felt the most comfortable with because I valued the relationship we had built withand\n\n5- Acquire a tech company while having 0 knowledge about M&A\nIn 2022, I acquired Taplio when it was doing $20,000 in MRR\nToday it’s doing more than $5,000,000 in ARR, and I believe that it will help even more creator around the world grow their business while leveraging their personal brand.\n\nWhat about you?\n\nWhat are the things you did because you knew better?",
      "reactions": {
        "likes": "90\nAlex Turnbull and 89 others",
        "comments": "18 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Thank you for your insights \n\nthe \"3- Let enterprise customers go\" highly resonate with us right now.\n\nWith Cardynale We have to chose today between build the core value of the product or make requirement for enterprise customer (SOC2, SSO, custom integrations etc..).\n\nWe decided that we prefer to focus first on the core value. And maybe one day we will decide to serve these customers.",
          "userName": "William Bellity",
          "userProfileURL": "https://www.linkedin.com/in/william-bellity",
          "dataId": "urn:li:comment:(activity:7284510120309391362,7284570632615264256)"
        },
        {
          "commentText": "I’m a bit of a fatalist when it comes to the first point - if you’re going to give it a shot, why not aim high, even in the most saturated markets? Who knows, maybe your destiny is to stand out as number 1!",
          "userName": "Iryna Kotova",
          "userProfileURL": "https://www.linkedin.com/in/iryna-kotova",
          "dataId": "urn:li:comment:(activity:7284510120309391362,7284554758613340160)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7282510926178603008",
      "url": "https://www.linkedin.com/in/askaralipv?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACSE08MB24HDvs8EjEopKOSQZ-jYwy_ZwU4",
      "name": "Askar Ali 🌿\nAskar Ali 🌿",
      "content": "How to Spot the Difference Between Authentic and Counterfeit Products\n\nIn today’s market, one might assume everything in their wardrobe is original, but counterfeits are more common than we think—especially for popular brands.\n\nUnderstanding the differences between genuine and counterfeit items is crucial to ensure you’re not paying for something less than what you expect.\n\nTake Nike Air sneakers, for example. Authentic pairs have specific qualities that counterfeit manufacturers struggle to replicate:\n• Material Quality: Genuine Nike Air sneakers use high-quality materials that result in a distinct texture, particularly in the leather. Counterfeits often lack this hardness and durability.\n• Symmetry: Authentic sneakers are designed with precision, ensuring perfect symmetry. Any asymmetry could be a red flag.\n\nBeing aware of these details can save you from being misled and ensure you’re investing in authentic, high-quality products.\n\nWhat steps do you take to verify authenticity before making a purchase? Let’s discuss!",
      "reactions": {
        "likes": "800",
        "comments": "48 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "This is the same shoe in each photo.",
          "userName": "Bob Drapeau",
          "userProfileURL": "https://www.linkedin.com/in/bobdrapeau",
          "dataId": "urn:li:comment:(activity:7282510926178603008,7283022976264892417)"
        },
        {
          "commentText": "Bob Drapeau The differences in the photo between the fake and original Nike shoes are:\n 1. Logo Alignment:\n • Fake: The “NIKE AIR” logo is not well-centered and appears misaligned.\n • Original: The “NIKE AIR” logo is properly aligned and centered.\n 2. Heel Texture:\n• Fake: The heel area lacks texture and looks smoother than it should.\n• Original: The heel area has a textured finish, consistent with the authentic design.\n3. Construction Quality:\n• Fake: The stitching and finish around the heel area look less precise.\n• Original: The stitching and finish are clean and precise.",
          "userName": "Askar Ali 🌿",
          "userProfileURL": "https://www.linkedin.com/in/askaralipv",
          "dataId": "urn:li:comment:(activity:7282510926178603008,7283163897866440704)"
        },
        {
          "commentText": "Askar Ali  same shoe in both pic",
          "userName": "Bob Drapeau",
          "userProfileURL": "https://www.linkedin.com/in/bobdrapeau",
          "dataId": "urn:li:comment:(activity:7282510926178603008,7283387829487878145)"
        },
        {
          "commentText": "I would debate “high quality.” My son wears Nike for basketball. They last maybe 2-3months.",
          "userName": "Trish Johnson",
          "userProfileURL": "https://www.linkedin.com/in/trish-johnson-bb19a473",
          "dataId": "urn:li:comment:(activity:7282510926178603008,7284624409628229635)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7284539691406618626",
      "url": "https://www.linkedin.com/in/robynmussler?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADkSvAB-ZNxqWOOJ7D4WBnGrpBfqV7eUqw",
      "name": "Robyn Mussler\nRobyn Mussler",
      "content": "NGT360 - 1st Workshop of the new year. \n Workshop 1 this Tuesday, January 14th! \nAgenda: All About the Customer \n- Human-Centered Design with Jennifer Sullivan ️\n- User Personas \n- Customer Surveys \n- Mini Shark Pitches \nCheck out this video showcasing this year's talent of one of the teams promoting their product and starting their entreprenuer journey\n\nContribute to the success of these young bright teams, Donate:",
      "reactions": {
        "likes": "12",
        "comments": "1 comment",
        "shares": "0"
      },
      "mediaUrl": "blob:https://www.linkedin.com/a13c572d-aec9-4e13-a690-10f2bbc97f70",
      "comments": [
        {
          "commentText": "",
          "userName": "Duy H.",
          "userProfileURL": "https://www.linkedin.com/in/duy-h-652b6463",
          "dataId": "urn:li:comment:(ugcPost:7284408045974007809,7284594443666477056)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7282649228663791616",
      "url": "https://www.linkedin.com/company/inc42/posts",
      "name": "Inc42 Media\nInc42 Media",
      "content": "D2C fashion startup The Souled Store turned profitable in the financial year ended March 2024 (FY24) on the back of a strong growth in its top line and improvement in margins. The startup posted a net profit of INR 18.2 Cr during the year under review as against a loss of INR 16.5 Cr in FY23\n\nOperating revenue surged 54.26% to INR 360.2 Cr from INR 233.5 Cr in FY23. It earned INR 5.2 Cr from membership fees, while the rest of the revenue came from the sale of products.\n\nFounded in 2013 by,,and Harsh Lal, The Souled Store started as a branded merchandise apparel brand and later morphed into its current D2C casual wear brand form.\n\nTo read the in-depth article, click here:",
      "reactions": {
        "likes": "3,394\nDhruv Goel and 3,393 others",
        "comments": "23 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "The Souled Store’s transformation from a ₹16.5 Cr loss in FY23 to an ₹18.2 Cr profit in FY24 is the kind of pivot that startup dreams (and investor presentations) are made of. \n\n\nWith revenue soaring 54% to ₹360.2 Cr, it’s clear they’ve tapped into the zeitgeist of India’s casually stylish youth, who now seem to wear their disposable incomes as effortlessly as their oversized T-shirts.\n\nThe ₹5.2 Cr from membership fees is particularly poetic—essentially monetizing loyalty while building a subscriber base that’s both fashionable and, evidently, financially useful.\n\nFor a brand rooted in \"soul,\" this shift from merchandise kitsch to profit-savvy casual wear might seem paradoxical. But in today’s D2C landscape, perhaps the greatest flex is proving you can make margins as sharp as your marketing.\n\nIn essence, The Souled Store isn’t just selling clothes—it’s selling a lifestyle, and for once, it’s the startup, not the customer, leaving with fuller pockets.",
          "userName": "Ambika M",
          "userProfileURL": "https://www.linkedin.com/in/ambika-m-730bb3b0",
          "dataId": "urn:li:comment:(activity:7282649228663791616,7282809743033737216)"
        },
        {
          "commentText": "The Souled Store’s profitability is a testament to the power of evolving with market trends and consumer preferences.\n\nFrom branded merchandise to a full-fledged D2C casual wear brand, their ability to pivot and scale speaks volumes about the founders’ vision and adaptability. Achieving a 54% growth in revenue while posting a net profit after a loss the previous year is no small feat, and it highlights the importance of smart strategy and operational excellence.\n\nThe fact that their membership fees contributed to a chunk of their revenue also opens interesting avenues for recurring revenue models in the D2C space. As we see more brands move towards personalized and community-driven experiences, The Souled Store's ability to build a loyal consumer base will be key to maintaining long-term growth.\n\nLooking forward to seeing how they continue to innovate and expand in the future!",
          "userName": "Nikhil Asnani",
          "userProfileURL": "https://www.linkedin.com/in/nikhil-asnani",
          "dataId": "urn:li:comment:(activity:7282649228663791616,7284171239995138049)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7284592506502086656",
      "url": "https://www.linkedin.com/in/jslagle?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADaWkwBniXr5PFFECwmXqLdVBLvX_Hy-XU",
      "name": "Jason Slagle ✂️\nJason Slagle ✂️",
      "content": "It's time.\n\nWe're having the first in person board meeting for Cyber RISE.\n\nWe're working on vision, mission, values and trying to get this kicked off.\n\nWe're trying to change the industry, and be there if we fail.\n\nExcited for our day and the future.\n\nWithand",
      "reactions": {
        "likes": "79",
        "comments": "10 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Congrats, cant wait to see what rises!!",
          "userName": "Clay Archer",
          "userProfileURL": "https://www.linkedin.com/in/dancarcher",
          "dataId": "urn:li:comment:(activity:7284591646682296320,7284622833853321216)"
        },
        {
          "commentText": "+10 points for great style",
          "userName": "Phin Security",
          "userProfileURL": "https://www.linkedin.com/company/phin-security/posts",
          "dataId": "urn:li:comment:(activity:7284591646682296320,7284617043696308225)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7284604680452591616",
      "url": "https://www.linkedin.com/in/victoria-tollossa?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABZeRDgBFYlUpuhO4ZeYJjNt7eF3l3iUXow",
      "name": "Victoria Tollossa\nVictoria Tollossa",
      "content": "I’ve failed more times than I can count.\nI've started 6 companies. Only 2 worked out.\n\n(Ok, maybe I can count them.)\n\nHere’s the thing: most things we try will fail.\nBUT... (and that’s a big but )\n\nThat doesn’t mean we are failures.\n\nYou are not defined by a project, a job, a relationship, or any single chapter of your life.\n\nKeep going.\nKeep growing.\nSuccess is about resilience, not perfection.",
      "reactions": {
        "likes": "308",
        "comments": "75 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Yes!\n\nEvery success is laced with failure. \n\nThis is my big message to anyone (including myself) creating sales and marketing intiatives and plans.",
          "userName": "Darrin Guttman",
          "userProfileURL": "https://www.linkedin.com/in/darrin-guttman-propel",
          "dataId": "urn:li:comment:(activity:7284577773703028737,7284604673523675136)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7284603084096348162",
      "url": "https://www.linkedin.com/in/averyj?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAlfJMBGfBFYB1vM3Sh4TW9dafUwQkcUFk",
      "name": "James Avery\nJames Avery",
      "content": "This makes a ton of sense for TMobile - they already have access to unique data from their network and Vistar is going to bring a wealth of inventory to their team of great sellers. \n\nA great Adtech exit to start the year!",
      "reactions": {
        "likes": "12",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": []
    }
  ],
  "errors": [
    {
      "postId": "urn:li:activity:7282290111407353856",
      "url": "https://www.linkedin.com/in/matt-bowker-65ba4811?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAJ3xacB4cLUixvVgG2m_gbP10mOYNWzSeY",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7283508339840319489",
      "url": "https://www.linkedin.com/in/mynameisalex?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACI1sUEBx9EBTbBeKp0wdvfE1G29dKtBEdI",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7284328285105184769",
      "url": "https://www.linkedin.com/in/matthew-t-rocha?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACOiQHgBfOIbKH42GFVzDcOt1Lbk16fRBZ4",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7284541315717971969",
      "url": "https://www.linkedin.com/in/guillaume-moubeche-a026541b2?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADGS3aIB50yotmXVjvGJKyqetfg0qhs20-c",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7282510926178603008",
      "url": "https://www.linkedin.com/in/askaralipv?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACSE08MB24HDvs8EjEopKOSQZ-jYwy_ZwU4",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7282649228663791616",
      "url": "https://www.linkedin.com/company/inc42/posts",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7284592506502086656",
      "url": "https://www.linkedin.com/in/jslagle?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADaWkwBniXr5PFFECwmXqLdVBLvX_Hy-XU",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7284604680452591616",
      "url": "https://www.linkedin.com/in/victoria-tollossa?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABZeRDgBFYlUpuhO4ZeYJjNt7eF3l3iUXow",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7284603084096348162",
      "url": "https://www.linkedin.com/in/averyj?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAlfJMBGfBFYB1vM3Sh4TW9dafUwQkcUFk",
      "errors": [
        "Failed to fetch media URL."
      ]
    }
  ]
}