{
  "posts": [
    {
      "postId": "urn:li:activity:7287495416353337344",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287495416353337344",
      "url": "https://www.linkedin.com/in/theangelngele?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADIlBjgBCu33RaaiWkBet0oUaLRthBR64R8",
      "name": "Angel Ngele\nAngel Ngele",
      "content": "Soft skills are the No.1 strategy in the world to take your Career/ Business from 0 - \n\nThey help you connect with people, share your ideas, and stand out in any room.\n\nBut here’s the thing, most people don’t work on them enough.\n\nShort story: I’ve met so many talented individuals who struggle to express their thoughts clearly or build strong relationships.\n\nThey have the skills, but not the communication to match.\n\nWhat most people think:\n1. \"I’m just not a good communicator.\"\n2. \"Soft skills don’t matter as much as hard skills.\"\n3. \"I’ll figure it out eventually.\"\n\nWhat you should be thinking:\n1. Communication is a skill you build, not something you’re born with.\n2. Being a better communicator opens doors you didn’t even know existed.\n3. Small improvements in your soft skills can lead to big results in your career and life.\n\nBonus: People who communicate well are often seen as leaders, even if they’re not the most experienced in the room.\n\nIf you want to get better at soft skills like communication, start small:\n- Practice active listening.\n- Learn how to explain your ideas simply.\n- Give people your full attention in every conversation.\n\nThe results will surprise you.\n\nWant to become a better communicator?\n\nWatch this till the end, I’ve shared tips that can help you right away.\n\nP.S. Soft skills aren’t “soft.” They’re the real deal. Don’t sleep on them.",
      "reactions": {
        "likes": "9",
        "comments": "2 comments",
        "shares": "0"
      },
      "mediaUrl": "blob:https://www.linkedin.com/c7786992-b192-4ac4-860a-dc6c258d496d",
      "comments": [
        {
          "commentText": "And In today's AI era, soft skills are more important than ever. \n\nWhile many can master hard skills, it's the ability to communicate, adapt, and collaborate that sets top performers apart ",
          "userName": "Ammara Nazar",
          "userProfileURL": "https://www.linkedin.com/in/ammara-nazar039",
          "dataId": "urn:li:comment:(ugcPost:7287495360774602753,7287504386690289664)"
        },
        {
          "commentText": "Communication skill isnt mean speaking louder it's all about speaking clear & actively listening too Angel Ngele",
          "userName": "Mashhood ul Hassan🟠 Marketer",
          "userProfileURL": "https://www.linkedin.com/in/thedigibuddy",
          "dataId": "urn:li:comment:(ugcPost:7287495360774602753,7287505074321248256)"
        }
      ],
      "commentAdded": "Absolutely agree! Investing in soft skills opens doors and fosters meaningful connections. Small steps can lead to significant growth! 🚀"
    },
    {
      "postId": "urn:li:activity:7287372811654877184",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287372811654877184",
      "url": "https://www.linkedin.com/in/blessing-ikpia-54b790244?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADygsAsBE3EnPxCYA_zzPihIYwYLIfwhOQg",
      "name": "Blessing Ikpia\nBlessing Ikpia",
      "content": "You keep failing because you don't take advantage of opportunities \n\nFor you, everything is a SCAM.\n\nEspecially on this blue app (Linkedin), so you keep scrolling endlessly.\n\nA few days ago, I shared an opportunity to take the Content Marketing Certification with HubSpot Academy. A few persons jumped on it, others DIDN'T, thinking it was just another course\n\nBut here’s the thing: This wasn’t just any course, for me, It was a masterclass in creating content that drives results, connects with audiences and builds lasting brand impact. And now, I’m proud to say I’ve successfully completed it\n\nThis wasn’t “just another course.” It was an investment in knowledge that opened my eyes to:\n\n️The strategy behind value-driven content especially blogs, articles and SEO\n\n️How to create stories that connect and convert\n\n️The importance of measuring and optimizing every piece of content\n\nTo those who dismissed it, I have to say that you missed out on a game-changing opportunity and it's sad because you felt it wasn't important.\n\nTo those who took action, welcome to a new world of possibilities. Send me a Dm, let's grow together\n\nAnd to you, reading this: What’s stopping you from investing in yourself and your growth?\n\nOpportunities are everywhere but they’re only as good as the action you take.\n\nI'm, a Growth Marketer. I share my professional journey to empower young marketers. I also share resources like Mentorship program, courses and job vacancies to young professionals seeking global opportunities. If this is your thing, ensure you follow for more valuable content ",
      "reactions": {
        "likes": "37\nBlessing Ikpia and 36 others",
        "comments": "34 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "To everyone out there with a heart to actually scale up and be better \n\nYou may be overwhelmed \n\nYou may not have It all figured\n\nBut you just want to grow in your career,\n\nPLEASE DON'T GIVE UP \n\nFailure is difficult to explain",
          "userName": "Blessing Ikpia",
          "userProfileURL": "https://www.linkedin.com/in/blessing-ikpia-54b790244",
          "dataId": "urn:li:comment:(ugcPost:7287372809410895873,7287374674324299777)"
        },
        {
          "commentText": "My birthday is officially 19 days from now ",
          "userName": "Blessing Ikpia",
          "userProfileURL": "https://www.linkedin.com/in/blessing-ikpia-54b790244",
          "dataId": "urn:li:comment:(ugcPost:7287372809410895873,7287373759211040769)"
        }
      ],
      "commentAdded": "Absolutely! Investing in ourselves is crucial to unlocking new opportunities. Excited to see how this masterclass transforms your journey!"
    },
    {
      "postId": "urn:li:activity:7287482044471721985",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287482044471721985",
      "url": "https://www.linkedin.com/in/westmcdonaldco?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAEvxMQBQ77AN3_0OXUHuUpKcY6AMaxm8us",
      "name": "West McDonald\nWest McDonald",
      "content": "Have you heard of the \"Holy Trifecta of AI\"? If you've worked with GoWest.ai you have. For those we haven't worked with, there are 3 things we recommend to every single client we work with:\n\n1️⃣ Develop AI Policies\nWithout clear guidelines, shadow AI (unapproved tools used by employees) can create chaos. Developing robust AI policies prevents misuse, ensures data security, and aligns AI adoption with your organization's goals. It’s not just a rulebook—it’s your strategic playbook for the future.\n2️⃣ Implement an AI Meeting Assistant\nTime is precious, especially for sales reps. That’s why we use timeOS (). It seamlessly integrates with our CRM, offers customizable features, and even provides automated call scoring based on training. Imagine knowing how a call went without lifting a finger—it’s a game-changer for sales teams looking to improve performance and close more deals.\n3️⃣ Use Enterprise-Grade AI\nSecurity and creativity should never be at odds. Tools like ChatGPT Team Edition, MS Copilot Pro, and Gemini Advanced ensure your data stays protected while empowering your teams to unleash their full potential. These platforms allow businesses to innovate with confidence, combining security with functionality.\n\nReady to build your trifecta? Let’s talk about how to make it happen. Message me to get started.",
      "reactions": {
        "likes": "2",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Great insights! Building a strong AI foundation is essential for success. Excited to see how others implement these strategies! #AI #Innovation"
    },
    {
      "postId": "urn:li:activity:7287484140956876802",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287484140956876802",
      "url": "https://www.linkedin.com/in/bleamjennifer?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAdS_MgB_9odrFWIpkQ2HIOknAy8Z19gx7E",
      "name": "Jennifer Bleam, Sales Sherpa\nJennifer Bleam, Sales Sherpa",
      "content": "Pineapple. Pizza. And Sales.\n \nThe other night, my family had a \"build your own pizza\" night.\n\nEveryone got exactly what they wanted – extra cheese for one, no mushrooms for another, and some amazing turkey sausage for me.\n\nSales works the same way.\n\nEvery prospect has unique preferences, pain points, and priorities.\n\nYour job is not to push a one-size-fits-all solution.\n\nThat’s like FORCING someone to eat pineapple on their pizza.\nWe all know how that goes.\n\nYour real job? Discover their needs.\n\n(Hence the word discovery...)\n\nThen customize their experience to match what they’re truly looking for.\n\nTake a look at the way you show up in sales conversations.\n\nDo you stick to a “set menu,” pitching the same features and benefits to every prospect?\n\nYAWN.\n\nOr do you ask questions, listen, and deliver EXACTLY what they need?\n\nThink about pizza toppings – NO ONE wants pineapple on their pizza.\n\nUnless, of course, they DO want pineapple.\n\nIn that case, it’s your job to give it to them.\n\nBecause sales isn’t about what YOU think is great.\n\nIt’s about giving your prospect exactly what THEY want.",
      "reactions": {
        "likes": "1",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Love the pizza analogy! 🍕 Tailoring solutions to each prospects unique needs is key. Its all about custom experiences in sales! #SalesStrategy"
    },
    {
      "postId": "urn:li:activity:7287507100681871361",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287507100681871361",
      "url": "https://www.linkedin.com/in/shelleyzalis?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABSaEUBcXvw_xvXzLeFD2NaWWsmRSPBHn8",
      "name": "Shelley Zalis\nShelley Zalis",
      "content": "Do you use AI every day? ‍️\nAccording to the 2025 ETS Human Progress Report: The Female Edition in partnership with The Female Quotient, 59% of women are already gaining AI skills and using it regularly. And this isn’t just important—it’s essential. Here’s why:\n\nArtificial intelligence is not just a tool; it’s the blueprint for the future. AI is shaping how we live, work, and connect, influencing everything from healthcare to education to hiring practices. But here’s the challenge: AI is only as good as the data and perspectives it’s built on. When women are underrepresented in AI development, biases—both hidden and overt—become baked into the algorithms that impact billions of lives.\n\nWomen must be at the forefront of this revolution, leading the charge to ensure AI works for everyone, not just a select few. When women are empowered to shape AI, we ensure that its potential is fully realized—for fairer systems, smarter solutions, and a better future for all.\nLet’s make sure women don’t just use AI, but lead its transformation. An inclusive future depends on it. Read more from the report:",
      "reactions": {
        "likes": "14",
        "comments": "1 comment",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Shelley Zalis, how are you actively contributing to a more inclusive ai landscape? let's inspire change together. ",
          "userName": "Raghuram Sitarram",
          "userProfileURL": "https://www.linkedin.com/in/raghurams",
          "dataId": "urn:li:comment:(activity:7287504434983587840,7287504691385581570)"
        }
      ],
      "commentAdded": "Absolutely agree! Empowering women in AI is key to fostering innovation and ensuring equitable solutions for everyone. Lets champion inclusivity! 🌟"
    },
    {
      "postId": "urn:li:activity:7287484623067009025",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287484623067009025",
      "url": "https://www.linkedin.com/in/manoj-sharma-207434289?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAEYCTycBv454d81ZVBrEYXKSwoPASSDPm2k",
      "name": "Manoj Sharma\nManoj Sharma",
      "content": "I'm excited to share that I 'm starting a new position as campus ambassador at Birla Institute of technology and science , pilani!",
      "reactions": {
        "likes": "2\nPiyush Kumar Mahato and 1 other",
        "comments": "1 comment",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Congrats Manoj! ",
          "userName": "Avdhesh Kumar",
          "userProfileURL": "https://www.linkedin.com/in/avdhesh-kumar-491a8b266",
          "dataId": "urn:li:comment:(ugcPost:7287484622425243648,7287487022334623744)"
        }
      ],
      "commentAdded": "Congratulations on your new role! Excited to see the great impact youll make as a campus ambassador at BITS Pilani! Best of luck! 🚀"
    },
    {
      "postId": "urn:li:activity:7287473122851577856",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287473122851577856",
      "url": "https://www.linkedin.com/in/rickconlowservantleadership?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAPUxFwB6p1p6ESvdwgOkdRMuNdW3KDrJTU",
      "name": "Richard A. Conlow\nRichard A. Conlow",
      "content": "22 HEALTH AND WELL-BEING QUOTES FOR ENCOURAGEMENT:\nhttps://buff.ly/4avlOMP",
      "reactions": {
        "likes": "2",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Absolutely inspiring! These quotes are a great reminder to prioritize our well-being. Thanks for sharing such valuable insights!"
    },
    {
      "postId": "urn:li:activity:7287468003267338240",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287468003267338240",
      "url": "https://www.linkedin.com/groups/35771?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A35771-7287468002042605568",
      "name": "Salesty - a sales community\nSalesty - a sales community",
      "content": "Here is an unpopular opinion….\n\n\nWhen it comes to identifying sales talent, college doesn’t matter.\n\nA lot of thought, deliberation, and vetting went into every hiring decision I’ve made while building several start-up sales teams over my career.\n\nBut one thing I’ve never considered much is where (or if) a candidate went to college, or what they studied.\n\nShow me evidence of grit, curiosity and problem solving and you’ve got my attention.\n\nShow me a fancy degree without examples of overcoming adversity or excelling in some area of your life, and I’m skeptical you’ll be able to handle the rigors of selling in a start-up environment.\n\nI believe you can train someone on your product, competitors, and how to sell, but you’ll never teach them to be driven, goal-oriented, and hungry.\n\nThat comes from within.\n\nHiring for personality traits that can’t be taught has served me well in my career.\n\nHow much do you weigh college credentials when hiring salespeople?",
      "reactions": {
        "likes": "4",
        "comments": "3 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Interesting",
          "userName": "Rosaria Totaro",
          "userProfileURL": "https://www.linkedin.com/in/rosaria-totaro-99677729",
          "dataId": "urn:li:comment:(groupPost:35771-7287468002042605568,7287482554436255745)"
        },
        {
          "commentText": "Adversity either sharpens and hones or breaks. The difference is found in the metal of the person. So it make sense that skills like grit and resilience aren’t tied to a college degree. But I do think that learning to think well and critically is something that has to be taught. Learning how to lean outside of our own intellect and into unknowns without defining those unknowns based on subjective data is important, too. Where do you think those skills are developed? I would have said college but I’ve met a lot of highly educated stagnant people.",
          "userName": "Rebecca Anderson",
          "userProfileURL": "https://www.linkedin.com/in/rebeccaandersonsurveysmallbusinesssupport",
          "dataId": "urn:li:comment:(groupPost:35771-7287468002042605568,7287489615869943808)"
        },
        {
          "commentText": "Rebecca Anderson Excellent points...thanks for sharing!",
          "userName": "Ted McNulty",
          "userProfileURL": "https://www.linkedin.com/in/ted-mcnulty-743635",
          "dataId": "urn:li:comment:(groupPost:35771-7287468002042605568,7287491052280643585)"
        }
      ],
      "commentAdded": "Absolutely agree! Skills and mindset often outweigh degrees, especially in dynamic sales environments. Grit and curiosity are key!"
    },
    {
      "postId": "urn:li:activity:7287506201641205762",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287506201641205762",
      "url": "https://www.linkedin.com/in/snehal-talati-124a38b6?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABi2wawB4AjfxgfGc8CJ2rEDRx2tTqS1Muc",
      "name": "Snehal Talati\nSnehal Talati",
      "content": " \"AI, AI everywhere...\" as Buzz Lightyear might say\n\nRemember 2010 when everyone suddenly became \"Agile\"? Scrum Masters sprouted up like mushrooms after rain, and sticky notes became their own form of currency.\n\nBut here's the reality check we all need: Just like how slapping \"2-week sprints\" on waterfall didn't magically make you agile, adding .predict() to your code doesn't make you an AI engineer.\n\nTrue story: Had a stakeholder recently ask if we could \"just sprinkle some AI\" on their legacy system. Sure, and while we're at it, let's just sprinkle some unicorn dust too! \n\nRemember:\nAgile took years to mature\nDevOps wasn't built in a day\nAnd AI/ML isn't a magic wand\n\nThe fundamentals matter. The math matters. The data matters. And yes, understanding gradient descent matters (even if it sounds like a scary ski slope).\n\nSo before you pivot your entire career to \"AI Solutions Architect,\" maybe take a breath, grab some popcorn, and actually learn the foundations?\n\nAfter all, even Woody had to come to terms with Buzz's arrival... eventually. ",
      "reactions": {
        "likes": "1",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Great analogy! Its so important to focus on the fundamentals before jumping on the latest trends. Solid foundation leads to true innovation! 🌟"
    },
    {
      "postId": "urn:li:activity:7287507102443491331",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287507102443491331",
      "url": "https://www.linkedin.com/in/tom-plumadore-5b26387?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAFW5FYBJxIwXgri8OM4xl7_TYScsxi1w_I",
      "name": "Tom Plumadore\nTom Plumadore",
      "content": "I’m happy to share that I’m starting a new position as Director of Sales at Buildkite! I'm really excited to Join this great team. To all my friends in Software development, reach out to me! Can't wait to tell you more about Buildkite!",
      "reactions": {
        "likes": "69",
        "comments": "34 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Congrats Tom! ",
          "userName": "Shawn Doyle",
          "userProfileURL": "https://www.linkedin.com/in/releaseteam",
          "dataId": "urn:li:comment:(ugcPost:7287475490062237696,7287507088178659328)"
        }
      ],
      "commentAdded": "Congratulations on the new role! Exciting times ahead at Buildkite. Cant wait to hear about your journey and the innovations youll bring! 🎉✨"
    }
  ],
  "errors": [
    {
      "postId": "urn:li:activity:7287372811654877184",
      "url": "https://www.linkedin.com/in/blessing-ikpia-54b790244?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADygsAsBE3EnPxCYA_zzPihIYwYLIfwhOQg",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287482044471721985",
      "url": "https://www.linkedin.com/in/westmcdonaldco?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAEvxMQBQ77AN3_0OXUHuUpKcY6AMaxm8us",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287484140956876802",
      "url": "https://www.linkedin.com/in/bleamjennifer?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAdS_MgB_9odrFWIpkQ2HIOknAy8Z19gx7E",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287507100681871361",
      "url": "https://www.linkedin.com/in/shelleyzalis?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABSaEUBcXvw_xvXzLeFD2NaWWsmRSPBHn8",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287484623067009025",
      "url": "https://www.linkedin.com/in/manoj-sharma-207434289?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAEYCTycBv454d81ZVBrEYXKSwoPASSDPm2k",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287473122851577856",
      "url": "https://www.linkedin.com/in/rickconlowservantleadership?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAPUxFwB6p1p6ESvdwgOkdRMuNdW3KDrJTU",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287468003267338240",
      "url": "https://www.linkedin.com/groups/35771?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A35771-7287468002042605568",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287506201641205762",
      "url": "https://www.linkedin.com/in/snehal-talati-124a38b6?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABi2wawB4AjfxgfGc8CJ2rEDRx2tTqS1Muc",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287507102443491331",
      "url": "https://www.linkedin.com/in/tom-plumadore-5b26387?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAFW5FYBJxIwXgri8OM4xl7_TYScsxi1w_I",
      "errors": [
        "Failed to fetch media URL."
      ]
    }
  ]
}