{
  "posts": [
    {
      "postId": "urn:li:activity:7287520892958515200",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287520892958515200",
      "url": "https://www.linkedin.com/in/robbedell?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABKpecBwzkxsq_MmpHgh6HZGbDwz33MzAE",
      "name": "Rob Bedell\nRob Bedell",
      "content": "I’m happy to share that I’m starting a new position as Fractional VP of Sales at Impact HealthCare!",
      "reactions": {
        "likes": "1",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Congratulations on your new role! Excited to see the impact youll make at Impact HealthCare. Wishing you great success ahead! 🎉"
    },
    {
      "postId": "urn:li:activity:7287471006032506881",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287471006032506881",
      "url": "https://www.linkedin.com/in/nona-prather-b5663010a?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABuAYXIBi7sSvrYjNrRn52Kia7vOCxjVrRM",
      "name": "Nona Prather\nNona Prather",
      "content": "The most successful speakers aren’t just speakers—they’re thought leaders. \n\nThis week, try one of these thought leadership activities:\nWrite a LinkedIn article sharing industry insights.\nHost a live Q&A to connect with your audience.\nCollaborate with another expert for a shared post.\nStart small, but think big.",
      "reactions": {
        "likes": "7",
        "comments": "2 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Sharing your expertise is always a good investment! Love this, Nona Prather.",
          "userName": "Lisa Apolinski",
          "userProfileURL": "https://www.linkedin.com/in/lisaapolinski",
          "dataId": "urn:li:comment:(activity:7287471006032506881,7287478835254644736)"
        },
        {
          "commentText": "It's also an avenue for growth and improvement.",
          "userName": "Abdullah Owolabi",
          "userProfileURL": "https://www.linkedin.com/in/abdullah-owolabi-81553a177",
          "dataId": "urn:li:comment:(activity:7287471006032506881,7287479565189337089)"
        }
      ],
      "commentAdded": "Great tips! Starting small can lead to impactful connections. Excited to see how we can all elevate our thought leadership together!"
    },
    {
      "postId": "urn:li:activity:7287521524650057729",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287521524650057729",
      "url": "https://www.linkedin.com/in/chrisdegasperis?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAACZ9jMB9kXKTRmo9qjmV8-X0PtfFubCMJM",
      "name": "Chris DeGasperis\nChris DeGasperis",
      "content": "Just had an insightful conversation with Dana Dunleavy from Kinnelon Design Creative Studio , where she shared some valuable \nhashtag\n#branding insights!\n\nBranding goes beyond aesthetics—it's the art of storytelling. Crafting the right message for the right audience can be a game changer. Dana excels at translating big-picture ideas into tangible results, emphasizing the power of connection in both staffing and branding strategies.\n\n Who is your target audience?\n How do you engage with them?\n What unique value do you offer?\n\nIt's always a pleasure connecting with creative minds like Dana, sparking ideas for potential collaborations. Exploring synergies between innovative talents like Dana and professionals in thenetwork and myconnections.\n\nIf you have any recent branding or networking tips to share, feel free to join the conversation!",
      "reactions": {
        "likes": "1",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Great insights! Branding truly is about storytelling. Excited to explore more ways we can connect and collaborate in this space! #branding"
    },
    {
      "postId": "urn:li:activity:7287487853712850945",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287487853712850945",
      "url": "https://www.linkedin.com/in/darenlauda?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABIpdgBX6o4UYYx-xo3ObV25PMBwqZmlNM",
      "name": "Daren Lauda\nDaren Lauda",
      "content": "Withdrawing a promised promotion was one of my career's top five worst professional days.\n\nI promised a promotion to someone. “Achieve these metrics, and we will promote you.”\n\nI was in a big role and didn’t hesitate to commit. Unfortunately, I made a commitment I could not keep.\n\nI thought offering the promotion was within my authority, but I was shocked to learn I was wrong. I let one of my team members down in the worst way.\n\nSomething similar happened to me once. I was offered a position with one of the largest software companies in the world.\n\nAn SVP presented the offer verbally, and the offer letter was promised to follow within two business days, so my wife and I celebrated with a nice dinner.\n\nThe offer letter never came. It seems he didn’t have the authority either.\n\nI learned two painful lessons.\n\nThe first is pretty simple: don’t make promises you cannot keep. And when it comes to HR items, dot every i and cross every t before making commitments. Check and double-check.\n\nThe second is that holding a title is different from having authority.\n\nIn large organizations, authority may be explicit and documented. Still, check and double-check.\n\nIn smaller organizations, authority may be fluid, changing based on the business's needs or the founder's opinion. So definitely, check and double-check.",
      "reactions": {
        "likes": "16",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Thank you for sharing your experience! It’s a powerful reminder of the importance of clear communication and understanding authority in the workplace."
    },
    {
      "postId": "urn:li:activity:7287521534217175041",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287521534217175041",
      "url": "https://www.linkedin.com/in/arpitbhayani?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAKPFhYBDWsxnFRk7XmQhjujHkwkpWFiwrc",
      "name": "Arpit Bhayani\nArpit Bhayani",
      "content": "I have some news to share :) Profile[.]fyi is joining forces with Mercor to help a billion people find their next job \n\n2024 was the year I took the leap of faith and ventured out with, to build a social network for people in tech, and the idea evolved into what you see today as Profile.\n\nBuilding an engineering team of 6, thinking of business, making product decisions, and shipping things that matter was quite a task. Listening to customers, understanding market feedback, and operating frugally without any funds was fun.\n\nI keep talking about business >> product >> engineering, and I am so happy that I got to live and breathe that for one year straight; it made me a better and super-practical operator.\n\nI am super happy that I ventured out and even more, to have met and known; seeing him work was a crash course of how seasoned leaders operate.\n\nWhat next for me? I have joined Google and will work on Ads Forecasting as my full-time responsibility. On the side, I will keep building DiceDB - an open-source in-mem database and putting out a ton of\nstuff on my socials and YT channel.\n\nThank you to everyone who supported us in the journey, it truly means a ton. This was the experience of a lifetime and something I would like to do again.\n\nOnce an entrepreneur, always an entrepreneur.",
      "reactions": {
        "likes": "736",
        "comments": "14 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Arpit Bhayani Taking a career leap with you was one of the best things I did. Thoroughly enjoyed the rollercoaster ride with you.\nYou are a diamond in to the tech community. ",
          "userName": "Krishna Kiran",
          "userProfileURL": "https://www.linkedin.com/in/krishnakirang",
          "dataId": "urn:li:comment:(activity:7287451065225035776,7287521530408837120)"
        }
      ],
      "commentAdded": "Congratulations on this exciting new chapter! 🎉 Your journey is truly inspiring — can’t wait to see the impact youll make at Google and with DiceDB!"
    },
    {
      "postId": "urn:li:activity:7287206275841441793",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287206275841441793",
      "url": "https://www.linkedin.com/in/cstone1?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAADUbUBF_tbtwrVRkQpE9YYbjHAB13qiVk",
      "name": "Rich Rosen\nRich Rosen",
      "content": "ALERT:\n\nWe will be kicking off a search shortly for a Director of Account Management:\n\n- The groundwork's done (1,500 clients already trust us) - you're expanding the company's footprint with a very happy client base.\n\n- You've got the perfect background if you've sold Ai/ML/DevOps before - meaning you know exactly what makes technical buyers lean in vs tune out\n\n- There's a new solution the clients are asking for - imagine walking into conversations where they're already raising their hand",
      "reactions": {
        "likes": "25",
        "comments": "2 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "I'm interested",
          "userName": "Christopher J. Tyndorf",
          "userProfileURL": "https://www.linkedin.com/in/christopher-j-tyndorf-7614843b",
          "dataId": "urn:li:comment:(activity:7287206275841441793,7287212774240206849)"
        },
        {
          "commentText": "Great opportunity",
          "userName": "Joe Slezak",
          "userProfileURL": "https://www.linkedin.com/in/joe-slezak-43a1328",
          "dataId": "urn:li:comment:(activity:7287206275841441793,7287213482129739776)"
        }
      ],
      "commentAdded": "Exciting opportunity! A dynamic Director of Account Management could really amplify client relationships and drive growth. Cant wait to see who steps up!"
    },
    {
      "postId": "urn:li:activity:7287498392488869889",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287498392488869889",
      "url": "https://www.linkedin.com/groups/66325?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A66325-7287498391373135877",
      "name": "The Social Media Marketing Group\nThe Social Media Marketing Group",
      "content": "Think LinkedIn is just for profile updates? Think again. 64% of buyers look for and prefer thought leadership content over boring promotional materials. 63% say it shows you understand their challenges.\n\nTranslation: posting great content isn’t optional—it’s table stakes. The same goes for hiring managers, your next investor, or top talent. Whether it’s a sharp take on industry trends or solving real-world problems, your content is your credibility.\n\nSkip the fluff and focus on insights that educate and engage. In a crowded feed, the loudest voice isn’t the winner—the smartest one is. So, what’s your next post going to say about you? I hope this handy-dandy chart helps!",
      "reactions": {
        "likes": "12",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Great reminder! Quality content is key to building credibility. Lets elevate the conversation with insights that truly resonate! 💡"
    },
    {
      "postId": "urn:li:activity:7287447229403975680",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287447229403975680",
      "url": "https://www.linkedin.com/in/kaushi-biddappa?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABReesABc-RcLiip-m--qDrtxPAJLiDPCwU",
      "name": "Kaushi Biddappa 🕉\nKaushi Biddappa 🕉",
      "content": "hashtag\n#driveclaritywithkau  It is apparent meaningful work does make us happier, and there are hundreds of studies showing that job satisfaction and life satisfaction are positively related.\n\nAND there are so many ways to navigate this space.\n\nInterestingly there are three career models\n\n ‘Steady State’ careers are those that are associated with one job over decades, where one doesn’t advance much but increases in expertise. This was much more common in the past than it is today. However, it might be right for you if you really love stability and want a job that allows you to spend your life on things you care a lot about outside work.\n\n 'Transitory Career' here the person jumps around all over the place. From the outside it looks chaotic however, it is the profile of someone who loves trying new things, and a moves around based on non-job criteria such as lifestyle, location or social life.\n\n ‘Spiral’ careers is the last category.  People in this model might make a pretty dramatic career shift every decade or so but there is a method to the madness. They are using their skills and knowledge in one field and applying it to another while getting a variety of experiences for their own fulfilment .\n\nSo you might be asking what is the right path for you?\nIn your heart you probably already know and in general this is the way to know how to proceed along the professional path in your life\n\nDiscern how it make you feel.\n Does this opportunity excite you, frighten you or deaden you?\n\nIf it excites you a lot and frightens you a little, this is a signal to move forward.\nIf it simply frightens you, you need a lot more information.\nIf it deadens you when you imagine doing the new job, the answer is clear : turn it down.\n\nYes, life is so much simpler when you ask the right questions.\n\nThank you Oprah and Arthur C Brooks for the wisdom.\n'Build the Life You Want'.\n\nis\n\nYour advocate for\nin the neighbourhood",
      "reactions": {
        "likes": "29",
        "comments": "7 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "hashtag\n#musings  ",
          "userName": "Kaushi Biddappa 🕉",
          "userProfileURL": "https://www.linkedin.com/in/kaushi-biddappa",
          "dataId": "urn:li:comment:(activity:7287442451240230912,7287443435567960065)"
        },
        {
          "commentText": "Steady careers? A rarity today. People who stay loyal to a company for decades, growing with it, are truly admirable.I once met a customer who had been with her company for 19 years. She loved her work that she worked up until her due date for delivery of her first child, thanks to a supportive family & flexible work culture,her career is her “first child,” evolving alongside her personal milestones.\n\nTransitory careers? labeled as chaotic, but they’re anything but. A talented friend of mine worked with a North American, then a German, and finally a UK-based automotive company. With every move, she adapted swiftly, learned on the job, and became an indispensable team member. Switching jobs frequently requires agility, continuous learning, and the ability to tailor your skills to fit each new role.\n\nMy own journey has been spiral-type, starting in academia and landing in corporate. Though each field was different, I connected the dots and applied lessons learned in one domain to the next. This path taught me adaptability, resilience, and how to turn every career shift into an opportunity for growth.\n\nNo matter the path,steady, transitory, or spiral,the secret is growth, learning, and staying open to new opportunities at every turn.",
          "userName": "Gunabharathi G",
          "userProfileURL": "https://www.linkedin.com/in/gunabharathig",
          "dataId": "urn:li:comment:(activity:7287442451240230912,7287508687705751554)"
        }
      ],
      "commentAdded": "Great insights! Choosing the right career path is crucial. Its all about what truly excites and fulfills us. #DriveClarityWithKau"
    },
    {
      "postId": "urn:li:activity:7287183081625563138",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287183081625563138",
      "url": "https://www.linkedin.com/in/sampepin?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAD-f-KgBuu90XELNrtdOJGoIHd7fYz8FyTg",
      "name": "Sam Pepin\nSam Pepin",
      "content": "️ Teaser Alert for Episode #15 – Noah Healy: Revolutionizing Markets Through Game Theory\n\nGet ready for a groundbreaking conversation on The Meaningful Podcast, where host Sam Pepin dives deep with Noah Healy, founder of CordDisc, to explore how mathematics and game theory are reshaping global economies.\n\n In this episode, you’ll discover:\n\nHow Noah’s innovative model challenges traditional market structures to create fairness and efficiency.\nThe fascinating intersection of game theory, technology, and ethics in modern economic systems.\nInsights into Noah’s legal battle to patent his revolutionary marketplace design.\nPrepare to be inspired by a visionary redefining the future of trade and finance. This is an episode you won’t want to miss!\n\n Stay tuned—full episode dropping soon!",
      "reactions": {
        "likes": "6",
        "comments": "2 comments",
        "shares": "0"
      },
      "mediaUrl": "blob:https://www.linkedin.com/973bd7d6-8b21-4123-863f-a624a902a804",
      "comments": [
        {
          "commentText": "Sam Pepin, this interview promises valuable insights on disruptive market strategies. How can game theory reshape our economy? ",
          "userName": "International Centre for Trade Transparency and Monitoring",
          "userProfileURL": "https://www.linkedin.com/company/international-centre-for-trade-transparency/posts",
          "dataId": "urn:li:comment:(ugcPost:7287183079855554563,7287188437319696384)"
        },
        {
          "commentText": "International Centre for Trade Transparency and Monitoring - Simply tune in on Friday! Noah Healy explains it all.",
          "userName": "Sam Pepin",
          "userProfileURL": "https://www.linkedin.com/in/sampepin",
          "dataId": "urn:li:comment:(ugcPost:7287183079855554563,7287188649413103617)"
        }
      ],
      "commentAdded": "Excited to hear Noahs insights! Game theorys potential to reshape markets is truly fascinating. Cant wait for the episode drop! 🎧✨"
    },
    {
      "postId": "urn:li:activity:7287464024596721665",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287464024596721665",
      "url": "https://www.linkedin.com/in/edwardwooten?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAArLWFEBESWkBtYxrvyof1I8DZjU5kpMnEk",
      "name": "Ed Wooten\nEd Wooten",
      "content": "Greetings from the Texas Hill Country. Until further notice, Texas is closed. I jest, somewhat. Stay warm my friends. And to all of my neighbors up north, I know, I know... :)",
      "reactions": {
        "likes": "13",
        "comments": "12 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Trade ya!",
          "userName": "Bob Lafon",
          "userProfileURL": "https://www.linkedin.com/in/bob-lafon",
          "dataId": "urn:li:comment:(ugcPost:7287464023736885248,7287464799116931072)"
        },
        {
          "commentText": "Bob Lafon Hahaha... Balmy...",
          "userName": "Ed Wooten",
          "userProfileURL": "https://www.linkedin.com/in/edwardwooten",
          "dataId": "urn:li:comment:(ugcPost:7287464023736885248,7287471209577959424)"
        },
        {
          "commentText": "Wow! It's crazy to see snow in that area of TX. I heard the Flordia Pan Handle is also supposed to get a dusting. ATL will be hit or miss. Stay dry and cozy!",
          "userName": "Steve Blanchard",
          "userProfileURL": "https://www.linkedin.com/in/steve-blanchard-8681505",
          "dataId": "urn:li:comment:(ugcPost:7287464023736885248,7287486311735672832)"
        },
        {
          "commentText": "Steve Blanchard A little crazy for sure. Stay warm!",
          "userName": "Ed Wooten",
          "userProfileURL": "https://www.linkedin.com/in/edwardwooten",
          "dataId": "urn:li:comment:(ugcPost:7287464023736885248,7287488909112946688)"
        }
      ],
      "commentAdded": "Sending warm thoughts your way! Enjoy the Hill Country vibes while the rest of us brave the chill up north. Stay cozy! ☀️❄️"
    }
  ],
  "errors": [
    {
      "postId": "urn:li:activity:7287520892958515200",
      "url": "https://www.linkedin.com/in/robbedell?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABKpecBwzkxsq_MmpHgh6HZGbDwz33MzAE",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287471006032506881",
      "url": "https://www.linkedin.com/in/nona-prather-b5663010a?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABuAYXIBi7sSvrYjNrRn52Kia7vOCxjVrRM",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287521524650057729",
      "url": "https://www.linkedin.com/in/chrisdegasperis?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAACZ9jMB9kXKTRmo9qjmV8-X0PtfFubCMJM",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287487853712850945",
      "url": "https://www.linkedin.com/in/darenlauda?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABIpdgBX6o4UYYx-xo3ObV25PMBwqZmlNM",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287521534217175041",
      "url": "https://www.linkedin.com/in/arpitbhayani?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAKPFhYBDWsxnFRk7XmQhjujHkwkpWFiwrc",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287206275841441793",
      "url": "https://www.linkedin.com/in/cstone1?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAADUbUBF_tbtwrVRkQpE9YYbjHAB13qiVk",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287498392488869889",
      "url": "https://www.linkedin.com/groups/66325?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A66325-7287498391373135877",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287447229403975680",
      "url": "https://www.linkedin.com/in/kaushi-biddappa?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABReesABc-RcLiip-m--qDrtxPAJLiDPCwU",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287464024596721665",
      "url": "https://www.linkedin.com/in/edwardwooten?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAArLWFEBESWkBtYxrvyof1I8DZjU5kpMnEk",
      "errors": [
        "Failed to fetch media URL."
      ]
    }
  ]
}