{
  "posts": [
    {
      "postId": "urn:li:activity:7287845774476861441",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287845774476861441",
      "url": "https://www.linkedin.com/in/mrnirmalpatel?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAARIIsIBKWVi_41K99WEFRPehFrO7b-g4zE",
      "name": "Nirmal Patel\nNirmal Patel",
      "content": "President Donald Trump announced the \"Stargate\" initiative, a monumental AI infrastructure project, alongside tech leaders Larry Ellison (Oracle), Masayoshi Son (SoftBank), and Sam Altman (OpenAI). The project will invest $500 billion into AI development in the United States, creating over 100,000 jobs and focusing on building massive data centres and other critical AI infrastructure. Unclear how the project will be funded and by whom but its expected over the next four years.\n\nThe initiative aims to bolster America’s technological leadership and accelerate progress in healthcare, particularly through advancements like cancer detection and personalised vaccines using AI. Trump emphasised energy production and regulatory support to expedite the project. The leaders expressed confidence in the U.S. under Trump’s leadership, calling it the beginning of a \"golden age\" for America",
      "reactions": {
        "likes": "141",
        "comments": "113 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "SoftBank’s Son emphasised the transformative potential of artificial general intelligence (AGI).",
          "userName": "Jason Bramble",
          "userProfileURL": "https://www.linkedin.com/in/jasonbramble-revcarto",
          "dataId": "urn:li:comment:(activity:7287618058079121409,7287845756231647232)"
        }
      ],
      "commentAdded": "Exciting times ahead! The Stargate initiative could redefine AIs role in healthcare and create countless new jobs. Lets embrace this potential!"
    },
    {
      "postId": "urn:li:activity:7287864282300497921",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287864282300497921",
      "url": "https://www.linkedin.com/in/shivnathmazumdar?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAKr1O8BOa4zYwnuyfJO-7qdCMpyE-EJ1Ss",
      "name": "Shivnath Mazumdar\nShivnath Mazumdar",
      "content": "Money is for survival, Purpose is for meaning - do you agree with this Gyan?",
      "reactions": {
        "likes": "2",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Absolutely! While money meets our needs, purpose drives our passion. Finding balance is key for a fulfilling life. 💡✨"
    },
    {
      "postId": "urn:li:activity:7287864137567621121",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287864137567621121",
      "url": "https://www.linkedin.com/in/aeshraghi?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAd0WUBFuMOQmbx0sbf9KIhtPva09tIuDI",
      "name": "Arman Eshraghi\nArman Eshraghi",
      "content": "In our latest \nhashtag\n#SaaSScaled podcast, we’re joined by Mohan Rao, Chief Product & Technology Officer of Knownwell, a pioneering \nhashtag\n#AIaaS platform company. \n\nWe talk about the changing product development process with\nproducts, including how to elicit user feedback when application output is unpredictable.\n\nMohan shares insights into solving the unique challenges of scaling professional services relationships. Finally, we discuss how to overcome the cognitive dissonance of using AI tools.\n\nTune in to hear more about Mohan’s unique insights.\n\n\n\nPlease share your thoughts.",
      "reactions": {
        "likes": "4\nMark Selinger and 3 others",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Excited to tune in! Mohans insights on scaling and navigating AI tools are timely and invaluable for our industry. #SaaS #AIaaS"
    },
    {
      "postId": "urn:li:activity:7287572446604410881",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287572446604410881",
      "url": "https://www.linkedin.com/in/shailkhiyara?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAI0qsBpxphE2KG_1m9XtczLVREYS_DN5U",
      "name": "Shail Khiyara\nShail Khiyara",
      "content": "𝗧𝗵𝗲 𝗜𝗻𝘁𝗲𝗹𝗹𝗶𝗴𝗲𝗻𝘁 𝗔𝗴𝗲: 𝗔 $𝟭𝟳.𝟵 𝗧𝗿𝗶𝗹𝗹𝗶𝗼𝗻 𝗢𝗽𝗽𝗼𝗿𝘁𝘂𝗻𝗶𝘁𝘆—𝗜𝗳 𝗪𝗲 𝗟𝗲𝗮𝗱 𝗕𝗼𝗹𝗱𝗹𝘆\n\nAI’s projected $𝟳.𝟲–𝟭𝟳.𝟵 𝘁𝗿𝗶𝗹𝗹𝗶𝗼𝗻 𝗰𝗼𝗻𝘁𝗿𝗶𝗯𝘂𝘁𝗶𝗼𝗻 𝘁𝗼 𝘁𝗵𝗲 𝗴𝗹𝗼𝗯𝗮𝗹 𝗲𝗰𝗼𝗻𝗼𝗺𝘆 𝗯𝘆 𝟮𝟬𝟯𝟴 and a $𝟲𝟯𝟬 𝗯𝗶𝗹𝗹𝗶𝗼𝗻 𝘀𝗽𝗲𝗻𝗱 𝗯𝘆 𝟮𝟬𝟮𝟴 reveal the staggering scale of this transformation. But here’s the truth: The 𝗳𝘂𝘁𝘂𝗿𝗲 𝘄𝗼𝗻’𝘁 𝗯𝗲 𝗱𝗲𝗳𝗶𝗻𝗲𝗱 𝗯𝘆 𝗔𝗜—𝗶𝘁 𝘄𝗶𝗹𝗹 𝗯𝗲 𝗱𝗲𝗳𝗶𝗻𝗲𝗱 𝗯𝘆 𝗵𝗼𝘄 𝘄𝗲 𝗹𝗲𝗮𝗱 𝗶𝘁.\n\nWe stand at a crossroads:\n\n 𝟯% 𝗼𝗳 𝗴𝗹𝗼𝗯𝗮𝗹 𝗲𝗹𝗲𝗰𝘁𝗿𝗶𝗰𝗶𝘁𝘆 𝗻𝗼𝘄 𝗽𝗼𝘄𝗲𝗿𝘀 𝗱𝗮𝘁𝗮 𝗰𝗲𝗻𝘁𝗲𝗿𝘀. This will increase. Can we ensure AI doesn’t just consume resources but creates energy efficiencies across industries?\n\n As digital borders tighten and data sovereignty rises, will AI be a force for global collaboration or a catalyst for fragmentation?\n\n 𝗔𝗜 𝗮𝗱𝗼𝗽𝘁𝗶𝗼𝗻 𝗽𝗿𝗼𝗺𝗶𝘀𝗲𝘀 𝟭𝟬–𝟲𝟬% 𝗲𝗻𝗲𝗿𝗴𝘆 𝘀𝗮𝘃𝗶𝗻𝗴𝘀, yet are we balancing progress with ethics, sustainability, and inclusivity?\n\nThe Intelligent Age demands bold leadership. As AI adoption accelerates, this 𝟴-𝗿𝗲𝗽𝗼𝗿𝘁 𝘀𝗲𝗿𝗶𝗲𝘀 serves as a strategic guide to navigating the complexities of this era, championing collaboration, ethical governance, and long-term value creation.\n\nIt was developed with leading partners like,,, and theto explore AI's transformative impact across industries, including manufacturing, energy, healthcare, financial services, cybersecurity, media, transport, and more. Each report provides in-depth insights and actionable strategies tailored to these sectors, making it an essential resource for leaders navigating the Intelligent Age.\n\n Dive into thereport:\n\nKudos to,,,\n,,,,,,,,, and teams for this excellent resource.",
      "reactions": {
        "likes": "17",
        "comments": "1 comment",
        "shares": "0"
      },
      "mediaUrl": "blob:https://www.linkedin.com/78ddcfcb-789b-4e57-a240-61becaec1ea6",
      "comments": [
        {
          "commentText": "This is an intriguing look at AI's potential. Balancing energy efficiency, ethical governance, and global collaboration will be key to leading boldly in the Intelligent Age.",
          "userName": "Graham Riley - Generating business opportunities",
          "userProfileURL": "https://www.linkedin.com/in/grahamkeithriley",
          "dataId": "urn:li:comment:(ugcPost:7287572443030855682,7287700804231172096)"
        }
      ],
      "commentAdded": "Exciting insights on navigating the Intelligent Age! Bold leadership will be key in harnessing AI for positive, sustainable impact."
    },
    {
      "postId": "urn:li:activity:7287858954171301888",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287858954171301888",
      "url": "https://www.linkedin.com/in/remingtonrawlings?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABkCHTcB4rFFwOBWcyblqU_AbeuW6G84uYw",
      "name": "Remington Rawlings\nRemington Rawlings",
      "content": "Sometime soon I'll share more details about OneView specific AI use cases that we have pioneered (and why they are must have's for Rev Ops teams today).\n\nOneView's AI GTM guide named Oliver will be launching this quarter.\n\nWe have created purpose built AI for use cases you don't currently have an AI \"hired to do the job for.\"\n\nI'm excited to see where it goes.\n\nFor now, a little education on AI.\n\nKnowing your tools and using them properly is half the battle.\n\nPlacing AI up into a few buckets, based on \"the jobs\" they do, you can remember these by the \"personification labels\" I gave them.\n\n‍ \"the creator\" >>> Generative AI\n\n \"the detective\" >>> Natural Language Processing\n\n‍ \"the scientist\" >>> Machine Learning\n\n \"the robot\" >>> Autonomous AI\n\n‍ \"the manager\" >>> Agentic AI\n\nLooking at their applications, and thinking about them like this helps us ask two important questions.\n\n[a] What \"jobs\" do we need AI to do for us?\n\n[b] What \"category\" of AI is best suited for the job?\n\n1. Generative AI - \"the creator\" AI\n generate text\n‍ generate code\n generate audio\n generate images\n generate video (emerging)\n generate designs\n generate game content\n\nGen AI creates new content and responses based on prompts or instructions, transforming existing patterns into new forms.\n\n2. Natural Language Processing - \"the detective\" AI\n finds meaning and patterns in text\n discerns sentiment\n classifies and organizes based on training\n️ understands speech\n extracts information\n identifies relationships\n translates languages\n\nNLP takes inputs and processes them for understanding, acting as the bridge between human language and machine comprehension.\n\n3. Machine Learning - \"the scientist\" AI\n predictions about the future\n recommendations\n‍ handles any type of data (not just text)\n finds patterns in complex datasets\n learns from probability\n improves with experience\n tests hypotheses\n\nML takes data and uses either supervised or unsupervised learning to produce pattern recognition beyond NLP capabilities, predictions, and recommendations through iterative improvement.\n\n4. Autonomous systems - \"the robot\" AI\n interacts with the physical world\n️ requires deep safety measures\n⌛️ must be real time\n processes sensor data\n makes independent decisions\n adapts to environment\n️ handles unexpected situations\n collaborates with humans\n\nAutonomous systems interact with the physical world tot go beyond simple IoT devices to include self-driving vehicles, industrial robots, and adaptive control systems.\n\n5. Agentic AI - \"the manager\" AI (Adding this as a fifth category)\n sets and pursues goals\n creates action plans\n monitors progress\n adapts strategies\n initiates interactions\n learns from experience\n understands context\n coordinates multiple tasks\n\nAgentic AI acts as an independent operator, taking initiative and managing complex tasks while adapting to change.",
      "reactions": {
        "likes": "0",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Exciting insights on AI applications! Looking forward to the OneView AI GTM guide launch and exploring these innovative use cases for Rev Ops."
    },
    {
      "postId": "urn:li:activity:7287811401790681089",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287811401790681089",
      "url": "https://www.linkedin.com/in/miodrag-o-markovic?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAWyHnEB842NovxmdKytP1VkWHSdhtYXPR8",
      "name": "Miodrag O. Markovic\nMiodrag O. Markovic",
      "content": "The question isn’t if blockchain will shape these industries, it’s how and when.\n\nIt's only a matter of time before we see well-known companies making the shift and integrating blockchain into their business models.\n\nBig names like Nike, Lacoste, Spotify, Lufthansa, Dior, Gucci, and more are already on board.\n\nThis proves there’s no escaping the Web3 era, no matter how many doubts we got.\n\nI knew from the start that Web3 had big potential, and I am happy because I have dedicated my time to bringing it to the travel industry.\n\nMy tip from a builder in this space is that if you’re looking to build in this space, know that real impact and change come from those who are willing to go beyond just adopting trends or adding new tools.\n\nThe key is to create something meaningful, something that not only fits the moment but stands the test of time.\n\nAnd if you’re working on something bold in the Web3 space, let’s connect. My DMs are always open to bold innovators.\n\nTo wrap it up, I’m genuinely excited about the opportunities blockchain is unlocking, and as the travel industry continues to evolve, I’m proud to be part of this change.",
      "reactions": {
        "likes": "3",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Absolutely agree! Embracing meaningful innovation in Web3 is crucial for lasting impact. Excited to see how blockchain transforms industries! 🚀"
    },
    {
      "postId": "urn:li:activity:7287839565569040385",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287839565569040385",
      "url": "https://www.linkedin.com/in/manzoornazar?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAB2CwrQBa5jzinty-ElMgJiSyyA_JCgec3Q",
      "name": "Manzoor Nazar\nManzoor Nazar",
      "content": "Excited to Announce! \n\nI’ll be representing Ateam Soft Solutions at Arab Health 2025 from 27th to 30th January in Dubai.\n\nAt Ateam, we specialize in delivering custom healthcare solutions for hospitals and clinics, including:\n Healthcare Management Systems Built for Your Workflow\n Complete IP Ownership with No Data Risk\n AI Agents to convert website visitors into a doctor's appointment\n AI agent who can chat with patients and converse any information on health\n\nWhen off-the-shelf solutions fall short, we create custom Hospital Information Systems (HIS) tailored to your unique workflows and requirements, helping you enhance patient care and operational efficiency.\n\nOther Solutions, I ll be giving demo at the event\n\n Distributer Management system for Medical device manufacturers\n\nLet’s connect and explore how we can empower healthcare innovation together!\n\n Reach out at +91 79029 43226\n\nWe are also seeking partner\n\nLooking forward to meeting healthcare professionals and innovators to discuss how technology can shape the future of healthcare.",
      "reactions": {
        "likes": "6\nAbhinand V Nair and 5 others",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Exciting times ahead! Looking forward to seeing Ateam Soft Solutions at Arab Health 2025 and exploring innovative healthcare solutions together!"
    },
    {
      "postId": "urn:li:activity:7284599488843825153",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7284599488843825153",
      "url": "https://www.linkedin.com/in/westmcdonaldco?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAEvxMQBQ77AN3_0OXUHuUpKcY6AMaxm8us",
      "name": "West McDonald\nWest McDonald",
      "content": "Frank Cucco introducing the next generation leadership team at Impact Networking, LLC at \nhashtag\n#ECS25. Michael Lepper , ASHLEY CARNES and Anthony Cucco. \"The pursuit to $500 million.\"",
      "reactions": {
        "likes": "20",
        "comments": "2 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Very impressive team !",
          "userName": "Strings D. E. Kozisek",
          "userProfileURL": "https://www.linkedin.com/in/strings-tekumo",
          "dataId": "urn:li:comment:(ugcPost:7284599487916916736,7287151220312416256)"
        },
        {
          "commentText": "huh",
          "userName": "Greg_ Walters🚀☄️",
          "userProfileURL": "https://www.linkedin.com/in/gregwalters",
          "dataId": "urn:li:comment:(ugcPost:7284599487916916736,7284615950639792129)"
        }
      ],
      "commentAdded": "Exciting times ahead for Impact Networking! Thrilled to see such talented leaders driving the vision towards $500 million! #ECS25"
    },
    {
      "postId": "urn:li:activity:7287857451058515968",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287857451058515968",
      "url": "https://www.linkedin.com/in/podolski?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAmnHsBzAzwD9km7B-hDfzveBYRBJxy0CI",
      "name": "Stan Podolski\nStan Podolski",
      "content": "The IoT management platform market surpassing $1 billion in 2024 shows how rapidly IoT is scaling.\n\nTherefore, the need for advanced platforms to manage connected devices has never been greater. But growth brings complexity. Thus, platforms must focus on security, scalability, and real-time insights to meet enterprise needs.\n\nAs IoT continues to expand, management platforms will be the backbone, enabling businesses to unlock the full potential of their connected ecosystems.",
      "reactions": {
        "likes": "0",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Exciting times ahead for the IoT landscape! Strong management platforms are crucial for navigating the complexities of this rapid growth. 🚀"
    },
    {
      "postId": "urn:li:activity:7287864704276828162",
      "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287864704276828162",
      "url": "https://www.linkedin.com/in/anillamba?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABJkEUBL2pKbLitOQ7Exr5p3BZEGa7aTZw",
      "name": "Dr. Anil Lamba, CISSP\nDr. Anil Lamba, CISSP",
      "content": "Protection against cyber attacks requires a multi-layered approach that combines technical defenses, user awareness, and proactive monitoring. One of the foundational steps is implementing firewalls and intrusion detection systems (IDS) to filter malicious traffic and monitor for suspicious activity. Additionally, encryption should be used to protect sensitive data, both at rest and in transit, ensuring that even if data is intercepted, it remains unreadable to attackers. Regular software updates and patching are crucial to fixing vulnerabilities that could be exploited in an attack.\n\nAnother key aspect is user education—training employees on recognizing phishing scams, using strong passwords, and following best practices can reduce the risk of social engineering attacks. Multi-factor authentication (MFA) adds an extra layer of security by requiring users to provide additional verification, making it more difficult for attackers to gain unauthorized access. Moreover, organizations should implement backup strategies to ensure critical data can be restored in the event of a ransomware attack or data breach. Finally, continuous monitoring of networks and systems can help detect and respond to potential threats in real time, minimizing the impact of an attack. By integrating these measures, individuals and organizations can significantly reduce their exposure to cyber threats and strengthen their overall security posture.\n\n Stay connected for industry’s latest content – Follow",
      "reactions": {
        "likes": "1",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [],
      "commentAdded": "Great insights! A multi-layered defense is crucial in today’s cyber landscape. User education and proactive measures are key to resilience! 🔒"
    }
  ],
  "errors": [
    {
      "postId": "urn:li:activity:7287845774476861441",
      "url": "https://www.linkedin.com/in/mrnirmalpatel?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAARIIsIBKWVi_41K99WEFRPehFrO7b-g4zE",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287864282300497921",
      "url": "https://www.linkedin.com/in/shivnathmazumdar?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAKr1O8BOa4zYwnuyfJO-7qdCMpyE-EJ1Ss",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287864137567621121",
      "url": "https://www.linkedin.com/in/aeshraghi?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAd0WUBFuMOQmbx0sbf9KIhtPva09tIuDI",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287858954171301888",
      "url": "https://www.linkedin.com/in/remingtonrawlings?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABkCHTcB4rFFwOBWcyblqU_AbeuW6G84uYw",
      "errors": [
        "Failed to fetch reactions.",
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287811401790681089",
      "url": "https://www.linkedin.com/in/miodrag-o-markovic?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAWyHnEB842NovxmdKytP1VkWHSdhtYXPR8",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287839565569040385",
      "url": "https://www.linkedin.com/in/manzoornazar?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAB2CwrQBa5jzinty-ElMgJiSyyA_JCgec3Q",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7284599488843825153",
      "url": "https://www.linkedin.com/in/westmcdonaldco?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAEvxMQBQ77AN3_0OXUHuUpKcY6AMaxm8us",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287857451058515968",
      "url": "https://www.linkedin.com/in/podolski?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAmnHsBzAzwD9km7B-hDfzveBYRBJxy0CI",
      "errors": [
        "Failed to fetch reactions.",
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7287864704276828162",
      "url": "https://www.linkedin.com/in/anillamba?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABJkEUBL2pKbLitOQ7Exr5p3BZEGa7aTZw",
      "errors": [
        "Failed to fetch media URL."
      ]
    }
  ]
}