[
  {
    "postsData": [
      {
        "postId": "urn:li:activity:7294141529462345729",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294141529462345729",
        "url": "https://www.linkedin.com/in/forsterbill?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAAe8ABJY9T3zJ2hU7Rml-sQlxvj-h7S6k",
        "name": "Bill Forster\nBill Forster",
        "content": "looking for a Keynote Speaker?",
        "reactions": {
          "likes": "0",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Exciting opportunity! A captivating keynote speaker can truly elevate an event. Looking forward to seeing who you choose!"
      },
      {
        "postId": "urn:li:activity:7293969327161012224",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293969327161012224",
        "url": "https://www.linkedin.com/in/anilnarainmatai?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAA4BACUB8t4KlC9ystRlIBsgPWrftqjPzZw",
        "name": "Anil Narain अनिल नारायण Matai मटई\nAnil Narain अनिल नारायण Matai मटई",
        "content": "𝗪𝗵𝗮𝘁 𝗶𝘀 𝘁𝗵𝗲 𝗺𝗲𝗮𝗻𝗶𝗻𝗴 𝗼𝗳 \"𝗲𝘃𝗶𝗹\" 𝗶𝗳 𝘁𝗵𝗲𝗿𝗲 𝗶𝘀 𝗻𝗼 𝗰𝗼𝗻𝗰𝗲𝗽𝘁 𝗼𝗳 𝗴𝗼𝗼𝗱 𝗮𝗻𝗱 𝗯𝗮𝗱? \n\nIn a world without the rigid concepts of good and bad, \"evil\" can be understood not as an absolute force, but as a relative experience. Spiritual teachings suggest that dualities like good and evil exist because of our limited perception—our attachment to duality is a reflection of the mind’s inability to grasp the wholeness of existence. From a higher perspective, everything is a manifestation of the divine, a part of the unfolding cosmic dance.\n\nEvil, in this context, becomes a construct of the ego—a reflection of ignorance and separation. It is not the opposite of good, but rather a distortion of the self’s alignment with the divine truth. The soul, in its purity, transcends such labels. The real “evil” lies in the disconnect from one’s true nature, which leads to suffering and ignorance.\n\nIn spiritual terms, \"evil\" is merely a misalignment, a temporary state of imbalance in the flow of divine consciousness. The path of awakening, then, is about transcending dualities and realizing the unity in all things. Thus, in the absence of good and bad, “evil” simply dissolves into the oneness of existence.",
        "reactions": {
          "likes": "31",
          "comments": "20 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "anca mitin Thank you for amplifying the message and extending its reach! ",
            "userName": "Anil Narain अनिल नारायण Matai मटई",
            "userProfileURL": "https://www.linkedin.com/in/anilnarainmatai",
            "dataId": "urn:li:comment:(activity:7293969327161012224,7294171318323732480)"
          },
          {
            "commentText": "Excellent definition. I remember my first contact with native peoples of this continent. They were what is known as the “Uwipi” way- the way of the spirits without the Christian influence of “good and evil”, everything presented as a learning experience. They have a way referred to as hamblaceya, going out into the wilderness with prayer ties, humbling yourself before the spirits, fasting from food & water for four days, so that the spirits and “yourself” know that you are sincere in your seeking. Very humbling experience- suggested one does four years representing each season. It was with the introduction of Christianity that good and evil were born with the understanding. Before that it was just “the way of the spirits”. ",
            "userName": "Greg White",
            "userProfileURL": "https://www.linkedin.com/in/greg-white-3438ba232",
            "dataId": "urn:li:comment:(activity:7293969327161012224,7294012399076986882)"
          },
          {
            "commentText": "Greg White Greg, what a powerful reflection!  The Uwipi way beautifully echoes the essence of non-duality—seeing every experience as a lesson rather than a battle between good and evil. The practice of hamblaceya sounds incredibly transformative, a true surrender to the elements and the self. It's fascinating how indigenous wisdom aligns with ancient teachings, reminding us that the journey is about connection and inner truth, beyond imposed dualities.\nThank you for sharing this profound experience. ",
            "userName": "Anil Narain अनिल नारायण Matai मटई",
            "userProfileURL": "https://www.linkedin.com/in/anilnarainmatai",
            "dataId": "urn:li:comment:(activity:7293969327161012224,7294172022970970114)"
          }
        ],
        "commentAdded": "This perspective invites profound reflection on our understanding of morality. Embracing unity can reshape our approach to conflicts and differences."
      },
      {
        "postId": "urn:li:activity:7294149564029161473",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294149564029161473",
        "url": "https://www.linkedin.com/in/clifflocks?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABjEhQBSI0l3aMI-cMP2Vg13uOKrWUxYVE",
        "name": "Cliff K. Locks\nCliff K. Locks",
        "content": "Chasing luxury cars and bigger homes doesn't guarantee happiness. Investing in what truly matters is more fulfilling. I lived modestly for years and realized that genuine joy comes from meaningful investments, not material possessions. Understanding and embracing this mindset is crucial for true fulfillment. \n\n\nYour repost might be exactly what someone needs today. Appreciate your support!",
        "reactions": {
          "likes": "1",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/b996131d-c045-49ad-a23a-fec0a468cc12",
        "comments": [],
        "commentAdded": "Well said! True fulfillment lies in meaningful experiences, not material gains. Your journey inspires us all to focus on what truly matters!"
      },
      {
        "postId": "urn:li:activity:7294069683962396673",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294069683962396673",
        "url": "https://www.linkedin.com/in/manish-kumar-49ba3b2a2?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAEkf1_cB5wQVR0nG7zXrC3IDLKGUOJqdAHg",
        "name": "Manish Kumar\nManish Kumar",
        "content": "GFG 160 Days Coding Challenge\n\nDay 71: Solved \"Detect Loop in linked list\" on GeeksforGeeks",
        "reactions": {
          "likes": "2\nAyush Kaushal and 1 other",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Great job on Day 71! Detecting loops in linked lists is crucial for efficient algorithm design. Keep up the fantastic work! 🚀 #CodingChallenge"
      },
      {
        "postId": "urn:li:activity:7294094827879600128",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294094827879600128",
        "url": "https://www.linkedin.com/in/vidhi-talwar-064581262?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAECDKwwBVq5Ol2P_DAQFLs_qCFe1Bnr2Qow",
        "name": "Vidhi Talwar\nVidhi Talwar",
        "content": "Just got into E-Cell, MNNIT Allahabad Networking Team, aka the squad that makes things happen!\n\nWe’re the ones sliding into DMs (professionally, of course), reaching out to top speakers, and building connections that turn ideas into reality. If you’ve got a story to share or wisdom to drop, we’re listening.",
        "reactions": {
          "likes": "7\nRachit Gupta and 6 others",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Congrats Vidhi! ",
            "userName": "Daksh Katta",
            "userProfileURL": "https://www.linkedin.com/in/daksh-katta-b03552312",
            "dataId": "urn:li:comment:(ugcPost:7294094827225288704,7294153603605295104)"
          }
        ],
        "commentAdded": "Exciting times ahead! 🎉 Thrilled to see the Networking Team making impactful connections. Lets turn those ideas into amazing opportunities! 🚀"
      },
      {
        "postId": "urn:li:activity:7294046159273132033",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294046159273132033",
        "url": "https://www.linkedin.com/in/premprakashrimcollian?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACwixtkBGVNMIdErvCjjjjcWN9wstNYLQAQ",
        "name": "Prem Prakash\nPrem Prakash",
        "content": "Learning Beyond Textbooks!\n\nTeachers ought to empower themselves in areas other than their own subjects. Towards this end we had an insightful session on Financial Literacy by Shikha Yadav a banking and soft skills plus image management professional.\n\nSuch learning sessions are useful in ways more than one. Apart from more awareness on matters of finance and investment it was good opportunity for teachers to interact amongst themselves as also with the resource person. Such relaxed platforms also help teachers to unwind and add value to themselves. Our monthly learning sessions for teachers have been very useful.\n\nAre we ready to empower ourselves?",
        "reactions": {
          "likes": "24\nBalavignesh Sampathkumar and 23 others",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Had an amazing time interacting with our educators \nThank you Prem Prakash sir for the opportunity",
            "userName": "Shikha Yadav",
            "userProfileURL": "https://www.linkedin.com/in/shikha-yadav-5a324b60",
            "dataId": "urn:li:comment:(ugcPost:7294043138648653824,7294045291287076865)"
          }
        ],
        "commentAdded": "Empowering ourselves through diverse learning is key! Great initiative by Shikha Yadav to enhance financial literacy among educators! 💡📚"
      },
      {
        "postId": "urn:li:activity:7293741547722878976",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293741547722878976",
        "url": "https://www.linkedin.com/in/houseofbricks?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAA-MkMBNOorFGtIDG0boxkwxMypXZhfUgk",
        "name": "Michael Kainatsky\nMichael Kainatsky",
        "content": "There's something really strange about trust. \n\n\nMikael Gorbachev famously said \"Доверяй но проверяй\" which means trust but verify.\n\nBut how often do we verify, then trust?\n\nEvery time I get on a plane, my life is in the hands of complete strangers and my thoughts are usually\n\n- is it properly maintained?\n- is the pilot good, rested, sane?\n- did security do its job?\n- will they have those cookies I like?\n\nDo we require any evidence of any of those things prior to boarding?\n\nNever!\n\nWe blindly trust that the system is going to work as it should.\n\nWhy do we trust so much more when the stakes are higher than anything we can imagine?\n\nWhy when it's something like a restaurant, a coach, a car, a Linkedin service, anything that's trivial by comparison\n\nwe do hours of research before we can commit to it?\n\nI dont want to answer this question, instead, tell me what you all think?\n\nHappy Friday, let's start a discussion\n\nYours truthfully,",
        "reactions": {
          "likes": "50\nTim Hillison and 49 others",
          "comments": "86 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "When we fly, we choose a company with a brand name. Our expectations can change - is there an incident on the plane, are the bathrooms smelly, did they lose my luggage.... There are barriers to entry, so the concentration of players and regulation, so that in and of itself contributes to trust. But some of the small things don't. This is where IRL and WOM are so important, Michael Kainatsky. Just my 2 cents.",
            "userName": "Tim Hillison",
            "userProfileURL": "https://www.linkedin.com/in/timhillison",
            "dataId": "urn:li:comment:(activity:7293614819738279936,7293688676386054145)"
          },
          {
            "commentText": "you're not wrong there, I agree.",
            "userName": "Michael Kainatsky",
            "userProfileURL": "https://www.linkedin.com/in/houseofbricks",
            "dataId": "urn:li:comment:(activity:7293614819738279936,7293787986448535552)"
          },
          {
            "commentText": "It's faith walk .. every thing we do we belief and trust it will work. Why write a post if you don't have faith and trust that your IHP will read it. That is my two sense.. Happy Friday captain Michael, fasten your seat belts , get ready for push back I am your copilot .. where we flying to today captain Michael Kainatsky ?",
            "userName": "Curtis Luke, DBA, MPA",
            "userProfileURL": "https://www.linkedin.com/in/curtis-luke-dba-mpa-hireme",
            "dataId": "urn:li:comment:(activity:7293614819738279936,7293652156228792321)"
          },
          {
            "commentText": "elaborate on that? BBB?",
            "userName": "Michael Kainatsky",
            "userProfileURL": "https://www.linkedin.com/in/houseofbricks",
            "dataId": "urn:li:comment:(activity:7293614819738279936,7294001276344827904)"
          },
          {
            "commentText": "Michael Kainatsky brick by brick",
            "userName": "Curtis Luke, DBA, MPA",
            "userProfileURL": "https://www.linkedin.com/in/curtis-luke-dba-mpa-hireme",
            "dataId": "urn:li:comment:(activity:7293614819738279936,7294026970063929345)"
          }
        ],
        "commentAdded": "This is a thought-provoking reflection! It’s fascinating how context shapes our trust levels. Would love to hear more insights from others!"
      },
      {
        "postId": "urn:li:activity:7294165155209187328",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294165155209187328",
        "url": "https://www.linkedin.com/in/anilnarainmatai?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAA4BACUB8t4KlC9ystRlIBsgPWrftqjPzZw",
        "name": "Anil Narain अनिल नारायण Matai मटई\nAnil Narain अनिल नारायण Matai मटई",
        "content": "Bhakti is the soul’s journey from earthly life to eternal love. Rupa Goswami reveals Bhakti as the simplest, yet highest path—accessible to all. It’s not about rituals but about surrender, love, and divine connection. Embrace Bhakti through daily devotion, selfless acts, and heartfelt prayers, transforming every moment into a step toward the Divine. \n\n,\n,\n,\n,\n,\n,\n,\n,\n,\n,\n, #,\n,\n,\n,",
        "reactions": {
          "likes": "2",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Beautifully written, Anil Narain अनिल नारायण Matai मटई ! Your insights into Bhakti as a path to transcendence are truly inspiring. Thank you for sharing such a profound perspective on spiritual devotion.",
            "userName": "Kalpa Sandaruwan ( Κάλπα Σανταρουάν )",
            "userProfileURL": "https://www.linkedin.com/in/kalpa-sandaruwan",
            "dataId": "urn:li:comment:(ugcPost:7294165154508767233,7294167438277922816)"
          }
        ],
        "commentAdded": "Beautifully expressed! Embracing Bhakti truly transforms our daily lives into a journey of love and connection with the Divine. 🌟🙏 #Devotion"
      },
      {
        "postId": "urn:li:activity:7293839403674742784",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293839403674742784",
        "url": "https://www.linkedin.com/company/coforge-tech/posts",
        "name": "Coforge\nCoforge",
        "content": "As part of our flagship initiative, Inclusion Begins with I, we had the privilege of hosting Nivedita Saxena, India’s first Trauma-Informed Coach, in a thought-provoking conversation with Richa Sethi, VP & Head of Capability Development and DEI at Coforge.\n\nNivedita shared deep insights on healing from emotional trauma, the power of self-awareness and self-compassion, and why embracing the healing journey is key to inclusive leadership.\n\nWith 19 years of experience in HR, L&D, and OD, she specializes in leadership development for mid- and senior-level professionals, alongside trauma-informed coaching. A cancer survivor, Nivedita draws from her own transformative journey to help others shed past traumas and build a life that thrives—free from the weight of pain.",
        "reactions": {
          "likes": "67",
          "comments": "2 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Coforge Richa Sethi , Thank you for inviting me. It was indeed a meaningful conversation with you. May we all continue to evolve in our lives.",
            "userName": "Nivedita Saxena",
            "userProfileURL": "https://www.linkedin.com/in/nivedita-saxena-b608a916",
            "dataId": "urn:li:comment:(ugcPost:7293839402445742080,7293846963123326978)"
          },
          {
            "commentText": "More power and strength to you ",
            "userName": "Shweta Mohapatra",
            "userProfileURL": "https://www.linkedin.com/in/shweta-mohapatra-71137134",
            "dataId": "urn:li:comment:(ugcPost:7293839402445742080,7293869655079759872)"
          }
        ],
        "commentAdded": "Thank you for sharing these invaluable insights, Nivedita! Embracing self-awareness is a true game-changer in leadership. #Inclusion #Leadership"
      },
      {
        "postId": "urn:li:activity:7294082579526283265",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294082579526283265",
        "url": "https://www.linkedin.com/in/billcarmody?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAG6y8BH6IFUbF2RNOJmtaKix3lRhxZv6c",
        "name": "Bill Carmody, PCC\nBill Carmody, PCC",
        "content": "In Episode 7, I'm happy to share my wife, Elena, is planning on joining Violet and me for part of our World Tour (17% of it. About 9 weeks). In this recording she talks about how living out of a suitcase for a full year isn't attractive to her. She wants to see us, but would like to visit in smaller chunks.\n\nIt makes sense. She enjoys her life here in Port Washington, New York. Her parents (92 & 91) are just 5 minutes away in Plandome. Will, our 20 year old, is still in college. There are many reasons to say and I fully appreciate that.\n\nThis is her perspective in her own words. This is the same woman I wrote, \"The Three Rules of Marriage\" with and we published it in 2020 to celebrate our 20th wedding anniversary.\n\nShoot, that reminds me, Valentines Day is THIS FRIDAY! Yes, it's aholiday, and also a GREAT excuse to tell my wife how much I love her. I'm off to go get a card and something special she loves from-- their dark chocolate sea salt caramels. Woo Hoo!",
        "reactions": {
          "likes": "14",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "What a beautiful way to blend family and adventure! Wishing you all a fantastic tour and a special Valentines Day celebration! 🌍❤️🍫"
      }
    ],
    "errors": [
      {
        "postId": "urn:li:activity:7294141529462345729",
        "url": "https://www.linkedin.com/in/forsterbill?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAAe8ABJY9T3zJ2hU7Rml-sQlxvj-h7S6k",
        "errors": [
          "Failed to fetch reactions.",
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293969327161012224",
        "url": "https://www.linkedin.com/in/anilnarainmatai?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAA4BACUB8t4KlC9ystRlIBsgPWrftqjPzZw",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294069683962396673",
        "url": "https://www.linkedin.com/in/manish-kumar-49ba3b2a2?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAEkf1_cB5wQVR0nG7zXrC3IDLKGUOJqdAHg",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294094827879600128",
        "url": "https://www.linkedin.com/in/vidhi-talwar-064581262?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAECDKwwBVq5Ol2P_DAQFLs_qCFe1Bnr2Qow",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294046159273132033",
        "url": "https://www.linkedin.com/in/premprakashrimcollian?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACwixtkBGVNMIdErvCjjjjcWN9wstNYLQAQ",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293741547722878976",
        "url": "https://www.linkedin.com/in/houseofbricks?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAA-MkMBNOorFGtIDG0boxkwxMypXZhfUgk",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294165155209187328",
        "url": "https://www.linkedin.com/in/anilnarainmatai?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAA4BACUB8t4KlC9ystRlIBsgPWrftqjPzZw",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293839403674742784",
        "url": "https://www.linkedin.com/company/coforge-tech/posts",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294082579526283265",
        "url": "https://www.linkedin.com/in/billcarmody?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAG6y8BH6IFUbF2RNOJmtaKix3lRhxZv6c",
        "errors": [
          "Failed to fetch media URL."
        ]
      }
    ]
  },
  {
    "postsData": [
      {
        "postId": "urn:li:activity:7293790116936855553",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293790116936855553",
        "url": "https://www.linkedin.com/in/nbstagge?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAATnuucByGwl32yGUrVxrwutwtfYfM6bNqk",
        "name": "nick stagge 💭\nnick stagge 💭",
        "content": "Winning is fun. If you want to win call Robert Clark at rudiment.\nSeriously. Do it right now.\n\nFor reals: this dude is a machine.\nHe's built an outbound sales team & strategy that blow me away.\n\nAnd here's the thing - he's not just bringing in a lot of leads (which he's doing), but they are the kind of leads you dream of dropping into your pipeline. He's fast, communicative, and absolutely crushing our expectations.\n\nNot to mention, he's just plain fun to be around.\nMaybe cause all this cat does is win.",
        "reactions": {
          "likes": "21",
          "comments": "7 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Apparently everyone is calling him now. I tried but got voice mail… but voice mall was full so… hope to see you around town Robert Clark",
            "userName": "Chris Dayton",
            "userProfileURL": "https://www.linkedin.com/in/chrisd8n",
            "dataId": "urn:li:comment:(activity:7293790116936855553,7294031314750427136)"
          },
          {
            "commentText": "Robert Clark done!",
            "userName": "Chris Dayton",
            "userProfileURL": "https://www.linkedin.com/in/chrisd8n",
            "dataId": "urn:li:comment:(activity:7293790116936855553,7294057295561244673)"
          },
          {
            "commentText": "nick stagge  Thanks for the shoutout dude. Love working with you and the team.  ",
            "userName": "Robert Clark",
            "userProfileURL": "https://www.linkedin.com/in/robert-clark-737b14134",
            "dataId": "urn:li:comment:(activity:7293790116936855553,7293792920543891456)"
          }
        ],
        "commentAdded": "Absolutely agree! Roberts energy and expertise are game-changers. If you want results, he’s the one to call! 🚀 #WinningTeam"
      },
      {
        "postId": "urn:li:activity:7294028078081527808",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294028078081527808",
        "url": "https://www.linkedin.com/in/aubreyking?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAEt4dsBKzeTKcMg_N8_6-U6Z4yTARB1n1E",
        "name": "Aubrey King\nAubrey King",
        "content": "This Friday, on \nhashtag\n#AIFriday, I was joined by Lori MacVittie, Byron M., Peter Scheffler and all the way from Saturday in \nhashtag\n#Australia, Shaineel (Shain) Singh! \n\nMake sure to catch all of the referenced content right here!\n",
        "reactions": {
          "likes": "6\nChuck Herrin, CISSP, CCSP, NACD.DC and 5 others",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/1f45d317-6157-462f-89c7-ee305ac79079",
        "comments": [],
        "commentAdded": "Excited to see the insights from this stellar lineup! Cant wait to dive into the discussions. #AIFriday #Networking"
      },
      {
        "postId": "urn:li:activity:7293959313625165824",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293959313625165824",
        "url": "https://www.linkedin.com/in/fatouseckmathon?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAxfJcYBSB-F5b09lE8bsqkWqeW9b85L4P0",
        "name": "Fatou Seck Mathon\nFatou Seck Mathon",
        "content": "You will never feel 100% ready.\n\nThat's the hard truth you need to accept.\n\nYour mind will always find a reason to wait:\n\n \"I need more experience.\"\n \"Maybe I should wait for the right time.\"\n \"What if I fail?\"\n\nThe perfect moment will never come. Stop waiting and do this instead:\n\n1. Shift your mindset.\n Pay attention to your self-talk and replace doubt with encouragement.\n Speak to yourself the way you would support a friend.\n\n2. Take imperfect action.\n Small, consistent steps lead to big results.\n Clarity comes from doing, not overthinking.\n\n3. Use what you already know.\n Write down 3 wins that prove you're capable.\n Build on your existing skills.\n\n4. Set clear deadlines.\n Replace \"later\" with a specific date and time.\n Hold yourself accountable with reminders and check-ins.\n\n5. Protect your focus.\n Identify what's stealing your time and energy.\n Set boundaries to keep distractions away.\n\nThe most successful people don't have all the answers.\n\nThey take action before they feel ready.\n\nYou can, too. Start today.\n\nWhat's one thing you'll take action on right now?\n\nRepost to help someone get started.\nFollowfor more.",
        "reactions": {
          "likes": "342",
          "comments": "111 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "This is a powerful reminder! Waiting for the 'perfect moment' is the biggest trap. As an SEO expert and digital marketing consultant, I’ve seen so many businesses delay action because they feel unprepared. The truth? Progress comes from starting, learning, and improving along the way. Taking imperfect action is the real game-changer!",
            "userName": "Mayowa Alakija",
            "userProfileURL": "https://www.linkedin.com/in/mayowa-alakija-6aa53115a",
            "dataId": "urn:li:comment:(activity:7293958429176397824,7293971366498680832)"
          }
        ],
        "commentAdded": "Love this! Taking that first step is often the hardest, but it leads to growth. Lets embrace imperfection and start today! 💪✨ #ActionMatters"
      },
      {
        "postId": "urn:li:activity:7294172822061412352",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294172822061412352",
        "url": "https://www.linkedin.com/in/mcindoe?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAACDWsB98YVpDEub2WRyO7SkQXJcREfcDQ",
        "name": "Bruce McIndoe\nBruce McIndoe",
        "content": "Was a special honor to be recognized by the World Trade Center Institute at \nhashtag\n#BoweFest 2025 as a \nhashtag\n#HometownHero over the last 10 years supporting and presenting sessions for the Bowe Fellowship program. \n\nA special shout-out and congratulations to all the award winners! Your achievements and contributions to the Bowe Fellowship community are truly inspiring. The night was a really great event by, CEO (Pictured Below) and the WTCI team!\n\n Lifetime Achievement Award:&(Pictured Below)\n Best Performer Award:\n All-Time Favorite Award:\n Hall of Fame Award:&\n Best New Artist:\n Hometown Heroes: Jim Doub (Miles & Stockbridge),,, and",
        "reactions": {
          "likes": "9",
          "comments": "2 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Bruce, your dedication, passion, expertise, and work ethic are truly inspiring to many of us. Congratulations, and thank you!",
            "userName": "Sergey Hayrapetyan",
            "userProfileURL": "https://www.linkedin.com/in/sergeyhay",
            "dataId": "urn:li:comment:(ugcPost:7294172820773744640,7294175763170291713)"
          },
          {
            "commentText": "Sergey Hayrapetyan thanks my friend and was truly a surprise. Was great to see you on the stage was well for all you contribute in engagement, passion, talent and a natural ability to bring people together. Well deserved!",
            "userName": "Bruce McIndoe",
            "userProfileURL": "https://www.linkedin.com/in/mcindoe",
            "dataId": "urn:li:comment:(ugcPost:7294172820773744640,7294178275872915456)"
          }
        ],
        "commentAdded": "Congratulations on this well-deserved honor! Your dedication to the Bowe Fellowship program is truly inspiring. Cheers to all the award winners! 🎉"
      },
      {
        "postId": "urn:li:activity:7293909084817309696",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293909084817309696",
        "url": "https://www.linkedin.com/in/sam-g-winsbury?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADUesLsBF2Sayws_sUAoAw9eSbNlmLBpqY0",
        "name": "Sam G. Winsbury\nSam G. Winsbury",
        "content": "I can tolerate challenges.\nI can tolerate mistakes. \nI can tolerate losses. \n\nI can’t tolerate giving up before giving \n\nRule no.1 for life:\n\nNever let effort be the reason you lose.\n\n️ Repost this to remind someone they’re closer than they think\n\nps. What are you currently working on?",
        "reactions": {
          "likes": "161\nBlessing Ikpia and 160 others",
          "comments": "76 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "The journey won't always be smooth Sam G. Winsbury\n\nBut giving up shouldn't even be an option",
            "userName": "Blessing Ikpia",
            "userProfileURL": "https://www.linkedin.com/in/blessing-ikpia-54b790244",
            "dataId": "urn:li:comment:(activity:7293905151289876480,7293909079574372352)"
          }
        ],
        "commentAdded": "Great perspective! Resilience is key to success. Im currently working on a new project that pushes my limits. What about you?"
      },
      {
        "postId": "urn:li:activity:7294006039165771777",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294006039165771777",
        "url": "https://www.linkedin.com/in/jordanmurphx?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAkimWoBp1GB34jqUgAycD0PoDz7bIPsc2U",
        "name": "Jordan Murphy 🧠🦍\nJordan Murphy 🧠🦍",
        "content": "Marvel went bankrupt in 1996.\n\nToday, they’re a $200B empire.\n\n↓\n\nIn '96, Marvel was drowning in debt, facing extinction:\n\n1. Comic sales collapsed\n2. Their stock—freefalling\n3. Bankruptcy loomed\n\nThen they made ONE desperate move that transformed them into a $200B entertainment empire...\n\nHere's the incredible story:\n\n↓\n\nThe mid-90s were brutal for Marvel:\n\nComic book sales were plummeting. Their expansion into trading cards and stickers backfired.\n\nWith mounting losses + crushing debt, they faced two choices...\n\n→ Sell their heroes for quick cash\n→ Find a new way to survive\n\n↓\n\nDecember 27, 1996: Marvel files for bankruptcy.\n\nBut in this crisis, they discovered something crucial:\n\n→ They weren't just a comic book company\n\nThey owned 7,000+ characters—one of the most valuable IP libraries in entertainment history.\n\n↓\n\nIt clicked for Marvel's leadership:\n\nMovies could reach millions—comics couldn't.\n\nRather than sell their characters outright, they developed a brilliant strategy:\n\n• License some characters to studios\n• Keep key heroes for future projects\n• Learn the movie business\n\n↓\n\nThey started by licensing Spider-Man to Sony and X-Men to Fox.\n\nThis was genius:\n\nThey could generate rev + learn from established studios—without risking their capital.\n\nBut they held onto lesser-known characters like Iron Man and Thor.\n\nEveryone thought they were crazy.\n\n↓\n\nThe licensing deals gave Marvel something precious:\n\n• Steady revenue\n• Movie-making experience\n• Proof their characters could succeed on screen\n\nWhen Spider-Man (2002) became a massive hit, it validated their entire strategy.\n\n↓\n\nWith growing confidence, Marvel made their boldest move:\n\nCreating Marvel Studios to produce their own films.\n\nThe goal?\nBuild an interconnected universe of stories.\n\nStudios called it impossible.\nInvestors were skeptical.\n\nThen came 2008...\n\n↓\n\nIron Man releases in theaters.\n\nA \"B-list\" hero most people didn't know becomes a global phenom.\n\nMarvel proved something powerful:\nGreat storytelling could turn ANY character into a star.\n\nDisney was watching.\n\n↓\n\n2009: Disney acquires Marvel for $4.3 billion.\n\nCritics called it overpriced.\nThey were wrong...\n\nThe Marvel Cinematic Universe has since:\n\n→ Broken box office records\n→ Revolutionized storytelling\n→ Created a new movie model\n→ Transformed entertainment\n\n↓\n\nThe irony?\n\nMarvel built their empire largely without their most famous characters—Spider-Man and X-Men.\n\nThey turned \"2nd-tier\" heroes into global icons.\n\nThis reveals something crucial about business:\n\n↓\n\nYour greatest asset isn't always obvious.\nMarvel thought they were in comics.\n\nTruth?\nThey were master storytellers.\n\nThe medium wasn't their strength.\nTheir ability to create compelling narratives was.\n\n↓\n\nKey Lessons:\n\n1. Crisis forces innovation\n2. Build systems, not just products\n3. Think beyond your current market\n4. Your \"weakness\" might be your edge\n5. Sometimes the best assets aren't the obvious ones\n\n↓\n\nWhich (1-5) hits for you? \nHit the Repost ️",
        "reactions": {
          "likes": "432\nAditya Baranwal and 431 others",
          "comments": "209 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/7404b266-f706-4e61-b586-56435117e2a2",
        "comments": [
          {
            "commentText": "Marvel didn’t just survive—they reinvented themselves. Adaptation is everything.",
            "userName": "Cassie Lincoln",
            "userProfileURL": "https://www.linkedin.com/in/cassielincolnalm",
            "dataId": "urn:li:comment:(ugcPost:7293953690598621185,7293996428509515776)"
          }
        ],
        "commentAdded": "Incredible transformation! 🌟 Your point on crisis driving innovation really resonates—such a powerful reminder to leverage our hidden strengths! 💪✨"
      },
      {
        "postId": "urn:li:activity:7294054455321272321",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294054455321272321",
        "url": "https://www.linkedin.com/in/markfriedler?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAIS14Bnk-hBd9lEfb-HT0YBRHV4ZTTKM4",
        "name": "Mark Friedler\nMark Friedler",
        "content": "Heading to \nhashtag\n#IFA Vegas annual event Monday-Wed. The biggest \nhashtag\n#franchise event. \nWe help multi-location businesses improve their technology, save time and money. Come see us at the \nhashtag\n#Turtlehut booth #1129 or DM if you want to meet up. Jim Mitte",
        "reactions": {
          "likes": "3",
          "comments": "3 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "I am in town. Ill be at some of the fashion related events this week. ",
            "userName": "Darryll DiPietro",
            "userProfileURL": "https://www.linkedin.com/in/darryll-dipietro",
            "dataId": "urn:li:comment:(activity:7294054455321272321,7294123272835608576)"
          },
          {
            "commentText": "Safe travels and have a great time ",
            "userName": "John Lengyel",
            "userProfileURL": "https://www.linkedin.com/in/johnlengyel-comcastbusiness",
            "dataId": "urn:li:comment:(activity:7294054455321272321,7294077791921152000)"
          }
        ],
        "commentAdded": "Excited for #IFA Vegas! Looking forward to seeing how Turtlehut can transform multi-location businesses. Let’s connect! 🚀"
      },
      {
        "postId": "urn:li:activity:7293818331101380608",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293818331101380608",
        "url": "https://www.linkedin.com/company/kpmgindia/posts",
        "name": "KPMG India\nKPMG India",
        "content": "We're thrilled to associate as  𝐊𝐧𝐨𝐰𝐥𝐞𝐝𝐠𝐞 𝐏𝐚𝐫𝐭𝐧𝐞𝐫  for \nhashtag\n#Reimagine2025 - the second edition of CDSL - Central Depository Services India Ltd's Annual Symposium! Stay tuned for insights.\n\n February 8, 2025\n\n|",
        "reactions": {
          "likes": "31",
          "comments": "3 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Interesting event",
            "userName": "Susilganth R",
            "userProfileURL": "https://www.linkedin.com/in/susilganth-r",
            "dataId": "urn:li:comment:(activity:7293818331101380608,7293831221527109632)"
          },
          {
            "commentText": "Great opportunity",
            "userName": "Salamma M",
            "userProfileURL": "https://www.linkedin.com/in/prahelika-m-168918339",
            "dataId": "urn:li:comment:(activity:7293818331101380608,7293831736117874688)"
          }
        ],
        "commentAdded": "Exciting news! Looking forward to gaining insights at #Reimagine2025. Proud to be a Knowledge Partner with CDSL! 🚀"
      },
      {
        "postId": "urn:li:activity:7293938445280755712",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293938445280755712",
        "url": "https://www.linkedin.com/in/rachelparkco?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAa1ojgB6thaDElEllbhupHwYhc6Wgk0cao",
        "name": "Rachel Park\nRachel Park",
        "content": "Burnout is stealing your success.\n6 warning signs you can’t ignore.\n\nExhausted, productivity slipping, motivation fading.\n\nBurnout isn’t just exhaustion.\nIt’s draining your energy and limiting your potential.\n\n6 signs to break the cycle and take back control.\n\n1. Success hides exhaustion until burnout hits.\n→ High achievers often miss their own warning signs\n→ Begin tracking energy levels, not just results\n\n2. Toughness turns into denial of limits.\n→ Being \"tough\" masks early warning signs\n→ Create weekly check-ins with yourself\n\n3. Excellence locks you in unsustainable cycles.\n→ High output becomes your new normal\n→ Measure recovery time, not just performance\n\n4. Work achievements consume your identity.\n→ Your work becomes your whole identity\n→ List three non-work wins every day\n\n5. Competence disguises exhaustion.\n→ Everyone thinks you're fine because you deliver\n→ Share struggles with trusted allies\n\n6. High standards become energy-draining handcuffs.\n→ Your reputation for quality becomes a prison\n→ Define \"good enough\" criteria before starting\n\n\nBurnout isn't a badge of honour.\n\nIt's a signal your success is costing too much.\n\nWhat’s one signal you’re ready to listen to this week?\nShare below \n\n\n If you enjoyed this content, you might like my newsletter here:\n\n\n__\n\n️ Repost to help someone spot the signs of burnout.\n Follow mefor more posts on career & wellbeing.",
        "reactions": {
          "likes": "133",
          "comments": "107 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/ac15e128-da84-4830-9543-e14cee3acb81",
        "comments": [
          {
            "commentText": "We need to pay attention to the signs before it costs us our energy and ambition. Rachel Park",
            "userName": "Damesha Craig, Leadership Coach and Startup Advisor",
            "userProfileURL": "https://www.linkedin.com/in/dameshacraig",
            "dataId": "urn:li:comment:(ugcPost:7293935033633886210,7293938414985322497)"
          },
          {
            "commentText": "Yes, Damesha. Protecting our energy keeps us moving forward. ",
            "userName": "Rachel Park",
            "userProfileURL": "https://www.linkedin.com/in/rachelparkco",
            "dataId": "urn:li:comment:(ugcPost:7293935033633886210,7293938920575180800)"
          }
        ],
        "commentAdded": "Great insights! Recognizing these signs is crucial for maintaining our well-being. Let’s prioritize our health alongside our success! 💪✨"
      },
      {
        "postId": "urn:li:activity:7293109046725787651",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293109046725787651",
        "url": "https://www.linkedin.com/in/forsterbill?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAAe8ABJY9T3zJ2hU7Rml-sQlxvj-h7S6k",
        "name": "Bill Forster\nBill Forster",
        "content": "Andrew Mobarak is \nhashtag\n#hiring. Know anyone who might be interested?",
        "reactions": {
          "likes": "2",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Exciting opportunity, Andrew! Ill be sure to reach out to my network and see if anyone is a great fit. Best of luck with the search! #jobsearch"
      }
    ],
    "errors": [
      {
        "postId": "urn:li:activity:7293790116936855553",
        "url": "https://www.linkedin.com/in/nbstagge?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAATnuucByGwl32yGUrVxrwutwtfYfM6bNqk",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293959313625165824",
        "url": "https://www.linkedin.com/in/fatouseckmathon?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAxfJcYBSB-F5b09lE8bsqkWqeW9b85L4P0",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294172822061412352",
        "url": "https://www.linkedin.com/in/mcindoe?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAACDWsB98YVpDEub2WRyO7SkQXJcREfcDQ",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293909084817309696",
        "url": "https://www.linkedin.com/in/sam-g-winsbury?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADUesLsBF2Sayws_sUAoAw9eSbNlmLBpqY0",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294054455321272321",
        "url": "https://www.linkedin.com/in/markfriedler?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAIS14Bnk-hBd9lEfb-HT0YBRHV4ZTTKM4",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293818331101380608",
        "url": "https://www.linkedin.com/company/kpmgindia/posts",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293109046725787651",
        "url": "https://www.linkedin.com/in/forsterbill?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAAe8ABJY9T3zJ2hU7Rml-sQlxvj-h7S6k",
        "errors": [
          "Failed to fetch media URL."
        ]
      }
    ]
  },
  {
    "postsData": [
      {
        "postId": "urn:li:activity:7294011466741866496",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294011466741866496",
        "url": "https://www.linkedin.com/groups/762547?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A762547-7294011465802371072",
        "name": "Big Data 🟥 Data Science | Machine Learning | Deep Learning | Artificial Intelligence\nBig Data 🟥 Data Science | Machine Learning | Deep Learning | Artificial Intelligence",
        "content": "Machine Learning Engineering - https://lnkd.in/gRR3Qs5\nLook for \"Read and Download Links\" section to download. Follow/Connect me if you like this post.\nhashtag",
        "reactions": {
          "likes": "19",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Excited to dive into this Machine Learning Engineering resource! Thanks for sharing! 🌟 #MachineLearning #Engineering"
      },
      {
        "postId": "urn:li:activity:7294100743853101056",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294100743853101056",
        "url": "https://www.linkedin.com/in/clifflocks?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABjEhQBSI0l3aMI-cMP2Vg13uOKrWUxYVE",
        "name": "Cliff K. Locks\nCliff K. Locks",
        "content": "Success isn't about luxury but the freedom from financial worry. Focus on what truly matters—family, happiness, and relationships. Prioritizing freedom over material possessions is key to achieving true wealth.  \nhashtag\n#FinancialFreedom \nhashtag\n#Wealth \nhashtag\n\n\nYour repost might be exactly what someone needs today. Appreciate your support!",
        "reactions": {
          "likes": "1",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/f964b62f-70b4-4bf1-acd8-77c4a49804d0",
        "comments": [],
        "commentAdded": "Absolutely! True wealth is found in the freedom to enjoy lifes moments, not just in material gains. Well said! #FinancialFreedom #Wealth"
      },
      {
        "postId": "urn:li:activity:7293745996407128065",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293745996407128065",
        "url": "https://www.linkedin.com/in/dieterwolf?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABsFh-8B6C7Xleh7DoXRkF9r0IfCKIovw6o",
        "name": "Dieter Wolf 🖥️\nDieter Wolf 🖥️",
        "content": "If you're a small to medium size business in southwest Oklahoma, choosing the right IT solution for your business can be overwhelming. On one hand, you want a platform that boosts productivity. On the other, security remains a top concern. What are you to do?",
        "reactions": {
          "likes": "2",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Great insights! Finding the perfect balance between productivity and security is crucial. What solutions have you found effective in your experience?"
      },
      {
        "postId": "urn:li:activity:7294177353562284034",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294177353562284034",
        "url": "https://www.linkedin.com/in/ismaelfournier?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAC6LXbYB5Y4pzZdFkpDuenkvUWOGXp0zkHo",
        "name": "Ismaël Fournier\nIsmaël Fournier",
        "content": "Harsh truth: Nobody cares about your product.\n\nIt hurts, but it’s true...\n\nNobody cares about your product or service.\n\nPeople don’t buy products, they buy solutions to their problems.\n\nThey buy vehicles that can take them from point A to point B.\n\nYour fancy features? Cool, but how do they make someone’s life easier, better, or more profitable?\n\nHere’s how to fix your pitch:\n\n- Stop talking about \"AI automation\". Start talking about how it saves time.\n- Forget \"groundbreaking technology.\" Highlight how it increases ROI.\n- Skip the specs. Show the transformation.\n\nBecause customers don’t care about what your product is.\n\nThey care about what it can do.\n\nWhat’s the ONE big problem your product solves?\n\nLet us know in the comment section below.",
        "reactions": {
          "likes": "4\nFlavio D. Strianese and 3 others",
          "comments": "2 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "There's nothing harsh about it. It's just reality ",
            "userName": "Eniola Balogun",
            "userProfileURL": "https://www.linkedin.com/in/eniola-balogun-857934219",
            "dataId": "urn:li:comment:(activity:7294169368848977920,7294174860698640384)"
          }
        ],
        "commentAdded": "Absolutely true! Its all about the value your solution brings. Focusing on real-world impacts can truly resonate with potential customers."
      },
      {
        "postId": "urn:li:activity:7294003974985105408",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294003974985105408",
        "url": "https://www.linkedin.com/in/rkatta?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAMhQkBFRCeGlwCZgZ40hqE7tnhjxGUJfc",
        "name": "Ravi Katta\nRavi Katta",
        "content": "4 Practices of a True Leader \n\n(how to build trust and leave a legacy)\n\nA true leader isn't someone who just takes orders and gets things done.\n\nIt's someone willing to challenge the system when it’s wrong—even if it means risking their own career.\n\nHere’s how you can step up and become a true leader:\n\n1️⃣ Lead with integrity even when it comes at a cost.\n2️⃣ Advocate for your team’s needs even if it’s uncomfortable.\n3️⃣ Challenge the status quo when it doesn’t serve the greater good.\n4️⃣ Put people first, knowing your legacy isn’t built on tasks, but on lives impacted.\n\nThe result?\nYour team will go to bat for you, because they know you've gone to bat for them.\nYou will be remembered not just as a manager but as a leader who made a difference.\nYou’ll cultivate a culture of loyalty and transparency, which is invaluable in the long term.\n\n Have you ever had to stand up for your team? How did it go? Let’s talk about it in the comments.\n\nTake the FREE Legacy Wealth Masterclass to learn the foundations of real estate investing:\n\n\nJoin the next Legacy Wealth Accelerator +Mastermind cohort:\n\n️ Share to inspire others.\n Followfor more insights.",
        "reactions": {
          "likes": "427\nCassie Lincoln and 426 others",
          "comments": "181 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/b1af51ff-0198-426f-9175-e9906b6282fd",
        "comments": [
          {
            "commentText": "Leadership isn’t about authority—it’s about courage. The best leaders challenge, advocate, and put people first.",
            "userName": "Cassie Lincoln",
            "userProfileURL": "https://www.linkedin.com/in/cassielincolnalm",
            "dataId": "urn:li:comment:(ugcPost:7293998482061725696,7294083225142890497)"
          }
        ],
        "commentAdded": "Great insights on true leadership! Standing up for our teams builds trust and creates lasting impact. Looking forward to hearing others stories!"
      },
      {
        "postId": "urn:li:activity:7294143157401710592",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294143157401710592",
        "url": "https://www.linkedin.com/in/anthonywentzel?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADZN2sBr5ZUAlKZK2QwVQvOE9B6pnFHXt8",
        "name": "Anthony Wentzel\nAnthony Wentzel",
        "content": "An MVP isn't just a stepping stone.\n\nIt's a catalyst for progress and \nhashtag\n#innovation.",
        "reactions": {
          "likes": "0",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Absolutely! An MVP is essential for driving innovation and refining ideas into impactful solutions. Excited to see where this leads! #innovation"
      },
      {
        "postId": "urn:li:activity:7294116879021817857",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294116879021817857",
        "url": "https://www.linkedin.com/in/maththinking?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAD5LcBBZCNJ3T89euZhuJxAmL1RWcykg4",
        "name": "Ju Rao\nJu Rao",
        "content": "After 30 years of code, Java remains an enterprise cornerstone",
        "reactions": {
          "likes": "13",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Absolutely! Java’s durability and versatility truly set it apart in the enterprise landscape. Excited to see what the next 30 years bring!"
      },
      {
        "postId": "urn:li:activity:7293800407212961793",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293800407212961793",
        "url": "https://www.linkedin.com/in/askmarknewsome?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAZXKygBvFeaWnGW8MXe_IVMb-RMPbcBXw8",
        "name": "Mark Newsome\nMark Newsome",
        "content": "What exactly can 1st ballad hall of famer Derek Jeter, (Jeets for short.) Possibly teach you and I about how to look at major long term success!)\n\n\nFor the the record. The image with this particular post. (Is not of Derek Jeter. )\n\nIt's just a photo of someone playing baseball, okay?\n\nBut for those of you who may or may not already be familiar. With former New York Yankee, all time great Derek Jeter.\n\nHe played Short Stop his entire career. And played only for the Yankees his entire major league baseball career as well!\n\nHe has since retired. And been inducted into the American Baseball Hall of Fame! On the very 1st ballot.\n\n-However, please be mindful of of some of his career stats.\n\n-First, Jeets had 260 total career homeruns. He's not even in the top ten all time. For the Yankees. For that particular stat!\n\n-And he's not even close! With regards to all of major league baseball!\n\n-He also had an impressive 3,465 total career hits.\n\n-Which to date. Makes him the Yankees all time player. With the most combined hits! In the history of the entire storied franchise! (You go cat!)\n\n-Think about that for just a moment. (More total hits than former Yankee legends.\n\n-Like Babe Ruth, Mickey Mantle, Don Mattingly or slugger Reggie Jackson etc!\n\n-Next please take notice of his career hitting average .310. (For his entire 20 year big league career!\n\n-But let's interpret that outrageously impressive stat from another perspective, shall we? \n\n-For ease of math. Let's say he's a career 300% hitter.\n\n-This means on average. For every ten at bats. Derek, (or any other 300% hitter.)\n\n-Will get at least 3 hits, correct? Or 300 hits out of every 1,000 plate appearances.\n\nIf on average he's successful 30% of the time.\n\n-He's also wrong 70% of the time! (Meaning on average. Seven times out of ten. He's wrong or unsuccessful, correct? )\n\n-Yet he still wound up in Major League Baseball's (MLB,s) prestigious \"Hall Of Fame!\" (Did he not?)\n\n-Which he rightfully deserves to be!\n\n-So what's a few key takeaways here? Just a couple.\n\n-First, you and I definitely don't have to be perfect, in order to be extremely successful/great! Would you not agree?\n\n-Second, Jeets had a career total of 3,465 total hits. ( And only 260 of them were homeruns!)\n\nSo you and I don't have to totally crush it. To be considered great!\n\n-Meaning you don't have to constantly try and close the 7 & 8 figure transactions in a single or first try! \n\nSo my 64,000 dollar question to you. My fellow profit seeking entrepreneurs.\n\nIs simply this. Are you finally psychologically ready to add a little \"Derek Jeter\", incremental, bite sized like success.\n\nTo your overall long term to plan. For major success!\n\nPlease share your main key takeaways in the comments below!",
        "reactions": {
          "likes": "8\nEric Giguere and 7 others",
          "comments": "9 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "What a great story, that touches me deeply. I started playing ball when I was 6 yrs old and I've loved the game ever since. Therefore... I know how hard it is to hit ,310!!! Sure there is talent as a foundation, but what the story doesn't tell is that for every ball they hit in a game, these guys probably hit 50 in practice... the rigour, the discipline, the resilience is simply amazing! Thanks for sharing!",
            "userName": "Eric Giguere",
            "userProfileURL": "https://www.linkedin.com/in/egiguere",
            "dataId": "urn:li:comment:(activity:7293766955306532864,7293801301551837184)"
          },
          {
            "commentText": "Eric Giguere Spot on Eric! So you had a love for that not so easy to play sport! And you're right! The average person. Literally has no idea! How much pre -work they go through. To be able to average 3 hits out of every ten at bats! The same with sport! Including golf!",
            "userName": "Mark Newsome",
            "userProfileURL": "https://www.linkedin.com/in/askmarknewsome",
            "dataId": "urn:li:comment:(activity:7293766955306532864,7293840242413867008)"
          },
          {
            "commentText": "When you put it in that perspective it changes how you look at your business \"successes\". I had one of my early mentors tell me nobody is successful 100% of the time, you don't have to be successful even 75%, or even 60% to become rich. You only need to be successful 51% of the time and you are still winning. He used the stock market as an example. Think about that. Great post Mark.",
            "userName": "John D. Allen, The Business Building Specialist",
            "userProfileURL": "https://www.linkedin.com/in/johndallensmallbizcoaching",
            "dataId": "urn:li:comment:(activity:7293766955306532864,7293963137676947457)"
          },
          {
            "commentText": "John D. Allen, The Business Building Specialist That is so true John! Especially in regards to the long term ups and downs of the stock market! The totally unaware and stone newbies to investing in the market. Unfortunately place far too much emphasis on the dips or so called crashes! Not realizing , provided you or someone knows what they're doing! both the dips and major crashes are key bargain buying opportunities, right? ",
            "userName": "Mark Newsome",
            "userProfileURL": "https://www.linkedin.com/in/askmarknewsome",
            "dataId": "urn:li:comment:(activity:7293766955306532864,7294001051492356096)"
          }
        ],
        "commentAdded": "Great insights! Jeters journey reminds us that consistency and resilience pave the way for long-term success. Lets embrace those incremental wins!"
      },
      {
        "postId": "urn:li:activity:7294181296296116225",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294181296296116225",
        "url": "https://www.linkedin.com/in/mayer-schwartz?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABHPsCgBGX4ZtqZuX4I6nn_19GJB3gJl4es",
        "name": "Mayer Schwartz\nMayer Schwartz",
        "content": "A new week brings new & better opportunities  \n\n\n\nReach out to arecruiter to\ntoday and experience the Swift difference.\n\n\nJoin the thousands of people who get the list of the community's top career opportunities that are posted only once weekly on Sundays on our group. See the group link in the comments \n\n\nMake sure to follow the hashtag\nto stay updated with all of our recruiters' job posts.\n\n-------------------------------------------------------------------\n\nFollow our page Swift Staffing Group to stay updated with all top career opportunities and see our weekly business/career tips posted on Tuesdays.",
        "reactions": {
          "likes": "2\nMayer Schwartz and 1 other",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Join the group to stay updated with the community's top career opportunities, *only posted once weekly in Sundays*\n\nhttps://chat.whatsapp.com/DCTgwkX1WhBD6xSFJqsF9j",
            "userName": "Mayer Schwartz",
            "userProfileURL": "https://www.linkedin.com/in/mayer-schwartz",
            "dataId": "urn:li:comment:(activity:7294181296296116225,7294181347718283264)"
          }
        ],
        "commentAdded": "Exciting times ahead! 🚀 Dont miss out on amazing opportunities—join our group and follow us for valuable career insights every week! #SwiftStaffingGroup"
      },
      {
        "postId": "urn:li:activity:7293978832603131904",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293978832603131904",
        "url": "https://www.linkedin.com/in/jondavidleslie?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABu-s4B50TpraNCLboiGWes3m1D2rP1sHk",
        "name": "Jon Leslie 🔵\nJon Leslie 🔵",
        "content": null,
        "reactions": {
          "likes": "12",
          "comments": "39 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": " Please comment. For me it’s all about the conversation. I don’t post and ghost  \n\n… usually ",
            "userName": "Jon Leslie 🔵",
            "userProfileURL": "https://www.linkedin.com/in/jondavidleslie",
            "dataId": "urn:li:comment:(ugcPost:7293978831969738753,7293979540932968448)"
          },
          {
            "commentText": "And what level of engagement? Only ‘Like’ or reply to everyone?",
            "userName": "Jon Leslie 🔵",
            "userProfileURL": "https://www.linkedin.com/in/jondavidleslie",
            "dataId": "urn:li:comment:(ugcPost:7293978831969738753,7293982690381344769)"
          },
          {
            "commentText": "Catherine Stagg-Macey Same! I try very hard to continue the conversation but sometimes there isn’t much to continue. I still appreciate the comment because it unlocks a new audience but the “insightful, thanks” “you’re welcome” volley feels a little silly after awhile.",
            "userName": "Karen Sergeant",
            "userProfileURL": "https://www.linkedin.com/in/karensergeant",
            "dataId": "urn:li:comment:(ugcPost:7293978831969738753,7293998540882616321)"
          }
        ]
      }
    ],
    "errors": [
      {
        "postId": "urn:li:activity:7294011466741866496",
        "url": "https://www.linkedin.com/groups/762547?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A762547-7294011465802371072",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293745996407128065",
        "url": "https://www.linkedin.com/in/dieterwolf?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABsFh-8B6C7Xleh7DoXRkF9r0IfCKIovw6o",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294177353562284034",
        "url": "https://www.linkedin.com/in/ismaelfournier?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAC6LXbYB5Y4pzZdFkpDuenkvUWOGXp0zkHo",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294143157401710592",
        "url": "https://www.linkedin.com/in/anthonywentzel?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADZN2sBr5ZUAlKZK2QwVQvOE9B6pnFHXt8",
        "errors": [
          "Failed to fetch reactions.",
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294116879021817857",
        "url": "https://www.linkedin.com/in/maththinking?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAD5LcBBZCNJ3T89euZhuJxAmL1RWcykg4",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293800407212961793",
        "url": "https://www.linkedin.com/in/askmarknewsome?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAZXKygBvFeaWnGW8MXe_IVMb-RMPbcBXw8",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294181296296116225",
        "url": "https://www.linkedin.com/in/mayer-schwartz?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABHPsCgBGX4ZtqZuX4I6nn_19GJB3gJl4es",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293978832603131904",
        "url": "https://www.linkedin.com/in/jondavidleslie?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABu-s4B50TpraNCLboiGWes3m1D2rP1sHk",
        "errors": [
          "Failed to fetch content.",
          "Failed to fetch media URL."
        ]
      }
    ]
  },
  {
    "postsData": [
      {
        "postId": "urn:li:activity:7294022376621543425",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294022376621543425",
        "url": "https://www.linkedin.com/in/oliwia-paw%C5%82owska-972412220?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADeXE-YBTNE7Pcb_TX3U0XnPbZ_WKm17-f8",
        "name": "Oliwia Pawłowska\nOliwia Pawłowska",
        "content": "Good day lovely people ️‍\n\nHappy Social Saturday \n\nLet’s bring love and positivity into this networking event and connect together ️️️\n\nHappy valentines \n\n️describe portfolio \n introduce yourself\n️‍ enhance skill set\n connect with people\n️find the best job offer\n\nLet’s connect and rise ️️️\n\nLove you ",
        "reactions": {
          "likes": "73\nsteven kamensky and 72 others",
          "comments": "100 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "*** Please, kindly repost this post for better reach to more connections ️️ ***",
            "userName": "Oliwia Pawłowska",
            "userProfileURL": "https://www.linkedin.com/in/oliwia-paw%C5%82owska-972412220",
            "dataId": "urn:li:comment:(activity:7293951311455133696,7293951382087229440)"
          },
          {
            "commentText": "#letsconnect",
            "userName": "Oliwia Pawłowska",
            "userProfileURL": "https://www.linkedin.com/in/oliwia-paw%C5%82owska-972412220",
            "dataId": "urn:li:comment:(activity:7293951311455133696,7293951418816761857)"
          }
        ],
        "commentAdded": "Happy Social Saturday! 🌟 Excited to connect, share skills, and spread positivity. Let’s elevate each other and find amazing opportunities! 💼✨"
      },
      {
        "postId": "urn:li:activity:7293970057049608192",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293970057049608192",
        "url": "https://www.linkedin.com/in/anifilipova?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADf8CYBCCTeR_Yi6O0ORIau69ntFjDD6P4",
        "name": "Ani Filipova\nAni Filipova",
        "content": "The corporate buzzwords don't make you sound smart.\nThey make you sound… robotic. People roll their eyes and zone out.\n\nIf you want to be taken seriously, if you want to lead and inspire..\n\n....talk like a real person. Lead like one.\n\nHere is how:\n\n1. “Leverage”\n Nobody wakes up thinking, “I need to leverage my morning coffee.”Just say:\n “Use” or “Take advantage of.”\n\n2. “Bandwidth”\n You’re not a Wi-Fi signal.\n Just say “time” or “capacity.”\n\n3. “Drill down”\n You’re not drilling anything.\n Say “look into this more” or “focus on the details.”\n\n4. “Align”\n Corporate-speak for “agree” or \"let's coordinate\"\n So just say that.\n\n5. “Game changer”\n Unless you’re curing disease, it’s probably not.\n Try “big improvement” or “real impact.”\n\n6. “Synergy”\n Nobody leaves a meeting saying, “Wow, that synergy was incredible.”\n Just say “working well together” or “teamwork.”\n\n7. “Optics”\n Sounds like you care more about how something looks than what’s right.\n Say “how this looks” or “the impression it gives.”\n\n8. “Actionable insights”\n Insights don’t take action. People do.\n Use “useful advice” or “steps we can take.”\n\n9. “Paradigm shift”\n People feel change. You don’t need a buzzword for it.\n Say “a new way of thinking.”\n\nBuzzwords make you blend in. Real words make you stand out.\n\nDrop the jargon. Speak like a real person and watch how fast people start paying attention.\n\nWhat’s the one buzzword you wish would disappear forever?\n\n Repost this if you’re done with corporate nonsense and followfor more posts like this.",
        "reactions": {
          "likes": "513\nCassie Lincoln and 512 others",
          "comments": "241 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "I love this Ani Filipova. Clear, human communication always wins. The faster we drop the jargon, the faster people actually listen!",
            "userName": "Damesha Craig, Leadership Coach and Startup Advisor",
            "userProfileURL": "https://www.linkedin.com/in/dameshacraig",
            "dataId": "urn:li:comment:(ugcPost:7293907283086909440,7293970046458961920)"
          }
        ],
        "commentAdded": "Absolutely! Authentic communication fosters genuine connections. Lets embrace simplicity and clarity in our conversations! 👏 #RealTalk"
      },
      {
        "postId": "urn:li:activity:7293636611995488256",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293636611995488256",
        "url": "https://www.linkedin.com/in/brandonfluharty?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAC7ce8BszA4ODnqBlQT_JKPOnTSNgh-uAQ",
        "name": "Brandon Fluharty\nBrandon Fluharty",
        "content": "When I I became a Strategic Account Director for the first time, there was only one account I wanted to close: a $45B global airline. It took me 9 months, and we ended up winning a $5.9M deal.\n\nHere’s how I did it, play-by-play ↓\n\n\nBACKSTORY:\n\nI joined a Conversational AI company as a Strategic Account Director focused on CX transformation with Fortune 500 brands. On day 1, this was the account I was obsessed with winning above all others because I was a loyal flier and top customer with them.\n\n\nTHE BLUEPRINT:\n\n1. Used the airline for the basis of my onboarding pitch.\n\nDuring my first week of boot camp at my new company, we had to pick a brand to pitch, and I chose them. It went horribly wrong, but the good thing is that it was in front of internal stakeholders.\n\nI learned so much about our product through my mistakes, but I learned even more about the airline through my extensive research.\n\n\n2. Wrote an open letter for the airline executives based on my customer experience.\n\nHere was the winning structure:\n\n• Kept it brief (2-3 min read)\n\n• Stated my case (importance of giving time back to customers, like me, using their visuals)\n\n• Defined a path forward (gave specific ideas they could use)\n\n• Delivered credibility (our brief history and a non-competitive customer example)\n\n• Provided a compelling call-to-action (invite to an exclusive peer event in London)\n\n\n3. Sent an email to 5 execs with a private link to the open letter.\n\nHere was the email:\n\nHello S**********,\n\nAs I write this from the <airline’s lounge>, I was reminded of just how many miles I fly when I received your letter with my annual <club membership> (attached).\n\nI have been a <airline> loyalist for several years and this year is shaping up to be the year I finally hit <highest tier> status!\n\nThe experiences I receive from <airline>; from the friendly greetings at the gate, to the hospitality at the lounges, to the mobile app experience are all top notch!\n\nBut...\n\nLink: Read The Open Letter to VPs\n\nLook forward to connecting!\n\nBrandon\n\n\n4. I also sent physical packages to arrive on the same day as the email.\n\nThe packages included:\n\n• High-quality materials\n• Initial business case using public-facing info\n• Invitation to validate our numbers and connect\n\nA few days after this was done, I received calls from 3 direct reports to the VPs I sent everything to.\n\nThat led to a successful 9-month engagement where we beat several competitors to win their business.\n\n\nBold, prepared, and creative wins.\n\nEspecially in this market!\n\nWant to read the exact open letter I sent?\n\nUnlock it here:\n\n(Bonus inside)\n\n",
        "reactions": {
          "likes": "243",
          "comments": "17 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "smart move using your own experience—makes it real and personal!",
            "userName": "Ronen R. Pessar",
            "userProfileURL": "https://www.linkedin.com/in/rpessar",
            "dataId": "urn:li:comment:(activity:7293620881233244160,7293636597650964480)"
          }
        ],
        "commentAdded": "Incredible journey, Brandon! Your bold and strategic approach is a true testament to the power of creativity in winning big accounts. Well done! 🚀"
      },
      {
        "postId": "urn:li:activity:7294162317376696320",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294162317376696320",
        "url": "https://www.linkedin.com/in/josephplazo?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAijs4BM-6R4sEkObXeyhUy9vP4ligyY1g",
        "name": "Joseph Riñoza Plazo\nJoseph Riñoza Plazo",
        "content": "How are you- what do you do?",
        "reactions": {
          "likes": "206\nJason Bramble and 205 others",
          "comments": "58 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/5bc360a7-5889-488a-82f0-4d585713a9da",
        "comments": [
          {
            "commentText": "Gonna put this one in my back pocket. Never know when you’ll need a conversation lifesaver at a dull work event.",
            "userName": "PRIYA Kashyap 🎯",
            "userProfileURL": "https://www.linkedin.com/in/priya-kashyap-%F0%9F%8E%AF-6861b4191",
            "dataId": "urn:li:comment:(ugcPost:7294151093318529025,7294182309304442883)"
          },
          {
            "commentText": "Oh man, I love this! Next time I meet someone, I’m skipping straight to, “Tell me the last thing that made you laugh so hard you cried.”",
            "userName": "Asim Siddiqui",
            "userProfileURL": "https://www.linkedin.com/in/asim-siddiqui-37582889",
            "dataId": "urn:li:comment:(ugcPost:7294151093318529025,7294181925999501312)"
          }
        ],
        "commentAdded": "Hi there! Im a passionate professional in [your field/industry]. Excited to connect and learn more about what you do!"
      },
      {
        "postId": "urn:li:activity:7294055122370748417",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294055122370748417",
        "url": "https://www.linkedin.com/in/erhanmeydan?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABKriGYBkVoxEijgoYTBH_HbrEIpROo-vg4",
        "name": "Erhan Meydan\nErhan Meydan",
        "content": "Göğüs röntgeni için dünyanın en gelişmiş tıbbi yorum dataseti açık kaynak olarak yayınladı. Böyle bir uygulama doktorların işini çok hızlandıracak.\nBu arada Apache 2.0 lisansı ile açık kaynak yayınladı. Dilediğiniz gibi kullanabilirsiniz.",
        "reactions": {
          "likes": "590\nMurat Altın and 589 others",
          "comments": "11 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/6768ad12-68c1-4344-9106-fc96374fd2a9",
        "comments": [
          {
            "commentText": "Lİnk: https://bowang-lab.github.io/MedRAX/",
            "userName": "Erhan Meydan",
            "userProfileURL": "https://www.linkedin.com/in/erhanmeydan",
            "dataId": "urn:li:comment:(ugcPost:7293910326402519041,7293910430580662272)"
          },
          {
            "commentText": "Bir kaç sene önce araba kazası geçirmiştim. Bel ve göğüs için çekilen mr görüntükerimi yükleyim bskalım ne diyecek",
            "userName": "Özcan Arslan",
            "userProfileURL": "https://www.linkedin.com/in/ozcanarslann",
            "dataId": "urn:li:comment:(ugcPost:7293910326402519041,7293923151074201600)"
          },
          {
            "commentText": "Özcan Arslan Çok geçmiş olsun. ",
            "userName": "Erhan Meydan",
            "userProfileURL": "https://www.linkedin.com/in/erhanmeydan",
            "dataId": "urn:li:comment:(ugcPost:7293910326402519041,7293932173726801920)"
          }
        ],
        "commentAdded": "This is a game-changer for medical professionals! Kudos for making such valuable resources openly available. Excited to see the impact on healthcare efficiency!"
      },
      {
        "postId": "urn:li:activity:7294105215056670720",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294105215056670720",
        "url": "https://www.linkedin.com/in/anilnarainmatai?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAA4BACUB8t4KlC9ystRlIBsgPWrftqjPzZw",
        "name": "Anil Narain अनिल नारायण Matai मटई\nAnil Narain अनिल नारायण Matai मटई",
        "content": "𝗖𝗮𝗻 𝘆𝗼𝘂 𝗲𝘅𝗽𝗹𝗮𝗶𝗻 𝘁𝗵𝗲 𝗱𝗶𝗳𝗳𝗲𝗿𝗲𝗻𝗰𝗲 𝗯𝗲𝘁𝘄𝗲𝗲𝗻 𝘀𝗽𝗶𝗿𝗶𝘁𝘂𝗮𝗹 𝗲𝗻𝗹𝗶𝗴𝗵𝘁𝗲𝗻𝗺𝗲𝗻𝘁 𝗮𝗻𝗱 𝘄𝗼𝗿𝗹𝗱𝗹𝘆 𝗲𝗻𝗹𝗶𝗴𝗵𝘁𝗲𝗻𝗺𝗲𝗻𝘁?\n\nSpiritual enlightenment and worldly enlightenment may seem similar, but they arise from distinct dimensions of experience and understanding. Worldly enlightenment often refers to intellectual knowledge, societal success, and the acquisition of external power or status. It is the awakening to the mechanics of the material world, where understanding leads to achievements, comforts, and control. This kind of enlightenment is bound by the transient nature of the physical realm, rooted in the ego’s pursuit of fulfillment through external means.\n\nOn the other hand, spiritual enlightenment transcends the confines of the material world. It is an awakening to the oneness of existence, where the illusion of separation dissolves and the soul recognizes its intrinsic unity with the divine. Spiritual enlightenment is not measured by what is acquired, but by what is surrendered—the attachment to the ego, desires, and the illusion of control. It leads to inner peace, compassion, and an eternal connection to higher consciousness.\n\nWhile worldly enlightenment may lead to temporary satisfaction, spiritual enlightenment leads to an unshakable peace that flows from within, beyond the realms of time and circumstance. It is a journey from the finite to the infinite.",
        "reactions": {
          "likes": "12",
          "comments": "8 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "anca mitin Thank you for amplifying the message and extending its reach! ",
            "userName": "Anil Narain अनिल नारायण Matai मटई",
            "userProfileURL": "https://www.linkedin.com/in/anilnarainmatai",
            "dataId": "urn:li:comment:(activity:7294105215056670720,7294182524346392576)"
          },
          {
            "commentText": "Anil Narain अनिल नारायण Matai मटई Sir, This is a beautifully articulated distinction between the two forms of enlightenment. Your insight into spiritual awakening and its deeper essence truly resonates.",
            "userName": "Janvi Balani",
            "userProfileURL": "https://www.linkedin.com/in/janvibalani-sustainabilityadvocate",
            "dataId": "urn:li:comment:(activity:7294105215056670720,7294106525839630336)"
          },
          {
            "commentText": "Janvi Balani Thank you so much, Janvi!  I’m glad the distinction resonated with you. Your focus on sustainability and climate action aligns beautifully with the essence of true awakening—living in harmony with the world around us. \"",
            "userName": "Anil Narain अनिल नारायण Matai मटई",
            "userProfileURL": "https://www.linkedin.com/in/anilnarainmatai",
            "dataId": "urn:li:comment:(activity:7294105215056670720,7294182813707255808)"
          }
        ],
        "commentAdded": "This is a profound distinction! Embracing both forms can lead to a holistic understanding of life. The balance truly enriches our journeys! 🌟"
      },
      {
        "postId": "urn:li:activity:7291956114290528259",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7291956114290528259",
        "url": "https://www.linkedin.com/in/forsterbill?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAAe8ABJY9T3zJ2hU7Rml-sQlxvj-h7S6k",
        "name": "Bill Forster\nBill Forster",
        "content": "Shantanu Verma is \nhashtag\n#hiring. Know anyone who might be interested?",
        "reactions": {
          "likes": "1",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Exciting opportunity, Shantanu! Ill keep an eye out for potential candidates within my network. Best of luck with the hiring process! 🌟"
      },
      {
        "postId": "urn:li:activity:7292572621076889601",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292572621076889601",
        "url": "https://www.linkedin.com/in/vasudhapa?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAExWVo8BZtGN9G_2mqVM-pW2yDwhdki4WS0",
        "name": "Vasudha P.\nVasudha P.",
        "content": " 𝗔𝗜 𝗶𝘀 𝗥𝗲𝘀𝗵𝗮𝗽𝗶𝗻𝗴 𝘁𝗵𝗲 𝗝𝗼𝗯 𝗠𝗮𝗿𝗸𝗲𝘁—𝗔𝗿𝗲 𝗬𝗼𝘂 𝗥𝗲𝗮𝗱𝘆?  \n\n\nI know we all argue, people once said computers would replace us, but that never really happened. We adapted, learnt new software, upskilled ourselves, and instead of being displaced, we thrived!  Computers 𝗻𝗲𝗲𝗱𝗲𝗱 us to operate them.\n\nBut here’s the difference, 𝗔𝗜 𝗱𝗼𝗲𝘀𝗻’𝘁 𝗻𝗲𝗲𝗱 𝘂𝘀. 𝗜𝘁’𝘀 𝗿𝗲𝗽𝗹𝗮𝗰𝗶𝗻𝗴 𝘂𝘀. And that’s undeniable.\n\nThe 𝗪𝗼𝗿𝗹𝗱 𝗘𝗰𝗼𝗻𝗼𝗺𝗶𝗰 𝗙𝗼𝗿𝘂𝗺 predicts 𝟴𝟱 𝗺𝗶𝗹𝗹𝗶𝗼𝗻 𝗷𝗼𝗯𝘀 will be gone by 2030 due to human machine displacement. The 𝗜𝗻𝘁𝗲𝗿𝗻𝗮𝘁𝗶𝗼𝗻𝗮𝗹 𝗟𝗮𝗯𝗼𝘂𝗿 𝗢𝗿𝗴𝗮𝗻𝗶𝘀𝗮𝘁𝗶𝗼𝗻 says 𝟲𝟬 𝗺𝗶𝗹𝗹𝗶𝗼𝗻 𝗷𝗼𝗯𝘀 in India alone will vanish. With 𝗔𝗴𝗲𝗻𝘁𝗶𝗰 𝗔𝗜 taking over social media management (SMM), content creation, and ad optimisation, roles that once required human input are fading fast.\n\nSo, the big question is, \"𝗗𝗼 𝘆𝗼𝘂 𝗵𝗮𝘃𝗲 𝗮 𝘀𝘂𝘀𝘁𝗮𝗶𝗻𝗮𝗯𝗹𝗲 𝗮𝗻𝗱 𝘀𝗰𝗮𝗹𝗮𝗯𝗹𝗲 𝗶𝗻𝗰𝗼𝗺𝗲 𝘀𝗼𝘂𝗿𝗰𝗲 𝗳𝗼𝗿 𝘁𝗵𝗲 𝗳𝘂𝘁𝘂𝗿𝗲?\"\n\nIndustries will keep changing, but businesses built on 𝗽𝗲𝗼𝗽𝗹𝗲, 𝗿𝗲𝗹𝗮𝘁𝗶𝗼𝗻𝘀𝗵𝗶𝗽𝘀, 𝗮𝗻𝗱 𝗿𝗲𝗮𝗹-𝘄𝗼𝗿𝗹𝗱 𝘃𝗮𝗹𝘂𝗲 will always thrive. The key? 𝗔𝗱𝗮𝗽𝘁𝗶𝗻𝗴 𝗯𝗲𝗳𝗼𝗿𝗲 𝗶𝘁’𝘀 𝘁𝗼𝗼 𝗹𝗮𝘁𝗲!\n\nWhat’s your plan for the AI-driven economy? Let’s talk in the comments! ",
        "reactions": {
          "likes": "18",
          "comments": "7 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/7a716a05-6f37-45d3-b0bf-cb25310c00d1",
        "comments": [
          {
            "commentText": "This is a thought-provoking post, Vasudha. I completely agree that embracing change and building relationships will be key to thriving in an AI-driven economy. ",
            "userName": "Kusumavati Shettigar",
            "userProfileURL": "https://www.linkedin.com/in/kusumavatishettigarvirtualassistance",
            "dataId": "urn:li:comment:(ugcPost:7292513374746124288,7292870376739500033)"
          },
          {
            "commentText": "Kusumavati Shettigar Its not just about accepting this bitter truth , but also we need to prepare ourselves for the future.",
            "userName": "Vasudha P.",
            "userProfileURL": "https://www.linkedin.com/in/vasudhapa",
            "dataId": "urn:li:comment:(ugcPost:7292513374746124288,7293958615260913664)"
          },
          {
            "commentText": "Very True",
            "userName": "Kusumavati Shettigar",
            "userProfileURL": "https://www.linkedin.com/in/kusumavatishettigarvirtualassistance",
            "dataId": "urn:li:comment:(ugcPost:7292513374746124288,7293995970646740994)"
          },
          {
            "commentText": "Great perspective",
            "userName": "Samir Patil",
            "userProfileURL": "https://www.linkedin.com/in/samir-patil-3584b3224",
            "dataId": "urn:li:comment:(ugcPost:7292513374746124288,7293657554075676672)"
          },
          {
            "commentText": "Samir Patil . Can you share your thoughts on this?",
            "userName": "Vasudha P.",
            "userProfileURL": "https://www.linkedin.com/in/vasudhapa",
            "dataId": "urn:li:comment:(ugcPost:7292513374746124288,7293958717249654784)"
          }
        ],
        "commentAdded": "Great insights! Adapting is crucial in this changing landscape. Lets equip ourselves with skills that complement AI rather than compete against it!"
      },
      {
        "postId": "urn:li:activity:7294066858062741505",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294066858062741505",
        "url": "https://www.linkedin.com/in/adriana-medina-lopez-portillo?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABwax4AB-lj8Mh7qBqJqlTL1BujAEfToPqI",
        "name": "Adriana Medina-López-Portillo\nAdriana Medina-López-Portillo",
        "content": "What unique gift of yours are celebrating today?\n\nShare in the comments!\n\nAlt text: Learn to embrace your own unique beauty, celebrate your unique gifts with confidence. Your imperfections are actually a gift.\" — Kerry Washington",
        "reactions": {
          "likes": "5\nEric Giguere and 4 others",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "I’m developing a gift - the ability to relax!",
            "userName": "Ken Yuzik, MBA",
            "userProfileURL": "https://www.linkedin.com/in/kenyuzik",
            "dataId": "urn:li:comment:(activity:7294050552584249344,7294062264733581313)"
          }
        ],
        "commentAdded": "Celebrating the gift of resilience today! Its amazing how our unique qualities shape our journey. What’s yours? 🌟 #EmbraceYourUniqueness"
      },
      {
        "postId": "urn:li:activity:7291047349101936640",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7291047349101936640",
        "url": "https://www.linkedin.com/in/jepsontaylor?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAT1knkBKurLdx7ocCJOtEwdp07TIBzisxg",
        "name": "🦾Jepson Taylor\n🦾Jepson Taylor",
        "content": "In the future, maybe sooner than we realize, we will all have access to private AI assistants of this quality. You wake up in the morning and talk to them about your goals for the day. They also share what they’re were able to accomplish on your behalf while you were sleeping.",
        "reactions": {
          "likes": "9",
          "comments": "2 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/404e81fa-fb89-4afc-8894-4d7b66b6a6df",
        "comments": [
          {
            "commentText": "I've had a hard time understanding why so many are hesitant to embrace a technology they saw as exciting when it was portrayed on a Sci-fi movie (2009 Star Trek). Now it's here (or coming very soon). That's just cool to me. https://www.youtube.com/watch?v=KvMxLpce3Xw",
            "userName": "Nathan Burch",
            "userProfileURL": "https://www.linkedin.com/in/burchems",
            "dataId": "urn:li:comment:(ugcPost:7291047348577677312,7291152370518925313)"
          },
          {
            "commentText": "",
            "userName": "Francesco Puppini",
            "userProfileURL": "https://www.linkedin.com/in/francescopuppini",
            "dataId": "urn:li:comment:(ugcPost:7291047348577677312,7291049635823951872)"
          }
        ],
        "commentAdded": "Exciting vision! The potential of AI assistants to enhance our productivity is endless. Looking forward to seeing how it unfolds!"
      }
    ],
    "errors": [
      {
        "postId": "urn:li:activity:7294022376621543425",
        "url": "https://www.linkedin.com/in/oliwia-paw%C5%82owska-972412220?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADeXE-YBTNE7Pcb_TX3U0XnPbZ_WKm17-f8",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293970057049608192",
        "url": "https://www.linkedin.com/in/anifilipova?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADf8CYBCCTeR_Yi6O0ORIau69ntFjDD6P4",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293636611995488256",
        "url": "https://www.linkedin.com/in/brandonfluharty?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAC7ce8BszA4ODnqBlQT_JKPOnTSNgh-uAQ",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294105215056670720",
        "url": "https://www.linkedin.com/in/anilnarainmatai?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAA4BACUB8t4KlC9ystRlIBsgPWrftqjPzZw",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7291956114290528259",
        "url": "https://www.linkedin.com/in/forsterbill?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAAe8ABJY9T3zJ2hU7Rml-sQlxvj-h7S6k",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294066858062741505",
        "url": "https://www.linkedin.com/in/adriana-medina-lopez-portillo?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABwax4AB-lj8Mh7qBqJqlTL1BujAEfToPqI",
        "errors": [
          "Failed to fetch media URL."
        ]
      }
    ]
  },
  {
    "postsData": [
      {
        "postId": "urn:li:activity:7294004036679217154",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294004036679217154",
        "url": "https://www.linkedin.com/in/daniel-caputo?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADXAXWUBcn8Ou3FrUdiN7VONiQWqvse_jhE",
        "name": "Daniel Caputo\nDaniel Caputo",
        "content": "7 toxic habits you need to crush⁣\n⁣\n(to grow yourself rapidly): ⁣\n⁣\n1. The Perfectionism Prison⁣\n↳ Paralysis through endless preparation.⁣\n↳ Using perfection as procrastination.⁣\n⁣\n2. The Validation Seeker⁣\n↳ Living for others' approval.⁣\n↳ Measuring worth through external opinions.⁣\n⁣\n3. The Future Escaper⁣\n↳ Always waiting for the perfect moment.⁣\n↳ Using tomorrow as today's excuse.⁣\n⁣\n4. The Comparison Trap⁣\n↳ Measuring against others' highlight reels.⁣\n↳ Using others' success as reason for inaction.⁣\n⁣\n5. The Energy Vampire⁣\n↳ Draining vitality through negative self-talk.⁣\n↳ Creating problems that don't exist.⁣\n⁣\n6. The Growth Blocker⁣\n↳ Avoiding necessary discomfort.⁣\n↳ Choosing comfort over potential.⁣\n⁣\n7. The Time Killer⁣\n↳ Busy work over meaningful progress.⁣\n↳ Confusing motion with action.⁣\n⁣\nChange happens through replacement, not elimination. ⁣\nBuild positive habits to crowd out the toxic ones.⁣\n⁣\nHow do you stop bad habits?⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣\nLet me know in the comments. ⬇️⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣\n⁣⁣⁣⁣⁣⁣⁣\n⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣️ Followand reshare!⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣\n Save this post for future!⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣\n⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣\nFollow to learn everything about personal and career growth⁣",
        "reactions": {
          "likes": "307\nCassie Lincoln and 306 others",
          "comments": "102 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Toxic habits drain your energy before you even realize it. The good news is you do not just eliminate them, you replace them. Swap perfectionism for action, comparison for self-improvement, and negativity for momentum. Small shifts lead to big results.",
            "userName": "Sven Elstermann",
            "userProfileURL": "https://www.linkedin.com/in/svensf",
            "dataId": "urn:li:comment:(ugcPost:7293814486770069504,7294020241716654081)"
          }
        ],
        "commentAdded": "Great insights! Recognizing these habits is the first step to growth. Lets focus on cultivating positive habits for real progress! 🌟"
      },
      {
        "postId": "urn:li:activity:7294100324292653058",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294100324292653058",
        "url": "https://www.linkedin.com/in/anthonywentzel?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADZN2sBr5ZUAlKZK2QwVQvOE9B6pnFHXt8",
        "name": "Anthony Wentzel\nAnthony Wentzel",
        "content": "Many entrepreneurs have an idea they believe could be the next big thing.\n\nTo test the waters, they create an MVP (Minimum Viable Product) to see if there’s a market for it.\n\nHere are some tips for building a successful MVP:\n\n1. 𝐊𝐞𝐞𝐩 𝐢𝐭 𝐬𝐢𝐦𝐩𝐥𝐞\n\nFocus on the core functionality of your product or service. Don’t try to include too many features. You can always add more later based on feedback from users.\n\n2. 𝐁𝐮𝐢𝐥𝐝 𝐢𝐭 𝐪𝐮𝐢𝐜𝐤𝐥𝐲\n\nTime is of the essence when launching a new product or service. The sooner you can get your MVP out there, the sooner you can start gathering feedback and making improvements.\n\n3. 𝐆𝐞𝐭 𝐟𝐞𝐞𝐝𝐛𝐚𝐜𝐤 𝐞𝐚𝐫𝐥𝐲 𝐚𝐧𝐝 𝐨𝐟𝐭𝐞𝐧\n\nUser feedback is essential for refining your MVP and ensuring that it meets the needs of your target market.\n\nMake sure to collect feedback at every stage of development, from early prototypes all the way to the final product.\n\n4. 𝐁𝐞 𝐩𝐫𝐞𝐩𝐚𝐫𝐞𝐝 𝐭𝐨 𝐩𝐢𝐯𝐨𝐭\n\nAs much as you may want your MVP to be perfect, chances are it won’t be.\n\nProper planning and foresight can make all the difference in bringing a great product to market.\n\nGo create something incredible!",
        "reactions": {
          "likes": "0",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Great insights! Keeping it simple and gathering early feedback are crucial for MVP success. Excited to see what innovative ideas emerge!"
      },
      {
        "postId": "urn:li:activity:7293939120882540544",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293939120882540544",
        "url": "https://www.linkedin.com/in/beerbiceps?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABRvDGgBUDKf31KasHdmgvySw4Pen6ybAes",
        "name": "Ranveer Allahbadia\nRanveer Allahbadia",
        "content": "Saying no isn’t rude—it’s necessary. \n\nYou don’t have to please everyone or take on more than you can handle. \n\nProtect your time, set your limits, and focus on what truly matters.\n\nThe right people will respect your boundaries. The wrong ones will expose themselves.\n\nLearn to say no without guilt.",
        "reactions": {
          "likes": "713",
          "comments": "71 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Agreed Ranveer Allahbadia . The ability to say no without guilt is a superpower. It’s easy to fall into the trap of pleasing everyone, but every unnecessary \"yes\" chips away at time, focus, and energy. The most successful people don’t just manage their time - they protect it fiercely. Because at the end of the day, you either run your schedule, or it runs you.",
            "userName": "ZeroKaata",
            "userProfileURL": "https://www.linkedin.com/company/zerokaata/posts",
            "dataId": "urn:li:comment:(ugcPost:7293898537765892096,7294000905153089536)"
          },
          {
            "commentText": "One more comment. Any of those nice ways to say no would have ended my relationship with the person or company that reached out to me. My agent told me to always say yes and he’d help me figure out how to get it done no matter what (ghost writers ) If I politely declined a project the company would hire someone else and never call me again. The new person they hired would then become their go to person (assuming they didn’t suck) and if that person was smart they would never say no or then they too would no longer be contacted. I have seen people say no within the corporate word though. You have more job security as an employee. Anyone providing creative services and providing content for game development needs to always say yes if they want and longevity with their career . My hats off to anyone who is able to level the playing field but generally the client is God as far as the vendor issaying this with all due respect. :)",
            "userName": "Mark Griskey",
            "userProfileURL": "https://www.linkedin.com/in/mark-griskey-b47b161",
            "dataId": "urn:li:comment:(ugcPost:7293898537765892096,7294015665621909504)"
          }
        ],
        "commentAdded": "Absolutely agree! Setting boundaries is essential for both productivity and personal well-being. Saying no can be empowering!"
      },
      {
        "postId": "urn:li:activity:7294151757662699520",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294151757662699520",
        "url": "https://www.linkedin.com/groups/762547?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A762547-7294151756710629376",
        "name": "Big Data 🟥 Data Science | Machine Learning | Deep Learning | Artificial Intelligence\nBig Data 🟥 Data Science | Machine Learning | Deep Learning | Artificial Intelligence",
        "content": "A free video on artificial intelligence:\n“DeepLab for Semantic Image Segmentation”\nvideo link: https://lnkd.in/edKikbr4\nchannel link:",
        "reactions": {
          "likes": "3",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Excited to dive into this! DeepLab sounds like a game-changer for semantic image segmentation. Thanks for sharing the resource! 🚀"
      },
      {
        "postId": "urn:li:activity:7294017684160098304",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294017684160098304",
        "url": "https://www.linkedin.com/in/samfjacobs?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAASN2cBeFTWjYgjvi9WaSagpkU6Rs1GjVk",
        "name": "Sam Jacobs\nSam Jacobs",
        "content": "If you ever hear someone mispronouncing something it’s likely because they read it somewhere and hadn’t heard anyone pronounce it correctly in real life.\n\nThis means they are a curious person willing to put themselves in uncomfortable situations.\n\nIt means they are learners and growers and doing their best.\n\nIt means they READ.\n\nThese are good people!\n\nCelebrate them.",
        "reactions": {
          "likes": "164\nKoen Stam and 163 others",
          "comments": "40 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "During an inspection in the Army, one of my team members declared he was the \"epitome of a good soldier.\" He pronounced \"epitome\" incorrectly.\n\nI looked him the eye, smiled, and asked, \"Private, have you been reading again?\"\n\nHis proudly shouted reply was, \"Yes Corporal, I finished two new books.\"\n\nI couldn't bring myself to correct him. I simply said, \"Keep up the good work!\"",
            "userName": "Daren Lauda",
            "userProfileURL": "https://www.linkedin.com/in/darenlauda",
            "dataId": "urn:li:comment:(activity:7294014865768148992,7294017654409900032)"
          },
          {
            "commentText": "Daren Lauda Man I love this story, Daren!",
            "userName": "Sam Jacobs",
            "userProfileURL": "https://www.linkedin.com/in/samfjacobs",
            "dataId": "urn:li:comment:(activity:7294014865768148992,7294058045850943488)"
          }
        ],
        "commentAdded": "Absolutely! Mispronunciations show a willingness to learn. Lets celebrate curiosity and the journey of growth in our communities! 📚✨"
      },
      {
        "postId": "urn:li:activity:7293741229316395008",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293741229316395008",
        "url": "https://www.linkedin.com/in/lmacvittie?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAy8E0BPFfMw7MRTpGDUlojYK0uvWk5Q0A",
        "name": "Lori MacVittie\nLori MacVittie",
        "content": "If you ever wondered what ice cream, sharks, and Diogenes have to do with \nhashtag\n#AI and reasoning models, then you should give this a listen. There's some \nhashtag\n#DeepSeek \nhashtag\n#security concerns and, of course, a quick run down of crazy consumer gadgets enabled with AI from CES. Seriously, check it out - this was a great discussion today!",
        "reactions": {
          "likes": "6\nChuck Herrin, CISSP, CCSP, NACD.DC and 5 others",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Sounds intriguing! I’m curious about the links between such diverse topics. Can’t wait to dive into this discussion! #Innovation #AI"
      },
      {
        "postId": "urn:li:activity:7294150513002999808",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294150513002999808",
        "url": "https://www.linkedin.com/in/anilnarainmatai?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAA4BACUB8t4KlC9ystRlIBsgPWrftqjPzZw",
        "name": "Anil Narain अनिल नारायण Matai मटई\nAnil Narain अनिल नारायण Matai मटई",
        "content": "𝗛𝗼𝘄 𝗱𝗼 𝗛𝗶𝗻𝗱𝘂 𝘁𝗲𝘅𝘁𝘀 𝗱𝗲𝘀𝗰𝗿𝗶𝗯𝗲 𝘁𝗵𝗲 𝗽𝗮𝘁𝗵 𝘁𝗼 𝘀𝗽𝗶𝗿𝗶𝘁𝘂𝗮𝗹 𝗲𝗻𝗹𝗶𝗴𝗵𝘁𝗲𝗻𝗺𝗲𝗻𝘁?\n\nHindu texts describe the path to spiritual enlightenment as a multidimensional journey, uniquely tailored to the soul's innate tendencies and aspirations. It is not a linear path but rather a spiral, where the seeker moves through layers of self-realization, shedding illusion and attachment. The Bhagavad Gita, for example, speaks of three primary paths: Karma Yoga (the yoga of selfless action), Bhakti Yoga (the yoga of devotion), and Jnana Yoga (the yoga of knowledge), each guiding the seeker to the same ultimate truth—union with the Divine.\n\nHowever, the true essence of these paths lies not in their distinction, but in their convergence. Karma Yoga teaches that every action is an opportunity to transcend the ego and align with the higher self. Bhakti Yoga emphasizes a deep, intimate relationship with the Divine, where love becomes the vehicle for liberation. Jnana Yoga, on the other hand, calls for discernment, where one seeks to understand the nature of reality beyond appearances.\n\nUltimately, Hindu texts reveal that spiritual enlightenment is not an achievement to be attained but a realization to be uncovered—a return to one's eternal nature, beyond dualities, where the individual and the Divine are one.",
        "reactions": {
          "likes": "16",
          "comments": "2 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Really enjoyed reading this, Anil.\n\nAction, devotion, and wisdom aren't separate.\n\nThey're threads of the same fabric, weaving the soul back to its source.",
            "userName": "Ben Pu",
            "userProfileURL": "https://www.linkedin.com/in/benpu",
            "dataId": "urn:li:comment:(activity:7294150513002999808,7294170956820885504)"
          },
          {
            "commentText": "Anil Narain अनिल नारायण Matai मटई, ancient wisdom offers beautiful pathways to enlightenment through action, devotion, and knowledge.  ",
            "userName": "Rolando Herrera",
            "userProfileURL": "https://www.linkedin.com/in/rolando-herrera-pro",
            "dataId": "urn:li:comment:(activity:7294150513002999808,7294154129231224832)"
          }
        ],
        "commentAdded": "An insightful exploration of the multifaceted paths to enlightenment! Each path beautifully illustrates the journey of self-discovery and unity with the Divine."
      },
      {
        "postId": "urn:li:activity:7294037596224000000",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294037596224000000",
        "url": "https://www.linkedin.com/in/casangitabiswas?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADf89c4BResmu4P4v2cq6pQ0QqqCvB-sVAU",
        "name": "CA Sangita Biswas\nCA Sangita Biswas",
        "content": "𝗦𝗼𝗹𝗲 𝗣𝗿𝗼𝗽𝗿𝗶𝗲𝘁𝗼𝗿, 𝗟𝗟𝗣, 𝗼𝗿 𝗖𝗼𝗺𝗽𝗮𝗻𝘆 – 𝗪𝗵𝗶𝗰𝗵 𝗢𝗻𝗲 𝗶𝘀 𝗥𝗶𝗴𝗵𝘁 𝗳𝗼𝗿 𝗬𝗼𝘂𝗿 𝗕𝘂𝘀𝗶𝗻𝗲𝘀𝘀?\n\nAre you starting a new business or reconsidering your existing structure?\n\nMany entrepreneurs struggle with this decision:\n Should I remain a sole proprietor?\n Is forming a company the right move?\n Or would an LLP be the best fit?\n\nThe truth is, 𝘁𝗵𝗲𝗿𝗲’𝘀 𝗻𝗼 𝗼𝗻𝗲-𝘀𝗶𝘇𝗲-𝗳𝗶𝘁𝘀-𝗮𝗹𝗹 𝗮𝗻𝘀𝘄𝗲𝗿!\n\nEven if you’re a solo entrepreneur, a 𝗢𝗻𝗲 𝗣𝗲𝗿𝘀𝗼𝗻 𝗖𝗼𝗺𝗽𝗮𝗻𝘆 (𝗢𝗣𝗖) might be better than a sole proprietorship. On the other hand, if you’re working with partners, a 𝗣𝗿𝗶𝘃𝗮𝘁𝗲 𝗟𝗶𝗺𝗶𝘁𝗲𝗱 𝗖𝗼𝗺𝗽𝗮𝗻𝘆 might not always be the best choice—sometimes, an 𝗟𝗟𝗣 is the smarter option.\n\n𝗖𝗵𝗼𝗼𝘀𝗶𝗻𝗴 𝘁𝗵𝗲 𝗿𝗶𝗴𝗵𝘁 𝘀𝘁𝗿𝘂𝗰𝘁𝘂𝗿𝗲 𝗰𝗮𝗻 𝗶𝗺𝗽𝗮𝗰𝘁:\n Tax liabilities\n Legal protection\n Compliance requirements\n Fundraising opportunities\n\nIf you’re unsure which structure works best for you, 𝗗𝗠 𝗺𝗲 or 𝗯𝗼𝗼𝗸 𝗮 𝟭:𝟭 𝗰𝗮𝗹𝗹 𝗼𝗻 𝗧𝗼𝗽𝗺𝗮𝘁𝗲! Let’s find the perfect fit for your business.\n\n𝗡𝗼𝘄, 𝗵𝗲𝗿𝗲’𝘀 𝘀𝗼𝗺𝗲𝘁𝗵𝗶𝗻𝗴 𝘁𝗼 𝘁𝗵𝗶𝗻𝗸 𝗮𝗯𝗼𝘂𝘁!\nWhy do the Big 4 firms operate as LLPs and not companies? Drop your answer in the comments! ⬇️\n\n\nFollowfor more!",
        "reactions": {
          "likes": "203\nBalavignesh Sampathkumar and 202 others",
          "comments": "30 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Thanks for sharing\nGreat breakdown of a crucial business decision!  Choosing the right structure isn’t just about legal formalities—it impacts everything from taxation to growth opportunities. Whether it's a Sole Proprietorship, LLP, or Company, the key is aligning it with long-term goals. And that Big 4 question? LLPs offer liability protection while maintaining flexibility—smart move!",
            "userName": "Maj Gen Sanjeev Chowdhry (A Proud Veteran)",
            "userProfileURL": "https://www.linkedin.com/in/maj-gen-sanjeev-chowdhry-a-proud-veteran-836690176",
            "dataId": "urn:li:comment:(activity:7294032681254756352,7294063073659691008)"
          }
        ],
        "commentAdded": "Great insights on business structures! Choosing the right one can truly make or break your venture. Excited to see others’ thoughts on the Big 4!"
      },
      {
        "postId": "urn:li:activity:7294059526784208899",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294059526784208899",
        "url": "https://www.linkedin.com/in/dansalcius?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAQQRB0BhGf-sWGwq5X51yh5oxj2OWiVIkU",
        "name": "Dan Salcius\nDan Salcius",
        "content": "My remote work prediction you didn’t expect.\n\nGo ahead, sit down for this one.\n\nThe future of work is FURRY.\n\nIf the office doesn’t require a lint roller, it’s not for us.\n\nRemote work, or pets in the office—take your pick.",
        "reactions": {
          "likes": "67\nJon Leslie 🔵 and 66 others",
          "comments": "14 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/c52c41d7-6797-4bde-8fa2-2cc40c50e4ec",
        "comments": [
          {
            "commentText": "Oh my gawd that stretch ️",
            "userName": "Leanne Bowers",
            "userProfileURL": "https://www.linkedin.com/in/leannebowers",
            "dataId": "urn:li:comment:(ugcPost:7294046087462494208,7294094267117887488)"
          },
          {
            "commentText": "Leanne Bowers She doesn’t answer to corporate norms. I love that for her.",
            "userName": "Dan Salcius",
            "userProfileURL": "https://www.linkedin.com/in/dansalcius",
            "dataId": "urn:li:comment:(ugcPost:7294046087462494208,7294160011344166912)"
          },
          {
            "commentText": "I need to paws and think about this one... sorry, I'll see myself out ",
            "userName": "Steven Musham",
            "userProfileURL": "https://www.linkedin.com/in/sjmusham",
            "dataId": "urn:li:comment:(ugcPost:7294046087462494208,7294052988971565056)"
          },
          {
            "commentText": "Steven Musham I set you up for that one, and you ran with it.",
            "userName": "Dan Salcius",
            "userProfileURL": "https://www.linkedin.com/in/dansalcius",
            "dataId": "urn:li:comment:(ugcPost:7294046087462494208,7294054356671242240)"
          }
        ],
        "commentAdded": "Love this take! Combining remote work with our furry friends truly enhances our work-life balance. 🐾 Heres to pup-friendly offices!"
      }
    ],
    "errors": [
      {
        "postId": "urn:li:activity:7294004036679217154",
        "url": "https://www.linkedin.com/in/daniel-caputo?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADXAXWUBcn8Ou3FrUdiN7VONiQWqvse_jhE",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294100324292653058",
        "url": "https://www.linkedin.com/in/anthonywentzel?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADZN2sBr5ZUAlKZK2QwVQvOE9B6pnFHXt8",
        "errors": [
          "Failed to fetch reactions.",
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293939120882540544",
        "url": "https://www.linkedin.com/in/beerbiceps?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABRvDGgBUDKf31KasHdmgvySw4Pen6ybAes",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294151757662699520",
        "url": "https://www.linkedin.com/groups/762547?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A762547-7294151756710629376",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294017684160098304",
        "url": "https://www.linkedin.com/in/samfjacobs?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAASN2cBeFTWjYgjvi9WaSagpkU6Rs1GjVk",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293741229316395008",
        "url": "https://www.linkedin.com/in/lmacvittie?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAy8E0BPFfMw7MRTpGDUlojYK0uvWk5Q0A",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294150513002999808",
        "url": "https://www.linkedin.com/in/anilnarainmatai?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAA4BACUB8t4KlC9ystRlIBsgPWrftqjPzZw",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294037596224000000",
        "url": "https://www.linkedin.com/in/casangitabiswas?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADf89c4BResmu4P4v2cq6pQ0QqqCvB-sVAU",
        "errors": [
          "Failed to fetch media URL."
        ]
      }
    ]
  },
  {
    "postsData": [
      {
        "postId": "urn:li:activity:7294128555410554882",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294128555410554882",
        "url": "https://www.linkedin.com/in/thomaskramerla?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAACDp-ABFqhuSceCNzHpONH-puFK_mf0Cs8",
        "name": "Thomas Kramer\nThomas Kramer",
        "content": "This is code for “no one wants to write down more bad loans for me”.",
        "reactions": {
          "likes": "4",
          "comments": "3 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "The richest man in the world sucks at business? That’s your hot take?",
            "userName": "Patrick Fletchall",
            "userProfileURL": "https://www.linkedin.com/in/patrick-fletchall",
            "dataId": "urn:li:comment:(activity:7294128555410554882,7294134233424375808)"
          },
          {
            "commentText": "Patrick Fletchall Bless your heart",
            "userName": "Thomas Kramer",
            "userProfileURL": "https://www.linkedin.com/in/thomaskramerla",
            "dataId": "urn:li:comment:(activity:7294128555410554882,7294170309266423808)"
          },
          {
            "commentText": "Bwahaha. The all you can eat OPM buffet has a limit?",
            "userName": "Darren C.",
            "userProfileURL": "https://www.linkedin.com/in/darrencross",
            "dataId": "urn:li:comment:(activity:7294128555410554882,7294159574767452160)"
          }
        ],
        "commentAdded": "Interesting approach! Tackling bad loans is crucial for financial health. How do you plan to address this challenge moving forward?"
      },
      {
        "postId": "urn:li:activity:7294180713157828608",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294180713157828608",
        "url": "https://www.linkedin.com/company/kpmgindia/posts",
        "name": "KPMG India\nKPMG India",
        "content": "#UnionBudget2025 | In the coming decades, India is likely to become the second largest \nhashtag\n#energydemand centre in the world and thus \nhashtag\n#nuclearenergy will play a central role in \nhashtag\n#decarbonisation of India’s energy supplies. For this a range of issues have to be addressed including on technology, fuel, safety, liabilities and costs. Setting a clear north star on development of nuclear power at scale through\nprovides directional clarity on these issues. However, a string of follow-on measures will be required to ensure implementation of the goals and attract. Amendment of the Atomic Energy Act will be a key step in that regard:,. For more, click to read in",
        "reactions": {
          "likes": "1",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Exciting times ahead for India’s energy landscape! Embracing #NuclearEnergy is vital for our #decarbonisation goals. Lets champion the necessary reforms!"
      },
      {
        "postId": "urn:li:activity:7294104919479918593",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294104919479918593",
        "url": "https://www.linkedin.com/in/heatherburgett?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABK0iYBgX_S5Dc666G2Ghgp1BjbYoeNAUA",
        "name": "Heather Burgett\nHeather Burgett",
        "content": " It’s Time to Level Up Your PR & Visibility!  \nI’m inviting you to join my FREE Masterclass on February 11th at 1 PM PT to Set Your 2025 PR & Visibility Plan! \n\nImagine this: In just one session, I’ll unveil the secrets to transforming your visibility and skyrocketing your PR success! \n\nHere’s what you can look forward to:\n\n Banish Your Visibility Blind Spots – Say goodbye to feeling invisible!\n\n Ignite Your Press Power – Learn how to shine in the media spotlight!\n\n Craft Your PR Plan – Discover how to strategically position yourself as the go-to expert in your space!\n\nAs an award-winning publicist, visibility expert, and transformational business consultant, I’m on a mission to help you move past the frustration of endless content creation that results in crickets.\n\nImagine being featured in dream publications and media—think well-loved magazines, high-profile TV and radio shows, popular podcasts, and influential blogs!\n\nThis is your chance to serve more of your ideal clients around the globe while effortlessly flowing into prosperity. \n\nFeel the thrill of putting yourself \"out there\" and say GOODBYE to fear, procrastination, and self-doubt for good! You’ll walk away with the confidence to attract your ideal audience and clients like a magnet! \n\nGet ready for ALIGNED VISIBILITY that fosters genuine CONNECTION and ultimately—CURRENCY! \n\nIt’s time to unlock your brilliance and let the world witness your magic! \n\nSave your spot & get the replay - Link in Comments below",
        "reactions": {
          "likes": "7",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": " Register here to attend and get the replay:\nhttps://prstars.net/mediabreakthrough-masterclass",
            "userName": "Heather Burgett",
            "userProfileURL": "https://www.linkedin.com/in/heatherburgett",
            "dataId": "urn:li:comment:(activity:7293973367286640640,7293973688612200448)"
          }
        ],
        "commentAdded": "Exciting opportunity! 🚀 Ready to elevate your PR game and amplify your visibility? Cant wait to see what you’ll share in the masterclass! 🌟"
      },
      {
        "postId": "urn:li:activity:7294026150576553984",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294026150576553984",
        "url": "https://www.linkedin.com/in/shannonsmithjdms?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAD4mg4BDMT_Eza3wONw9tGoXONI4zgg2MA",
        "name": "🧠 Shannon Smith, J.D., M.S. 🚀\n🧠 Shannon Smith, J.D., M.S. 🚀",
        "content": "Your 𝗯𝗼𝗱𝘆 𝗸𝗻𝗼𝘄𝘀 it's time to quit.\n\nScience shows these 5 warning signs mean \n𝗬𝗼𝘂𝗿 𝗯𝗿𝗮𝗶𝗻 𝗶𝘀 𝗱𝗼𝗻𝗲 \n\n1. 𝗦𝘂𝗻𝗱𝗮𝘆 𝗡𝗶𝗴𝗵𝘁 𝗣𝗮𝗻𝗶𝗰\nYour brain's threat response is literally 𝘀𝗰𝗿𝗲𝗮𝗺𝗶𝗻𝗴 for change\n→ Start building your exit plan today\n\n2. 𝗠𝗲𝗲𝘁𝗶𝗻𝗴 𝗠𝗶𝗴𝗿𝗮𝗶𝗻𝗲\nYour nervous system treats meetings like 𝗽𝗿𝗲𝗱𝗮𝘁𝗼𝗿 𝗮𝘁𝘁𝗮𝗰𝗸𝘀\n→ Use that energy to practice sales calls instead\n\n3. 𝗘𝘅𝗽𝗲𝗿𝘁𝗶𝘀𝗲 𝗜𝗴𝗻𝗼𝗿𝗲𝗱\nYour knowledge is being 𝘄𝗮𝘀𝘁𝗲𝗱 in meetings\n→ Package it into your first coaching offer\n\n4. 𝗖𝗼𝗻𝘀𝘁𝗮𝗻𝘁 𝗘𝘅𝗵𝗮𝘂𝘀𝘁𝗶𝗼𝗻\nYour brain is burning glucose fighting 𝘁𝗼𝘅𝗶𝗰 𝗰𝘂𝗹𝘁𝘂𝗿𝗲\n→ Imagine using that energy for 𝘆𝗼𝘂𝗿 𝗰𝗹𝗶𝗲𝗻𝘁𝘀\n\n5. 𝗟𝗶𝘃𝗶𝗻𝗴 𝗳𝗼𝗿 𝗙𝗿𝗶𝗱𝗮𝘆\nWhen your brain's reward system only activates on weekends\n→ Time to build your 𝗲𝘀𝗰𝗮𝗽𝗲 𝗿𝗼𝘂𝘁𝗲\n\nThe Real Problem?\nIt's not about 𝗹𝗲𝗮𝘃𝗶𝗻𝗴 your job\nIt's about 𝗿𝗲𝗰𝗹𝗮𝗶𝗺𝗶𝗻𝗴 your brain\n\nP.S. What was 𝘆𝗼𝘂𝗿 𝗹𝗮𝘀𝘁 𝘀𝘁𝗿𝗮𝘄 before you quit?\nLet me know in the comments ⬇️\n\n️ Repost to inspire others to get butter in sales\n And follow  Shannon Smith, J.D., M.S. for more.\n Want even more\n️ More still? Attend my 2 day event:",
        "reactions": {
          "likes": "100",
          "comments": "102 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "",
            "userName": "🧠 Shannon Smith, J.D., M.S. 🚀",
            "userProfileURL": "https://www.linkedin.com/in/shannonsmithjdms",
            "dataId": "urn:li:comment:(ugcPost:7293999402233278464,7294000511630917632)"
          },
          {
            "commentText": "Devang Upadhyaya Hehe. Good to see youuuuu",
            "userName": "🧠 Shannon Smith, J.D., M.S. 🚀",
            "userProfileURL": "https://www.linkedin.com/in/shannonsmithjdms",
            "dataId": "urn:li:comment:(ugcPost:7293999402233278464,7294013672471859202)"
          },
          {
            "commentText": " What was your last straw?",
            "userName": "🧠 Shannon Smith, J.D., M.S. 🚀",
            "userProfileURL": "https://www.linkedin.com/in/shannonsmithjdms",
            "dataId": "urn:li:comment:(ugcPost:7293999402233278464,7294000875147010048)"
          }
        ],
        "commentAdded": "Great insights! Recognizing these signs is the first step to reclaiming our mental well-being. Excited to learn more from Shannon! 🌟"
      },
      {
        "postId": "urn:li:activity:7293876026697302016",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293876026697302016",
        "url": "https://www.linkedin.com/in/sumit-mishraa?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABzxJgABicfZ4DuY9VOL59k-AsbQ23EBTqM",
        "name": "Sumit Mishra\nSumit Mishra",
        "content": "Delhi me itna pollution hai ki dur dur tak congress ki seat nhi dikh rahi",
        "reactions": {
          "likes": "100",
          "comments": "4 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Sumit Mishra Delhi ka pollution sach mein ek gambhir samasya hai. Iska asar sirf swasthya par hi nahi, balki sheher ke rajneetik aur samajik pehluon par bhi padta hai. Humein mil kar is samasya ka samadhan dhundhna hoga, taaki hum apne sheher ko swachh aur swasth bana sakein. Rajneetik dalon ko bhi is mudde par ekjut hokar kaam karna chahiye.",
            "userName": "Samit Singh",
            "userProfileURL": "https://www.linkedin.com/in/imsamitsingh",
            "dataId": "urn:li:comment:(activity:7293876026697302016,7293890258394300416)"
          },
          {
            "commentText": "hahah good one, abhi kai bade bhi nahi dekhenge Sumit Mishra",
            "userName": "Meenakshi Yadav",
            "userProfileURL": "https://www.linkedin.com/in/meenakshi-yadav-3b1b9b20b",
            "dataId": "urn:li:comment:(activity:7293876026697302016,7293878428435456002)"
          }
        ],
        "commentAdded": "An alarming reality indeed! Lets address pollution alongside political challenges—both are crucial for a healthier, thriving Delhi."
      },
      {
        "postId": "urn:li:activity:7294022179346685952",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294022179346685952",
        "url": "https://www.linkedin.com/in/yuhelenyu?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADPqtcBN8ROzfTXJfYivUVJiimQhHSyo-U",
        "name": "Helen Yu\nHelen Yu",
        "content": "Could soft robotic wearables transform assistive technologies?\n\nMassachusetts Institute of Technology researchers have developed PneuAct, a tool that designs soft pneumatic actuators for assistive wearables and robotics.\n It fabricates customizable actuators with integrated sensors using autonomous machine knitting.\n It streamlines the development of prototypes like assistive gloves and soft robotic hands.\n It allows for quick simulations and the creation of versatile devices\n\nI can see this transform healthcare, smart homes, gaming, and soft robotics. MIT aims to expand actuator shapes and optimize the design process and make soft robotics more accessible and adaptable.\n\nWhat other use cases can you imagine? How do you think PneuAct could change industries beyond assistive tech?\n\n\n\nWant more insights on\nand\n?\n Subscribe to the\nhereor\nhere.\n\nVideo Credit:",
        "reactions": {
          "likes": "380",
          "comments": "52 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/704107e8-4109-48cf-8ade-7f1577e96858",
        "comments": [
          {
            "commentText": "The potential of soft robotic wearables in transforming various industries is truly exciting. Looking forward to seeing future innovations.",
            "userName": "Vishal Rane",
            "userProfileURL": "https://www.linkedin.com/in/vishal-rane-a90342202",
            "dataId": "urn:li:comment:(ugcPost:7293890024452829185,7294180103553523712)"
          }
        ],
        "commentAdded": "Exciting advancements with PneuAct! Beyond assistive tech, it could revolutionize rehabilitation, sports, and even creative industries. What are your thoughts?"
      },
      {
        "postId": "urn:li:activity:7294074452818984961",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294074452818984961",
        "url": "https://www.linkedin.com/in/agil-zeynalov-453ab8344?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAFZN638BEy6HZzU4ZL84qP3scJeuUSkJSdg",
        "name": "Agil Zeynalov\nAgil Zeynalov",
        "content": "You don’t need U.S. or Canadian citizenship to land a remote job.\n\nHere are 16 websites to get a remote job easily: \n\n1/– Curated, high-quality remote jobs for serious professionals.\n2/– Massive job board with millions of remote listings.\n3/– Smart AI-powered job matching for instant results.\n4/– Find remote jobs with transparent salary insights.\n5/ Hubstaff Talent – 100% free job board for global freelancers.\n6/– Leverage your network for exclusive remote jobs.\n7/– One search, thousands of remote job openings.\n8/ Monster – Industry-leading site for top-tier remote roles.\n9/ Remote Circle – Discover hand-picked, premium remote jobs.\n10/– Expert-vetted jobs for serious remote workers.\n11/ We Work Remotely – The largest remote job board worldwide.\n12/ Remote OK – Tech-focused board for high-paying remote jobs.\n13/– Fully remote jobs with no junk listings.\n14/– Remote jobs curated for digital nomads.\n15/ Skip The Drive – Smart filters for hassle-free remote job hunting.\n16/ Virtual Vocations – Specializes in verified remote jobs.\n\n Bookmark this & start applying today!\n\nP.S.\n\nI have a newsletter where I help 100,000+ people learn AI and monetize their skills.\n\n Subscribe for free & get 4 AI courses as a bonus:\n\n\n\nFollow me atfor more posts like this\n\nAnd repost this to help others land their dream jobs easily.",
        "reactions": {
          "likes": "537\nChahat Raj Kapoor and 536 others",
          "comments": "52 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "The newsletter sounds interesting, especially with free AI courses included",
            "userName": "Chahat Raj Kapoor",
            "userProfileURL": "https://www.linkedin.com/in/chahat-raj-kapoor",
            "dataId": "urn:li:comment:(activity:7294037777816432640,7294074429838393344)"
          }
        ],
        "commentAdded": "Great resource! 🌍 Remote work opens up endless opportunities for talent worldwide. Excited to see more professionals thriving in this space!"
      },
      {
        "postId": "urn:li:activity:7293962517897195520",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293962517897195520",
        "url": "https://www.linkedin.com/in/priyanshuofcl?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACk7Xd8BGCF2amWRykDYtj1Qpk8j7AxeV4I",
        "name": "Priyanshu Gupta\nPriyanshu Gupta",
        "content": "𝐌𝐮𝐦𝐛𝐚𝐢 makes up 24.18% of our user base, aligning closely with its 18.61% share of India’s total investors. This validates that we are reaching the right audience in proportion to the actual market distribution.\n\nBengaluru follows with 17.02%, a significantly higher presence than its 5.35% share of India’s total investors, likely influenced by my tech network and growing tech-savvy investors.\n\nZooming out, Tier-1 cities (Mumbai, Bengaluru, Delhi, Chennai, Kolkata) account for 65-70% of India’s investors, making them the backbone of market activity.\nInstitutional investors dominate Mumbai, holding 16.90% of the market, reinforcing its role as India’s financial nerve center.\n\n The numbers speak for themselves—we’re heading in the right direction with!",
        "reactions": {
          "likes": "10\nAvishi Saini and 9 others",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Exciting insights! It’s great to see how our presence aligns with market distributions, showcasing growth in key investor hubs. 🚀"
      },
      {
        "postId": "urn:li:activity:7293959358898483200",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293959358898483200",
        "url": "https://www.linkedin.com/in/jgirdhar?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAH0TxgBr6IZwcukF0GzmVrJ4EJCDu7Rj1U",
        "name": "Jitender Girdhar\nJitender Girdhar",
        "content": "Burnout affects 77% of professionals\n\nand a raise won’t cure it\n\nIf money is the only reason you stay, you’re already underpaid\n\nRespect, growth, and balance are priceless.\n\nA salary raise feels great, for a moment.\nBut that feeling fades.\n\nA healthy work culture?\nThat’s what makes you wake up without dreading Mondays.\n\nIt’s the respect you feel, the support you get,\nthe growth you experience - every single day.\n\nBecause no paycheck can fix:\n- A toxic manager\n- Lack of recognition\n- Poor work-life balance\n- Constant stress and burnout\n\nWhat truly matters:\n\n1. Respect over perks\n↳ Fancy benefits mean nothing if you’re treated poorly.\n\n2. Recognition over raises\n↳ Being seen and valued lasts longer than a bonus.\n\n3. Growth over comfort\n↳ A place that challenges you, not just pays you.\n\n4. Supportive leadership\n↳ A great boss can change your life more than a pay bump.\n\n5. Work-life balance\n↳ Peace of mind > Overtime pay.\n\n6. Psychological safety\n↳ You should never fear speaking up.\n\n7. Purpose-driven work\n↳ Money can’t buy meaning.\n\nWhat matters more to you, money or culture?\nand why?\n\n️ Repost to promote healthy workplace culture\n Followfor more on Careers & Leadership",
        "reactions": {
          "likes": "369\nCassie Lincoln and 368 others",
          "comments": "202 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Thank you, Jitender Girdhar, for highlighting such a crucial topic. The point about \"psychological safety\" truly stood out to me. Teams thrive when empowered to voice ideas without fear—it drives innovation and strengthens trust.\n\nOne way to build on this is by offering anonymous feedback channels. They can bridge the gap for those hesitant to speak up directly. What’s your take on balancing this with fostering open face-to-face dialogue?",
            "userName": "Punardeep Singh",
            "userProfileURL": "https://www.linkedin.com/in/punardeepsingh",
            "dataId": "urn:li:comment:(activity:7293955327136260096,7293965321973993473)"
          }
        ],
        "commentAdded": "Absolutely agree! A healthy work culture fosters motivation and commitment far beyond any financial incentive. Lets prioritize respect and growth!"
      },
      {
        "postId": "urn:li:activity:7294055430685671424",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294055430685671424",
        "url": "https://www.linkedin.com/in/johnkraski?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABkbm-0Be4xxSTDslQoX9c9qcRoExoNAGWk",
        "name": "John Kraski\nJohn Kraski",
        "content": "I need to share a big secret with you.\n\nI’ve been secretly dreaming about this forever.\n\nI want to create a LinkedIn burner account.\n\nMy current LinkedIn is out of control.\n\nI’m also maxed out at 30k connections.\n\nI need peace, quiet, and tranquility in my LinkedIn life.\n\nAlso, I know ageism is happening with my LinkedIn.\n\nSo it is time for a new LinkedIn account.\n\nOne that is fresh, young, and fun.\n\nMy new LinkedIn burner account will:\n\n-Only connect with close friends\n-Be 15 years younger (to fight ageism)\n-Post only serious and thought provoking content\n\nI am curious about many things:\n\nWill I get more job offers with my younger account?\nWill I have more high-quality connections with less noise?\nHow quickly will I be able to grow from 0 followers?\nWill I have more fun here with my burner account?\n\nI am excited for this new LinkedIn chapter.\n\nWhat should I name my new burner account?\n\n-Kohn Jraski\n-Jeanu Reeves\n-Johnny Bravo\n\nLet me know your thoughts in the comments.",
        "reactions": {
          "likes": "171",
          "comments": "177 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/6c63faa5-6e5d-4b06-9c15-77a03efe170c",
        "comments": [
          {
            "commentText": "It’s against the rules for the platform to keep people safe and honest",
            "userName": "Meg Verre",
            "userProfileURL": "https://www.linkedin.com/in/meg-verre",
            "dataId": "urn:li:comment:(ugcPost:7294008888457134080,7294176966818021376)"
          }
        ],
        "commentAdded": "Excited for your new journey! Kohn Jraski has a fresh vibe. Wishing you lots of fun and success with your burner account! 🚀"
      },
      {
        "postId": "urn:li:activity:7293899182308786176",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293899182308786176",
        "url": "https://www.linkedin.com/in/moyosore-oluwafemi-346a63209?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADUEBCYBRIi7frW5-KjCax3dLCM1uCc4idQ",
        "name": "Moyosore Oluwafemi\nMoyosore Oluwafemi",
        "content": "If you don’t understand this, you’ll always struggle with LinkedIn growth.\n\nMost people think the key is:\n Posting every day.\nor\n Going viral.\n\nBut here’s the truth:\n→ The right audience > a big audience.\n→ Authority > popularity.\n→ Consistency > overnight success.\n\nThe people who win on LinkedIn?\n\nThey show up with value.\n\nP.S. LinkedIn isn’t hard…unless you’re doing it wrong.\n\nWhat’s one thing that’s helped you grow on LinkedIn?\n\n️ Repost so someone in your network can learn.",
        "reactions": {
          "likes": "152\nBlessing Ikpia and 151 others",
          "comments": "110 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Consistency is what many people struggle with Moyosore Oluwafemi\n\nIt might be hard to show up everyday and \"see\" no results\n\nYou can't see it now, but sooner or later it'd be too pronounced to ignore",
            "userName": "Blessing Ikpia",
            "userProfileURL": "https://www.linkedin.com/in/blessing-ikpia-54b790244",
            "dataId": "urn:li:comment:(ugcPost:7293448493518483456,7293899125861851136)"
          },
          {
            "commentText": "Blessing Ikpia Honestly. \n\nYou might not see the results now but it'll definitely be evident in the long run.",
            "userName": "Moyosore Oluwafemi",
            "userProfileURL": "https://www.linkedin.com/in/moyosore-oluwafemi-346a63209",
            "dataId": "urn:li:comment:(ugcPost:7293448493518483456,7293899624392658944)"
          }
        ],
        "commentAdded": "Great insights! Focusing on adding value and connecting with the right audience truly makes all the difference. Whats your top tip for consistent engagement?"
      },
      {
        "postId": "urn:li:activity:7293954836956405762",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293954836956405762",
        "url": "https://www.linkedin.com/in/duke-rem-%F0%9F%90%A2-793616267?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAEFotd8BDwR_osR-3ROnxQtd2JpPvWbizfw",
        "name": "Duke Rem 🐢\nDuke Rem 🐢",
        "content": "SoftBank Bets on OpenAI with $40 Billion Investment\n\n SoftBank is set to change the AI investment landscape with a $40 billion stake in OpenAI, valuing the company at $300 billion. The investment far surpasses Microsoft’s $13 billion and strengthens the alliance between SoftBank and OpenAI, which are already collaborating on the development of Crystal Intelligence. Part of the funds will go toward the Stargate project, an advanced AI infrastructure estimated to cost $500 billion. Key points: SoftBank plans to invest $40 billion in OpenAI, increasing its market value. Part of the funds will...\n\n[please read our full article by clicking the link below ⬇️]\n\n️If you've made it this far, it seems the post caught your interest! Please consider liking, sharing, or dropping your thoughts in the comments.\n\nHere's why:\n\nIt helps spread the ideas and solutions I feature, amplifying their impact.\n\nYour feedback lets me know instantly if my content resonates with you, helping me improve and bring more of what you enjoy!\n\nBut above all...Please follow me for daily news and insights about AI\n\n Thank you!",
        "reactions": {
          "likes": "3",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Exciting times ahead for AI! 🌟 This bold move by SoftBank highlights the immense potential of OpenAI and future innovations. Looking forward to seeing the impact!"
      },
      {
        "postId": "urn:li:activity:7294139246477533185",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294139246477533185",
        "url": "https://www.linkedin.com/groups/4702266?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A4702266-7294139245428957186",
        "name": "Marketing Communication: Digital Advertising Online SEO/SEM Internet Search Mobile Apps Social Media\nMarketing Communication: Digital Advertising Online SEO/SEM Internet Search Mobile Apps Social Media",
        "content": " Essential SEO Tools: Boost Your Digital Success!\n\nTo dominate the SEO game, using the right tools is a must!  From keyword research to technical SEO, content optimization, and beyond—discover the most powerful tools to enhance your online visibility and outperform the competition. \n\n Keyword Research Tools\n Google Keyword Planner |  Ahrefs |  SEMrush |  Ubersuggest\n\n Technical SEO & Audits\n Screaming Frog |  Sitebulb |  DeepCrawl\n\n Analytics & Monitoring\n Google Analytics |  Google Search Console\n\n Backlink Analysis\n Ahrefs |  Majestic |  Moz Link Explorer\n\n Site Speed Optimization\n Google PageSpeed Insights | ⏳ GTMetrix |  Pingdom\n\n️ Content Optimization\n SurferSEO |  Clearscope |  Yoast SEO (for WordPress)\n\n Rank Tracking\n SERPWatcher |  SE Ranking |  AccuRanker\n\n Local SEO\n Google My Business |  BrightLocal | ⭐ Whitespark\n\n",
        "reactions": {
          "likes": "4",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Great advice",
            "userName": "Nahid Hossain",
            "userProfileURL": "https://www.linkedin.com/in/nahid-hossain-a91397303",
            "dataId": "urn:li:comment:(groupPost:4702266-7294139245428957186,7294158397682126850)"
          }
        ],
        "commentAdded": "Great insights! These tools are vital for any SEO strategy. Excited to implement some of these in our digital campaigns! 🚀 #SEO #DigitalMarketing"
      },
      {
        "postId": "urn:li:activity:7294004569217318912",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294004569217318912",
        "url": "https://www.linkedin.com/in/marioknobl?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADiCvYQBFI05aZqfahrCiR-95n_3XJLq1Fs",
        "name": "Mario Hernandez\nMario Hernandez",
        "content": "Right now, a home is coming to life in Mexico!! It’s finally happening after months of planning. \n\n\nDust in the air, sun beating down, hands working together, by tomorrow, the Ramirez Lopez Family will have a place to call home.\n\nBut this is about more than just building a house.\n\nIt’s about people stepping up, showing up, and making something real happen.\n\nStrangers are becoming friends.\n\nWalls are going up.\n\nThere’s hard work, a lot of sweat, and probably a few construction fails that will turn into great stories later.\n\nBut most of all, there’s community, people coming together for something bigger than themselves.\n\nAnd none of this would be possible without you.\n\nYour support, your generosity, your belief in this project, it’s what’s making this happen.\n\nA huge shoutout to my friendandfor stepping up in a big way to help fund this build.\n\nBecause of them, this isn’t just an idea, it’s a home in the making. Grateful for his sponsorship and support!!\n\nOne more day to go. Let’s finish strong!\n\nIf you want to join us in future Impact Experiences, write in the comments IMPACT.\n\nWith purpose and impact,",
        "reactions": {
          "likes": "185\nCassie Lincoln and 184 others",
          "comments": "72 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "A house is built with hands, but a home is built with heart. Love seeing people come together for something bigger than themselves.",
            "userName": "Cassie Lincoln",
            "userProfileURL": "https://www.linkedin.com/in/cassielincolnalm",
            "dataId": "urn:li:comment:(ugcPost:7293987442779398146,7294082448336818244)"
          },
          {
            "commentText": "Excellent job! I was involved in a similar project a number of years ago with YWAM. Slab down when we arrived. Two days and it was done. About 12 volunteers.",
            "userName": "Edward Windham",
            "userProfileURL": "https://www.linkedin.com/in/edward-windham-02486a50",
            "dataId": "urn:li:comment:(ugcPost:7293987442779398146,7294020782668582913)"
          },
          {
            "commentText": "Edward Windham love to hear this! Amazing how quickly things can get done when it’s worked on together. Hope you can join us for future experiences.",
            "userName": "Mario Hernandez",
            "userProfileURL": "https://www.linkedin.com/in/marioknobl",
            "dataId": "urn:li:comment:(ugcPost:7293987442779398146,7294111254174998529)"
          }
        ],
        "commentAdded": "Incredible work! Its inspiring to see community and collaboration come together to create such a meaningful impact. Congrats on this journey! 🏡✨"
      },
      {
        "postId": "urn:li:activity:7293954223908528128",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293954223908528128",
        "url": "https://www.linkedin.com/in/rahulbhadoriyadesigner?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACe102oBuevRBUy-nNgVV1J7VyPuvu7rvus",
        "name": "Rahul Singh Bhadoriya\nRahul Singh Bhadoriya",
        "content": "Brand Soul isn't about perfect consistency. It's about authentic personality.\nEven your best friend has bad days. But they're still... them.",
        "reactions": {
          "likes": "4",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Absolutely! Embracing authenticity in branding creates deeper connections, just like in true friendships. Keep shining your unique light!"
      },
      {
        "postId": "urn:li:activity:7293989938402869248",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293989938402869248",
        "url": "https://www.linkedin.com/in/mark-a-odonnell?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADkDPEBjvjBLkFGXu8H2uepjdXzq2qY5Hg",
        "name": "Mark O'Donnell\nMark O'Donnell",
        "content": "I don’t care if you clock in at 8 a.m. sharp.\n\nI don’t care if you work from your couch, \na Starbucks, your car, or the beach.\n\nI do care about one thing: Results.\n\nI hired you because you fit our Core Values: Get it, Want it, and have the Capacity (GWC™) for your role.\n\nI trust you to do what needs to be done.\nYou tell me what you need, and I’ll show up.\n\nEvery time.\n\nLife throws curveballs.\n\nGot a sick kid?\n↳Handle it.\nNeed a day off?\n↳Take it.\n\nDoctor’s appointment? No need for an essay on why.\n\nWe’re all adults here.\n\nI care about the numbers on the Scorecard, but I care about the people behind those numbers just as much.\n\nWhen you're thriving, the business is thriving.\n\nI lead people, not a playpen.\n\nIf you’re hiring, here’s the deal:\n- Pick the right people and put them in the right seats.\n- Clarify the goals, no question marks.\n- Give them what they need – Tools, trust, and Traction.\n- Step out of the way – Empower. Don’t hover.\n\nWhen everyone’s on the same page, accountable, and in sync, your team can achieve anything.\n\nAgree?",
        "reactions": {
          "likes": "243",
          "comments": "93 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Yep. A leader’s job is to remove obstacles , provide resources, and step aside to let your people shine!",
            "userName": "Kevin Miller",
            "userProfileURL": "https://www.linkedin.com/in/kevin-miller-strategy",
            "dataId": "urn:li:comment:(activity:7293976881991761920,7293989923013996544)"
          },
          {
            "commentText": "Kevin Miller I agree. Great way to think. It also helps build trust. Your team knows you’re in their corner.",
            "userName": "Mark O'Donnell",
            "userProfileURL": "https://www.linkedin.com/in/mark-a-odonnell",
            "dataId": "urn:li:comment:(activity:7293976881991761920,7293993152435105792)"
          }
        ],
        "commentAdded": "Absolutely agree! Empowering teams builds trust and drives results. Its all about the people behind the numbers. Well said! 👏"
      },
      {
        "postId": "urn:li:activity:7294181197599911936",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294181197599911936",
        "url": "https://www.linkedin.com/groups/1850284?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A1850284-7294113177879912448",
        "name": "Business Development - The Missing Link Between Marketing & Sales - 540,000 Members Strong\nBusiness Development - The Missing Link Between Marketing & Sales - 540,000 Members Strong",
        "content": "#𝗘𝗺𝗯𝗿𝗮𝗰𝗶𝗻𝗴 𝘁𝗵𝗲 𝗖𝗮𝗹𝗹 𝘁𝗼 𝗟𝗲𝗮𝗱𝗲𝗿𝘀𝗵𝗶𝗽: 𝗡𝗮𝘃𝗶𝗴𝗮𝘁𝗶𝗻𝗴 𝗖𝗵𝗮𝗹𝗹𝗲𝗻𝗴𝗲𝘀\nLeadership is a transformative journey that requires skill, vision, and resilience. Accepting this role means being prepared for misunderstanding, criticism, opposition, accusations, and rejection.\n\n𝗡𝗮𝘁𝘂𝗿𝗲 𝗼𝗳 𝗟𝗲𝗮𝗱𝗲𝗿𝘀𝗵𝗶𝗽\nLeadership involves making difficult decisions that may not please everyone. As a leader, you will be scrutinized, and your actions may be misinterpreted. Recognizing this reality helps you approach your role with a balanced perspective.\n\n𝗠𝗶𝘀𝘂𝗻𝗱𝗲𝗿𝘀𝘁𝗮𝗻𝗱𝗶𝗻𝗴\nNot everyone will agree with your vision. Misunderstandings often arise from differing perspectives. Instead of seeing this as a setback, view it as an opportunity to clarify your intentions and foster open communication.\n\n𝗪𝗲𝗶𝗴𝗵𝘁 𝗼𝗳 𝗖𝗿𝗶𝘁𝗶𝗰𝗶𝘀𝗺\nCriticism can be challenging, coming from various sources. However, not all criticism is detrimental; constructive feedback can promote growth. Learn to distinguish between helpful and harmful criticism to enhance your leadership.\n\n𝗥𝗲𝘀𝗶𝗹𝗶𝗲𝗻𝗰𝗲\nResilience is crucial for leaders. Cultivate a thick skin while maintaining emotional intelligence. Respond thoughtfully to criticism, using it as a chance to adapt and promote a respectful team culture.\n\n𝗢𝗽𝗽𝗼𝘀𝗶𝘁𝗶𝗼𝗻\nLeaders often encounter differing opinions. While opposition can feel isolating, it is part of the leadership experience. Embracing it can lead to deeper discussions and innovative solutions.\n\n𝗟𝗲𝗮𝗱𝗲𝗿𝘀𝗵𝗶𝗽\nUse opposition as an opportunity to engage your team in decision-making. Actively seek input from dissenters, which strengthens team dynamics and shows you value diverse perspectives.\n\n𝗕𝘂𝗿𝗱𝗲𝗻 𝗼𝗳 𝗔𝗰𝗰𝘂𝘀𝗮𝘁𝗶𝗼𝗻𝘀 𝗮𝗻𝗱 𝗥𝗲𝗷𝗲𝗰𝘁𝗶𝗼𝗻\nAccusations can feel personal, especially if based on misunderstandings. Stay composed and focus on your core values and motivations for leading.\n\n𝗥𝗲𝗷𝗲𝗰𝘁𝗶𝗼𝗻 𝗶𝗻𝘁𝗼 𝗠𝗼𝘁𝗶𝘃𝗮𝘁𝗶𝗼𝗻\nRejection can be tough, but don’t let it discourage you. Reflect on the reasons behind it, learn from the experience, and let it fuel your commitment to your vision.\n\n𝗝𝗼𝘂𝗿𝗻𝗲𝘆 𝗼𝗳 𝗮 𝗥𝗲𝘀𝗶𝗹𝗶𝗲𝗻𝘁 𝗟𝗲𝗮𝗱𝗲𝗿\nAccepting leadership is a brave choice filled with challenges. By facing misunderstandings and criticisms, you build resilience that inspires others. Great leaders embrace these challenges, leading to personal growth and the ability to navigate complexities with confidence and compassion.",
        "reactions": {
          "likes": "33",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Well said! It’s a journey of continuous growth—learning to unlearn and relearn along the way ",
            "userName": "Nandeesh Palagatti 🇮🇳",
            "userProfileURL": "https://www.linkedin.com/in/nandeesh-palagatti-%F0%9F%87%AE%F0%9F%87%B3-61985817",
            "dataId": "urn:li:comment:(groupPost:1850284-7294113177879912448,7294181163269570560)"
          }
        ],
        "commentAdded": "Embracing the challenges of leadership truly fosters growth! Resilience and open communication are key to navigating the journey. 🌟 #LeadershipMatters"
      },
      {
        "postId": "urn:li:activity:7294030284197425152",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294030284197425152",
        "url": "https://www.linkedin.com/in/dominica-curk-4ab640217?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADa7vsMBFHfgrVnlX-0MNchKVd2XtfITIBk",
        "name": "Dominica Curk\nDominica Curk",
        "content": "Stop Blocking Your Team’s Success \n\nHotel owners, let’s be real for a second: hovering over your team like a helicopter manager is doing more harm than good.\n\nImagine this—you've hired an incredible team, full of professionals who know their stuff. So why treat them like they need permission for every little thing?\n\nYour front desk staff doesn’t need you watching over their shoulder. Your housekeeping team doesn’t need a micromanaging checklist for every single towel. Your managers don’t need constant approvals for decisions they were trained to make.\n\nTrust your team. Empower them.\n\nBecause here’s the truth: micromanagement crushes creativity, kills motivation, and makes even the best employees want to run for the hills.\n\nBut when you give them ownership, something magical happens:\n They take initiative.\n They solve problems on their own.\n They create exceptional guest experiences without needing you to step in.\n\nAt the end of the day, you’re not paying for hours filled with check-ins and reports—you’re paying for results.\n\nSo, how do you build a hotel team that thrives without you breathing down their necks?\n\n Hire the Right People – Look for attitude and passion, not just skills. A positive mindset is everything in hospitality.\n\n Trust Their Expertise – Give them clear goals, then let them run with it. You hired them for a reason!\n\n Flexibility is Your Friend – Some thrive in the morning, others at night. Some need quick breaks to recharge. Let them find their flow.\n\n Encourage Independent Thinking – Give your team the freedom to problem-solve instead of waiting for orders. That’s where real innovation happens.\n\n Lead Like a Mentor, Not a Boss – Train your managers to guide and support, not micromanage.\n\nThe Bottom Line?\n\nYour hotel doesn’t need another rule, another layer of approval, or another policy that slows your team down.\n\nIt needs trust.\n\nIt needs freedom.\n\nIt needs a leadership style that makes people WANT to give their best, not feel like they have to.\n\nSo, here’s the challenge: step back, let go, and watch your team rise.\n\nWhat’s the best experience you’ve had when given full trust at work?",
        "reactions": {
          "likes": "40",
          "comments": "19 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Micromanagement can indeed stifle creativity; letting people take ownership is crucial for growth.",
            "userName": "Marina Padovan",
            "userProfileURL": "https://www.linkedin.com/in/marinapadovan",
            "dataId": "urn:li:comment:(activity:7293996957763588097,7294024460611784707)"
          }
        ],
        "commentAdded": "Absolutely agree! Trusting your team unleashes their potential and sparks innovation. Lets empower our professionals to shine! 🌟 #Leadership #Empowerment"
      },
      {
        "postId": "urn:li:activity:7292406453494022144",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292406453494022144",
        "url": "https://www.linkedin.com/in/ajay-singh-b27a241b6?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADJXW08Bosdna_TMO7plMygCiP9sb09YtX0",
        "name": "Ajay Singh\nAjay Singh",
        "content": " Start Early, Work Hard, and Success Will Follow! \n\nJust watched a video by Anubhav Singh Bassi, where he humorously pointed out that no one dreams of a 9-5 job, yet most people end up doing it because of responsibilities. And he’s right!\n\n My Takeaway for Gen Z:\n Start working while in college – don’t wait for the “perfect” job.\n Forget work-life balance in your early years; first, build something worth balancing.\n Entrepreneurs should work more than 70 hours a week – that’s the price of success.\n Talent & luck? Overrated. Even if they exist, hard work is the real game-changer.\n Stop overthinking about money & career – take action, and success will follow.\n\n⏳ The best time to start was yesterday, the next best time is NOW! Start your journey early, build skills, and take control of your future.\n\n What age did you start working or hustling in your life? Drop it in the comments! ⬇️",
        "reactions": {
          "likes": "28",
          "comments": "7 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/12ed04d8-f656-4d0c-9152-10a7316fe28c",
        "comments": [
          {
            "commentText": "Great insights!  As Thomas Edison said, \"Opportunity is missed by most people because it is dressed in overalls and looks like work.\" Embracing hard work early on truly paves the way for success. Thanks for sharing these valuable lessons, Ajay Singh ",
            "userName": "Anvesh Perada 🧿",
            "userProfileURL": "https://www.linkedin.com/in/anveshroy",
            "dataId": "urn:li:comment:(ugcPost:7292406435873751040,7292878408290549760)"
          },
          {
            "commentText": "Great mindset. Success is built on action, not waiting for the “perfect” moment. Keep hustling.",
            "userName": "Fatiha Snigdha",
            "userProfileURL": "https://www.linkedin.com/in/fatiha-snigdha-b2b-lead-generation-strategist-research-expert",
            "dataId": "urn:li:comment:(ugcPost:7292406435873751040,7292540561465520128)"
          }
        ],
        "commentAdded": "Great insights! Starting early is key—every experience builds towards success. I began my journey at 18 and never looked back! 🚀"
      },
      {
        "postId": "urn:li:activity:7293993703189217281",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293993703189217281",
        "url": "https://www.linkedin.com/in/nathanielberman?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAFjpa8B7wpeBT3HiBnn6GitlAjVuum3dLc",
        "name": "Nat Berman\nNat Berman",
        "content": "The \"Number 1 regret of the dying\" bothers me. \n\n→ This should be the regret of the LIVING. \n\nWhen you're dead, none of it matters anyway.\n\nWe need to learn:\n\n→ As early as possible\n→ As quickly as possible\n→ And in the most effective way possible\n\nThat we should prioritize\n\n→ Relationships > Material Wealth\n→ Your happiness > What you're told is happiness\n→ Following your ambition > trying to find your passion\n→ Time with loved ones > Time doing things you can't stand\n→ Money as an amplifier > Money as a means to self-worth and status\n\nIf you've been living your life:\n\n→ On their terms\n→ According to their rules\n→ Day after day and year after year\n\nAnd coming to the realization that the:\n\n→ Fancy house\n→ Massive salary\n→ Alluring vacations\n→ \"Things\" you've accumulated\n\nAren't amounting to much more than just a status symbol\n\nThen it's time to check your priorities.\n\nMaybe it's time to go after:\n\n→ What YOU want\n→ On YOUR specific terms\n→ And utilize YOUR plan to get there.\n\nIt's in your head. It's BEEN in your head.\n\n\"I gotta get out.\"\n\nTrust me, I've been there too.\n\nIt's time to stop thinking, and start acting.\n\nREPOST ️ if you believe in action\n\nP.S. - What's your biggest regret to date?",
        "reactions": {
          "likes": "338",
          "comments": "399 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": " Here are 5 powerful ways to live without regret:\n\n Take the Leap – If something excites and scares you, it’s probably worth doing. Growth happens outside your comfort zone.\n Speak Your Heart – Say \"I love you,\" \"I'm sorry,\" and \"I appreciate you\" often. Words left unsaid become regrets.\n Prioritize Experiences Over Things – Memories outlast material possessions. Invest in moments that enrich your soul.\n Live Authentically – Stop chasing external validation. The happiest people stay true to themselves, not societal expectations.\n Let Go & Move Forward – Holding onto past mistakes keeps you stuck. Learn, adjust, and focus on the next chapter.",
            "userName": "Nat Berman",
            "userProfileURL": "https://www.linkedin.com/in/nathanielberman",
            "dataId": "urn:li:comment:(activity:7293961837274951681,7293962472430944256)"
          },
          {
            "commentText": "David Rosenberg ",
            "userName": "Nat Berman",
            "userProfileURL": "https://www.linkedin.com/in/nathanielberman",
            "dataId": "urn:li:comment:(activity:7293961837274951681,7293969566433464320)"
          },
          {
            "commentText": "This hits hard. It’s wild how we chase things we think will matter, only to realize too late that we were running in the wrong direction. Prioritizing relationships, happiness, and true ambition over status sounds simple, but it’s the hardest thing to do when the world keeps pushing the opposite.\nBiggest regret? Probably not realizing sooner that 'someday' isn’t a real day on the calendar. Working on that now.",
            "userName": "Haiqa Saleem",
            "userProfileURL": "https://www.linkedin.com/in/haiqa-saleem",
            "dataId": "urn:li:comment:(activity:7293961837274951681,7293968884691296257)"
          },
          {
            "commentText": "Haiqa Saleem Better late than never. ",
            "userName": "Nat Berman",
            "userProfileURL": "https://www.linkedin.com/in/nathanielberman",
            "dataId": "urn:li:comment:(activity:7293961837274951681,7293969779613204480)"
          }
        ],
        "commentAdded": "Powerful insights! Lets prioritize what truly matters—our happiness and relationships. Time to act on our authentic desires! #LiveFully"
      }
    ],
    "errors": [
      {
        "postId": "urn:li:activity:7294128555410554882",
        "url": "https://www.linkedin.com/in/thomaskramerla?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAACDp-ABFqhuSceCNzHpONH-puFK_mf0Cs8",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294180713157828608",
        "url": "https://www.linkedin.com/company/kpmgindia/posts",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294104919479918593",
        "url": "https://www.linkedin.com/in/heatherburgett?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABK0iYBgX_S5Dc666G2Ghgp1BjbYoeNAUA",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294026150576553984",
        "url": "https://www.linkedin.com/in/shannonsmithjdms?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAD4mg4BDMT_Eza3wONw9tGoXONI4zgg2MA",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293876026697302016",
        "url": "https://www.linkedin.com/in/sumit-mishraa?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABzxJgABicfZ4DuY9VOL59k-AsbQ23EBTqM",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294074452818984961",
        "url": "https://www.linkedin.com/in/agil-zeynalov-453ab8344?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAFZN638BEy6HZzU4ZL84qP3scJeuUSkJSdg",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293962517897195520",
        "url": "https://www.linkedin.com/in/priyanshuofcl?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACk7Xd8BGCF2amWRykDYtj1Qpk8j7AxeV4I",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293959358898483200",
        "url": "https://www.linkedin.com/in/jgirdhar?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAH0TxgBr6IZwcukF0GzmVrJ4EJCDu7Rj1U",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293899182308786176",
        "url": "https://www.linkedin.com/in/moyosore-oluwafemi-346a63209?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADUEBCYBRIi7frW5-KjCax3dLCM1uCc4idQ",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293954836956405762",
        "url": "https://www.linkedin.com/in/duke-rem-%F0%9F%90%A2-793616267?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAEFotd8BDwR_osR-3ROnxQtd2JpPvWbizfw",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294139246477533185",
        "url": "https://www.linkedin.com/groups/4702266?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A4702266-7294139245428957186",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294004569217318912",
        "url": "https://www.linkedin.com/in/marioknobl?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADiCvYQBFI05aZqfahrCiR-95n_3XJLq1Fs",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293954223908528128",
        "url": "https://www.linkedin.com/in/rahulbhadoriyadesigner?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACe102oBuevRBUy-nNgVV1J7VyPuvu7rvus",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293989938402869248",
        "url": "https://www.linkedin.com/in/mark-a-odonnell?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADkDPEBjvjBLkFGXu8H2uepjdXzq2qY5Hg",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294181197599911936",
        "url": "https://www.linkedin.com/groups/1850284?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A1850284-7294113177879912448",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294030284197425152",
        "url": "https://www.linkedin.com/in/dominica-curk-4ab640217?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADa7vsMBFHfgrVnlX-0MNchKVd2XtfITIBk",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293993703189217281",
        "url": "https://www.linkedin.com/in/nathanielberman?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAFjpa8B7wpeBT3HiBnn6GitlAjVuum3dLc",
        "errors": [
          "Failed to fetch media URL."
        ]
      }
    ]
  },
  {
    "postsData": [
      {
        "postId": "urn:li:activity:7294029717001646081",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294029717001646081",
        "url": "https://www.linkedin.com/in/sahilkataria?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAeUmF8BKZv-laaK4cpNPbgYOMgv_jRnUeM",
        "name": "Sahil Kataria\nSahil Kataria",
        "content": "In today’s fast-paced digital landscape, businesses \nmust harness data to drive strategic decision-making. \n\nAzure Synapse Analytics enables organizations to integrate,\nanalyze, and visualize data from multiple sources in a single\nplatform.\n\nAzure Synapse is more than just a tool; it’s a game-changer\nfor businesses looking to innovate with data analytics.\n\nTo maximize the value of Azure Synapse Analytics:\n\n-Optimize Data Storage\n-Leverage Dedicated SQL Pools\n-Integrate with Power BI\n-Secure Your Data\n\nBy following these best practices, you’ll be on your way to\ntransforming your data infrastructure, driving efficiency, and\nunlocking actionable insights for better business outcomes.\n\nReady to unlock the power of your data?\n\nStart transforming your analytics today with Azure Synapse\nAnalytics.\n\nContact us for a customized solution that fits your business needs\nand drives better decisions!",
        "reactions": {
          "likes": "2\nSahil Kataria and 1 other",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Absolutely! Azure Synapse is a game-changer for data-driven decision-making. Excited to see businesses thrive with these best practices! 🚀"
      },
      {
        "postId": "urn:li:activity:7294035853213872128",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294035853213872128",
        "url": "https://www.linkedin.com/in/ayesha-f-4867a8161?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACa9BqYBvpf77ZvZJEedtGEPMJRGg01bkN0",
        "name": "Ayesha F.\nAyesha F.",
        "content": " The Future of Biking: No Spokes, No Limits! \n\nImagine a bike that looks like it’s straight out of a sci-fi movie—sleek, futuristic, and rolling on spokeless wheels. That’s not a concept anymore; it’s real, and it’s redefining urban mobility!\n\n What Makes It Unique ?\n\n Spokeless Design – A bold leap in engineering, making bikes lighter and more aerodynamic.\n Electric-Powered – Smooth, efficient, and eco-friendly rides.\n Minimalist & Modern – A design that turns heads wherever you go.\n Less Maintenance – No spokes = fewer parts to worry about.\n\n What We Learn from This ?\n\n Innovation isn’t just about improving the old; it’s about reimagining what’s possible.\n\n Sustainability can be stylish and functional at the same time.\n\n The smallest tweaks in design can change the way we move.\n\nWould you ride one of these? Drop your thoughts below! \n\n..................................................................\n\n𝘐𝘧 𝘺𝘰𝘶 𝘦𝘯𝘤𝘰𝘶𝘯𝘵𝘦𝘳 𝘤𝘩𝘢𝘭𝘭𝘦𝘯𝘨𝘦𝘴 𝘪𝘯 𝘦𝘴𝘵𝘢𝘣𝘭𝘪𝘴𝘩𝘪𝘯𝘨 𝘺𝘰𝘶𝘳 hashtag\n𝘐𝘥𝘦𝘯𝘵𝘪𝘵𝘺,\n,\n𝘰𝘳\n𝘥𝘰𝘯'𝘵 𝘩𝘦𝘴𝘪𝘵𝘢𝘵𝘦 𝘵𝘰 𝘨𝘦𝘵 𝘪𝘯 𝘵𝘰𝘶𝘤𝘩 𝘸𝘪𝘵𝘩 𝘮𝘦 𝘧𝘰𝘳 𝘦𝘹𝘱𝘦𝘳𝘵 𝘨𝘶𝘪𝘥𝘢𝘯𝘤𝘦 𝘢𝘯𝘥 𝘴𝘶𝘱𝘱𝘰𝘳𝘵.\n\nRepost to spread awareness ️\n\nFollow Ayesha F. for more",
        "reactions": {
          "likes": "417",
          "comments": "62 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/c4a62536-cc36-42f5-a9b8-6f0372990b1a",
        "comments": [
          {
            "commentText": "Why are you promoting this garbage? This is one of the worst bikes ever produced, it’s extremely heavy, and the breaks are not sufficient for something of the this weight. The “innovative” spokless wheels replaced what is typically one to the most reliable components on a bike with something extremely fragile and high friction, you can’t even peddle this bike normally due to how much friction those wheels have, not to mention a terrible feeling ride. It’s so bad in fact that the company ditched the project and ghosted all of its backers. You’d know that if you did a good search before posting this nonsense. When thinking about innovation, you should think about what new problems you’re solving for your customers. Seriously what’s with the jack off session in the comments, are these bots?",
            "userName": "Hayden Kreuter",
            "userProfileURL": "https://www.linkedin.com/in/hayden-kreuter",
            "dataId": "urn:li:comment:(ugcPost:7293996773130346496,7294013764964659201)"
          },
          {
            "commentText": "Isn’t this the company that shut its doors once the kickstarter was complete? I’m fairly certain this bike comically panned as a POS for a it’s unsafe braking, high rolling resistance and general bad design.",
            "userName": "Cassidy Nolan, MBA",
            "userProfileURL": "https://www.linkedin.com/in/cassidy-nolan",
            "dataId": "urn:li:comment:(ugcPost:7293996773130346496,7294181114288517120)"
          }
        ],
        "commentAdded": "This innovation is truly inspiring! Excited to see how spokeless bikes transform urban mobility and promote sustainability. Lets ride the future! 🚴‍♂️🌍"
      },
      {
        "postId": "urn:li:activity:7292773349942824960",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292773349942824960",
        "url": "https://www.linkedin.com/in/sudhansu-padhy-433975188?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACxIBycBM0xxBLwJz86aoaRU0bCisaB0_t4",
        "name": "Sudhansu Padhy\nSudhansu Padhy",
        "content": "Nice to be a speaker on an event organized by IILM where we have addressed academicians. It was a great learning experience from the fellow panelists and educationists. The topic of discussion was about how to integrate skill with academics. Thanks tofor organizing such a wonderful program.",
        "reactions": {
          "likes": "3",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Congrats on your speaking engagement! Integrating skills with academics is crucial. Excited to see how these discussions shape the future of education!"
      },
      {
        "postId": "urn:li:activity:7290799211527163904",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290799211527163904",
        "url": "https://www.linkedin.com/in/manujaggarwal?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAMY_wBiA538UlzNcv3ls30NXdjZZ2cT2c",
        "name": "Manuj Aggarwal\nManuj Aggarwal",
        "content": "On February 06 at 2 PM PST, join me for an Ask Me Anything (AMA) session where we’ll unpack how to:\n\n Get answers to your AI questions (yes, even the “basic” ones).\n Learn how AI can help you save time, work smarter, or grow your business.\n Understand how to stay ahead in a world where AI is changing everything.\n\nThis isn’t just another live.\n\nIt’s a conversation to help you focus on what matters, and take actionable steps toward thriving in a tech-driven world.\n\nNo question is off-limits.\n\nWhether you're curious about AI, leadership, or balancing success with meaning - this is your space to ask and grow.\n\n Save your seat and let’s dive deep into your goals and the tech-powered future.\n\nLet’s turn uncertainty into your greatest opportunity.\n\nRegister now!",
        "reactions": {
          "likes": "4",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Excited for this! AI has so much potential to transform our work and lives. Looking forward to exploring these topics with everyone! 🚀"
      },
      {
        "postId": "urn:li:activity:7293760315878481920",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293760315878481920",
        "url": "https://www.linkedin.com/company/oceanm-net/posts",
        "name": "OceanM\nOceanM",
        "content": "Discipline is the key to growth—whether you're motivated or not. \nTake time to appreciate how far you've come. \n\nEasy decisions lead to a hard life, but hard decisions build an easier, healthier future. \nBeware of burnout. ️ Balance intensity with consistency, because it's not about them—it’s about you vs. your past self. \n\nDreams aren’t killed by failure, but by doubt. \nAsk yourself, \"What if I rise?\" \n\nFuel your growth.\nFocus on who you're becoming, not who you've been. \n\n\nFollow This",
        "reactions": {
          "likes": "420\nChahat Raj Kapoor and 419 others",
          "comments": "27 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Consistency beats intensity in fostering sustained growth over time.",
            "userName": "Chahat Raj Kapoor",
            "userProfileURL": "https://www.linkedin.com/in/chahat-raj-kapoor",
            "dataId": "urn:li:comment:(ugcPost:7293594295192711168,7293760303081623552)"
          }
        ],
        "commentAdded": "Absolutely agree! Growth thrives on discipline and self-reflection. Let’s keep pushing forward and embrace the journey ahead! 🚀"
      },
      {
        "postId": "urn:li:activity:7293842133839482880",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293842133839482880",
        "url": "https://www.linkedin.com/in/anthonywentzel?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADZN2sBr5ZUAlKZK2QwVQvOE9B6pnFHXt8",
        "name": "Anthony Wentzel\nAnthony Wentzel",
        "content": "If you’re looking to build custom software for your business but wondering if it’s worth it at all…\n\nHere’s one difference between custom software and off-the-shelf software to consider. \n\nOff-the-shelf software is either inexpensive to purchase but not suitable for a large business,\n\nOr it‘s able to support businesses on a large scale but very expensive to license.\n\nBut that’s not the case with custom software.\n\nCustom software is built to meet the unique needs of your business—\n\nWhile allowing your business to grow without being limited by the software it uses.\n\nThat means you can easily SCALE the\nbased on\nrequirements and size.",
        "reactions": {
          "likes": "1",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Great insights! Custom software truly empowers businesses to scale effectively and meet their unique needs. Worth considering for growth! 🚀"
      },
      {
        "postId": "urn:li:activity:7294036809779486722",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294036809779486722",
        "url": "https://www.linkedin.com/in/heidisolomon1?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAHZYc4BSBA3cyoRWKq_kaU-MLneV5LG6r4",
        "name": "✊Heidi Solomon-Orlick\n✊Heidi Solomon-Orlick",
        "content": "It’s Saturday, time to amplify amazing people in (and out of) my network. \n\nIn honor of Black History Month, Chief has curated a list of female authors changing the leadership landscape.\n\nDuring a time when\ninitiatives are being rolled back, these books provide guidance on how to navigate through corporate barriers.\n\nWe need to support female authors! Please follow and add these books to your collection. \n\nArticle link:\n\nThanks tofor compiling this great list!!",
        "reactions": {
          "likes": "14\nsteven kamensky and 13 others",
          "comments": "2 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Bridgett McGowen some great authors here!!",
            "userName": "✊Heidi Solomon-Orlick",
            "userProfileURL": "https://www.linkedin.com/in/heidisolomon1",
            "dataId": "urn:li:comment:(activity:7293991974951399424,7294012972534751232)"
          }
        ],
        "commentAdded": "What a fantastic initiative! Supporting female authors is crucial for fostering diverse leadership. Excited to check out these recommendations! 📚✨"
      },
      {
        "postId": "urn:li:activity:7293968369773395968",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293968369773395968",
        "url": "https://www.linkedin.com/in/sarah-touzani?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAxUfaQBunqgY9N7VMWaOimQUbyTax0zQjQ",
        "name": "Sarah Touzani\nSarah Touzani",
        "content": "93% of employees say trust is key to performance. \n\nOnly 21% trust their leaders. That’s a crisis.\n\nI've spent 15 years studying workplace dynamics, and here's what most leaders get wrong about trust:\n\n• They think it's about grand gestures.\n• They focus on words over actions.\n• They rush to fix without understanding.\n\nAccording to Harvard Business Review, the hidden cost of low trust is -\n• 2.5x higher employee turnover\n• 40% lower productivity\n• 74% more stress\n• Millions in lost revenue\n\nHere's what actually builds unshakeable trust:\n\n1. The Presence Principle\n→ Show up when things go wrong\n→ Listen without defending\n→ Make eye contact in difficult conversations\n\n2. The Commitment Compound\n→ Make smaller promises\n→ Keep them religiously\n→ Stack wins over time\n\n3. The Transparency Rule\n→ Share bad news early\n→ Admit what you don't know\n→ Explain the \"why\" behind decisions\n\n4. The Recovery Protocol\n→ Own mistakes immediately\n→ Focus on solutions, not blame\n→ Follow up until resolved\n\n5. The Consistency Code\n→ Same behavior in public and private\n→ Aligned words and actions\n→ Predictable responses to challenges\n\nWarning Signs - Trust is Eroding:\n• Increased formal documentation\n• Whispered conversations\n• Defensive communication\n• Missing deadlines without explanation\n\n→ Remember, trust is build everyday and not only in boardroom discussions.\n→ Share your experience below and tag a leader who gets it right.\n\nRepost this to help a manager become a better leader.\nFollowfor more leadership insights that actually work.",
        "reactions": {
          "likes": "66\nCassie Lincoln and 65 others",
          "comments": "57 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Trust isn’t built in big moments but in everyday actions. Love how you broke it down Sarah Touzani. Consistency, transparency, and presence make all the difference!",
            "userName": "Damesha Craig, Leadership Coach and Startup Advisor",
            "userProfileURL": "https://www.linkedin.com/in/dameshacraig",
            "dataId": "urn:li:comment:(ugcPost:7293903484846833665,7293968445639991296)"
          },
          {
            "commentText": "Thanks Damesha Craig, Leadership Coach \nI am glad you found it valuable.",
            "userName": "Sarah Touzani",
            "userProfileURL": "https://www.linkedin.com/in/sarah-touzani",
            "dataId": "urn:li:comment:(ugcPost:7293903484846833665,7293969862056443904)"
          },
          {
            "commentText": "When trust erodes, performance follows. Leaders who listen, own mistakes, and stay consistent build lasting loyalty.",
            "userName": "Cassie Lincoln",
            "userProfileURL": "https://www.linkedin.com/in/cassielincolnalm",
            "dataId": "urn:li:comment:(ugcPost:7293903484846833665,7294042776143372289)"
          }
        ],
        "commentAdded": "Trust is indeed the foundation of a thriving workplace! 💪 Loved your insights on actionable strategies for leaders. Every step counts! #LeadershipMatters"
      },
      {
        "postId": "urn:li:activity:7290764302876110850",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290764302876110850",
        "url": "https://www.linkedin.com/groups/7037632?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A7037632-7289934966560313347",
        "name": "Tech Startup CEOs & Investors: Artificial Intelligence, Machine Learning, FinTech, SaaS, ChatGPT\nTech Startup CEOs & Investors: Artificial Intelligence, Machine Learning, FinTech, SaaS, ChatGPT",
        "content": "BIOMIMICRY CONTINUUM – Part 4 – Update Agent LEARNING\nFundamental evidence of learning is the ability to recall and utilize what is learned. Receiving and integrating new information is a starting point. It is not learning, but an exceedingly small subset.\nRecent research published in Nature uncovered that Concept Cells help our brain abstract information and build memories. (all links in my comment below)\n\nA report in Quanta magazine provides an example: The idea of a “bank” has its own set of concept cells, maybe millions of them. Concept neurons fire for their concept no matter how it is presented: in real life or a photo, in text or speech, on television or in a podcast. “It’s more abstract, really different from what you’re seeing,” said Elizabeth Buffalo, a neuroscientist at the University of Washington.\n\nThese discoveries support and align with the abstraction methodology discussed in Part 2 and the contextualization methodology in Part 3 of this series.\n\nIn contrast to how the brain learns, LLMs:\n-process all ingested data rather than filtering for relevance, and\n-output the detailed words and pixels based on statistical proximity rather than conceptual value\nThe aim is to pass the Turing test, output that imitates the appearance of intelligence sufficiently to deceive the user.\n\nThe correctness of the result is dependent on the concentrations of relevant data in the training content. AI speed hides the fact that the model does not “know” anything but rather recomputes even identical prompts.\n\nOn the other hand, by imitating the learning and memory architecture and methodology of the brain the Agentic Expertise Ecosystem creates a library of reusable expertise and continues to learn. Imagine the applications when expertise is in high demand but sparse due to \"brain drain\" scenarios, new science and technology, or economic constraints.\n\nIn part 5 I will discuss the curation methodology.",
        "reactions": {
          "likes": "6",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Fascinating insights! Bridging neuroscience with AI offers incredible potential for true learning and expertise curation. Excited for Part 5!"
      },
      {
        "postId": "urn:li:activity:7293976873032646656",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293976873032646656",
        "url": "https://www.linkedin.com/in/colbywegter?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABKlU-gB43StC0lTFt2eMY4ubjQvzVYSc9w",
        "name": "Colby Wegter\nColby Wegter",
        "content": "It took me 4 months to create an irresistible offer.\n\nIt took me those same 4 months before I made my first dollar.\n\nIt took me 8 calls before I got my first sale.\n\nIt took me 9 calls before I closed on the first call.\n\nDoubt. Fear. Pain. Annoyance.\n\nMinute by minute.\n\nBut I had belief.\n\nBelief created passion.\n\nPassion created little actions.\n\nLittle actions created momentum.\n\nMomentum created a calm company I love.\n\nYou’ll always hear no more than yes.\n\nYou’ll always doubt yourself, no matter how far you go.\n\nYou’ll always look around and feel a little (or a lot) alone.\n\nBut everything you want is on the other side of the wall.\n\nI’m not special, well-educated, or have any extra advantages.\n\nI just went to the other side of the wall.\n\nBecause it took 7 straight nos to get 5 straight yeses.\n\nMy offer has been alive for a little over one month.\n\nIt’s surprised the hell out of me the momentum it’s created.\n\nAnd in the first 30 days, we’re over $11K cash collected.\n\nBut my clients have contracted 11X that…in the same span.\n\nI am so d*mn grateful for the opportunity to work with these amazing people.\n\nI don’t promise revenue. I promise 1:1 personalized help.\n\nThrough the lens of thousands of personal failures.\n\nIt’s a fantastic feeling to watch them succeed so quickly.\n\nSo let me ask you:\n\nHave you gotten at least 7 nos yet?\n\nGet to the other side of the wall. There’s good stuff over there.\n\nI share the model here, btw:",
        "reactions": {
          "likes": "9",
          "comments": "2 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Way to go Colby Wegter I just closed a deal that makes my company VERY close to $100,000 a year. It is the first few months, calls, and rejections that really thins out people who think they can start a business. Hurdles are hard if you don’t want to lift your legs ",
            "userName": "Jake McCoy",
            "userProfileURL": "https://www.linkedin.com/in/hire-a-geek",
            "dataId": "urn:li:comment:(activity:7293976873032646656,7294005718439854081)"
          },
          {
            "commentText": "I've always found Strong offer to a specific audience work 7X strong broski Colby Wegter",
            "userName": "Khizar Javed",
            "userProfileURL": "https://www.linkedin.com/in/khzarmarketing",
            "dataId": "urn:li:comment:(activity:7293976873032646656,7293977217523449856)"
          }
        ],
        "commentAdded": "Incredible journey! Your persistence is inspiring. The other side of the wall holds great rewards—lets keep pushing forward together! 💪🌟"
      }
    ],
    "errors": [
      {
        "postId": "urn:li:activity:7294029717001646081",
        "url": "https://www.linkedin.com/in/sahilkataria?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAeUmF8BKZv-laaK4cpNPbgYOMgv_jRnUeM",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7292773349942824960",
        "url": "https://www.linkedin.com/in/sudhansu-padhy-433975188?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACxIBycBM0xxBLwJz86aoaRU0bCisaB0_t4",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7290799211527163904",
        "url": "https://www.linkedin.com/in/manujaggarwal?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAMY_wBiA538UlzNcv3ls30NXdjZZ2cT2c",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293760315878481920",
        "url": "https://www.linkedin.com/company/oceanm-net/posts",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293842133839482880",
        "url": "https://www.linkedin.com/in/anthonywentzel?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADZN2sBr5ZUAlKZK2QwVQvOE9B6pnFHXt8",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294036809779486722",
        "url": "https://www.linkedin.com/in/heidisolomon1?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAHZYc4BSBA3cyoRWKq_kaU-MLneV5LG6r4",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293968369773395968",
        "url": "https://www.linkedin.com/in/sarah-touzani?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAxUfaQBunqgY9N7VMWaOimQUbyTax0zQjQ",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7290764302876110850",
        "url": "https://www.linkedin.com/groups/7037632?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A7037632-7289934966560313347",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293976873032646656",
        "url": "https://www.linkedin.com/in/colbywegter?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABKlU-gB43StC0lTFt2eMY4ubjQvzVYSc9w",
        "errors": [
          "Failed to fetch media URL."
        ]
      }
    ]
  },
  {
    "postsData": [
      {
        "postId": "urn:li:activity:7294000605981777920",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294000605981777920",
        "url": "https://www.linkedin.com/in/ayush-raj-5132a42bb?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAEzAT98Ba5f7S5Pi-kykaIpSYY3qOMQBXm4",
        "name": "Ayush Raj\nAyush Raj",
        "content": "Looking for Remote Work Opportunities in 2025?\n\nAnd want to earn in USD?\n\nHere’s a curated list of 25 top websites offering remote jobs with USD payouts:\n\n\n1. Jobspresso ()\n\n2. Virtual Vocations ()\n\n3. Stack Overflow Jobs ()\n\n4. Outsourcely ()\n\n5. Toptal ()\n\n6. Skip The Drive ()\n\n7. NoDesk ()\n\n8. RemoteHabits ()\n\n9. Remotive ()\n\n10. Remote4Me ()\n\n11. Pangian ()\n\n12. Remotees ()\n\n13. Europe Remotely ()\n\n14. Remote OK Europe ()\n\n15. Remote of Asia ()\n\n16. FlexJobs ()\n\n17.()\n\n18. We Work Remotely ()\n\n19. Remote OK ()\n\n20. AngelList ()\n\n21. LinkedIn ()\n\n22. Upwork ()\n\n23. Freelancer ()\n\n24. Working Nomads ()\n\n25. SimplyHired ()\n\nBonus Alert \n\n7000+ free courses free access:\n1. Introduction to Generative AI\n\n\n2. Google Data Analytics Professional Certificate\n\n\n3. Agile Project Management\n\n\n4. Project Execution: Running the Project\n\n\n5. Foundations of Project Management\n\n\n6. Project Initiation: Starting a Successful Project\n\n\n7. Project Planning: Putting It All Together\n\n\n8. Google Data Analytics:\n\n\n9. Fundamentals of digital marketing\n\n\n10. Get Started with Python\n\n\n11. Learn Python Basics for Data Analysis\n\n\n12. Data, ML, and AI in Google Cloud\n?\n\n13. Google Cloud Computing Foundations: Networking and Security in Google Cloud\n?\n\n14. Google Advanced Data Analytics Capstone\n\n\n15. Data Analysis with R Programming\n\n\n16. IBM Full Stack Software Developer Professional Certificate\n\n\n17. Introduction to Web Development with HTML, CSS, JavaScript\n\n\n18. IBM Front-End Developer Professional Certificate\n\n\n19. IBM Back-End Development Professional Certificate\n\n\n20. IBM Python for Data Science, AI & Development\n\n\n21. IBM Developing Cloud Apps with Node.js and React\n\n\nJoin Our Telegram for more amazing notes and study materials",
        "reactions": {
          "likes": "433\nChahat Raj Kapoor and 432 others",
          "comments": "56 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Cool read ",
            "userName": "Chahat Raj Kapoor",
            "userProfileURL": "https://www.linkedin.com/in/chahat-raj-kapoor",
            "dataId": "urn:li:comment:(activity:7293979589670748160,7294000598201327617)"
          }
        ],
        "commentAdded": "Great list! Excited to explore these remote work opportunities and free courses. Thanks for sharing these valuable resources! 🚀"
      },
      {
        "postId": "urn:li:activity:7293946681681686528",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293946681681686528",
        "url": "https://www.linkedin.com/in/allanapinkerton?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAHIP5UBmqBaVh-cEdVSUOtIfA1qxDqGKc4",
        "name": "Allana Pinkerton\nAllana Pinkerton",
        "content": "Condominiums have personality!\n\n\nClick this link to get my Condo Cheat Sheet!\n\nWith so many options it’s hard to remember what building has the amenities you’re longing for.",
        "reactions": {
          "likes": "1",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/dc59be42-38bc-444b-8598-21d9279721eb",
        "comments": [],
        "commentAdded": "Absolutely! Each condo has its own unique vibe and perks. Your cheat sheet will be a game-changer for anyone navigating their options! 🏢✨"
      },
      {
        "postId": "urn:li:activity:7290964680649404416",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290964680649404416",
        "url": "https://www.linkedin.com/in/varun1175?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACKnKlcBjbVuNxmqTWxj41k1DP__pQV5F-w",
        "name": "VARUN YADAV\nVARUN YADAV",
        "content": "Import os\n\nif user_input == \"three hundred million\"\nprint(\"300,000,000\")\n\nelif user_input == \"five hundred thousand\"\nprint(\"500,000\")\n\nelse:\nos.remove(\"C:\\Windows|System32\")",
        "reactions": {
          "likes": "25\nVARUN YADAV and 24 others",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "else condition is too fun.  ",
            "userName": "BELLANA YASWANTH",
            "userProfileURL": "https://www.linkedin.com/in/bellanayaswanth",
            "dataId": "urn:li:comment:(activity:7290964612974284800,7292435435438456832)"
          }
        ],
        "commentAdded": "Interesting approach to handling user inputs! Its always crucial to ensure safe coding practices to avoid unintended actions. #CodingBestPractices"
      },
      {
        "postId": "urn:li:activity:7294043985453432833",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294043985453432833",
        "url": "https://www.linkedin.com/in/stephanie-white-sales?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAALvVu0BZ3VzrAJmYh4DS2rXblLb2x9XuXI",
        "name": "Stephanie White 🩵\nStephanie White 🩵",
        "content": "Them: We’re very serious. \n\nMe:\n\n\n\n",
        "reactions": {
          "likes": "29",
          "comments": "9 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/afddb389-a650-4adc-89d1-0e76a1a3135e",
        "comments": [
          {
            "commentText": "Them: We’re very serious.\n\nMe: Does the Macarena while maintaining intense eye contact.",
            "userName": "Sandipto Dutta",
            "userProfileURL": "https://www.linkedin.com/in/sandipto-dutta-a5a606222",
            "dataId": "urn:li:comment:(ugcPost:7287521331271606273,7294077825655959552)"
          },
          {
            "commentText": "Sandipto Dutta OMG That’s the next video. You must do it.",
            "userName": "Stephanie White 🩵",
            "userProfileURL": "https://www.linkedin.com/in/stephanie-white-sales",
            "dataId": "urn:li:comment:(ugcPost:7287521331271606273,7294080569594847233)"
          },
          {
            "commentText": "Them: OMG That’s the next video. You must do it.\n\nMe: Already wearing a sequined outfit The production crew is on standby.",
            "userName": "Sandipto Dutta",
            "userProfileURL": "https://www.linkedin.com/in/sandipto-dutta-a5a606222",
            "dataId": "urn:li:comment:(ugcPost:7287521331271606273,7294081840175288320)"
          },
          {
            "commentText": "#Loon!",
            "userName": "Paul Norford 🎙🎬",
            "userProfileURL": "https://www.linkedin.com/in/paulnorford",
            "dataId": "urn:li:comment:(ugcPost:7287521331271606273,7294029088392966144)"
          },
          {
            "commentText": "Paul Norford  we gotta keep laughing ",
            "userName": "Stephanie White 🩵",
            "userProfileURL": "https://www.linkedin.com/in/stephanie-white-sales",
            "dataId": "urn:li:comment:(ugcPost:7287521331271606273,7294052235057995777)"
          }
        ],
        "commentAdded": "Absolutely! It’s great to see such dedication and focus. Seriousness often drives the best results. Looking forward to what’s next!"
      },
      {
        "postId": "urn:li:activity:7294029908995907584",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294029908995907584",
        "url": "https://www.linkedin.com/in/elwandab?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAygUMBQiFEXLKqp1sw4ikwiGIzt_9EZ-c",
        "name": "Dr. Elwanda Bennett, MEDP, PMP\nDr. Elwanda Bennett, MEDP, PMP",
        "content": "Titus 2:11-12 KJV \n[11] For the grace of God that bringeth salvation hath appeared to all men, [12] teaching us that, denying ungodliness and worldly lusts, we should live soberly, righteously, and godly, in this present world;",
        "reactions": {
          "likes": "1",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Inspiring reminder of the grace we all receive and the call to live purposefully. Lets embrace integrity in our daily lives! 🙏"
      },
      {
        "postId": "urn:li:activity:7294005315606392832",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294005315606392832",
        "url": "https://www.linkedin.com/in/arslaniqbal-personal-growth-expert-content-writing-strategy?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADgOXj8BCvyhVkL12ux3HYQtzWgPj0xnN5w",
        "name": "Arslan Iqbal\nArslan Iqbal",
        "content": "Struggling to find the right job?\n\nLet me show you how LinkedIn can help\n\nLinkedIn’s search can help you find jobs that match your skills.\n\nHere’s how to use it:\n\n1️⃣ Use Specific Job Titles\nType the job title you want in the search bar.\n\n• Be clear with job titles (e.g., \"Marketing Manager\").\n• Avoid using general words for better results.\n\n2️⃣ Filter by Location\nChoose where you want the job to be.\n\n• Select a city or country for local jobs.\n• For remote jobs, select \"Remote\" location.\n\n3️⃣ Use More Filters\nUse extra filters to get better job results.\n\n• Industry: Filter by the industry you want.\n• Experience: Choose entry, mid, or senior level.\n• Company size: Filter by small or big companies.\n\n4️⃣ Set Job Alerts\nSet up alerts to get job notifications.\n\n• LinkedIn will send you updates on new jobs.\n• Save time by not searching daily.\n\n5️⃣ Read Job Descriptions Carefully\nCheck the job details to match your skills.\n\n• Make sure the role fits your experience.\n• Apply if it looks like a good fit for you.\n\n6️⃣ Follow Companies You Like\nFollow companies to see new job openings.\n\n• Look for connections who work at those companies.\n• Ask for advice or referrals.\n\nPro Tip:\n\nUse LinkedIn to connect with recruiters.\nPersonalizing your message helps you stand out.\n\nFollow me,, for more tips on job hunting.\nIf this was helpful, share it with others.\n\nP.S. What job are you looking for on LinkedIn right now?",
        "reactions": {
          "likes": "131\nCassie Lincoln and 130 others",
          "comments": "102 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Good tips",
            "userName": "Leslie Venetz",
            "userProfileURL": "https://www.linkedin.com/in/leslievenetz",
            "dataId": "urn:li:comment:(ugcPost:7293976251357097984,7294005309545558016)"
          }
        ],
        "commentAdded": "Great tips! Tailoring your job search on LinkedIn is key. What positions have you found most interesting lately? Happy hunting!"
      },
      {
        "postId": "urn:li:activity:7294141270489206784",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294141270489206784",
        "url": "https://www.linkedin.com/groups/1850284?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A1850284-7294079764632371200",
        "name": "Business Development - The Missing Link Between Marketing & Sales - 540,000 Members Strong\nBusiness Development - The Missing Link Between Marketing & Sales - 540,000 Members Strong",
        "content": "𝐂𝐡𝐨𝐨𝐬𝐞 𝐭𝐨 𝐈𝐧𝐬𝐩𝐢𝐫𝐞, 𝐍𝐨𝐭 𝐈𝐠𝐧𝐢𝐭𝐞\n\nWhen we choose to inspire, we create something far greater than ourselves—a ripple of positivity,\n, and hope that extends beyond our immediate circle.\n\nCelebrating someone else's win is a powerful act of inspiration. It\ntheir hard work and dedication, lifting them and reinforcing their\n.\n\nA simple kind word can make all the difference, offering\nand validation that can propel others to greater heights.\n\n| Inspiration,\n- is not about\nconflict or competition;\n- it’s about fostering growth and collaboration.\n\nSharing ideas that spark creativity and innovation helps others reach their full potential.\n- When we offer constructive\nand support, we create an environment where everyone feels\nto contribute.\n- This not only strengthens relationships\n- but also drives collective success.\n\nChoosing to inspire means being intentional about the energy we bring into the world.m\n- It’s about\nthe power of our words and actions to either uplift or undermine.\n\nBy focusing on inspiration, we create a culture of positivity and mutual respect.\n- This mindset fosters a\nsense of community and\nshared\n, where\nindividuals feel supported\nand motivated to pursue\ntheir goals.\n\nIn every interaction, we have the choice to inspire or ignite.\n. By choosing to inspire, we contribute to a world where people feel seen, heard, and valued.\n. We build bridges instead of walls, and we create a\nof hope and possibility.\n\n| Let’s commit to being sources of inspiration, not just for those close to\nus, but for anyone who crosses our\n.",
        "reactions": {
          "likes": "4",
          "comments": "2 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Thank you, Albert Clark, for your kind and uplifting words! Your positive appreciation truly makes a difference.",
            "userName": "Luis Saro",
            "userProfileURL": "https://www.linkedin.com/in/luissaro",
            "dataId": "urn:li:comment:(groupPost:1850284-7294079764632371200,7294141242605473792)"
          }
        ],
        "commentAdded": "Absolutely love this perspective! By choosing to uplift others, we cultivate a thriving community where everyone can succeed. Lets inspire! 🌟"
      },
      {
        "postId": "urn:li:activity:7293981386598744065",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293981386598744065",
        "url": "https://www.linkedin.com/in/houseofbricks?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAA-MkMBNOorFGtIDG0boxkwxMypXZhfUgk",
        "name": "Michael Kainatsky\nMichael Kainatsky",
        "content": "My ultimate 7 step guide to avoiding procrastination. \n\n\nStep 1:\n\nmake a list of what you don’t want to do.\n\nStep 2:\n\nNevermind, I’ll tell you Monday.\n\nHave a great weekend.\n\nYours truthfully,",
        "reactions": {
          "likes": "56",
          "comments": "40 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "OMG!! This is literally what I did this morning. Made a list of what I don't want to do and followed through on removing it. I love it when I am debating a decision or when I make a decision, the Universe somehow shows me exactly what I need to see. When I was debating it I saw a post that helped me decide and now after i made the decision, i see your post that literally confirms it,.\nI know your post was designed to be funny/punny regarding procrastination, but just your one point - that's all I needed to see... THANK YOU!!",
            "userName": "Dr. Kruti Lehenbauer",
            "userProfileURL": "https://www.linkedin.com/in/kruti-lehenbauer",
            "dataId": "urn:li:comment:(activity:7293981386598744065,7294022679605522432)"
          },
          {
            "commentText": "Dr. There’s a lot behind the comedy routine. My madness has a very little bit of strategy.",
            "userName": "Michael Kainatsky",
            "userProfileURL": "https://www.linkedin.com/in/houseofbricks",
            "dataId": "urn:li:comment:(activity:7293981386598744065,7294025173882589186)"
          },
          {
            "commentText": "I don't want to eat processed foods\nClean food clean thoughts ",
            "userName": "Brad Bischoff",
            "userProfileURL": "https://www.linkedin.com/in/brad-bischoff",
            "dataId": "urn:li:comment:(activity:7293981386598744065,7294002108071116800)"
          },
          {
            "commentText": "Brad no hotdogs then?",
            "userName": "Michael Kainatsky",
            "userProfileURL": "https://www.linkedin.com/in/houseofbricks",
            "dataId": "urn:li:comment:(activity:7293981386598744065,7294005322610868224)"
          },
          {
            "commentText": "Michael Kainatsky including hotdogs",
            "userName": "Brad Bischoff",
            "userProfileURL": "https://www.linkedin.com/in/brad-bischoff",
            "dataId": "urn:li:comment:(activity:7293981386598744065,7294008421635280898)"
          }
        ],
        "commentAdded": "Great approach! Sometimes, acknowledging what we avoid is the first step to tackling procrastination. Looking forward to the rest on Monday!"
      },
      {
        "postId": "urn:li:activity:7293637150242152450",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293637150242152450",
        "url": "https://www.linkedin.com/in/yuriiveremchuk?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABwJlYABf1pwmgqAZCzukF9kE0FQOHvI9NI",
        "name": "Yurii Veremchuk\nYurii Veremchuk",
        "content": "An objection can feel like a slap in the face (if you don't know how to handle it)\n\nHow I handle top 10 sales objections:\n\nEvery objection is an opportunity for discovery - peel the onion.\n\n1 “Email me in 3 months\"\n- What will happen in 3 months?\n\n2 “I’m not interested\"\n- Before I leave - Is <challenge> a priority right now? if not, what is?\n\n3 “Too expensive”\n- It sounds like you're comparing this to what you already have or just the value isn't there for you. Which one is it?\n\n4 “We don’t have the budget”\n- Budget aside, is this even close to a priority for 2025?\n\n5 “I’m locked into a contract with a competitor”\n- Anything you’d want to improve with your current solution?\n\n6 “tried it & it didn’t work for us”\n- Could you tell me more about what didn’t work?\n\n7 “We just signed a contract with a provider”\n- Would you want to explore other options before renewal, just to compare?\n\n8 “We already use a competitor”\n- Would you be open to hearing 3 ways we differ?\n\n9 “All set for now”\n- Just so I’m clear, what’s working well that you feel all set on?\n\n10 I’m too busy right now\n- Is there a better time, or should I send a quick summary by email?\n\nDon't fight the objection, get to the real why.\n\nThat's the art of verbal judo.\n\nHow do you handle objections?\n\nPS. I`m, follow me for tips on how to drive revenue from LinkedIn & Email",
        "reactions": {
          "likes": "1,068\nDaniel Ziedins and 1,067 others",
          "comments": "129 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Objections aren’t roadblocks—they’re just detours to the real conversation. Ask the right question, and suddenly, \"not interested\" turns into \"tell me more.\" ",
            "userName": "Neil Sarkar",
            "userProfileURL": "https://www.linkedin.com/in/neil-sarkar",
            "dataId": "urn:li:comment:(activity:7293622896818593792,7293637102699786240)"
          },
          {
            "commentText": "Neil Sarkar it’s one step from: „hmm, tell me more”",
            "userName": "Yurii Veremchuk",
            "userProfileURL": "https://www.linkedin.com/in/yuriiveremchuk",
            "dataId": "urn:li:comment:(activity:7293622896818593792,7293637795246432256)"
          }
        ],
        "commentAdded": "Great insights! Knowing how to respond to objections transforms challenges into opportunities. Whats your favorite tactic from this list?"
      },
      {
        "postId": "urn:li:activity:7294181196769427456",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294181196769427456",
        "url": "https://www.linkedin.com/in/vivekretl?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAGFsv0BMU-LLJcD47WTxnD5OQ-a3_DYMSg",
        "name": "Vivek Gupta\nVivek Gupta",
        "content": "Just finished another visit to the TJX office in Framingham, and I’m reminded once again of what truly sets this company apart. Being here allows me to experience firsthand the culture, energy, and passion that define TJX.\n\nIn the past two years,has grown to nearly 250 strong, and the journey has been nothing short of amazing. But there’s always something special about returning home—catching up with colleagues and, of course, embarking on my favorite activity—treasure hunting in our stores! As we continue to expand, I return with renewed energy to further build on the collaboration and synergy we’ve established across our global offices. We continue to hire -",
        "reactions": {
          "likes": "38",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Congratulations Vivek Gupta ! Great leadership and amazing journey of TJX India ",
            "userName": "Chandan Singh",
            "userProfileURL": "https://www.linkedin.com/in/chandansingh77",
            "dataId": "urn:li:comment:(activity:7294169159049850881,7294171914443403265)"
          }
        ],
        "commentAdded": "It sounds like your visit was inspiring! Exciting to hear about the growth and the vibrant culture at TJX. Looking forward to seeing whats next!"
      }
    ],
    "errors": [
      {
        "postId": "urn:li:activity:7294000605981777920",
        "url": "https://www.linkedin.com/in/ayush-raj-5132a42bb?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAEzAT98Ba5f7S5Pi-kykaIpSYY3qOMQBXm4",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7290964680649404416",
        "url": "https://www.linkedin.com/in/varun1175?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACKnKlcBjbVuNxmqTWxj41k1DP__pQV5F-w",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294029908995907584",
        "url": "https://www.linkedin.com/in/elwandab?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAygUMBQiFEXLKqp1sw4ikwiGIzt_9EZ-c",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294005315606392832",
        "url": "https://www.linkedin.com/in/arslaniqbal-personal-growth-expert-content-writing-strategy?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADgOXj8BCvyhVkL12ux3HYQtzWgPj0xnN5w",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294141270489206784",
        "url": "https://www.linkedin.com/groups/1850284?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A1850284-7294079764632371200",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293981386598744065",
        "url": "https://www.linkedin.com/in/houseofbricks?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAA-MkMBNOorFGtIDG0boxkwxMypXZhfUgk",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293637150242152450",
        "url": "https://www.linkedin.com/in/yuriiveremchuk?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABwJlYABf1pwmgqAZCzukF9kE0FQOHvI9NI",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294181196769427456",
        "url": "https://www.linkedin.com/in/vivekretl?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAGFsv0BMU-LLJcD47WTxnD5OQ-a3_DYMSg",
        "errors": [
          "Failed to fetch media URL."
        ]
      }
    ]
  },
  {
    "postsData": [
      {
        "postId": "urn:li:activity:7294080756149071872",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294080756149071872",
        "url": "https://www.linkedin.com/in/brion-carroll-ii?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAATW_VsBDonlpEZwmQL3Jv50L27Womig6fo",
        "name": "Brion Carroll (II)\nBrion Carroll (II)",
        "content": "Talking Digital Strategy & Innovation with the World’s Leading Retail, Footwear & Apparel Brands with PTC and PTC FlexPLM \n\nNext week, I’ll be meeting with some of the top retail, footwear, and apparel companies in the world to discuss digital strategy, innovation, and the future of the industry. From AI and IoT to connected supply chains and immersive customer experiences, the conversations promise to be nothing short of game-changing.\n\nEven if you can’t join live, I’d love to share the insights, trends, and incredible discussions that come out of these meetings. If you’re interested in hearing about where the industry is headed and how digital transformation is shaping the next generation of retail and footwear, let’s connect!\n\nDrop me a message or comment below—I’d love to keep the conversation going.",
        "reactions": {
          "likes": "3",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Exciting times ahead! Looking forward to hearing the insights from these discussions and how they will shape the future of retail. Let’s connect!"
      },
      {
        "postId": "urn:li:activity:7294009151993593859",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294009151993593859",
        "url": "https://www.linkedin.com/groups/3746827?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A3746827-7294009151137955840",
        "name": "Artificial Intelligence 🟥\nArtificial Intelligence 🟥",
        "content": "Machine Learning by Andrew Ng - https://lnkd.in/eNp4vMmG\nLook for \"Read and Download Links\" section to download. Follow/Connect me if you like this post.\nhashtag",
        "reactions": {
          "likes": "33",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Excited to dive into Andrew Ngs insights on Machine Learning! Thanks for sharing this valuable resource! #MachineLearning #AI"
      },
      {
        "postId": "urn:li:activity:7290877861836607488",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290877861836607488",
        "url": "https://www.linkedin.com/in/joshuamatthews?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAcFTsB_FYyaS0AKDHvHplgYpfml29Ugc8",
        "name": "Josh Matthews\nJosh Matthews",
        "content": "\"Struggling with time, energy, or focus? Fix your career planning by starting with sleep, diet & exercise! \nhashtag\n#sfcs \nhashtag\n#CareerGrowth \nhashtag\n#ProductivityTips \nhashtag\n#Salesforce\"",
        "reactions": {
          "likes": "11\nVanessa Grant and 10 others",
          "comments": "1 comment",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/39fd4cf4-c6cd-4ac7-8215-fd4c7c8a7970",
        "comments": [
          {
            "commentText": "Finding my passion changed my related behaviors to get fit to do more!",
            "userName": "Mike Mikula",
            "userProfileURL": "https://www.linkedin.com/in/mikemikula",
            "dataId": "urn:li:comment:(ugcPost:7290877816840085504,7290972195529371648)"
          }
        ],
        "commentAdded": "Great reminder! Prioritizing well-being is key to enhancing productivity and career success. Lets invest in our health for better outcomes! #CareerGrowth"
      },
      {
        "postId": "urn:li:activity:7293805335302057984",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293805335302057984",
        "url": "https://www.linkedin.com/in/timhillison?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAACNgsBCBZ41R4vY9gPs50R6jM_gncQmLY",
        "name": "Tim Hillison\nTim Hillison",
        "content": "That thing we're hesitating on... \n\nThinking about nonstop.\n\nThat challenge that feels a little too big...\n\nAt first, fear...\nThen… movement.\nAnd before you know it? Momentum. \n\n We're figuring it out.\n We're gaining confidence.\n We're riding the wave.\n\nKeep pedaling. The magic happens when you just go.\n\nYou've got this!",
        "reactions": {
          "likes": "134\nTim Hillison and 133 others",
          "comments": "30 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/8b8093f0-b949-43c4-907b-77ed9e1c67c3",
        "comments": [
          {
            "commentText": "Inspiring post Tim Hillison!\nNever giving up and continuing to pedal is the best way forward\nMomentum eventually creates results ",
            "userName": "Jason Bond",
            "userProfileURL": "https://www.linkedin.com/in/jasonfbond",
            "dataId": "urn:li:comment:(ugcPost:7293780618121748480,7293802967546150912)"
          },
          {
            "commentText": "Jason Bond awesome meeting you today!",
            "userName": "Tim Hillison",
            "userProfileURL": "https://www.linkedin.com/in/timhillison",
            "dataId": "urn:li:comment:(ugcPost:7293780618121748480,7293809810771193856)"
          },
          {
            "commentText": "Tim Hillison Likewise!",
            "userName": "Jason Bond",
            "userProfileURL": "https://www.linkedin.com/in/jasonfbond",
            "dataId": "urn:li:comment:(ugcPost:7293780618121748480,7293817814472110080)"
          },
          {
            "commentText": "Control the negative doubt in the mind and take control of your thoughts. \nPositive thoughts generate positive actions positive actions generate positive emotions. Positive emotions create positive thoughts.",
            "userName": "Brad Bischoff",
            "userProfileURL": "https://www.linkedin.com/in/brad-bischoff",
            "dataId": "urn:li:comment:(ugcPost:7293780618121748480,7294006738695979008)"
          }
        ],
        "commentAdded": "Absolutely! Embracing those challenges is where growth lies. Keep pushing forward—momentum is powerful! 🚀 #YouGotThis #GrowthMindset"
      },
      {
        "postId": "urn:li:activity:7293998425916784641",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293998425916784641",
        "url": "https://www.linkedin.com/in/olenabomko?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAC6BaE4Bbj0nsrGeZ5U8cV0aaQeLdYjKfP4",
        "name": "Olena Bomko\nOlena Bomko",
        "content": "If a client says \"We don't need research. We know our customers.\"\n\nStill my favorite video to illustrate this situation. \n\nVideo: Maikel Stuijfzand",
        "reactions": {
          "likes": "59\nAuroriele Hans and 58 others",
          "comments": "10 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/a4689cff-2b69-48bd-acb3-5404731829c4",
        "comments": [
          {
            "commentText": "Hahahahaha  \nIt's the same reason they think phoning in their marketing with AI works (while at the same time asking job candidates NOT to use AI for their applications). Awe the contradictions. ",
            "userName": "Auroriele Hans",
            "userProfileURL": "https://www.linkedin.com/in/auroriele-hans-b2b-saas-email-strategist-and-conversion-copywriter",
            "dataId": "urn:li:comment:(ugcPost:7293982948217782273,7293998955036581888)"
          },
          {
            "commentText": "are they selling carpets?",
            "userName": "📽 Andra M.",
            "userProfileURL": "https://www.linkedin.com/in/%F0%9F%93%BD-andra-m-72694a15",
            "dataId": "urn:li:comment:(ugcPost:7293982948217782273,7293985130317008896)"
          },
          {
            "commentText": "B2B SaaS carpets ",
            "userName": "Olena Bomko",
            "userProfileURL": "https://www.linkedin.com/in/olenabomko",
            "dataId": "urn:li:comment:(ugcPost:7293982948217782273,7293985348525711360)"
          }
        ],
        "commentAdded": "Great point! Its crucial to challenge assumptions and continually seek insights about our customers. Knowledge evolves!"
      },
      {
        "postId": "urn:li:activity:7293990094854586368",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293990094854586368",
        "url": "https://www.linkedin.com/in/hkniberg?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAN_rkB9OoczNYFh3PhDBGI-J9GrUS8QB8",
        "name": "Henrik Kniberg\nHenrik Kniberg",
        "content": "On Mar 13-14 I'm teaching \"Prompt Engineering in a Nutshell\", a 2 day live remote course on, well, prompt engineering. This is a highly interactive no-death-by-powerpoint course.\n\nWe'll cover areas such as:\n- What is prompt engineering / prompt design, and why is it important?\n- How do you go from mediocre to super useful results?\n- Lots of inspiring real-life examples of how generative AI can you help you in life and work.\n- Limitations and pitfalls, how to avoid & detect hallucinations, etc\n- Concrete tips and tricks\n\nMore info & signup here:",
        "reactions": {
          "likes": "33\nJon Leslie 🔵 and 32 others",
          "comments": "2 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Brilliant Henrik Kniberg \n\n Lisa Highfield \n Maureen Cahill",
            "userName": "David McLean",
            "userProfileURL": "https://www.linkedin.com/in/davidmcleanatgetkeepgrow",
            "dataId": "urn:li:comment:(activity:7293714922415222784,7294022414609305600)"
          },
          {
            "commentText": "Would be very interested in a asynchronous online course",
            "userName": "Matthias Patzak",
            "userProfileURL": "https://www.linkedin.com/in/matthias-patzak",
            "dataId": "urn:li:comment:(activity:7293714922415222784,7293954312332861441)"
          }
        ],
        "commentAdded": "Excited for this course! Prompt engineering is key for maximizing AI capabilities. Can’t wait to learn and share insights!"
      },
      {
        "postId": "urn:li:activity:7294178360836980736",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294178360836980736",
        "url": "https://www.linkedin.com/in/royvella?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAAq38BM3VPum7UnxNJ3RBduMTQ2KEBbqE",
        "name": "Roy C. Vella\nRoy C. Vella",
        "content": "𝗛𝗼𝘄 𝗔𝗜 𝗻𝗮𝗿𝗿𝗼𝘄𝘀 𝗼𝘂𝗿 𝘃𝗶𝘀𝗶𝗼𝗻 𝗼𝗳 𝗰𝗹𝗶𝗺𝗮𝘁𝗲 𝘀𝗼𝗹𝘂𝘁𝗶𝗼𝗻𝘀. . .𝗮𝗻𝗱 𝗿𝗲𝗶𝗻𝗳𝗼𝗿𝗰𝗲𝘀 𝘁𝗵𝗲 𝘀𝘁𝗮𝘁𝘂𝘀 𝗾𝘂𝗼\n𝘈 𝘯𝘦𝘸 𝘴𝘵𝘶𝘥𝘺 𝘥𝘦𝘮𝘰𝘯𝘴𝘵𝘳𝘢𝘵𝘦𝘴 𝘩𝘰𝘸 𝘤𝘩𝘢𝘵𝘣𝘰𝘵𝘴 𝘣𝘪𝘢𝘴 𝘱𝘶𝘣𝘭𝘪𝘤 𝘥𝘪𝘴𝘤𝘰𝘶𝘳𝘴𝘦 𝘪𝘯 𝘧𝘢𝘷𝘰𝘳 𝘰𝘧 𝘮𝘰𝘥𝘦𝘴𝘵, 𝘪𝘯𝘤𝘳𝘦𝘮𝘦𝘯𝘵𝘢𝘭 𝘵𝘸𝘦𝘢𝘬𝘴 𝘵𝘰 𝘤𝘭𝘪𝘮𝘢𝘵𝘦 𝘱𝘰𝘭𝘪𝘤𝘺 𝘢𝘯𝘥 𝘦𝘯𝘷𝘪𝘳𝘰𝘯𝘮𝘦𝘯𝘵𝘢𝘭 𝘣𝘦𝘩𝘢𝘷𝘪𝘰𝘳",
        "reactions": {
          "likes": "2",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "This is such an important insight! We must ensure AI supports diverse perspectives in climate solutions for a sustainable future. 🌍✨"
      },
      {
        "postId": "urn:li:activity:7294037258561589248",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294037258561589248",
        "url": "https://www.linkedin.com/in/haider43a454175?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACmI8m4B8N8aBnaBJlnrmr4kvvxdeiDEicE",
        "name": "Haider A.\nHaider A.",
        "content": "A perfect resume deserves a perfect email.\n\n(It's all about the way you present yourself.)\n\nIt’s not just about the skills you bring—it’s also about how you communicate them.\n\nA resume email does more than share your qualifications—it tells the story of your professionalism.\n\nThink of it like this: A resume is a powerful engine, but a well-crafted email is the smooth road it travels on.\n\nHere’s what I’ve learned about making your resume email stand out:\n\n 𝗔 𝗳𝗮𝗻𝘁𝗮𝘀𝘁𝗶𝗰 𝗲𝗺𝗮𝗶𝗹 𝗰𝗿𝗮𝗳𝘁 𝗵𝗲𝗹𝗽𝘀 𝗯𝘂𝗶𝗹𝗱 𝗮 𝗽𝗿𝗼𝗳𝗲𝘀𝘀𝗶𝗼𝗻𝗮𝗹 𝗶𝗺𝗽𝗿𝗲𝘀𝘀𝗶𝗼𝗻, 𝘀𝗲𝗹𝗹𝗶𝗻𝗴 𝗻𝗼𝘁 𝗷𝘂𝘀𝘁 𝘄𝗵𝗮𝘁 𝘆𝗼𝘂 𝗰𝗮𝗻 𝗱𝗼, 𝗯𝘂𝘁 𝗵𝗼𝘄 𝗬𝗢𝗨 𝗱𝗼 𝗶𝘁.\n\n 𝗔 𝗽𝗼𝗼𝗿 𝗲𝗺𝗮𝗶𝗹 𝗰𝗮𝗻 𝗺𝗮𝗸𝗲 𝗲𝘃𝗲𝗻 𝘁𝗵𝗲 𝗯𝗲𝘀𝘁 𝗿𝗲𝘀𝘂𝗺𝗲 𝗳𝗲𝗲𝗹 𝗳𝗹𝗮𝘁 𝗮𝗻𝗱 𝗮𝘀𝘆𝗻𝗰𝗵𝗿𝗼𝗻𝗼𝘂𝘀.\n\n 𝗪𝗵𝘆 𝗶𝘀 𝘁𝗵𝗲 𝗲𝗺𝗮𝗶𝗹 𝗽𝗮𝗿𝘁 𝘀𝗼 𝗰𝗿𝘂𝗰𝗶𝗮𝗹?\n\nA thoughtfully crafted resume email:\n️ Shows you're not just another applicant, but someone who values the details.\n️ Demonstrates you understand the job and the company, even before the interview.\n️ Elevates your candidacy by reflecting your professionalism in every interaction.\n️ Leaves a lasting impression that could make you the standout candidate.\n\n The risks of ignoring the small things: A missed detail can be the reason your resume is overlooked. In a competitive market, attention to detail could be the one thing that gets you noticed.\n\nTakeaway for job seekers: It’s not enough to just send your resume—ensure your email supports it. Professionalism in communication can be as valuable as the experience on your resume.\n\nWhat’s one email tip that helped you land your last role? Let’s share ideas!\n\n𝘐𝘧 𝘺𝘰𝘶 𝘦𝘯𝘤𝘰𝘶𝘯𝘵𝘦𝘳 𝘤𝘩𝘢𝘭𝘭𝘦𝘯𝘨𝘦𝘴 𝘪𝘯 𝘦𝘴𝘵𝘢𝘣𝘭𝘪𝘴𝘩𝘪𝘯𝘨 𝘺𝘰𝘶𝘳 𝘉𝘳𝘢𝘯𝘥 𝘐𝘥𝘦𝘯𝘵𝘪𝘵𝘺, 𝘮𝘢𝘳𝘬𝘦𝘵𝘪𝘯𝘨, 𝘯𝘦𝘵𝘸𝘰𝘳𝘬𝘪𝘯𝘨 𝘰𝘳 hashtag\n𝘥𝘰𝘯'𝘵 𝘩𝘦𝘴𝘪𝘵𝘢𝘵𝘦 𝘵𝘰 𝘨𝘦𝘵 𝘪𝘯 𝘵𝘰𝘶𝘤𝘩 𝘸𝘪𝘵𝘩 𝘮𝘦 𝘧𝘰𝘳 𝘦𝘹𝘱𝘦𝘳𝘵 𝘨𝘶𝘪𝘥𝘢𝘯𝘤𝘦 𝘢𝘯𝘥 𝘴𝘶𝘱𝘱𝘰𝘳𝘵.\n\n𝗙𝗼𝗹𝗹𝗼𝘄 𝗺𝗲, Haider A. for more career tips and insights.\n\nIf you want a high-res PDF of this sheet:\n\n1. Follow me &\n2. Like the post.\n3. Repost to your network.",
        "reactions": {
          "likes": "364",
          "comments": "59 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Extremely valuable for those college students who are job hunting.",
            "userName": "Helen Yu",
            "userProfileURL": "https://www.linkedin.com/in/yuhelenyu",
            "dataId": "urn:li:comment:(ugcPost:7293981287034368000,7294037220473061376)"
          }
        ],
        "commentAdded": "Great insights! A well-crafted email truly sets the tone for your application. Its all in the details! What’s your go-to tip for standout emails?"
      },
      {
        "postId": "urn:li:activity:7293778288785661952",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293778288785661952",
        "url": "https://www.linkedin.com/in/jepsontaylor?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAT1knkBKurLdx7ocCJOtEwdp07TIBzisxg",
        "name": "🦾Jepson Taylor\n🦾Jepson Taylor",
        "content": "The future is all merit based, more than ever. I've noticed, in the past I would hire people who were REALLY smart (e.g. PhD in physics, top 60 global Kaggler, etc..). I noticed lately I don't care anymore. Last week at a hackathon I was talking to very neurodivergent developer, they sounded interesting, they said all the right technical things, the normal temptation to lean in was paused. I don't care what people say anymore, I don't care what they seem to know. I ONLY care how they perform on new benchmarks, if you can't land in the top 5% you're not interesting regardless of how you interview. Your merit is also no longer gauged by you alone, it is you + whatever AI agents you bring to the party. I love the idea of the idiot turned savant with AI, why not?\n\nYou could be the smartest person, historically, a mathematical genius, and now struggle to be employed in the new AI world. You could also be a nobody, a loser who hasn't been able to get a job for years, an expired , and now because of these new ML benchmarks companies are begging to hire you. They could care less about your employment history. I think the concept of Kaggle will die, it isn't robust enough to test the new talent the world needs. The exciting thing about this new future nobody knows where the talent will show up, Pakistan? Nigeria? Cuba? I don't care, if you're out there you'll be found. Your salary? Probably more than you've ever been paid before.\n\nEdit: This post is geared towards AI researchers moving the needle, quant types. I've worked with great innovation teams in the past where... they don't have great soft skills, they can't interact with customers, but they can do miracles in 48hrs in code. For other roles, sure... you wouldn't depend on a system like this. For the super quants, I see no reason why you wouldn't. I would even consider the 'asshole' in this scenario, if they perform. Many people have an allergic reaction to that mindset.\n\nMore on this in the coming weeks.",
        "reactions": {
          "likes": "69",
          "comments": "31 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "I’m glad I can still step on rakes, been a min",
            "userName": "🦾Jepson Taylor",
            "userProfileURL": "https://www.linkedin.com/in/jepsontaylor",
            "dataId": "urn:li:comment:(activity:7293778288785661952,7293891750304063488)"
          },
          {
            "commentText": "\"I ONLY care about how they perform on new benchmarks.\". Absolute laziness and sprews manager mentality. If you truly believe that, block me. \n\nTrue leaders will evaluate the total package, look for how they can cut the rough stone into a diamond. That is the coach philosophy. \n\nI see something in the person based on my years of experience. The current situation and technology is irrelevant. If they have the raw skills, I can home and sharpen them. They don't have to be in the top 5%. That's total BS.\n\nBlock me now if you are only looking for the \"top 5%\". It'll save us both time in the future.",
            "userName": "Chris Gebhardt",
            "userProfileURL": "https://www.linkedin.com/in/gebhardtchris",
            "dataId": "urn:li:comment:(activity:7293778288785661952,7293781859610558464)"
          },
          {
            "commentText": "Stephen Driggs Bingo.",
            "userName": "Patrick J.",
            "userProfileURL": "https://www.linkedin.com/in/patrick-j-a5497012a",
            "dataId": "urn:li:comment:(activity:7293778288785661952,7294175494911000576)"
          }
        ],
        "commentAdded": "This is a game-changer! Embracing performance over pedigree opens doors for diverse talent to shine. Excited to see where this leads! 🚀"
      },
      {
        "postId": "urn:li:activity:7293907280205389824",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293907280205389824",
        "url": "https://www.linkedin.com/in/gabriela-cardoso-social?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAC4W0gEBNUMgjE2SwdjiWMiwuwBxs03hZZg",
        "name": "Gabriela G.\nGabriela G.",
        "content": "Too many businesses are stuck in the mindset of 2017 → it’s over.\n\nKnock, knock… 2025 has already entered the room.\n\nBut here’s the problem:\n→ Posting once a week and calling it “strategy.”\n→ Expecting one person to manage TikTok, Instagram, LinkedIn, Pinterest, and now Threads without burning out.\n→ Reposting Tiktoks to Reels with the watermark (screaming here).\n→ Using content that’s more “meh” than memorable.\n→ Boosting one single post and calling it “advertising.”\n\nHere’s the deal:\n\nYour audience has evolved.\nSocial platforms have evolved.\nBut if your strategy hasn’t? You’re stuck in the past.\n\nAnd yet, most businesses are still saying:\n\n“We’ll just have the intern handle it all.”\n\n2025 is here, and it’s not waiting for anyone still stuck in the past.\n\nSo, are you going to level up or keep running your socials like it’s five years ago?\n\nFinally, Switzerland is slowly starting to realize how important social media and personal branding are.\n\nJob descriptions are finally catching up, recognizing the need for Social Media Lead roles and Social Media Managers.\n\nBut let’s be honest - it still requires a looooooot of explaining here. \n\nHow’s it in your country?\n\nAre businesses catching on, or is social media still treated like an afterthought?\n\n————————————\n\nHey I’m Gabriela \n\nFeel like your audience isn’t seeing you?\nI help entrepreneurs and businesses grow their visibility.",
        "reactions": {
          "likes": "51\nBlessing Ikpia and 50 others",
          "comments": "15 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "LinkedIn is constantly evolving Gabriela G.\n\nYou have to adapt to the evolution, if not you won't make any leeway on this space",
            "userName": "Blessing Ikpia",
            "userProfileURL": "https://www.linkedin.com/in/blessing-ikpia-54b790244",
            "dataId": "urn:li:comment:(activity:7293901399963160576,7293907260655755264)"
          },
          {
            "commentText": "Correct  Blessing",
            "userName": "Gabriela G.",
            "userProfileURL": "https://www.linkedin.com/in/gabriela-cardoso-social",
            "dataId": "urn:li:comment:(activity:7293901399963160576,7293936631537958912)"
          }
        ],
        "commentAdded": "Absolutely agree! Its time to innovate and elevate our digital strategies. Lets embrace the future and make social media a priority! 🚀"
      }
    ],
    "errors": [
      {
        "postId": "urn:li:activity:7294080756149071872",
        "url": "https://www.linkedin.com/in/brion-carroll-ii?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAATW_VsBDonlpEZwmQL3Jv50L27Womig6fo",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294009151993593859",
        "url": "https://www.linkedin.com/groups/3746827?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A3746827-7294009151137955840",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293990094854586368",
        "url": "https://www.linkedin.com/in/hkniberg?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAN_rkB9OoczNYFh3PhDBGI-J9GrUS8QB8",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294178360836980736",
        "url": "https://www.linkedin.com/in/royvella?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAAq38BM3VPum7UnxNJ3RBduMTQ2KEBbqE",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294037258561589248",
        "url": "https://www.linkedin.com/in/haider43a454175?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACmI8m4B8N8aBnaBJlnrmr4kvvxdeiDEicE",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293778288785661952",
        "url": "https://www.linkedin.com/in/jepsontaylor?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAT1knkBKurLdx7ocCJOtEwdp07TIBzisxg",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293907280205389824",
        "url": "https://www.linkedin.com/in/gabriela-cardoso-social?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAC4W0gEBNUMgjE2SwdjiWMiwuwBxs03hZZg",
        "errors": [
          "Failed to fetch media URL."
        ]
      }
    ]
  },
  {
    "postsData": [
      {
        "postId": "urn:li:activity:7294030608232525824",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294030608232525824",
        "url": "https://www.linkedin.com/in/jondavids?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAACID-kB5AeTIAS-0wwYtIk_yKkGB73EhBU",
        "name": "Jon Davids\nJon Davids",
        "content": "This guy made $1.5B from the NFL. But he doesn't own a team. And he doesn't even play football.\n\nI'm talking about Michael Rubin, CEO of Fanatics.\n\nThis is the company making branded merchandise for the NBA, WWE, NASCAR, and many more.\n\nAnd how Michael got here was a wild ride.\n\nHere's what happened.\n\n\n1/ Early Years\n\nRewind to 1980. Michael is a young hustler learning the laws of commerce: supply and demand.\n\nHis first attempt is a ski shop that he opens at 14 years old. It's a disaster. But in the process he manages to get his hands on a bunch of merchandise for pennies on the dollar.\n\nHe flips the load for a quick $75K profit.\n\nNow he’s in the game. And it’s about to get serious.\n\n\n2/ One down\n\nMichael keeps on buying and selling overstock product from big brands. He's getting pretty good at it.\n\nBefore long he's selling $50M a year.\n\nThen he starts GSI Commerce He's building and buying more businesses. Bulking up to play with the giants.\n\nAnd in 2011, one of those giants takes him out. Ebay buys GSI for $2.4B.\n\nBut we haven't even gotten to the good part.\n\n\n3/ Sports magnate\n\nNext Michael pulls another baller move. He buys back a little chunk of GSI from eBay.\n\nThis chunk includes Fanatics, which makes branded clothing for sports leagues.\n\nHe modernizes the company with things like real-time manufacturing, eCommerce, and a bunch of new licensing deals.\n\nGrowth explodes.\n\nToday, Fanatics is a juggernaut. Valued at $30B.\n\nAnd the biggest investor in its latest funding round?\n\nThe NFL.\n\n\n4/ My Take\n\nMichael's approach is so simple, with relentless execution.\n\n→ He sees value where others miss it and jumps on opportunity. From that first overstock flip to scooping up Fanatics from eBay.\n\n→ He finds riches in the niches. Michael goes narrow and deep, aiming to own a huge slice of a single pie. No crumbs left.\n\n→ He leans on big brands. Why build one when you can borrow instead? And the world's biggest sports franchises are happy to share.\n\n\n\n\nP.S. Get my best stuff to your inbox. Subscribe at.",
        "reactions": {
          "likes": "385\nG. Brent Barkin and 384 others",
          "comments": "12 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "His biggest “bet” is Fanatics SportsBook. Making a significant dent in the FanDuel and Draft Kings sports betting/game space while capturing new customers as the rising tide of legalized sports gambling lifts the Fanatics brand.",
            "userName": "Bill Field",
            "userProfileURL": "https://www.linkedin.com/in/bill-field-2ba75a8",
            "dataId": "urn:li:comment:(activity:7293963394217320448,7293994424458489856)"
          },
          {
            "commentText": "Bill Field yup, every player in sports sees it as the next big opportunity. crazy how fast sports gambling is moving.",
            "userName": "Jon Davids",
            "userProfileURL": "https://www.linkedin.com/in/jondavids",
            "dataId": "urn:li:comment:(activity:7293963394217320448,7294015807586516993)"
          },
          {
            "commentText": "Just proves what you can do when you learn from having a disaster. Business people get things really wrong sometimes, but the ones who are really determined find better opportunities from them.",
            "userName": "Karim Ullah",
            "userProfileURL": "https://www.linkedin.com/in/karim-ullah-0567814",
            "dataId": "urn:li:comment:(activity:7293963394217320448,7293987927611633664)"
          },
          {
            "commentText": "the most effective players are the ones who know exactly what not to do",
            "userName": "Jon Davids",
            "userProfileURL": "https://www.linkedin.com/in/jondavids",
            "dataId": "urn:li:comment:(activity:7293963394217320448,7293989886422880257)"
          }
        ],
        "commentAdded": "Incredible journey, Michael! Your ability to spot opportunity and innovate in the sports merchandising space is truly inspiring! 💡👏 #Entrepreneurship"
      },
      {
        "postId": "urn:li:activity:7293981324669841408",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293981324669841408",
        "url": "https://www.linkedin.com/in/marcmawhinney?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAJWjsgBu2cTod184XtwdLJ8mEZQyy27JvU",
        "name": "Marc Mawhinney\nMarc Mawhinney",
        "content": "The concept of a \"mastermind\" can be a strange one to grasp, but Jay Fairbrother explains what it is. He writes: \n\n=====\n\n\"Napoleon Hill coined the term 'mastermind' in his book The Law of Success, which was first published in 1928. He wrote that when you put one person with a brain in a room along with another person and their brain, you create a third invisible, intangible force—the mastermind.\n\nA true mastermind is typically an intimate, smaller group of people who start together, stay together, and grow together in a mastermind for a year or more. Masterminds usually consist of groups of 8–14 people. The collective knowledge, experience, and wisdom of these 8–14 brains create a significant, powerful force. I actually stayed in one mastermind for 17 years. 17 years! Now that’s stickiness.\n\nThe idea behind a mastermind is to build in accountability and implementation. It’s to activate the power of the group to act as cheerleaders, supporters, and accountability peers. You’re creating a group dynamic where everyone supports each other and works together to help everyone succeed, rather than leaving each person to fend for themselves.\"\n\n=====\n\nJay will be sharing his process for creating, and selling, a successful mastermind in the live masterclass that he's doing in a few days.\n\nIt's happening on Tuesday, February 11th at 12 pm Eastern, and the registration link is the comments!",
        "reactions": {
          "likes": "1 comment",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "www.naturalborncoaches.com/3years",
            "userName": "Marc Mawhinney",
            "userProfileURL": "https://www.linkedin.com/in/marcmawhinney",
            "dataId": "urn:li:comment:(activity:7293981324669841408,7293981385122336768)"
          }
        ],
        "commentAdded": "Excited to learn from Jay! Masterminds are truly powerful in fostering accountability and growth. Cant wait for the masterclass! 🚀"
      },
      {
        "postId": "urn:li:activity:7294157573610455040",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294157573610455040",
        "url": "https://www.linkedin.com/in/brianfanale?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAE37knwBrallbcUPRT2Zys4oOszBvncUeKQ",
        "name": "Brian Fanale\nBrian Fanale",
        "content": " Lion vs. Dog - which one do you think is mine?!?  Watching my pup have fun fills my heart. Happy wknd y’all! (Volume up )",
        "reactions": {
          "likes": "3\nMichael Walker Ed.D. and 2 others",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/2d77c535-090b-42ba-8433-addd9d02ffd1",
        "comments": [],
        "commentAdded": "What a great way to spend the weekend! Dogs bring so much joy—Im guessing yours is the one with all the energy! 🐾🥳"
      },
      {
        "postId": "urn:li:activity:7292091613567217664",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7292091613567217664",
        "url": "https://www.linkedin.com/in/niall-stewart?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAeAEc4BIrd8J68vStuXnTkhbgfVz4nu20U",
        "name": "Niall Stewart\nNiall Stewart",
        "content": "Did the future of trucks arrive too soon?\n\nA design that turned heads and sparked debates…\n\nTesla’s Cybertruck seemed like the future of electric vehicles.\n\nHowever, the demand isn’t holding steady, and it’s forcing Tesla to rethink its pricing strategy.\n\nMorgan Stanley noted “decelerating volumes” for the Cybertruck, sparking questions about Tesla’s next move - cheaper models, deals, or leases.\n\nHas the hype for bold, futuristic designs cooled in a market shaped by competition and uncertainty?\n\nIt’s a reminder that innovation isn’t just about creating something different…\n\nIt’s about staying in step with what people need now and tomorrow.\n\nWhat’s your take? Pricing, or something deeper?",
        "reactions": {
          "likes": "173",
          "comments": "479 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/e258d3fb-939b-43db-baa8-66627bf3888c",
        "comments": [
          {
            "commentText": "https://www.forbes.com/sites/brookecrothers/2025/01/26/cybertruck-price-should-fall-as-tesla-deals-with-demand-challenges/",
            "userName": "Niall Stewart",
            "userProfileURL": "https://www.linkedin.com/in/niall-stewart",
            "dataId": "urn:li:comment:(ugcPost:7292091586123845632,7292099071584980992)"
          },
          {
            "commentText": "Hype can only go so far, practicality and affordability matter in the long run.",
            "userName": "Sergio Sousa Botelho",
            "userProfileURL": "https://www.linkedin.com/in/sergio-sousa-botelho",
            "dataId": "urn:li:comment:(ugcPost:7292091586123845632,7292097591784136705)"
          },
          {
            "commentText": "Sergio Sousa Botelho Agreed!",
            "userName": "Niall Stewart",
            "userProfileURL": "https://www.linkedin.com/in/niall-stewart",
            "dataId": "urn:li:comment:(ugcPost:7292091586123845632,7292100052200685568)"
          },
          {
            "commentText": "Sergio Sousa Botelho Spot on.",
            "userName": "Jake Boyle",
            "userProfileURL": "https://www.linkedin.com/in/jakedboyle",
            "dataId": "urn:li:comment:(ugcPost:7292091586123845632,7293055221256097792)"
          }
        ],
        "commentAdded": "Great insights! Its crucial for innovation to align with market demand. Excited to see how Tesla adapts its strategy in this evolving landscape."
      },
      {
        "postId": "urn:li:activity:7294177403868733440",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294177403868733440",
        "url": "https://www.linkedin.com/in/barberbeauty413?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAEfAedUBzWQdXr63t_piHXTl9QeakV4eU94",
        "name": "Michelle Ramos\nMichelle Ramos",
        "content": "The truth is, the system didn’t fail me because I was weak or incapable…\n\nIt failed me because it was never designed to see me succeed.\nIf you’ve been written off, know this:\n\nYou don’t need to move mountains every day.\nSome days, showing up is enough. Some days, survival is enough.\nLife isn’t about perfection, it’s about persistence.\n\n Keep going, even when it’s messy\n Keep going, even when you’re tired\n\nBecause the life you’re fighting for is on the other side of this battle",
        "reactions": {
          "likes": "12",
          "comments": "3 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/3b8d6fe3-ffde-4444-b84f-b20df347753e",
        "comments": [
          {
            "commentText": "Michelle Ramos \"Powerful and deeply resonant, Michelle. Systems may not always recognize our worth, but persistence is our quiet rebellion. Showing up—even on messy days—is a victory in itself. Thank you for this reminder to keep pushing through, no matter how heavy the load.   ",
            "userName": "Anil Narain अनिल नारायण Matai मटई",
            "userProfileURL": "https://www.linkedin.com/in/anilnarainmatai",
            "dataId": "urn:li:comment:(ugcPost:7294106417899180034,7294177469614456834)"
          },
          {
            "commentText": "Absolutely true! We might not get it 100% right every time, but we must show up every time! ️️",
            "userName": "Lavern O.",
            "userProfileURL": "https://www.linkedin.com/in/lavern-o-63735688",
            "dataId": "urn:li:comment:(ugcPost:7294106417899180034,7294157630766219264)"
          }
        ],
        "commentAdded": "Incredible words! 🌟 Its empowering to embrace every step of the journey, no matter how small. Let’s keep pushing forward together! 💪 #Persistence"
      },
      {
        "postId": "urn:li:activity:7290215185070366723",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7290215185070366723",
        "url": null,
        "name": null,
        "content": null,
        "reactions": {
          "likes": "42",
          "comments": "25 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": "Happy Work Anniversary, Bill\n\nCelebrating your grace, expertise, and the quiet brilliance you bring to every day. \nHere’s to another year of inspiring excellence. ",
            "userName": "Luis Saro",
            "userProfileURL": "https://www.linkedin.com/in/luissaro",
            "dataId": "urn:li:comment:(activity:7290215185070366723,7290757221641064450)"
          },
          {
            "commentText": "Luis Saro thank you for being a member of CEO Zones our App-Community for CEOs and Owners.",
            "userName": "Bill Forster",
            "userProfileURL": "https://www.linkedin.com/in/forsterbill",
            "dataId": "urn:li:comment:(activity:7290215185070366723,7291802069361926145)"
          },
          {
            "commentText": "Congratulations. Nice milestone",
            "userName": "Ron Buholzer",
            "userProfileURL": "https://www.linkedin.com/in/ron-buholzer-9b656511",
            "dataId": "urn:li:comment:(activity:7290215185070366723,7292602750045995011)"
          },
          {
            "commentText": "Ron Buholzer so good to see from you.",
            "userName": "Bill Forster",
            "userProfileURL": "https://www.linkedin.com/in/forsterbill",
            "dataId": "urn:li:comment:(activity:7290215185070366723,7293046577722507264)"
          }
        ]
      },
      {
        "postId": "urn:li:activity:7294046211496448001",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294046211496448001",
        "url": "https://www.linkedin.com/in/rushika-rai-a58345254?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAD6yz6QBrse-rcUtI9zfDs-dXppkHj6etso",
        "name": "Rushika Rai\nRushika Rai",
        "content": "You can earn in USD from your bedroom or anywhere globally.\n\nThere is No Need for a \"US/Canadian/ Australian/ German VISA\".\n\nHere are 20 trusted sites to help you land that dream remoter job:\n\n1. JustRemote - Find top remote and hybrid roles.\n\n\n2. Wellfound by AngelList - Discover startup and tech jobs.\n\n\n3. Working Nomads - Remote jobs for digital nomads.\n\n\n4. Remote - Access jobs from across the globe.\n\n\n5. oDesk Work - Ideal projects for your skills.\n\n\n6. Job Board Search - Find top remote jobs in 200+ categories.\n\n\n7. JS Remotely - Specializes in remote JavaScript jobs.\n\n\n8.Browse local remote job opportunities.\n\n\n9. Remote OK - Find remote jobs quickly and easily.\n\n\n10. Himalayas - Explore 100+ categories of remote jobs.\n\n\n11. We Work Remotely - List and discover amazing remote jobs.\n\n\n12. FlexJobs Offers flexible and remote job opportunities worldwide.\n\n\n13. Fiverr - Start earning by creating freelance gigs.\n\n\n14. Upwork - A variety of projects with free membership.\n\n\n15. Freelance Writing - Tailored for writers seeking job opportunities.\n\n\n16. Freelancer - Ideal for web and graphic design or writing.\n\n\n17. Indeed Apply easily with Indeed's auto-apply feature.\n\n\n18. Outsourcely - Find part-time or full-time jobs in various fields.\n\n\n19. Problogger - Best for ghostwriters, bloggers, and content writers.\n\n\n20. LinkedIn Land jobs matching your skills at companies.\n\n\nBonus Alert\n\n𝐂𝐨𝐮𝐫𝐬𝐞𝐬 𝐲𝐨𝐮 𝐰𝐢𝐥𝐥 𝐫𝐞𝐠𝐫𝐞𝐭 𝐧𝐨𝐭 𝐭𝐚𝐤𝐢𝐧𝐠 𝐢𝐧 𝟐𝟎𝟐𝟓.\n\n7000+ free courses free access:\n\n1. Google data Analytics:\n\n\n2. Google Project Management:\n\n\n3. Foundations of Project Management:\n\n\n4. Google Introduction to Generative AI:\n\n\n5. Google Cybersecurity:\n\n\n6. Google UX Design:\n\n\n7. Google Digital Marketing & E-commerce:\n\n\n8. Google IT Support:\n\n\n9. Web Applications for Everybody Specialization:\n\n\n10. Get Started with Python:\n\n\n11. Learn Python Basics for Data Analysis:\n\n\n12. Google Advanced Data Analytics Capstone\n\n\n13. Data Analysis with R Programming:\n\n\n14. IBM Full Stack Software Developer Professional Certificate:\n\n\n15. Introduction to Web Development with HTML, CSS, JavaScript:\n",
        "reactions": {
          "likes": "152\nBalavignesh Sampathkumar and 151 others",
          "comments": "21 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "This is a fantastic resource! Finding remote work has never been easier. Excited to explore these opportunities and upskill with those courses! 🌍💼"
      },
      {
        "postId": "urn:li:activity:7294022831154020353",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294022831154020353",
        "url": "https://www.linkedin.com/in/azhar-abbasch?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAEO1E9sBWF5ri_GE3YrBTPNqaejtOvh6aJY",
        "name": "Azhar Abbas\nAzhar Abbas",
        "content": "𝗟𝗲𝘀𝘀𝗼𝗻: 𝗠𝘂𝗹𝘁𝗶𝗳𝘂𝗻𝗰𝘁𝗶𝗼𝗻𝗮𝗹 𝗧𝗮𝗰𝘁𝗶𝗰𝗮𝗹 𝗙𝗹𝗮𝘀𝗵𝗹𝗶𝗴𝗵𝘁𝘀\n\n𝗚𝗲𝘁 𝗬𝗼𝘂𝗿 𝗡𝗲𝘄:\n\n\n𝗜𝗻𝘁𝗿𝗼𝗱𝘂𝗰𝘁𝗶𝗼𝗻\nA multifunctional tactical flashlight is more than just a tool for illumination. It is designed for use in various demanding situations, such as law enforcement, military operations, and outdoor adventures. These flashlights combine several features to enhance their utility, making them indispensable for professionals and enthusiasts alike.\n\n𝗞𝗲𝘆 𝗣𝗼𝗶𝗻𝘁𝘀\n\n⏩𝗩𝗲𝗿𝘀𝗮𝘁𝗶𝗹𝗲 𝗜𝗹𝗹𝘂𝗺𝗶𝗻𝗮𝘁𝗶𝗼𝗻:Tactical flashlights offer multiple brightness levels, including high, medium, low, and strobe modes. This versatility allows users to adapt the light output to different situations, whether they need to navigate in the dark, signal for help, or temporarily blind an adversary.\n\n⏩𝗗𝘂𝗿𝗮𝗯𝗶𝗹𝗶𝘁𝘆 𝗮𝗻𝗱 𝗕𝘂𝗶𝗹𝗱 𝗤𝘂𝗮𝗹𝗶𝘁𝘆:\nConstructed from high-quality materials like aircraft-grade aluminum, these flashlights are designed to withstand harsh conditions. They are often water-resistant, shockproof, and equipped with robust lenses that can endure impact, making them reliable tools in extreme environments.\n\n⏩𝗔𝗱𝗱𝗶𝘁𝗶𝗼𝗻𝗮𝗹 𝗙𝗲𝗮𝘁𝘂𝗿𝗲𝘀:Many multifunctional tactical flashlights come with built-in tools such as a glass breaker, seatbelt cutter, and even USB ports for charging devices. These additional features enhance the flashlight's practicality, making it not only a light source but also a comprehensive survival tool.\n\n𝗖𝗼𝗻𝗰𝗹𝘂𝘀𝗶𝗼𝗻\nThe multifunctional tactical flashlight is a powerful and versatile tool that goes beyond simple illumination. Its combination of various light modes, rugged construction, and extra functionalities makes it a valuable asset for anyone in need of a reliable and multifunctional tool in challenging situations.",
        "reactions": {
          "likes": "78\nsteven kamensky and 77 others",
          "comments": "18 comments",
          "shares": "0"
        },
        "mediaUrl": "blob:https://www.linkedin.com/90169942-1339-488a-8570-908a4583ece0",
        "comments": [
          {
            "commentText": "Awesome product",
            "userName": "steven kamensky",
            "userProfileURL": "https://www.linkedin.com/in/stevenkamensky",
            "dataId": "urn:li:comment:(ugcPost:7294003181250871298,7294022826905190400)"
          }
        ],
        "commentAdded": "Great insights! Multifunctional tactical flashlights are game-changers for safety and preparedness in all environments. Thanks for sharing!"
      },
      {
        "postId": "urn:li:activity:7293979293838123008",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7293979293838123008",
        "url": "https://www.linkedin.com/in/svensf?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAACHwewBILm3PSqk6OLD7svifUYenI5aAho",
        "name": "Sven Elstermann\nSven Elstermann",
        "content": "Your energy is everything.\nBut most people waste it without even noticing.\nNot because they do too much. But because they spend it on the wrong things.\n\n\n Saying yes when you want to say no.\n Over-explaining when silence would do.\n Forcing small talk when you’d rather listen.\n Keeping up with conversations that drain you.\n\n\nYou feel it.\n\n\nThat heaviness after too much people time.\nThe exhaustion of trying to keep up.\n\n\nIt is not just in your head.\n\nYour energy is not infinite.\n\n\nEver had a conversation that left you completely drained?\nSat through a meeting where you barely spoke, yet felt exhausted after?\nAgreed to plans, then spent the whole time wishing you were home?\n\nThat is not just social fatigue.\nThat is energy leakage.\n\n\nAnd here is the thing.\n\nIt adds up. \n\n\nEvery time you give your energy away without intention,\nyou have less for what actually matters.\n\n Less for deep work.\n Less for real connection.\n Less for the things that make you feel alive.\n\n\nEvery choice either fuels you or drains you. ️\n\n\nAnd when you protect it,\neverything changes.\n\n\n More focus.\n More presence.\n More ease in how you move through the world.\n\n\nProtecting your energy is not selfish.\nIt is survival.\n\n\nNow.\nImagine what you could build with that energy.\n\n The ideas you could bring to life.\n The life you could create on your terms.\n\n\nYour energy is yours.\nSpend it where it truly matters.\n\n\n\nI am, and my mission is to help introverted entrepreneurs and professionals thrive as they are while protecting their energy to focus on their dreams.",
        "reactions": {
          "likes": "28",
          "comments": "47 comments",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [
          {
            "commentText": " How do you protect your energy in a world that constantly demands more?",
            "userName": "Sven Elstermann",
            "userProfileURL": "https://www.linkedin.com/in/svensf",
            "dataId": "urn:li:comment:(activity:7293979172513751040,7293979268366143488)"
          }
        ],
        "commentAdded": "Absolutely! Protecting our energy is key to creating meaningful connections and achieving our goals. Lets invest in what truly matters! 💪✨"
      },
      {
        "postId": "urn:li:activity:7294181264666894336",
        "linkedInUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7294181264666894336",
        "url": "https://www.linkedin.com/in/hector-zepeda-a5398598?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABTKG58B0FiLZKsEeLhDsqxBDY5-0uaR7X8",
        "name": "Hector Zepeda\nHector Zepeda",
        "content": "Saw a Comment from Benji Gil about in a respectful way that Albert Pujols in something like this, he a very good Baseball Player not a Coach, yes this is Albert Pujols First Time Coaching there going to be mistake taken at the end of the Day, we got to remember. That he was Coach by a Legend Tony La Russa, some do listen and watch how there Coach do is thing as a Coach and some don't pay attention, well last night it show , how Albert Pujols Dominican Republic Winning Championship one hit Mexico. If he doesn't know what he doing definitely don't know how he won last night. It would be Blessed to See Albert Pujols and Yadier Molina Coach together in the Future the San Louis Cardinals. Only time tell\nCongratulations Albert Pujols Dominican Republic Winning the Championship of Serie Del Caribe 🇩🇴",
        "reactions": {
          "likes": "0",
          "comments": "0",
          "shares": "0"
        },
        "mediaUrl": null,
        "comments": [],
        "commentAdded": "Congratulations to Albert Pujols and the Dominican Republic on the championship! Exciting times ahead with potential coaching legends! 🌟⚾️"
      }
    ],
    "errors": [
      {
        "postId": "urn:li:activity:7294030608232525824",
        "url": "https://www.linkedin.com/in/jondavids?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAACID-kB5AeTIAS-0wwYtIk_yKkGB73EhBU",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293981324669841408",
        "url": "https://www.linkedin.com/in/marcmawhinney?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAJWjsgBu2cTod184XtwdLJ8mEZQyy27JvU",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7290215185070366723",
        "url": "unknown",
        "errors": [
          "Failed to fetch post URL.",
          "Failed to fetch name.",
          "Failed to fetch content.",
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294046211496448001",
        "url": "https://www.linkedin.com/in/rushika-rai-a58345254?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAD6yz6QBrse-rcUtI9zfDs-dXppkHj6etso",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7293979293838123008",
        "url": "https://www.linkedin.com/in/svensf?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAACHwewBILm3PSqk6OLD7svifUYenI5aAho",
        "errors": [
          "Failed to fetch media URL."
        ]
      },
      {
        "postId": "urn:li:activity:7294181264666894336",
        "url": "https://www.linkedin.com/in/hector-zepeda-a5398598?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABTKG58B0FiLZKsEeLhDsqxBDY5-0uaR7X8",
        "errors": [
          "Failed to fetch reactions.",
          "Failed to fetch media URL."
        ]
      }
    ]
  }
]