{
  "posts": [
    {
      "postId": "urn:li:activity:7281274138252517376",
      "url": "https://www.linkedin.com/in/garettm?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAxhx8oBrMrQ4Rb6q9ZLv7KibK_ydWLFZCE",
      "name": "Garett Moreau 🇺🇸\nGarett Moreau 🇺🇸",
      "content": "️ ALERT: PLAYFULGHOST Targets VPN Users, and it ain’t pretty. \n\nThis powerful backdoor malware deceives users by trojanizing legitimate VPN apps, enabling keylogging, screen/audio capture, and remote shell access.",
      "reactions": {
        "likes": "22",
        "comments": "2 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "No doubt this account of mine is being shadowbanned.",
          "userName": "Garett Moreau 🇺🇸",
          "userProfileURL": "https://www.linkedin.com/in/garettm",
          "dataId": "urn:li:comment:(activity:7281274138252517376,7281827434205749251)"
        },
        {
          "commentText": "Garett Moreau 🇺🇸 yes sir",
          "userName": "George Pate",
          "userProfileURL": "https://www.linkedin.com/in/sp33d",
          "dataId": "urn:li:comment:(activity:7281274138252517376,7281837143709138945)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7286085712859299841",
      "url": "https://www.linkedin.com/in/matthew-t-rocha?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACOiQHgBfOIbKH42GFVzDcOt1Lbk16fRBZ4",
      "name": "Matt Rocha\nMatt Rocha",
      "content": "I routinely check my spam and respond to bad emails on occasion. \n\nWhat is alarming to me is the amount of technical or technical persona focused solutions that are selling poorly via emails that land in spam and have zero thought of what to say to THE HARDEST persona group you can target (Eng/IT leaders)\n\nIt’s a bunch of low effort garbage. That’s the bar.\n\nIf you’re selling to this group you have to come correct.\n\nIf you’re selling poorly to this group, you’re playing the game on hard mode, with a blind fold, and a banana with electrodes barely attached to it as a controller.\n\nYou will go out of business unless your solution basically sells itself or you have someone that actually knows what they’re doing working there.",
      "reactions": {
        "likes": "1",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": []
    },
    {
      "postId": "urn:li:activity:7282388308758802432",
      "url": "https://www.linkedin.com/in/robertsjeff?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAeZvQUBybFX1rFWHMOHhOcZiZKlyH6HX5k",
      "name": "Jeff Roberts\nJeff Roberts",
      "content": "AI in Hiring—Opportunity or Obstacle?\n\nA recent NBC News article highlights how AI is reshaping the hiring process, streamlining applications and helping companies manage massive volumes of resumes. It sounds like a win-win: faster hiring for employers and easier applications for job seekers. But here's the catch—it might also be unintentionally creating new barriers.\n\nThe article explores concerns about bias and the over-reliance on algorithms, which could leave qualified candidates overlooked. It's a reminder that while AI can bring efficiency, we can't lose sight of fairness and the human side of hiring.\n\nThis sparks an important question: As AI takes on more roles in recruitment, how do we ensure it supports fairness in hiring rather than undermining it?\n\nRead more on NBC News:",
      "reactions": {
        "likes": "8",
        "comments": "4 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "It's not streamlining anything. Utilizing AI just forces candidates to adjust and \"play the game\". They'll start slipping in the key words that AI is set to look for in a partciular role, and now you're right back to square 1 of heating out all the smelt to get to the ore.\n\nIn my last job search I was specifically referred to apply for a role by an internal employee of that company, and their HR recruiter for that particular role told me he had to go manually look for my resume because the AI filtering rejected my application.\n\nThat should tell you everything you need to know about how \"useful\" it is.",
          "userName": "Joseph M.",
          "userProfileURL": "https://www.linkedin.com/in/josephdmonk3",
          "dataId": "urn:li:comment:(activity:7282388308758802432,7282792120694841344)"
        },
        {
          "commentText": "Agree Joseph - so far anyway ",
          "userName": "James Del Monte",
          "userProfileURL": "https://www.linkedin.com/in/delmonte",
          "dataId": "urn:li:comment:(activity:7282388308758802432,7282813187333279744)"
        },
        {
          "commentText": "It's a strange scenario that HR is using AI to find humans to create agents that replace humans to do work. Jeff Roberts\n\nUsed properly, AI can augment humans by better sorting candidates than a human can. So, some of those hacks are removed.\n\nThe end result will only matter if the code is designed to find the right candidate rather than the one that looks best. I have personally worked with some ding dongs that came from the finest MBA programs in the world.",
          "userName": "John Lane",
          "userProfileURL": "https://www.linkedin.com/in/johntlane",
          "dataId": "urn:li:comment:(activity:7282388308758802432,7282405776432738305)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7286023852256636929",
      "url": "https://www.linkedin.com/in/stevelitzow?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAOjBwBP9nWnY_-6KWhJLV-EzTXeRDsxTg",
      "name": "Steve Litzow\nSteve Litzow",
      "content": "Big deal about to close... but it’s not the ICP?\n\nWhen I work on refining sales strategies for scale ups, I always include a validation step.\n\nIt comes after the proposal and negotiation.\n\nIt’s an internal step for:\n– The CEO or VP of Sales to review the deal.\n– The SDR or sales manager to self-analyze.\n– An item to discuss during weekly or monthly deal reviews.\n\nThe key focus of validation?\n\nDouble-check the customer still fits your ICP.\n\nIt’s overlooked because:\n– The SDR wants to hit quota.\n– The sales manager wants to hit quota.\n– Or simply, the revenue is too tempting to resist.\n\nBut if you’re serious about scaling to 8 or 9 figures, you must take this step.\n\nYou must reconsider going ahead if the ICP isn’t the right fit.\n\nHere’s why…\n\nI recently read a story from Jake Fuentes, co-founder of Cascade, about why he shut his startup down.\n\nHe admitted that “ICP fray” was a key factor.\n\nCascade initially defined their ICP as “nontechnical business analysts using Excel to crunch big data sets”.\n\nThe definition was too broad.\n\nThey ended up chasing customers with wildly different use cases:\n– A scooter company managing location data.\n– An HR team managing employee data.\n\nThey didn’t have a framework to accept or reject opportunities, so they tried to support them all.\n\nJake described this as “a slow death of a thousand cuts.”\n\nSupporting anyone and everyone pulled the company in a million directions, ultimately diluting their focus and stunting growth.\n\nIf you want to scale successfully, rejecting deals from prospects who don’t fit your ICP is the tough but necessary way forward.\n\nValidate every deal.\n\nStick to your guns.\n\nKeep closing.\n\nLike what you read? ️ Repost it to your network and follow Steve Litzow for more.\n\nWant to accelerate your sales? Join our community of CEOs & Sales Leaders subscribers today:",
      "reactions": {
        "likes": "18",
        "comments": "13 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Staying true to your ICP is crucial for growth. Misaligned deals might boost short-term revenue but often lead to inefficiencies and lost focus. Discipline here pays dividends!",
          "userName": "Neil Sarkar",
          "userProfileURL": "https://www.linkedin.com/in/neil-sarkar",
          "dataId": "urn:li:comment:(activity:7286008448524107776,7286023806983225345)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7286086022730235904",
      "url": "https://www.linkedin.com/in/bailey-spell-b487ab149?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACPkHqgBFRIIR8wrAMKvK-STAujABR37SB0",
      "name": "Bailey Spell\nBailey Spell",
      "content": "Silicon Valley is a crazy place. Crazy ambitious people, you live 1-2 years in the future, self-driving cars. But the most underrated part about this place is the willingness of people to help you without anything in return. It's amazing.and I came here knowing no one, and after being here for >1.5 years, we have received countless help, insight, and support from many people who had nothing to gain. This is one of the many magical secrets to the success of Silicon Valley and why nowhere else in the world can recreate this.",
      "reactions": {
        "likes": "8",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": []
    },
    {
      "postId": "urn:li:activity:7283467773542854658",
      "url": "https://www.linkedin.com/in/rutul-vadadoriya-07806b176?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACmn0JwB7P0KJQgjurJdHfZxqeOHwVTeTM4",
      "name": "Rutul Vadadoriya\nRutul Vadadoriya",
      "content": "I’ve always asked myself: What if I can’t make my clients happy?\n\nWhat if the real estate market is too hard to predict?\n\nWhat if I fail because of these doubts?\n\nI could think of 100 reasons to give up.\n\nBut you know what? Success happens when you take action.\n\nI once read, \"You only lose when you stop trying.\" That stayed with me.\n\nStill, I kept doubting myself.\n\"Oh, I might not close this deal.\"\n\nDid I really try to connect with my client?\n\"Oh, this market might not work for me.\"\n\nDid I spend time planning and thinking?\nThe other day, I looked back at my real estate work.\n\nI saw how much I’ve done—every sale, every happy client.\n\nIt made me realize none of it happened fast. It took effort, step by step.\n\nWould I have made it this far if I didn’t take action? No.\n\nFor you, it might be different. But don’t let doubts stop you.\n\nUse them to move forward.\n\nIt might be hard, but what if it works out?\n\nYou can do this.",
      "reactions": {
        "likes": "52",
        "comments": "2 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Doubts are natural, but taking action makes all the difference. Love this mindset!",
          "userName": "Apurva J.",
          "userProfileURL": "https://www.linkedin.com/in/iamapurvajoshi",
          "dataId": "urn:li:comment:(activity:7283467773542854658,7283470599140564993)"
        },
        {
          "commentText": "Always inspirational thoughts!! ",
          "userName": "Umang Parikh",
          "userProfileURL": "https://www.linkedin.com/in/umangparikh65",
          "dataId": "urn:li:comment:(activity:7283467773542854658,7283488950273343488)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7286057006866575360",
      "url": "https://www.linkedin.com/in/andy-jenkinson-96210727?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAWIcJoBxM0byv5xOwZw3Y9dfgGOwEwRPfM",
      "name": "Andy Jenkinson\nAndy Jenkinson",
      "content": "Cybersecurity and Infrastructure Security Agency Emergency Directive DNS Tampering and Abuse M-19-01 (5 years ago).\n\n''Background: In coordination with government and industry partners, the Department of Homeland Security (DHS) Cybersecurity and Infrastructure Security Agency (CISA) is tracking a series of incidents1 involving Domain Name System (DNS) infrastructure tampering.\n\nCISA is aware of multiple executive branch agency domains that were impacted by the tampering campaign and has notified the agencies that maintain them. Using the following techniques, attackers have redirected and intercepted web and mail traffic, and could do so for other networked services:''\n\n\n\nFor the full Emergency Directive:",
      "reactions": {
        "likes": "17",
        "comments": "4 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "From Cybersecurity and Infrastructure Security Agency Emergency Directive:\n\n''It is critical that organizations have accurate and up-to date inventories of all domain names that are owned or operated on their behalf.''",
          "userName": "Andy Jenkinson",
          "userProfileURL": "https://www.linkedin.com/in/andy-jenkinson-96210727",
          "dataId": "urn:li:comment:(activity:7286048186790498306,7286055679713312769)"
        },
        {
          "commentText": "Keep preaching my friend, thanks Andy Jenkinson",
          "userName": "Aaron Lax",
          "userProfileURL": "https://www.linkedin.com/in/aaron-lax",
          "dataId": "urn:li:comment:(activity:7286048186790498306,7286057024218357761)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7285925015542239235",
      "url": "https://www.linkedin.com/in/ikpia-blessing-isioma-54b790244?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADygsAsBE3EnPxCYA_zzPihIYwYLIfwhOQg",
      "name": "Ikpia Blessing Isioma\nIkpia Blessing Isioma",
      "content": "How to get started in Marketing without spending a Dime ($0)\n\nWhen I decided to pursue marketing, I had zero experience and no budget to pay for expensive courses. I remember sitting in my room, scrolling endlessly, wondering, How do I even start?\n\nThat’s when I stumbled upon free resources that didn’t just teach me the basics, they gave me the confidence to land my first freelance client.\n\nFast forward to today, I’ve built communities of 20,000+, led successful campaigns that led to over 100,000+ downloads in less than 48 hours and mentored aspiring marketers. All thanks to resources like these that gave me my foundation.\n\nAs your Marketing Big sister , I want you to have the same head start I did. Here are some amazing, FREE marketing courses you can start today:\n\n Content Marketing Certification – Learn how to create, promote, and analyze content like a pro.\n\n\n Social Media Marketing Certification – Master strategies for platforms like LinkedIn, Instagram, and more.\n\n\n Email Marketing Certification – Craft emails that convert and engage.\n\n\n Inbound Marketing Certification – Learn to attract customers through value-driven content.\n\n\n Affiliate Marketing by Ahrefs – Dive into affiliate marketing strategies.\n\n\n Marketing Course by edX – Explore comprehensive marketing topics.\n\n\nThese courses don’t just teach skills they build confidence, open doors, and set you up for success. Plus, you will also be getting a free certificate after taking these courses.\n\nIf you’ve been waiting for a sign to start your marketing journey, this is it because let’s be honest, Netflix isn’t adding ‘Certified Marketer’ to your resume, so get to Work\n\nLet me know which course you’ll be taking first—I’m here to cheer you on\n\nSeeing me for the first time? I'm, a Growth Marketer seeking to empower young/aspiring professionals in their professional journey by sharing my personal journey and resources like courses, mentorships, Job vacancies to those seeking global opportunities. Welcome to my world \n\nPS - The video below is an old video, currently we've trained over 26,000 persons in leveraging Artificial intelligence in their various fields.",
      "reactions": {
        "likes": "28",
        "comments": "25 comments",
        "shares": "0"
      },
      "mediaUrl": "blob:https://www.linkedin.com/0d2bf50f-f4d6-4e9f-84c8-98566859ef8b",
      "comments": [
        {
          "commentText": "Watching your own video feels so weird ",
          "userName": "Ikpia Blessing Isioma",
          "userProfileURL": "https://www.linkedin.com/in/ikpia-blessing-isioma-54b790244",
          "dataId": "urn:li:comment:(ugcPost:7285924963461599233,7285928283186077696)"
        },
        {
          "commentText": "Michael Olanike Thank you \n\nI feel tempted to take down the video but I wouldn't ",
          "userName": "Ikpia Blessing Isioma",
          "userProfileURL": "https://www.linkedin.com/in/ikpia-blessing-isioma-54b790244",
          "dataId": "urn:li:comment:(ugcPost:7285924963461599233,7285930799516839936)"
        },
        {
          "commentText": "My first video upload \n\nEven though it's an old video ",
          "userName": "Ikpia Blessing Isioma",
          "userProfileURL": "https://www.linkedin.com/in/ikpia-blessing-isioma-54b790244",
          "dataId": "urn:li:comment:(ugcPost:7285924963461599233,7285927953497022464)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7284941901957406720",
      "url": "https://www.linkedin.com/in/krishnakirang?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAE8zYQBfa2YXjIfujz5uSYm1zup6Hu1aRc",
      "name": "Krishna Kiran\nKrishna Kiran",
      "content": "Most people who started 2025 with big goals have already lost track. \n\nForget goals. Build systems.\n\nPresenting my summary of \"Atomic Habits” for people in tech.\nI picked the best 19 key ideas from the book. Bookmark this.\n\nMy goal with my \"QuickbookSummaries\" is to make great books accessible, and approachable and to give you 80% of the value of the book in under 15 mins.\n\n\"Atomic Habits\" by James Clear is the #1 book that had the most positive influence on my life.\n\nThe quality of your thinking = the quality of the ideas you consume.\nFollow along for more such gems.\n\nDo let me know what idea resonated the most with you.\n\n\nLive Sessions:\nSelf-Paced Workshops:",
      "reactions": {
        "likes": "429",
        "comments": "6 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Live Sessions: https://lnkd.in/gPu-YdPy\nSelf-Paced Workshops: https://lnkd.in/grVUWnQB",
          "userName": "Krishna Kiran",
          "userProfileURL": "https://www.linkedin.com/in/krishnakirang",
          "dataId": "urn:li:comment:(ugcPost:7284941901005275137,7284993700382814208)"
        },
        {
          "commentText": "Thanks for the reminder.\n\nI read this book.your summary is crisp and on point. Good revision :)",
          "userName": "Harmanpreet Singh",
          "userProfileURL": "https://www.linkedin.com/in/harmanpreet-singh-58194912b",
          "dataId": "urn:li:comment:(ugcPost:7284941901005275137,7285978434193760256)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7286033345845624832",
      "url": "https://www.linkedin.com/in/jodie-cook?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAXipigBjcr86ewfAu0nJyKsC4rX-wZj5Xk",
      "name": "Jodie Cook\nJodie Cook",
      "content": "To make money while you sleep:\n\nDo the work while you’re awake\n\nEveryone dreams of making endless passive income, but few know how to make it happen.\n\nThese ChatGPT prompts will help create digital products that keep going long after you log off.\n\nStep 1. Open ChatGPT\n\nStep 2. Work through the prompts:\n\n- Create your digital product\n- Build your sales system\n- Set up multiple streams\n- Price for profit\n- Scale what works\n\nStep 3. Transform your expertise into income streams that work while you rest.\n\nThe sooner you begin, the sooner you earn.",
      "reactions": {
        "likes": "131",
        "comments": "58 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Smart strategy—start small, scale big. ChatGPT makes passive income planning so accessible!",
          "userName": "Isar Meitis",
          "userProfileURL": "https://www.linkedin.com/in/isarmeitis",
          "dataId": "urn:li:comment:(ugcPost:7285565512502169600,7286033327210283010)"
        },
        {
          "commentText": "Isar Meitis exactly this!",
          "userName": "Jodie Cook",
          "userProfileURL": "https://www.linkedin.com/in/jodie-cook",
          "dataId": "urn:li:comment:(ugcPost:7285565512502169600,7286079473731461120)"
        }
      ]
    }
  ],
  "errors": [
    {
      "postId": "urn:li:activity:7281274138252517376",
      "url": "https://www.linkedin.com/in/garettm?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAxhx8oBrMrQ4Rb6q9ZLv7KibK_ydWLFZCE",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7286085712859299841",
      "url": "https://www.linkedin.com/in/matthew-t-rocha?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACOiQHgBfOIbKH42GFVzDcOt1Lbk16fRBZ4",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7282388308758802432",
      "url": "https://www.linkedin.com/in/robertsjeff?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAeZvQUBybFX1rFWHMOHhOcZiZKlyH6HX5k",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7286023852256636929",
      "url": "https://www.linkedin.com/in/stevelitzow?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAOjBwBP9nWnY_-6KWhJLV-EzTXeRDsxTg",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7286086022730235904",
      "url": "https://www.linkedin.com/in/bailey-spell-b487ab149?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACPkHqgBFRIIR8wrAMKvK-STAujABR37SB0",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7283467773542854658",
      "url": "https://www.linkedin.com/in/rutul-vadadoriya-07806b176?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACmn0JwB7P0KJQgjurJdHfZxqeOHwVTeTM4",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7286057006866575360",
      "url": "https://www.linkedin.com/in/andy-jenkinson-96210727?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAWIcJoBxM0byv5xOwZw3Y9dfgGOwEwRPfM",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7284941901957406720",
      "url": "https://www.linkedin.com/in/krishnakirang?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAE8zYQBfa2YXjIfujz5uSYm1zup6Hu1aRc",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7286033345845624832",
      "url": "https://www.linkedin.com/in/jodie-cook?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAXipigBjcr86ewfAu0nJyKsC4rX-wZj5Xk",
      "errors": [
        "Failed to fetch media URL."
      ]
    }
  ]
}