{
  "posts": [
    {
      "postId": "urn:li:activity:7284950518320295936",
      "url": "https://www.linkedin.com/in/cynthia-handal?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAx8-EYB9e9cP8rirMAHNj_Mdpr71jKq-pQ",
      "name": "Cynthia H.\nCynthia H.",
      "content": "realizing it's 2025 and the struggle is real....",
      "reactions": {
        "likes": "11",
        "comments": "1 comment",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "right on the hustle is real in 2025—but we keep pushing!",
          "userName": "Ronen R. Pessar",
          "userProfileURL": "https://www.linkedin.com/in/rpessar",
          "dataId": "urn:li:comment:(activity:7284932305410818048,7284950486649049088)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7284864735185879040",
      "url": "https://www.linkedin.com/in/warikoo?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABOlvUB-6uQpj5VtIz3pACOBVaAzOdTRBA",
      "name": "Ankur Warikoo\nAnkur Warikoo",
      "content": "Imagine you are driving at 50 kmph.\n\nAt that speed, the ride may seem boring but it can be enjoyable.\n\nYou don't have to brake often.\nYou don't have to honk often.\nYou can munch on something.\nHave a nice chat with your fellow passenger.\n\nAnd almost predictably arrive at your destination on time.\n\nNow compare that with driving at 80 kmph.\n\nThere is no peace.\nYou are cutting corners.\nBraking often, honking often.\nGetting angry at the slow ones in front of you.\nYou can't enjoy the music nor the company.\nYou are constantly looking at the road.\n\nAnd worse, all of this has increased the chances of an accident.\n\nIf you reach your destination, you will reach perhaps 2-3 mins earlier than the one at 50 kmph.\n\nThis is your career.\n\nThe 50 kmph driver represents the person who grows their career steadily.\n\nTaking time to learn.\nBuild relationships.\nThey value balance and sustainability.\n\nThey don’t chase shortcuts but still arrive at their goals predictably, safely, and with their peace intact.\n\nThe 80 kmph driver is the one chasing rapid success.\n\nHopping between jobs for titles, taking shortcuts to impress, neglecting health, and burning out in the process.\n\nThe journey becomes stressful, and even if they achieve success, it comes at a heavy price.\n\nYes, there will still be bumps and unexpected stops, even at 50 kmph.\nBut the ride will be much more enjoyable and far less draining.\n\nNo speed is worth it if it takes away your life.\n\nNo career path is worth it if it takes away your peace.",
      "reactions": {
        "likes": "1,976",
        "comments": "156 comments",
        "shares": "0"
      },
      "mediaUrl": "blob:https://www.linkedin.com/ced7b25c-edf8-4f78-a5a8-acee9e2fa188",
      "comments": [
        {
          "commentText": "This analogy beautifully captures the essence of a balanced career journey. It's a vital reminder that sustainable growth often leads to a more fulfilling experience, allowing us to savor our successes while maintaining our well-being. Thank you for sharing such insightful perspectives,.",
          "userName": "Priyank Ahuja",
          "userProfileURL": "https://www.linkedin.com/in/priyank-ahuja",
          "dataId": "urn:li:comment:(ugcPost:7284611968282288128,7284864725195046913)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7284966662510911488",
      "url": "https://www.linkedin.com/in/pejmanmilani?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAW_5OMBv5A_wj5y-24syQIXis4PPJP-Blo",
      "name": "Pejman Milani\nPejman Milani",
      "content": "Don't compare your chapter 1 to someone else's chapter 20.\n\nWe see overnight success.\nWe don't see the sleepless nights.\n\nWe see someone standing tall.\nWe don't see the stumbling it took to get there.\n\nThe struggles are temporary tangles on the long thread to success.\n\nIllustration by me ",
      "reactions": {
        "likes": "47",
        "comments": "18 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "I guess you went through this yourself too, right Pejman? Great illustration.",
          "userName": "Reinoud Driebergen",
          "userProfileURL": "https://www.linkedin.com/in/reinoud-driebergen-2461401a",
          "dataId": "urn:li:comment:(activity:7284962490264756224,7284963882027106304)"
        },
        {
          "commentText": "Reinoud Driebergen Could you tell? ",
          "userName": "Pejman Milani",
          "userProfileURL": "https://www.linkedin.com/in/pejmanmilani",
          "dataId": "urn:li:comment:(activity:7284962490264756224,7284964692567977984)"
        },
        {
          "commentText": "No but I figured!",
          "userName": "Reinoud Driebergen",
          "userProfileURL": "https://www.linkedin.com/in/reinoud-driebergen-2461401a",
          "dataId": "urn:li:comment:(activity:7284962490264756224,7284965056797159424)"
        },
        {
          "commentText": "I LOVE THIS. \"What We Dont' See\" reminds my of the childhood string game, \"Cat's Cradle.\" Before I knew how to play, I would always end up in knots. But with lots of practice, I figured it out and looked more like the successful entrepreneur!!!",
          "userName": "Alison S.",
          "userProfileURL": "https://www.linkedin.com/in/alison-s-3838a1184",
          "dataId": "urn:li:comment:(activity:7284962490264756224,7284963541642571776)"
        },
        {
          "commentText": "That sounds like a fun childhood game Alison! I had no idea that's what that game was called!",
          "userName": "Pejman Milani",
          "userProfileURL": "https://www.linkedin.com/in/pejmanmilani",
          "dataId": "urn:li:comment:(activity:7284962490264756224,7284965289211899906)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7284909622631546881",
      "url": "https://www.linkedin.com/in/pulseiq?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAKtQQBTyDDpRxNvQB5uHPy8VZkb1b82Ug",
      "name": "Jerry Rassamni\nJerry Rassamni",
      "content": " Unleash the Adventure: 2024 Specialized Kenevo SL E-Bike! \n\nTrail lovers, your next adventure is here! The 2024 Kenevo SL Expert features the perfect balance of power, lightweight design, and trail-blazing innovation. Whether you're conquering steep mountains or cruising rugged landscapes, this e-bike redefines outdoor adventures.\n\n Strong New Motor: 50Nm torque—any trail is yours.\n 320 Watts of Power: Designed for endurance and longer, stronger rides.\n Lightweight Design: Built for speed, agility, and complete control.\n Trail Precision: Tackle the toughest terrain with confidence.\n\n 𝐖𝐡𝐲 𝐈𝐭 𝐒𝐭𝐚𝐧𝐝𝐬 𝐎𝐮𝐭\nThe Kenevo SL isn’t just a bike—it’s a statement. For those who stop at nothing and push boundaries, it delivers effortless climbs, thrilling descents, and unforgettable rides.\n\n 𝐖𝐡𝐚𝐭’𝐬 𝐘𝐨𝐮𝐫 𝐍𝐞𝐱𝐭 𝐀𝐝𝐯𝐞𝐧𝐭𝐮𝐫𝐞?\nWhere’s your dream trail destination? Share your ultimate trail goals below and tag your biking squad!\n\nIf this bike gives you goosebumps, give it a ️ and share with your fellow cyclists. Let the trail talk to you—will you heed the call?\n\n 𝐅𝐨𝐥𝐥𝐨𝐰 𝐦𝐞 for more updates on AI, innovation, and adventure!",
      "reactions": {
        "likes": "74",
        "comments": "5 comments",
        "shares": "0"
      },
      "mediaUrl": "blob:https://www.linkedin.com/6381682b-4e16-4c10-9622-e38ac2558d07",
      "comments": [
        {
          "commentText": "Love it",
          "userName": "Banamali sardar",
          "userProfileURL": "https://www.linkedin.com/in/banamali-sardar-800744248",
          "dataId": "urn:li:comment:(ugcPost:7283995984089489409,7284938296051281920)"
        },
        {
          "commentText": "Very cool E-Bike",
          "userName": "Jandeep Singh Sethi",
          "userProfileURL": "https://www.linkedin.com/in/mrjandeepsingh",
          "dataId": "urn:li:comment:(ugcPost:7283995984089489409,7284921653334044672)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7284905686113615872",
      "url": "https://www.linkedin.com/in/houseofbricks?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAA-MkMBNOorFGtIDG0boxkwxMypXZhfUgk",
      "name": "Michael Kainatsky\nMichael Kainatsky",
      "content": "Someone gave me a really nice compliment yesterday. \n\n\nShe said it was admirable that I didn't care what people thought\nof me on.\n\nWhile it's very much appreciated, I must be honest, too.\n\nThere is not really all that much to fear when it comes\npeople's thoughts of me on this platform.\n\nThe reason is that there's not many people thinking for\nthemselves on this platform.\n\nIt seems I am safe for the time being.\n\nI will continue to build amazing relationships and the rest. . .\n\nI'll be content with making the AI commenters look silly.\n\nYours truthfully,",
      "reactions": {
        "likes": "57",
        "comments": "56 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "You seem so buttoned up too…probably just a down to earth, wholesome person; naturally. Were you raised in a little house, on a prairie?",
          "userName": "Kenneth Robinson",
          "userProfileURL": "https://www.linkedin.com/in/kenneth-robinson-23548693",
          "dataId": "urn:li:comment:(activity:7284905686113615872,7284925693614858242)"
        },
        {
          "commentText": "Kenneth little cabin in USSR woods.",
          "userName": "Michael Kainatsky",
          "userProfileURL": "https://www.linkedin.com/in/houseofbricks",
          "dataId": "urn:li:comment:(activity:7284905686113615872,7284937663307022336)"
        },
        {
          "commentText": "Oooh a little Brezhnevka on the concrete prairie ",
          "userName": "Kenneth Robinson",
          "userProfileURL": "https://www.linkedin.com/in/kenneth-robinson-23548693",
          "dataId": "urn:li:comment:(activity:7284905686113615872,7284938594706694145)"
        },
        {
          "commentText": "I love that about you too. (And I know you only for like 2-3 weeks) You are the same across all posts/comments.",
          "userName": "Marina DeMarco",
          "userProfileURL": "https://www.linkedin.com/in/marina-demarco",
          "dataId": "urn:li:comment:(activity:7284905686113615872,7284908822639357952)"
        },
        {
          "commentText": "Marina that's very kind of you, I really try my best to remove the four sifter from all my posts and comments. ",
          "userName": "Michael Kainatsky",
          "userProfileURL": "https://www.linkedin.com/in/houseofbricks",
          "dataId": "urn:li:comment:(activity:7284905686113615872,7284911174645657601)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7284922960283328513",
      "url": "https://www.linkedin.com/in/daniel-goodman2001?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAeS6L0BdHsGXRto-nWwwPVPt8hNYJ4niZI",
      "name": "Dan Goodman\nDan Goodman",
      "content": "Rep increases severance 5x to $50k after wrongful termination.\n\nI consulted with an amazing salesperson and person named Briana. She was terminated after 11 months of employment despite being in two protected classes for age and a medical condition.\n\nBriana was recruited with lies and deceit and lured away from a good job she had for 5 years. Walking away from a strong pipeline of deals and a secure role.\n\nShe suffered through a sexist and toxic work environment for 11 months. One she stayed in way too long, given the damage it did to her confidence and outlook. Feeling mentally abused and tormented, leaving her a shell of her former self.\n\nBriana was terminated just weeks after providing constructive feedback to the CEO about her manager and process challenges. Just weeks prior to a significant one-year cliff equity vest from happening.\n\nShe was gaslit about false claims of performance despite never being put on a PIP or a word of concern about performance.\n\nBriana was blamed for a client issue caused by a VP 4 months earlier and sited as contributing factor for her termination. She was fired for performance despite not one member of the team having closed a single deal other than Briana that quarter.\n\nBriana was third female rep terminated without a PIP in the last 6 months, while 2 male counterparts failed two PIPs each and are still employed. No one on the team ever came close to hitting quota as the comp plan was setup so no one could.\n\nDuring her short tenure Briana penetrated a new market segment the company had been attempting to enter for years based solely on Briana’s outbound efforts.\n\nYet she was always made to feel that she was not as good as her male counterparts which led to her continuously questioning herself.\n\nTypically Briana was offered only 1 month severance worth $10k. Something she would never considering signing away her rights for.\n\nWe put together a scathing document proving the discrimination and mistreatment. The employer did not know what hit them. They confirmed receipt and came back with an offer of $25k, 250% more than originally offered.\n\nBriana desperately wanted to take the offer and move on. I convinced her there was a lot more to come and to go at least one more round.\n\nI always like to hear \"No\" at least once if not twice before giving in and even then, in many instances, we will escalate to the CEO or Board of Directors if necessary.\n\nWe turned the heat up on our next response and the employer doubled the offer from the last one, from $25k to $50k. I knew there was more to be had but Briana was done. She was satisfied and accepted the offer.\n\nIt was a trying and anxiety filled 10 days writing the document and negotiating a settlement. Briana is extremely proud of herself and feels on top of the world. She has her mojo back.",
      "reactions": {
        "likes": "55",
        "comments": "11 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "It's a great thing that you help people not just win just settlements, but win back their confidence as well. ",
          "userName": "Monique G.",
          "userProfileURL": "https://www.linkedin.com/in/moniqueldavis",
          "dataId": "urn:li:comment:(activity:7284922960283328513,7284937831590813696)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7284940533200797696",
      "url": "https://www.linkedin.com/in/theheathermonahan?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAF0rAQBOVWdVNf7xpxrla6SGSMTDiyvNHA",
      "name": "Heather Monahan\nHeather Monahan",
      "content": "There’s no such thing as “effortless.”\n\nI lost my job. It wasn’t pretty.\nI rebuilt my life from scratch. It wasn’t easy.\nI became a bestselling author. It took grit.\nI stepped on stage as a speaker. It took courage.\nI built my confidence. It took showing up every day.\n\nSuccess isn’t magic; it’s work.\nEvery “effortless” win has a grind behind it.\nEvery confident leader has battled self-doubt.\n\nDon’t fall for the myth.\nPut in the work. Push through the setbacks.\nYou’ll earn the life you deserve—and it’ll be worth it. \n\nDo you believe in effortless??",
      "reactions": {
        "likes": "397",
        "comments": "103 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": " Regardless of the situation, you have to put in the work!",
          "userName": "Ken Combs",
          "userProfileURL": "https://www.linkedin.com/in/sgtkenjrveteran",
          "dataId": "urn:li:comment:(activity:7284937981105176579,7284965424763478016)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7284915129064869888",
      "url": "https://www.linkedin.com/in/garima-jain-20b254237?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADryeSsBtUdKl5hUwm5Wy7TXXMH-QrEK1EE",
      "name": "Garima Jain\nGarima Jain",
      "content": "This made me quit LinkedIn for real.\n\nA real time story:\nI planned to organize an audio event on LinkedIn which is my fav thing to do lol.\n\nBut unfortunately, I found out that LinkedIn discontinued audio events (Heartbreak) \n\nThen, I planned to organize a LinkedIn Live but that also did not work because of some glitches.\n\nI was receiving messages on when I'll be live but I was helpless.\n\nAnd then I ended up doing an event on Google meet.\n\nIt was not a good day but definitely my best event.\n\nUndeniably, LinkedIn did this to simplify its events creation process and to focus more on video content.\n\nI wanted to quit LinkedIn?\n-- Not really lol\n\n\nLet's explore more of these LinkedIn new updates and experiment them ⭐",
      "reactions": {
        "likes": "73",
        "comments": "32 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "I love doing such events and network with more like minded people.\n\nSee you all next Sunday ⭐",
          "userName": "Garima Jain",
          "userProfileURL": "https://www.linkedin.com/in/garima-jain-20b254237",
          "dataId": "urn:li:comment:(activity:7284909572064976896,7284922078036705280)"
        },
        {
          "commentText": "Even I was puzzled as I had registered for the audio event Garima!\n\nMissed the event this time..",
          "userName": "Madhav Pangarkar",
          "userProfileURL": "https://www.linkedin.com/in/madhav-pangarkar",
          "dataId": "urn:li:comment:(activity:7284909572064976896,7284911654591459329)"
        },
        {
          "commentText": "⭐",
          "userName": "Garima Jain",
          "userProfileURL": "https://www.linkedin.com/in/garima-jain-20b254237",
          "dataId": "urn:li:comment:(activity:7284909572064976896,7284914143298535424)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7284748602617294848",
      "url": "https://www.linkedin.com/in/jatin-tiwari999?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABzgWV8BAv2cAXRI8kMu-4KnPnhRVlvtCI4",
      "name": "Jatin Tiwari\nJatin Tiwari",
      "content": "SAP Notes ️\n\nSAP Notes is a set of instructions to remove known errors from SAP systems. Using the Note Assistant tool, SAP Notes can be applied to the system.\n\nYou can access the Note Assistant tool using transaction SNOTE.\n\nRelease notes describe the new functions and changes in each SAP release. Using the Help menu, you can display release notes for any SAP application and release. ️\n\nYou can also search for release notes using keywords and attributes.\n\nWhenever you receive a new SAP release, you should review the release notes. The release notes describe new functions that may affect the task you perform in the system. ️\n\nThey also describe how to change customizing and installation parameters before upgrading from one SAP release to another.\n\nProcedure️\n\nYou can display release notes in the SAP Library or from within the SAP System.\nTo display release notes in the SAP system, proceed as follows:\n\nFrom the menu, choose Help > Release notes.\n\nThe Find Release Notes screen appears.\n\nFor a list of all release notes, choose Complete list 3.0/3.1 or Complete list from 4.0.\n\nHighlight the release notes for the SAP version you want to see and choose Choose.\n\nA hierarchical list of the available release notes appears, with plus signs to the left of every item that has sublists.\n\nDisplay one of the release note sublists by double-clicking it.️\n\nThe sublist appears, containing release notes, more sublists, or both. You can identify a set of release notes by the fact that no plus or minus sign appears to the left of it.\n\nRepeat step 3 until you see the desired release notes.\n\nDouble-click the release notes you want to display.️\n\nThe release notes appear. To print the selected release notes, choose Print.\nSearching for Release Notes\nYou can search for release notes by keyword or by attribute.\n\nA keyword is a term associated with a release note, such as \"Purchasing\" for release notes in purchasing.️\n\nAn attribute refers to the type of information the release note contains. You can narrow the search for release notes by choosing the attributes of the release notes you want to display.\n\nFor example, a release note has the attribute Changes to Customizing parameters if the new function requires a change in your system’s Customizing parameters. ️\n\nThus, if you want to display all release notes requiring a change to Customizing, you can list all release notes with this attribute.\n\nTo search for release notes: ️\n\nFrom the menu bar, choose Help -> Release notes.\n\nTo search by keyword, choose full-text search. ️\n\nTo search for release notes that contain only a certain type of information, choose Attribute search.\n\nEnter your search criteria (keywords or attributes).\n\nChoose Find. ️\n\nThe system displays any release notes that match your search criteria.️\n\nIf you found this useful, followfor more insights from the top 1% every week.\n\nMy SAP Community\n\n",
      "reactions": {
        "likes": "90",
        "comments": "6 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Very helpful Guide for the newbie to understand SAP Note Application !",
          "userName": "SanthaRam Sivalenka",
          "userProfileURL": "https://www.linkedin.com/in/santharamz",
          "dataId": "urn:li:comment:(ugcPost:7284748601358987264,7284766211819585537)"
        }
      ]
    }
  ],
  "errors": [
    {
      "postId": "urn:li:activity:7284950518320295936",
      "url": "https://www.linkedin.com/in/cynthia-handal?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAx8-EYB9e9cP8rirMAHNj_Mdpr71jKq-pQ",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7284966662510911488",
      "url": "https://www.linkedin.com/in/pejmanmilani?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAW_5OMBv5A_wj5y-24syQIXis4PPJP-Blo",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7284905686113615872",
      "url": "https://www.linkedin.com/in/houseofbricks?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAA-MkMBNOorFGtIDG0boxkwxMypXZhfUgk",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7284922960283328513",
      "url": "https://www.linkedin.com/in/daniel-goodman2001?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAeS6L0BdHsGXRto-nWwwPVPt8hNYJ4niZI",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7284940533200797696",
      "url": "https://www.linkedin.com/in/theheathermonahan?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAF0rAQBOVWdVNf7xpxrla6SGSMTDiyvNHA",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7284915129064869888",
      "url": "https://www.linkedin.com/in/garima-jain-20b254237?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADryeSsBtUdKl5hUwm5Wy7TXXMH-QrEK1EE",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7284748602617294848",
      "url": "https://www.linkedin.com/in/jatin-tiwari999?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABzgWV8BAv2cAXRI8kMu-4KnPnhRVlvtCI4",
      "errors": [
        "Failed to fetch media URL."
      ]
    }
  ]
}