{
  "posts": [
    {
      "postId": "urn:li:activity:7286023852256636929",
      "url": "https://www.linkedin.com/in/stevelitzow?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAOjBwBP9nWnY_-6KWhJLV-EzTXeRDsxTg",
      "name": "Steve Litzow\nSteve Litzow",
      "content": "Big deal about to close... but it’s not the ICP?\n\nWhen I work on refining sales strategies for scale ups, I always include a validation step.\n\nIt comes after the proposal and negotiation.\n\nIt’s an internal step for:\n– The CEO or VP of Sales to review the deal.\n– The SDR or sales manager to self-analyze.\n– An item to discuss during weekly or monthly deal reviews.\n\nThe key focus of validation?\n\nDouble-check the customer still fits your ICP.\n\nIt’s overlooked because:\n– The SDR wants to hit quota.\n– The sales manager wants to hit quota.\n– Or simply, the revenue is too tempting to resist.\n\nBut if you’re serious about scaling to 8 or 9 figures, you must take this step.\n\nYou must reconsider going ahead if the ICP isn’t the right fit.\n\nHere’s why…\n\nI recently read a story from Jake Fuentes, co-founder of Cascade, about why he shut his startup down.\n\nHe admitted that “ICP fray” was a key factor.\n\nCascade initially defined their ICP as “nontechnical business analysts using Excel to crunch big data sets”.\n\nThe definition was too broad.\n\nThey ended up chasing customers with wildly different use cases:\n– A scooter company managing location data.\n– An HR team managing employee data.\n\nThey didn’t have a framework to accept or reject opportunities, so they tried to support them all.\n\nJake described this as “a slow death of a thousand cuts.”\n\nSupporting anyone and everyone pulled the company in a million directions, ultimately diluting their focus and stunting growth.\n\nIf you want to scale successfully, rejecting deals from prospects who don’t fit your ICP is the tough but necessary way forward.\n\nValidate every deal.\n\nStick to your guns.\n\nKeep closing.\n\nLike what you read? ️ Repost it to your network and follow Steve Litzow for more.\n\nWant to accelerate your sales? Join our community of CEOs & Sales Leaders subscribers today:",
      "reactions": {
        "likes": "17",
        "comments": "12 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Staying true to your ICP is crucial for growth. Misaligned deals might boost short-term revenue but often lead to inefficiencies and lost focus. Discipline here pays dividends!",
          "userName": "Neil Sarkar",
          "userProfileURL": "https://www.linkedin.com/in/neil-sarkar",
          "dataId": "urn:li:comment:(activity:7286008448524107776,7286023806983225345)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7286000566244163584",
      "url": "https://www.linkedin.com/in/aditya-b-raghav-854020196?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAC3rxsABmoBo1W7fe7xXqFj1IhViTQ3h9kU",
      "name": "Aditya B. Raghav\nAditya B. Raghav",
      "content": "In today’s competitive landscape, businesses are continuously evolving their revenue strategies. One such method, though controversial, has emerged as a topic of debate: drip pricing.\n\nTake, for example. Their implementation of drip pricing, where additional charges are revealed during the booking process, instead before booking or preview, has sparked significant conversation. While this strategy may seem like a means to offer initial transparency, the consumer experience can often feel less than optimal when unexpected fees appear at the final stages.\n\nAs leaders in the business world, it is critical to recognize the balance between maximizing revenue and fostering customer trust. While drip pricing can boost short-term profits, it often runs the risk of alienating customers and eroding long-term brand loyalty.\n\nThe key takeaway here is that consumer experience and transparency must always remain at the forefront of any pricing strategy. Customers seek fairness and clarity. It’s not just about the bottom line—it’s about building a relationship founded on trust.\n\nTrue leadership in business lies not just in crafting profitable strategies, but in nurturing a relationship-driven approach that recognizes the value of the customer experience. After all, an organization’s reputation is its most valuable asset.\n\nAs we step forward into a new age of business practices, let us remember: Strategy isn’t just about numbers—it’s about people. Align your pricing strategy with your values, and success will follow.\n\n\n\nWhat do you think? Do comment",
      "reactions": {
        "likes": "0",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": []
    },
    {
      "postId": "urn:li:activity:7286050798633943041",
      "url": "https://www.linkedin.com/in/markselinger?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAS-U0BSId2P1_Cr002hApyc4sxYqlNS-Y",
      "name": "Mark Selinger\nMark Selinger",
      "content": "There's going to have to be a real balance between convenience and safety as agents learn about us and become more personalized. This inside knowledge will provide tangible benefits to anyone (good or evil) to exploit this data. How do we ensure our lives don't become open books for anyone willing to pay or hack their ways into them?",
      "reactions": {
        "likes": "3",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": []
    },
    {
      "postId": "urn:li:activity:7285730708264820736",
      "url": "https://www.linkedin.com/in/nick-king?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAK9QYABKfb6GA7FSnInQzopdySpvwWobPQ",
      "name": "Nicholas King\nNicholas King",
      "content": "It's been a while since I posted on LinkedIn. Mostly there weren't enough hours in the day between building, learning, and creating new things.\n\nNo predictions from me this year. But I will lay this up.\n\nA huge thanks to everyone who took the time to help us and the team last year. It means more to me every year about who takes the time to reach out, provide guidance, ask deep questions, and push the collective to be smarter. I'll always do my best to try do the same.\n\nJust to list a few of the people on my list in no particular order. But I appreciate you all.\n\nand many many more who aren't on LinkedIn.",
      "reactions": {
        "likes": "66",
        "comments": "6 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Let us thank you Nick....you're way too modest. Keep trailblazing! ",
          "userName": "Chas Dabhia",
          "userProfileURL": "https://www.linkedin.com/in/chas-dabhia-09ba88159",
          "dataId": "urn:li:comment:(activity:7285730708264820736,7286004977557241858)"
        },
        {
          "commentText": "It was an absolute pleasure to meet you earlier this year, Nick, and congrats on your many successes. Big thank you to Tom Lynch for the introduction.",
          "userName": "John Cooper",
          "userProfileURL": "https://www.linkedin.com/in/iamjohncooper",
          "dataId": "urn:li:comment:(activity:7285730708264820736,7286019607902011392)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7286084461887213570",
      "url": "https://www.linkedin.com/in/alliekmiller?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAUJVx4B0QKVo_UehWM6klZVZMXaC3wv25w",
      "name": "Allie K. Miller\nAllie K. Miller",
      "content": "We’re going to see a lot more job descriptions like this.\n\nIf you want to become AI-first, don’t miss my LinkedIn course on…literally just that:",
      "reactions": {
        "likes": "117",
        "comments": "20 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "This is a well written job description. I am assuming it was written by a human, not a chatbot.\n\nAs we continue dancing through the AI hype cycle, here's a question Allie:\nWho gets to set the standard for what an \"AI-first\" executive looks like, acts like, and leads like?\n\nCurrently I have not yet found a standards body. And every LLM provider might offer their own standards, which causes more confusion or bias.\n\nExciting times.",
          "userName": "- Lisa - Nirell",
          "userProfileURL": "https://www.linkedin.com/in/energizegrowth",
          "dataId": "urn:li:comment:(activity:7286079163390676994,7286084013578989569)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7286081389655961600",
      "url": "https://www.linkedin.com/in/dansalcius?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAQQRB0BhGf-sWGwq5X51yh5oxj2OWiVIkU",
      "name": "Dan Salcius\nDan Salcius",
      "content": "Can remote work improve creativity? \n\n73% of employers say creativity is a priority.\n\nHere's why I’m convinced:\n\nRemote work helps you find time for hobbies.\n\nAnd guess what? A fulfilling life outside of work make us more creative.\n\nBefore remote work, I dreamed of having more time to get outdoors and use my camera.\n\nBut the daily in-office routine consumed my life.\n\nThe commute alone sucked every ounce of creativity from me.\n\nThen I landed my first remote job. The transition wasn’t easy, but the time I got back daily improved my life.\n\nHaving time for photography made me more creative.\n\nBeing creative boosted my mood and energy—all of which flowed into my professional presence:\n\n-More confident\n-Open-minded about change\n-Showed up with fresh ideas more often\n-More drive to perform and grow\n\nAnd this experience isn’t unique to me.\n\nGet this: The World Economic Forum's Future of Jobs Survey reveals over 800 organizations want more creative employees.\n\nIs remote work the solution?\n\nP.S. Please please please don't underestimate the creative benefits of remote work.",
      "reactions": {
        "likes": "13\nJon Leslie 🔵 and 12 others",
        "comments": "5 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "The office = anxiety and distraction, both of which kill creativity.",
          "userName": "Jon Leslie 🔵",
          "userProfileURL": "https://www.linkedin.com/in/jondavidleslie",
          "dataId": "urn:li:comment:(ugcPost:7286079707110850561,7286081333498396672)"
        },
        {
          "commentText": "Jon Leslie  Yes, so much anxiety. I didn’t remember being an anxious young adult, but when I entered the workforce, I had panic attacks regularly. Remote work isn’t perfect, but anxiety is rarely on my mind.",
          "userName": "Dan Salcius",
          "userProfileURL": "https://www.linkedin.com/in/dansalcius",
          "dataId": "urn:li:comment:(ugcPost:7286079707110850561,7286084630888267776)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7286011555308019713",
      "url": "https://www.linkedin.com/in/christellemombozigah?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAUI1KEBERJpWhusHTKg37_oCjezy9vl3HE",
      "name": "✨ Christelle Mombo-Zigah\n✨ Christelle Mombo-Zigah",
      "content": " Why should everyone—regardless of gender, ethnicity, or race—be concerned about Digital Colorism? \n\nThrough over 20 interviews with AI-generated image users (B2C/B2U), AI companies, responsible AI advocates, health commissioners, and data governance professionals (B2B), I uncovered alarming patterns in how digital avatars —used for professional self-representation—distort and erase real identities.\n\nLearn more about how these findings reveal a troubling reality: digital avatars are not just inaccurate—they can reinforce biases, fuel insecurities, and exclude diverse identities.\n\nThank you to all the interviewees who made this research possible. Most want to stay anonymous, but they know who they are. ️",
      "reactions": {
        "likes": "16",
        "comments": "7 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Artificial intelligence is not a real intelligence (for now). That's the problem. \nI'm super excited about your work here  Christelle Mombo-Zigahyou are going into good direction ",
          "userName": "Tomasz Boinski",
          "userProfileURL": "https://www.linkedin.com/in/tomaszboinski",
          "dataId": "urn:li:comment:(ugcPost:7286011554867621888,7286036080808603648)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7286082854185316352",
      "url": "https://www.linkedin.com/company/forbes-magazine/posts",
      "name": "Forbes\nForbes",
      "content": "Nearly half (46%) of \nhashtag\n#workers said they would consider leaving their \nhashtag\n#job rather than return to full-time, in-office work if their current employer were to eliminate work-from-home options.\n\nCurrently, 75% of the survey respondents have a flexible work arrangement, either working fully from home or adopting a hybrid model that includes some remote work days.\n\nIn the debate over\npolicies, women show a slightly higher propensity (49%) to seek new employment compared to men (43%).\n\nYounger workers—under 50—demonstrate a significantly higher willingness to change jobs (50%) if remote work is eliminated than their older counterpart (35%).\n\nRead more:",
      "reactions": {
        "likes": "41",
        "comments": "2 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "The supply and demand factor will be interesting to see over the next 12 months. It's already proven to be a tough market for job seekers. ",
          "userName": "Bread | Jobs",
          "userProfileURL": "https://www.linkedin.com/company/breadjobs/posts",
          "dataId": "urn:li:comment:(activity:7286076338375995392,7286082022844821506)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7286035405022322689",
      "url": "https://www.linkedin.com/groups/762547?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A762547-7286035404145737729",
      "name": "Big Data 🟥 Data Science | Machine Learning | Deep Learning | Artificial Intelligence\nBig Data 🟥 Data Science | Machine Learning | Deep Learning | Artificial Intelligence",
      "content": "(Free Online Edition) Fundamentals of Data Visualization: Making Informative and Compelling Figures - https://lnkd.in/dtdGxdmZ\nLook for \"Read and Download Links\" section to download. Follow/Connect me if you like this post.",
      "reactions": {
        "likes": "24",
        "comments": "6 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "The download is not working",
          "userName": "Yusufu Gambo",
          "userProfileURL": "https://www.linkedin.com/in/yusufu-gambo-43984475",
          "dataId": "urn:li:comment:(groupPost:762547-7286035404145737729,7286044139614289921)"
        },
        {
          "commentText": "Yusufu Gambo Did you look the \"Read and Download Links\" section on the following page?\nhttps://freecomputerbooks.com/Fundamentals-of-Data-Visualization.html",
          "userName": "Ju Rao",
          "userProfileURL": "https://www.linkedin.com/in/maththinking",
          "dataId": "urn:li:comment:(groupPost:762547-7286035404145737729,7286056117577678849)"
        },
        {
          "commentText": "Useful tips",
          "userName": "Ishaq Al-haribat",
          "userProfileURL": "https://www.linkedin.com/in/ishaq-al-haribat-7448b4286",
          "dataId": "urn:li:comment:(groupPost:762547-7286035404145737729,7286057680903806976)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7286053571647688704",
      "url": "https://www.linkedin.com/in/isarmeitis?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAMB50B_3NCLMZCvxrShlDeX2sL4TyWZBs",
      "name": "Isar Meitis\nIsar Meitis",
      "content": "24 months ago I was battling imposter syndrome about transitioning into AI consulting... and yesterday, I trained a NASDAQ-listed company's leadership team on AI... right before they rang the closing bell! \n\nHere's the truth: Every organization that wants to stay relevant in 2025 needs an AI strategy. Not in 2026. Not when competitors force their hand. Now.\n\nMy journey has taught me this:\n\n A 36,000-employee enterprise I train regularly isn't fundamentally different from the 30-person startup I coach.\n\n The manufacturing CEO isn't different from the tech executive\n\n The tech-savvy aren't different from the tech-cautious\n\nThey all share one crucial insight: AI isn't just another tech wave – it's a business transformation tsunami.\n\nWhat gave me the confidence to guide these leaders?\n\n- My experience as a CEO of multiple companies\n- Deep roots in the tech world\n- An obsessive passion for understanding AI\n- A genuine drive to help others succeed\n- The time to go deep into the AI landscape\n\nBut here's what keeps me up at night: Too many businesses are sitting on the sidelines, watching the AI revolution unfold without a game plan.\n\n Reality check: The AI knowledge gap between companies is widening every week. Those investing in training today will leave others scrambling to catch up tomorrow.\n\nThe good news? It's not too late – but the window is closing fast.\n\n If you have any questions on how to get started, what are the different training options and what are the pros and cons of each, send me a DM, and I will gladly help you out.\n\nCurious: What's holding you back from investing in AI training for your team or yourself? (Time, other priorities, not knowing where to start, thinking AI is a passing buzz...) Please share in the comments and let's chat about it.\n\n\"",
      "reactions": {
        "likes": "18",
        "comments": "5 comments",
        "shares": "0"
      },
      "mediaUrl": "blob:https://www.linkedin.com/13c12751-529c-42f1-a550-1a6dc69cbdd1",
      "comments": [
        {
          "commentText": "Congratulations, Isar! Your story is inspiring and keeps me optimistic and motivated to keep pushing my own AI business journey",
          "userName": "Allison Paver",
          "userProfileURL": "https://www.linkedin.com/in/allisonpaver",
          "dataId": "urn:li:comment:(ugcPost:7286053522167529473,7286078862533238784)"
        },
        {
          "commentText": "Congrats Isar. I always enjoy your content and the value you bring!",
          "userName": "Sergey Gulak",
          "userProfileURL": "https://www.linkedin.com/in/sergeygulak",
          "dataId": "urn:li:comment:(ugcPost:7286053522167529473,7286074592710795265)"
        }
      ]
    }
  ],
  "errors": [
    {
      "postId": "urn:li:activity:7286023852256636929",
      "url": "https://www.linkedin.com/in/stevelitzow?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAOjBwBP9nWnY_-6KWhJLV-EzTXeRDsxTg",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7286000566244163584",
      "url": "https://www.linkedin.com/in/aditya-b-raghav-854020196?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAC3rxsABmoBo1W7fe7xXqFj1IhViTQ3h9kU",
      "errors": [
        "Failed to fetch reactions.",
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7286050798633943041",
      "url": "https://www.linkedin.com/in/markselinger?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAS-U0BSId2P1_Cr002hApyc4sxYqlNS-Y",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285730708264820736",
      "url": "https://www.linkedin.com/in/nick-king?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAK9QYABKfb6GA7FSnInQzopdySpvwWobPQ",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7286084461887213570",
      "url": "https://www.linkedin.com/in/alliekmiller?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAUJVx4B0QKVo_UehWM6klZVZMXaC3wv25w",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7286081389655961600",
      "url": "https://www.linkedin.com/in/dansalcius?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAQQRB0BhGf-sWGwq5X51yh5oxj2OWiVIkU",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7286011555308019713",
      "url": "https://www.linkedin.com/in/christellemombozigah?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAUI1KEBERJpWhusHTKg37_oCjezy9vl3HE",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7286082854185316352",
      "url": "https://www.linkedin.com/company/forbes-magazine/posts",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7286035405022322689",
      "url": "https://www.linkedin.com/groups/762547?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A762547-7286035404145737729",
      "errors": [
        "Failed to fetch media URL."
      ]
    }
  ]
}