{
  "posts": [
    {
      "postId": "urn:li:activity:7285355712052973569",
      "url": "https://www.linkedin.com/in/parth-sanghvi-humour-finance?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACrWWHIBmYh46hKHEhDWXQ-ljd36aXDIVp8",
      "name": "Parth Sanghvi\nParth Sanghvi",
      "content": "You can pick a new path, pivot, or even pause - whenever you feel ready. \n\nThere’s no shame in starting late, starting small, or even starting again.\n\nThe only thing that matters is this: are you doing it for you?\n\nTake a moment, think it through, and then take that first step.\n\nNo explanations needed.\nJust move forward.",
      "reactions": {
        "likes": "105",
        "comments": "37 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "It answers a lot of questions and make your path clear, ARE YOU DOING IT FOR YOU? \n\nAlso keep asking it, to check if you’re moving in the direction you need to :)",
          "userName": "Srushti Warhade",
          "userProfileURL": "https://www.linkedin.com/in/srushti-warhade-bb184817a",
          "dataId": "urn:li:comment:(activity:7285343485765783553,7285344620887085056)"
        },
        {
          "commentText": "Srushti Warhade self-introspection is very underrated in my opinion!",
          "userName": "Parth Sanghvi",
          "userProfileURL": "https://www.linkedin.com/in/parth-sanghvi-humour-finance",
          "dataId": "urn:li:comment:(activity:7285343485765783553,7285345818977456129)"
        },
        {
          "commentText": "Rightly said Parth\nCourage is required, skills can be learnt but it’s the courage that’s being lacked",
          "userName": "Devanshu Singh",
          "userProfileURL": "https://www.linkedin.com/in/devanshu-singh-0a7546200",
          "dataId": "urn:li:comment:(activity:7285343485765783553,7285344128555474945)"
        },
        {
          "commentText": "Devanshu, very aptly conveyed.",
          "userName": "Parth Sanghvi",
          "userProfileURL": "https://www.linkedin.com/in/parth-sanghvi-humour-finance",
          "dataId": "urn:li:comment:(activity:7285343485765783553,7285344763904466945)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7285357356228517888",
      "url": "https://www.linkedin.com/in/olukemi-adekunbi?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAxBY04BTxNvjf8QyR7Nz-F_yQnc0zDL64M",
      "name": "Kemi Adekunbi\nKemi Adekunbi",
      "content": "Wellness Wednesday \nDoctors don’t make you healthy\nTeachers don’t make you learn \nTrainers don’t make you fit\nCoaches don’t make you rich\nAt some point you have to understand that this life, your life is 100% your responsibility",
      "reactions": {
        "likes": "5",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Absolutely! Taking ownership of our lives is key to growth and success. Lets embrace accountability and pave our own paths! ",
          "userName": "Adamya Kumar",
          "userProfileURL": "https://www.linkedin.com/in/adamya-kumar-5947751ba",
          "dataId": "urn:li:comment:(activity:7285351319379296257,7285357982467469312)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7285354542211203072",
      "url": "https://www.linkedin.com/in/gordontredgold?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAwBvkBxAOSpQni6LD06Nx1ovwTlkiiTIo",
      "name": "Gordon Tredgold Globally Ranked Leadership Expert\nGordon Tredgold Globally Ranked Leadership Expert",
      "content": " 6 Keys to Creating Highly Engaged Teams \n\nIn today’s competitive landscape, fostering an engaged team is essential for driving success and innovation. Engaged teams are more productive, motivated, and committed to achieving organizational goals. Here are the 6 Keys to Create Engaged Teams:\n\n Be Accountable\n\nLead by Example: Demonstrate accountability in your actions and decisions. When leaders take responsibility, it sets a standard for the entire team.\nEncourage Ownership: Empower team members to take ownership of their tasks and outcomes, fostering a sense of responsibility and pride in their work.\n Have Focus\n\nClear Goals: Define and communicate clear, achievable goals that align with the organization's vision.\nPrioritize Tasks: Help your team prioritize their work to maintain focus on what truly matters, reducing distractions and enhancing productivity.\n Empower Them\n\nProvide Autonomy: Give your team the freedom to make decisions and take initiative, which boosts their confidence and engagement.\nSupport Growth: Offer opportunities for professional development and encourage continuous learning to empower your team members.\n Keep It Simple\n\nStreamline Processes: Simplify workflows and eliminate unnecessary complexities to make tasks more manageable.\nClear Communication: Use straightforward and concise communication to ensure everyone understands their roles and responsibilities.\n Be Transparent\n\nOpen Communication: Foster a culture of honesty and openness where team members feel comfortable sharing ideas and feedback.\nShare Information: Keep your team informed about organizational changes, goals, and progress to build trust and alignment.\n Give Recognition\n\nAcknowledge Achievements: Regularly recognize and celebrate individual and team accomplishments to boost morale and motivation.\nProvide Feedback: Offer constructive feedback and appreciation to reinforce positive behaviors and encourage continuous improvement.\n Why It Matters: Creating an engaged team leads to higher productivity, better job satisfaction, and reduced turnover. Engaged employees are more likely to go the extra mile, contribute innovative ideas, and drive the organization toward its goals.\n\n Ready to Transform Your Team’s Engagement? Visitfor more insights, strategies, and resources on building and maintaining highly engaged teams!\n\n Let’s Connect: How do you foster engagement within your team? Share your strategies and experiences in the comments below!\n\n Like,  Comment, and  Share if you found this valuable!",
      "reactions": {
        "likes": "80\nJason Bramble and 79 others",
        "comments": "43 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Giving autonomy shows that you trust your team’s decision-making capabilities.",
          "userName": "Jason Bramble",
          "userProfileURL": "https://www.linkedin.com/in/jasonbramble-revcarto",
          "dataId": "urn:li:comment:(activity:7285279692197154816,7285354538331459585)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7285274725956661248",
      "url": "https://www.linkedin.com/in/miodrag-o-markovic?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAWyHnEB842NovxmdKytP1VkWHSdhtYXPR8",
      "name": "Miodrag O. Markovic\nMiodrag O. Markovic",
      "content": "When it comes to innovation and ideas, I believe it all circles back to two key elements: curiosity and problem-solving.\n\nFor me, it always starts with identifying what’s missing in today’s world.\n\nPinpointing gaps and imagining how these areas could be upgraded to benefit a broad audience.\n\nI thought about what could become game-changing for people in their lives, businesses, or industries.\n\nIn my case, I chose to explore what was lacking in the travel industry.\n\nI identified the pain points travelers face, with cost being a significant challenge.\n\nThe solution I envisioned was rooted in the potential of what I believe is the next big thing: Web3.\n\nMy team and I created something that addresses the primary issue, reducing travel costs, but also added additional layers of innovation to redefine the experience.\n\nThis is my story.\n\nWhile it may sound easy, the reality is that it has taken years of effort and learning, and we’re still on this journey.\n\nWe continue to bridging Web3 and travel, and we know this process takes time.\n\nThat’s okay because I believe meaningful innovation must also be sustainable innovation.\n\nI never aimed for quick wins.\n\nAnd so, I circle back to my original point: stay curious.\nExplore, read, think, and always be willing to ask the questions that could lead to transformative ideas.",
      "reactions": {
        "likes": "12",
        "comments": "7 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Very well said Miodrag and thes two elements are the fabric of innovation",
          "userName": "Dr. Raghavendra Hunasgi",
          "userProfileURL": "https://www.linkedin.com/in/raghavph",
          "dataId": "urn:li:comment:(activity:7285274725956661248,7285296913602473984)"
        },
        {
          "commentText": "Dr. Raghavendra Hunasgi Thank you",
          "userName": "Miodrag O. Markovic",
          "userProfileURL": "https://www.linkedin.com/in/miodrag-o-markovic",
          "dataId": "urn:li:comment:(activity:7285274725956661248,7285297850958110720)"
        },
        {
          "commentText": "Visual is spot on Miodrag O. Markovic",
          "userName": "Himanshu Rawat",
          "userProfileURL": "https://www.linkedin.com/in/machimanshu",
          "dataId": "urn:li:comment:(activity:7285274725956661248,7285278050768850944)"
        },
        {
          "commentText": "Himanshu Rawat Straightforward yet incredibly impactful...",
          "userName": "Miodrag O. Markovic",
          "userProfileURL": "https://www.linkedin.com/in/miodrag-o-markovic",
          "dataId": "urn:li:comment:(activity:7285274725956661248,7285278879265484800)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7285356777427083264",
      "url": "https://www.linkedin.com/in/brian-rollins-39026329?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAXpJFwB9YzFb1-VWjqretaHbb0LuyEiDxA",
      "name": "Brian Rollins\nBrian Rollins",
      "content": "Stop spending $1000+ per lead!!\n\n\nYou think you get leads for cheaper? Add up your costs.\n\nLead Gen (you don't even know what you pay) - $2000\n\nPaying an appointment setter - 5%\n\nNever Ending Job Ads for setter turnover - $300\n\nPaying a Closer - 10%\n\n\nNever having to worry about someone complaining about commission again --- Priceless\n\n\nUse Ai to set your appointments so you don't have\n\n Endless setter ads\n Commission Issues\n Working lead wrong\n\nComment WOW to get the free Ai agent example!!\n\nP.S. Anyone remember the commercial my post is based off of?",
      "reactions": {
        "likes": "1",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": []
    },
    {
      "postId": "urn:li:activity:7285353615676841985",
      "url": "https://www.linkedin.com/in/jepsontaylor?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAT1knkBKurLdx7ocCJOtEwdp07TIBzisxg",
      "name": "🦾Jepson Taylor\n🦾Jepson Taylor",
      "content": "I've been thinking more about brain efficiency. With my last startup I was doing polyphasic sleeping where I would go to bed at 11pm and wake up at 2:30am every day to work. You can do this if you are good at taking micro naps during the day. During that time I had feedback from an investor and my co-founder that I might need more sleep because I was showing signs of cognitive decay.\n\nRecently I was catching up with a CEO who mentioned their sleeping the last few months was on point, many nights getting the full 8hrs of sleep.\n\nSo here is my main question, between fighting for minimal sleep, and ideal sleep (aka sleep until your body wakes up) what is the ideal? I think the answer to that question is beyond human, I think it ultimately will come down to AI's assessment of our work.\n\nFor example, if you are programming, then all of the code you check in through git should be automatically analyzed and scored by an agent. Scored for it's unit of work (complexity, value, etc.. however you define that) and then your units of work should be tracked/day.\n\nIf you are producing more on the world's most terrible sleep schedule... there you go... if you are producing more on sleep closer to your ideal target (8hrs) there you go. I'm curious if anyone has done this level of tracking, also what tricks/tips to people use/do to maximize their cognitive throughput (e.g. lions mane, bacopa monnieri, omega-3, ginko biloba, vitamin B, cardio, ice baths, etc..).\n\nCurious what tips people have out there and what they do sleep-wise to maximize throughput at work.",
      "reactions": {
        "likes": "4",
        "comments": "4 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "I found that maximizing work output is getting 8 hours of sleep and also taking screen breaks. It seems counterintuitive to take more breaks and sleep more but essentially task that would take me an hour now only take me 20 minutes. Additionally remove as many meetings as possible.",
          "userName": "Sadie St. Lawrence",
          "userProfileURL": "https://www.linkedin.com/in/sadiestlawrence",
          "dataId": "urn:li:comment:(activity:7285353615676841985,7285356800772657152)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7285355070320164864",
      "url": "https://www.linkedin.com/in/chris-halon?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAJUnr8B_guqTlvcueMlnXZ1zm2ILJkNQak",
      "name": "Chris Halon\nChris Halon",
      "content": "Yamaha Products at 2025 NAMM\nIt’s NAMM time again! If you can’t make it to this year’s show in person, don’t worry! We’ve got a fantastic lineup of the hottest products that Yamaha will be showcasing, both on the show floor and online. These exciting new offerings are perfect for helping you express yourself and be heard!",
      "reactions": {
        "likes": "0",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": []
    },
    {
      "postId": "urn:li:activity:7285357251672915969",
      "url": "https://www.linkedin.com/in/stevenkamensky?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAKdCREB47gRHqS_iAkoL2KbGVRlpmaERKA",
      "name": "steven kamensky\nsteven kamensky",
      "content": " Happy Wednesday! \nAs we embrace the middle of the week, let's remember the importance of spending our energy in the present moment. Every day is a precious gift, and living in the \"now\" is the key to true happiness and fulfillment. \nFocus on what you can do today to make the most of your time and create beautiful memories. Let go of past regrets and future anxieties, and pour your energy into the present. It's the little moments that make life extraordinary. \nWishing you an awesome day ahead! Let's live each day to the fullest and cherish every moment. \nI hope this brings a smile to your face and inspires those around you! ",
      "reactions": {
        "likes": "10",
        "comments": "1 comment",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Absolutely love this perspective! Embracing the present truly transforms our experiences. Heres to making today extraordinary! ",
          "userName": "Adamya Kumar",
          "userProfileURL": "https://www.linkedin.com/in/adamya-kumar-5947751ba",
          "dataId": "urn:li:comment:(activity:7285344851217330176,7285358343752163328)"
        },
        {
          "commentText": "Absolutely love this reminder! Embracing the present truly transforms our experiences. Here’s to making today extraordinary!  \nhashtag\n#Mindfulness",
          "userName": "Adamya Kumar",
          "userProfileURL": "https://www.linkedin.com/in/adamya-kumar-5947751ba",
          "dataId": "urn:li:comment:(activity:7285344851217330176,7285358331949395970)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7285115345663676416",
      "url": "https://www.linkedin.com/in/jatin-tiwari999?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABzgWV8BAv2cAXRI8kMu-4KnPnhRVlvtCI4",
      "name": "Jatin Tiwari\nJatin Tiwari",
      "content": "SAP FUE ️\n\nSAP Full Use Equivalent (FUE) is a unit of measurement utilized by SAP to grant licenses for its S/4 HANA Cloud applications.\n\nIt signifies the permission given to users to access certain solution features within the S/4HANA Cloud. SAP FUE establishes a consistent framework for licensing, assuring that companies have the appropriate level of access for their users, tailored to their unique requirements.\n\nIn today's context, gaining a solid understanding of FUE is essential, as this is the favored metric for SAP, particularly with S/4 HANA.\n\nDifferent Types of FUEs:️\n\nSAP FUE encompasses distinct types that cater to varying user requirements:\n\nSAP S/4HANA for Advanced Use: ️\n\nThis FUE type grants users full access to the S/4HANA Cloud application, enabling them to create and modify data, run reports, and utilize its complete range of business processes.\n\nIt is typically assigned to users who require extensive functionality and plays a key role in managing critical business operations. One user is equal to one SAP FUE. This category has the lowest compliance risk but the highest over-allocation risk.\n\nSAP S/4HANA for Core Use: ️\n\nThis FUE type is intended for users who require limited access to the S/4HANA Cloud application, allowing them to view data, run reports, and engage in basic business processes.\n\nIt is suitable for users needing access to specific information or who perform routine tasks without the need for extensive functionality. Five core users make up one FUE. This category has a medium compliance risk and medium over-allocation risk.\n\nSAP S/4HANA for Self-Service Use: ️\n\nThis FUE type is designed for those using the S/4HANA Cloud application through self-service portals, offering access to data viewing, report generation, and basic business processes.\n\nIt caters to users who primarily consume information or interact with the application through predefined self-service capabilities.\n\nIt is also used to display and approve use rights. 30 self-service Users make up one FUE. This category has the highest compliance risk but the lowest over-allocation risk.\n\nCustomers should carry out internal audits or hire a third party like LDS to regularly check for risk with this allocation. The table below represents the S/4HANA cloud roles & responsibilities for self-service use.\n\nHow to Calculate SAP FUEs (Full Usage Equivalents)?️\n\nThe calculation of SAP FUE uses a weights mechanism with specific ratios assigned to each FUE type. These ratios provide a standardized approach to determining the number of FUEs required for licensing:\n\n1 FUE- 0.5 SAP S/4HANA Cloud, Developer Access\n1 FUE = 1 SAP S/4HANA for Advanced Use\n1 FUE = 5 SAP S/4HANA for Core Use\n1 FUE = 30 SAP S/4HANA for Self-Service Use\n\nIf you found this useful, followfor more insights from the top 1% every week.\n\nMy SAP Community\n\n",
      "reactions": {
        "likes": "20",
        "comments": "3 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Very informative",
          "userName": "Chirag Thakkar↗",
          "userProfileURL": "https://www.linkedin.com/in/chirag-thakkar-sap",
          "dataId": "urn:li:comment:(ugcPost:7285115342840836096,7285161351373590528)"
        },
        {
          "commentText": "Chirag Thakkar↗ ",
          "userName": "Jatin Tiwari",
          "userProfileURL": "https://www.linkedin.com/in/jatin-tiwari999",
          "dataId": "urn:li:comment:(ugcPost:7285115342840836096,7285300245230448640)"
        },
        {
          "commentText": "Very helpful! Jatin Tiwari",
          "userName": "Chinmay Paratkar",
          "userProfileURL": "https://www.linkedin.com/in/chinmay-paratkar-49bab3173",
          "dataId": "urn:li:comment:(ugcPost:7285115342840836096,7285315211509592064)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7285355100053676032",
      "url": "https://www.linkedin.com/in/walterlcrosby?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABnRy4BfAi04dsWOrVfiDq5Fz8C2uALVWA",
      "name": "Walter Crosby\nWalter Crosby",
      "content": "Your sales leaders are drowning in the day-to-day\n\nYour veteran sales leaders know your industry inside and out. But they need a fresh perspective to take things to the next level.\n\nSometimes the best move isn't replacing your leaders - it's giving them new tools to succeed.\n\nFull episode of Sales & Cigars with sales expert Melanie French is now available. Hit follow so you don't miss it! ",
      "reactions": {
        "likes": "0",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": "blob:https://www.linkedin.com/e1445e4e-677f-48c1-a312-5d33a11068af",
      "comments": [
        {
          "commentText": "Great insights! Empowering sales leaders with fresh tools can unlock new potential and drive success. Excited to check out the episode!",
          "userName": "Adamya Kumar",
          "userProfileURL": "https://www.linkedin.com/in/adamya-kumar-5947751ba",
          "dataId": "urn:li:comment:(ugcPost:7285355099315482625,7285358154882719745)"
        }
      ]
    }
  ],
  "errors": [
    {
      "postId": "urn:li:activity:7285355712052973569",
      "url": "https://www.linkedin.com/in/parth-sanghvi-humour-finance?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACrWWHIBmYh46hKHEhDWXQ-ljd36aXDIVp8",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285357356228517888",
      "url": "https://www.linkedin.com/in/olukemi-adekunbi?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAxBY04BTxNvjf8QyR7Nz-F_yQnc0zDL64M",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285354542211203072",
      "url": "https://www.linkedin.com/in/gordontredgold?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAwBvkBxAOSpQni6LD06Nx1ovwTlkiiTIo",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285274725956661248",
      "url": "https://www.linkedin.com/in/miodrag-o-markovic?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAWyHnEB842NovxmdKytP1VkWHSdhtYXPR8",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285356777427083264",
      "url": "https://www.linkedin.com/in/brian-rollins-39026329?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAXpJFwB9YzFb1-VWjqretaHbb0LuyEiDxA",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285353615676841985",
      "url": "https://www.linkedin.com/in/jepsontaylor?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAT1knkBKurLdx7ocCJOtEwdp07TIBzisxg",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285355070320164864",
      "url": "https://www.linkedin.com/in/chris-halon?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAJUnr8B_guqTlvcueMlnXZ1zm2ILJkNQak",
      "errors": [
        "Failed to fetch reactions.",
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285357251672915969",
      "url": "https://www.linkedin.com/in/stevenkamensky?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAKdCREB47gRHqS_iAkoL2KbGVRlpmaERKA",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285115345663676416",
      "url": "https://www.linkedin.com/in/jatin-tiwari999?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABzgWV8BAv2cAXRI8kMu-4KnPnhRVlvtCI4",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285355100053676032",
      "url": "https://www.linkedin.com/in/walterlcrosby?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABnRy4BfAi04dsWOrVfiDq5Fz8C2uALVWA",
      "errors": [
        "Failed to fetch reactions."
      ]
    }
  ]
}