{
  "posts": [
    {
      "postId": "urn:li:activity:7283486868753518592",
      "url": "https://www.linkedin.com/company/corporatebhakt/posts",
      "name": "The Corporate Bhakt ™️\nThe Corporate Bhakt ™️",
      "content": "Avtar, an organisation which works for diversity and inclusivity in the workplace conducted surveys of 1500 women in each 120 cities. \n\nThe study is mostly based on secondary research and is based on two scores - Social Inclusion Score (SIS) and Industry Inclusion Score (IIS).\n\nFactors where Chennai fell behind Bengaluru include skilling and employment and caregiving support. Chennai stayed ahead in terms of infrastructure and quality of life.\n\nVia\n\nRead:",
      "reactions": {
        "likes": "328",
        "comments": "11 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": []
    },
    {
      "postId": "urn:li:activity:7280476347703992320",
      "url": "https://www.linkedin.com/company/simplilearn/posts",
      "name": "Simplilearn\nSimplilearn",
      "content": "This data analyst course, in collaboration with IBM, will transform you into a data analytics expert. In this course, you will learn the latest analytics tools and techniques, how to work with SQL, the languages of R and Python, the art of creating data visualizations, and how to apply statistics and predictive analytics in a business environment.",
      "reactions": {
        "likes": "892",
        "comments": "3 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": []
    },
    {
      "postId": "urn:li:activity:7280849395745439745",
      "url": "https://www.linkedin.com/in/ananth1635?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABeV5XQBlew5oSHB7m8FwODhE_kSSN9KpNM",
      "name": "Ananth Rangaswamaiah\nAnanth Rangaswamaiah",
      "content": "“TOP LEVEL MARKETING!\nChaiGPT powered by AI (Adrak & Ilaichi) – where creativity knows no limits.",
      "reactions": {
        "likes": "54",
        "comments": "3 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "ChaiGPT that's a clever name! It's great to see AI being used in creative ways. This focus on innovative solutions reminds me that clear and concise communication is also key, especially when documenting inventions. At PowerPatent, we help patent attorneys ensure their applications clearly capture the innovative aspects of their clients' work.",
          "userName": "PowerPatent, Inc.",
          "userProfileURL": "https://www.linkedin.com/company/powerpatent-inc-/posts",
          "dataId": "urn:li:comment:(activity:7280816344210579457,7281585730529726465)"
        },
        {
          "commentText": "ChaiGPT: Where AI meets creativity for limitless marketing potential.",
          "userName": "ETTFOS",
          "userProfileURL": "https://www.linkedin.com/company/ettfosmasterclass/posts",
          "dataId": "urn:li:comment:(activity:7280816344210579457,7280860022538969089)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7283430405267976194",
      "url": "https://www.linkedin.com/in/gaurmeenakshi?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABfMHE4BcBZ4-1KnHEAMGM80gWs7fYQF0hA",
      "name": "Minakshi G.\nMinakshi G.",
      "content": "A man living peacefully with a family of cheetahs—sounds unreal, doesn’t it? \n\nBut It’s amazing how wild animals and humans can coexist when there’s\n,\n,\n, and\n.\n\nInterestingly, these same\nare the foundation of a\nand\n.\n\n\n\n\nThe cheetahs trust the man because he respects their boundaries and understands their needs. Similarly, in the workplace, trust is built when leaders and colleagues honor commitments, listen actively, and create a safe environment for everyone to thrive.\n\n\nAsk yourself: Are you fostering a space where your team feels secure and valued?\n\n\n\n\nThe man’s kind actions make the cheetahs feel safe. In the workplace, simple acts of kindness—like appreciating someone’s efforts or lending a hand—can create a positive and supportive environment.\n\nRemember: A kind gesture often leads to stronger, more productive relationships.\n\n\n\nThe man understands the cheetahs’ needs and works with them. At work, understanding your colleagues’ perspectives can help resolve conflicts and build stronger relationships.\n\nTip: Start by listening without judgment during team discussions or conflicts.\n\n\n\nThe bond between the man and the cheetahs thrives because of respect. In the office, respecting everyone’s role and contributions leads to better teamwork and a happier workplace.\n\nInsight: Respect isn’t just about hierarchy, it’s about valuing everyone’s contributions equally.\n\n\n\nThis video of a man living with cheetahs is a testament to what’s possible when we prioritize trust, empathy, kindness, and respect. Whether in nature or the workplace, these values are timeless and universal.\n\nLet’s draw inspiration from this extraordinary bond and strive to create a corporate culture where even the wildest of ideas, personalities, and differences can coexist beautifully.\n\nHow are you fostering trust and empathy in your workplace? Share your thoughts!",
      "reactions": {
        "likes": "1,775",
        "comments": "67 comments",
        "shares": "0"
      },
      "mediaUrl": "blob:https://www.linkedin.com/d253b029-4e07-4d56-97f6-e6442ccc1c04",
      "comments": [
        {
          "commentText": "This extraordinary bond was very much ordinary once upon a time when humans were actually living with sympathy, empathy & affection. Jungles were there & kindness prevailed\n\nHumans became totally commercial, disregarding living beings & humans at large in the modern era. We badly disturbed the nature & started bullying people. As the good values were gone, only frustration, jealousy & leg pulling started prevailing. Kindness does go a long way but as it's forgotten, people are just self centric. High insecurities & lack of talent pushes the incompetent people to do all such venomous acts. But the good values have timeless impacts & are catered by the true leaders.\n\nKarma plays a big role, which people often forget. All comes back, good or bad . So choose wisely & foster trust & empathy. The same will return to you. God does help the best people. Cheers to kindness & humanity.",
          "userName": "CA SONIA CHANDEL",
          "userProfileURL": "https://www.linkedin.com/in/ca-sonia-chandel-9ba0161b9",
          "dataId": "urn:li:comment:(ugcPost:7283430380743880705,7284013202709848064)"
        },
        {
          "commentText": "CA SONIA CHANDEL Thank you for your kind words️",
          "userName": "Minakshi G.",
          "userProfileURL": "https://www.linkedin.com/in/gaurmeenakshi",
          "dataId": "urn:li:comment:(ugcPost:7283430380743880705,7284164830456954880)"
        },
        {
          "commentText": "Minakshi G.: The tragedy is that it is mostly humanity that breaches and fails the trust that we put in it. Animals rarely breach it. They are often more trustworthy than humans. Also, it is more subjective than objective in most cases regarding humanity, with people deciding to trust others based on their own experiences and beliefs. That does not work.\n\nOne either trusts others or does not; there is no middle way of trusting others. It has to be total, irrespective of experience. One cannot pick and choose among people when it comes to trust.\n\nAnd one has to carry on trusting even in the face of disappointments. Trust is a fragile thing that must be given wholeheartedly to be effective. People cannot be selective in who they trust, as trust must be unconditional. It requires a leap of faith in others, even when faced with challenges or letdowns.\n\nTrusting others and being competitive at the same time are not complementary subjects. Respecting others is an integral part of the trust component.\n\nTrusting someone means believing in their abilities, intentions, and integrity. It means letting go of control and allowing yourself to be vulnerable.",
          "userName": "Ajay Sharma",
          "userProfileURL": "https://www.linkedin.com/in/ajaysharma1962",
          "dataId": "urn:li:comment:(ugcPost:7283430380743880705,7283439731575504897)"
        },
        {
          "commentText": "Thank you Ajay Sharma Sir for sharing such a profound perspective! You're absolutely right—trust is indeed fragile and requires wholehearted commitment to be effective. While animals often embody trust instinctively, humans face the complexities of experiences and beliefs, which can sometimes cloud our ability to trust unconditionally. Your point about trust requiring a leap of faith, even in the face of challenges, resonates deeply. It’s a reminder that trust is as much about courage and vulnerability as it is about mutual respect and integrity. I agree that trust and competitiveness can sometimes feel at odds, but perhaps the balance lies in fostering environments where respect and collaboration are prioritized over rivalry.",
          "userName": "Minakshi G.",
          "userProfileURL": "https://www.linkedin.com/in/gaurmeenakshi",
          "dataId": "urn:li:comment:(ugcPost:7283430380743880705,7283450724372398081)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7259178482432176129",
      "url": "https://www.linkedin.com/company/regnology/posts",
      "name": "Regnology\nRegnology",
      "content": " We are thrilled to announce that Regnology has been awarded Best Tax Reporting Solution at the Regulation AsiaAwards for Excellence 2024!\n\nThe judging panel recognized our Regnology Tax Hub for its ability to enhance tax reporting accuracy and compliance on a global scale. By incorporating advanced AI, cloud scalability, and client-driven customisation, our solution has proven to be transformative.\n\nA huge thank you to the Regulation Asia judging panel for this honor.\n\n️ Find out more about our win:\n\n,",
      "reactions": {
        "likes": "301",
        "comments": "1 comment",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": []
    },
    {
      "postId": "urn:li:activity:7283501311998750723",
      "url": "https://www.linkedin.com/company/amk-andhanar-munnetra-kazhagam/posts",
      "name": "Brahmin Political Party (AMK - Aravor Munnetra Kazhagam)\nBrahmin Political Party (AMK - Aravor Munnetra Kazhagam)",
      "content": " In yet another suspected cardiac arrest case among toddlers, an eight-year-old girl studying in Class 3 died in her school in Gujarat's Ahmedabad on Friday (10.1.25).",
      "reactions": {
        "likes": "35",
        "comments": "20 comments",
        "shares": "0"
      },
      "mediaUrl": "blob:https://www.linkedin.com/c7528f48-04c8-46c0-ae0d-ab894a2bdf96",
      "comments": [
        {
          "commentText": "So sad  she was trying to call by raising her hand in the last moment  Please feed heart health foods to kids.",
          "userName": "Kiran Kumar Kalabariga",
          "userProfileURL": "https://www.linkedin.com/in/kiran-kumar-kalabariga-0b693b53",
          "dataId": "urn:li:comment:(ugcPost:7283501287906648066,7283818906232766464)"
        },
        {
          "commentText": "Very tragic scene,this may be the spurious food item being sold and consumed",
          "userName": "Ajay Sharma",
          "userProfileURL": "https://www.linkedin.com/in/ajay-sharma-68448a188",
          "dataId": "urn:li:comment:(ugcPost:7283501287906648066,7283691706825240578)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7283837945575260160",
      "url": "https://www.linkedin.com/in/shubham-soni-374a86175?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACmguogBIdbijM6YpcIganWLJ67yKyV5kd4",
      "name": "Shubham Soni\nShubham Soni",
      "content": "I completely agree with S. N. Subrahmanyan and Narayan Murthy working 90/70+ hours per week.\n\nFor a Job switch, you have to work hard for at least 70+ hours per week. there's a lot to cover:\n- DSA\n- JavaScript domain knowledge\n- framework knowledge\n- Machine coding round\n- Performance\n- Security\n- System design\n\nI guess they are planning to switch. \n\nWell if you are also planning to switch to a frontend role (Javascript interview), must check 𝐒𝐨𝐧𝐢'𝐬 𝐅𝐫𝐨𝐧𝐭𝐞𝐧𝐝 𝐃𝐨𝐜𝐮𝐦𝐞𝐧𝐭-2.0\n\nLink to doc -\nCoupon code – SONIDOC10 for 10% discount for the first 5 users.\n\nAround 470+ people have already taken this \nFollow more for updates:)",
      "reactions": {
        "likes": "368",
        "comments": "49 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "\nTHE END",
          "userName": "Habibur Rahman",
          "userProfileURL": "https://www.linkedin.com/in/hr-rahman-7a4323297",
          "dataId": "urn:li:comment:(activity:7283441494995189760,7283443418926661632)"
        },
        {
          "commentText": " ",
          "userName": "Shubham Soni",
          "userProfileURL": "https://www.linkedin.com/in/shubham-soni-374a86175",
          "dataId": "urn:li:comment:(activity:7283441494995189760,7283443648292175872)"
        },
        {
          "commentText": "",
          "userName": "Naveen Rawat",
          "userProfileURL": "https://www.linkedin.com/in/naveen-rawat-100",
          "dataId": "urn:li:comment:(activity:7283441494995189760,7283444324942434304)"
        },
        {
          "commentText": "Naveen Rawat  ",
          "userName": "Shubham Soni",
          "userProfileURL": "https://www.linkedin.com/in/shubham-soni-374a86175",
          "dataId": "urn:li:comment:(activity:7283441494995189760,7283444863197487104)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7275926378569482240",
      "url": "https://www.linkedin.com/in/christopheryoung4?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAABL_MBCVh5BUbrBcVC5bmhrdnm094EPrE",
      "name": "Christopher Young\nChristopher Young",
      "content": "It’s clear that AI is no longer a future promise – it’s a present and enduring reality. I started 2024 with a ride in a Wayve autonomous car in London and ended the year in an autonomous taxi with my kids in San Francisco. AI is becoming solidly embedded in the daily lives of many, and it’s only going to grow from here.\n\nBut what’s next? 2025 will surely be another memorable year. Here I share my thoughts on what I’m watching and excited to see play out in the AI space in the year ahead. What’s on your list?",
      "reactions": {
        "likes": "10,268",
        "comments": "301 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Whenever I used AI in 2024, I sensed its growth towards greater vitality. This is a good thing in principle but also scary to me since it guessed fairly well and to a large extent the context I was, for example writing. The big question therefore is, how much data is it collecting at the backend (without my consent) for it to contextualize my thoughts or next actions?\nMore specifically, what if an autonomous taxi (for example in your case above) overrules the passenger’s instructions for what the AI perceives to be a better option and yet that option is wrong?\nDon’t you think the world needs to agree on some form of joint regulations on AI before a time of “no-return”?",
          "userName": "Eng. Daniel Opwonya",
          "userProfileURL": "https://www.linkedin.com/in/eng-daniel-opwonya-20148b19",
          "dataId": "urn:li:comment:(ugcPost:7275926378011639808,7282412774649946114)"
        },
        {
          "commentText": "Eng. Daniel Opwonya You raise an essential and valid concern. The rapid advancement of AI brings incredible potential, but it also highlights the need for transparency, accountability, and robust regulations. Data privacy, ethical decision-making, and ensuring human override in critical AI systems like autonomous vehicles are non-negotiable.\nA global framework for AI governance is critical to balance innovation with safety and trust. Without proactive measures, we risk creating systems that operate beyond our control. Collaboration between governments, companies, and experts is key to ensuring AI serves humanity responsibly.",
          "userName": "Muhammad Umar Farooq",
          "userProfileURL": "https://www.linkedin.com/in/umarbaloch6044",
          "dataId": "urn:li:comment:(ugcPost:7275926378011639808,7283019401228947456)"
        },
        {
          "commentText": "For 2025, I’m particularly excited to watch these areas unfold:\n1️⃣ Generative AI Advancements: Beyond text and image generation, we’ll likely see more robust applications in coding, research, and even AI-assisted creativity for industries like film and design.\n2️⃣ AI in Healthcare: AI-powered diagnostics and treatment personalization are poised to make even bigger strides, potentially transforming patient care.\n3️⃣ Regulation and Ethics: As AI becomes more embedded, how we balance innovation with responsible usage will be key.\n4️⃣ Edge AI: AI moving closer to devices (e.g., wearables, IoT) promises lower latency and better privacy—game-changers for everyday tech.\n\nWhat’s on my watchlist? AI’s role in data governance and analytics, ensuring smarter, more ethical decision-making at scale.\n\n What’s topping your 2025 AI radar? ",
          "userName": "Louisa Igbonoba",
          "userProfileURL": "https://www.linkedin.com/in/ifeomaigbonoba",
          "dataId": "urn:li:comment:(ugcPost:7275926378011639808,7282441886768766977)"
        }
      ]
    }
  ],
  "errors": [
    {
      "postId": "urn:li:activity:7283486868753518592",
      "url": "https://www.linkedin.com/company/corporatebhakt/posts",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7280476347703992320",
      "url": "https://www.linkedin.com/company/simplilearn/posts",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7280849395745439745",
      "url": "https://www.linkedin.com/in/ananth1635?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABeV5XQBlew5oSHB7m8FwODhE_kSSN9KpNM",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7259178482432176129",
      "url": "https://www.linkedin.com/company/regnology/posts",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7283837945575260160",
      "url": "https://www.linkedin.com/in/shubham-soni-374a86175?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACmguogBIdbijM6YpcIganWLJ67yKyV5kd4",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7275926378569482240",
      "url": "https://www.linkedin.com/in/christopheryoung4?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAABL_MBCVh5BUbrBcVC5bmhrdnm094EPrE",
      "errors": [
        "Failed to fetch media URL."
      ]
    }
  ]
}