{
  "posts": [
    {
      "postId": "urn:li:activity:7285678836703264769",
      "url": "https://www.linkedin.com/in/jondavidleslie?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABu-s4B50TpraNCLboiGWes3m1D2rP1sHk",
      "name": "Jon Leslie 🔵\nJon Leslie 🔵",
      "content": "We can complain about RTOs all we want, but it won’t change a thing.\n\n\n-> JPMorgan - RTO\n-> Goldman Sachs - RTO\n-> Morgan Stanley - RTO\n\nOld-school companies are going to demand a return to office, just as old-school retailers failed to adapt to e-commerce in the 2000s.\n\nIt’s in their nature. It’s all they know.\n\nThe good news… we don’t need to complain.\n\nThe market will reward those who evolve and punish those who don’t.\n\nLook at what happened to all of those brick & mortar focused retailers.\n\nJust as the internet permanently changed retail, it’s now changing how and where we work.\n\nAnd it’s about time.\n\nThe future of work is remote and distributed.\n\nEmbrace the change or join the ranks of those who failed to do so in the past.",
      "reactions": {
        "likes": "34",
        "comments": "22 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": " Remember these retailers?\n\n- Sears\n- Circuit City\n- Blockbuster\n- Toys \"R\" Us\n\nWhat others failed to adapt to change?",
          "userName": "Jon Leslie 🔵",
          "userProfileURL": "https://www.linkedin.com/in/jondavidleslie",
          "dataId": "urn:li:comment:(activity:7285678836703264769,7285682254469607426)"
        },
        {
          "commentText": "Stacy Burnside I did the same with my son when he was about that age. Better than FAO Schwartz.",
          "userName": "Jon Leslie 🔵",
          "userProfileURL": "https://www.linkedin.com/in/jondavidleslie",
          "dataId": "urn:li:comment:(activity:7285678836703264769,7285726225291960321)"
        },
        {
          "commentText": "The internet didn’t change retail, Amazon did. ",
          "userName": "Stacy Burnside",
          "userProfileURL": "https://www.linkedin.com/in/stacy-burnside",
          "dataId": "urn:li:comment:(activity:7285678836703264769,7285706231019712513)"
        },
        {
          "commentText": "Stacy Burnside Sure enough. They used the internet, distribution centers, and free shipping to great effect.",
          "userName": "Jon Leslie 🔵",
          "userProfileURL": "https://www.linkedin.com/in/jondavidleslie",
          "dataId": "urn:li:comment:(activity:7285678836703264769,7285711338159394817)"
        },
        {
          "commentText": "Jon Leslie  and I was right there from the beginning of Amazon Prime. I remember when it was like $79 a year.",
          "userName": "Stacy Burnside",
          "userProfileURL": "https://www.linkedin.com/in/stacy-burnside",
          "dataId": "urn:li:comment:(activity:7285678836703264769,7285723181640830977)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7285725994404003841",
      "url": "https://www.linkedin.com/in/angelique-letizia?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAHWItwBIYuMcg7T-FUiFFG_XxcCeIjHA9o",
      "name": "Angelique Letizia\nAngelique Letizia",
      "content": "What if I knew then what I know now? \n\nIf you've ever wished you could run your hands through the river of time, catching fragments of the life you've already lived, then you’ve felt the ache of avenoir.\n\nAvenoir is one of those hauntingly beautiful words from the Dictionary of Obscure Sorrows — the bittersweet desire to see where you’ve been, to watch your past unfold before you like a film, scene by scene.\n\nImagine you are standing at the edge of your timeline. What would you say to the younger versions of yourself—the dreamer, the risk-taker, the heartbroken?\n\nWould you cheer them on, warn them, or simply watch, mesmerized by the unfolding story of your life?\n\nThe ache of avenoir—longing to look back and rewrite our story with the wisdom we’ve gained in the present—can be overwhelming.\n\nHowever, if we didn’t experience both sides of the polarity spectrum, how would we truly appreciate the human experience?\n\nThe grand design of the universe is no accident. In this third-dimensional reality, where time and space are our constructs, we experience life in a linear fashion.\n\nEach moment builds on the last, forcing us to move forward, whether we’re ready or not. While quantum physics reveals a reality where all timelines run concurrently, we live through the lens of time, experiencing life step by step in the physical for reasons known only to the forces that set this world in motion billions of years ago.\n\nWe may long for the clarity of hindsight at the moment, but without the lessons learned through pain, joy, failure, and triumph, the wisdom we cherish now simply wouldn’t exist.\n\nDespite what some may say, this linear journey is not a punishment; it’s a gift. A chance to evolve in ways only the limitations of time can teach us.\n\nTherefore, if you find yourself longing for a do-over, remember this: the heartbreaks taught you about the power of love, the mistakes showed you the grace of humility, and the moments of triumph proved you’re capable of anything and everything you set your mind to.\n\nSo, the next time you feel the pull of avenoir, remember that the story behind you is as it's meant to be. And like any great tale, perhaps it’s here to teach us that life isn’t meant to be perfect—it’s meant to be lived.\n\nKeep Shining ⭐\n©Angelique Letizia",
      "reactions": {
        "likes": "158",
        "comments": "31 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Thank you for sharing Angelique Letizia have a great day ahead ",
          "userName": "steven kamensky",
          "userProfileURL": "https://www.linkedin.com/in/stevenkamensky",
          "dataId": "urn:li:comment:(activity:7285721477402820608,7285725947104841728)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7285372781821575168",
      "url": "https://www.linkedin.com/in/douglandis?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAANIaoB9byBBJUnD97_CwyPbZiTAcJWaf8",
      "name": "Doug Landis\nDoug Landis",
      "content": "The ash on the right is my former house. Fortunately, my neighbor next door \"has a home to return to,\" but not really. It could be up to two years before people can move back into the area because of the toxic chemicals in the air that will be released during the cleanup.\n\nIt's been amazing watching how the LA community has rallied together to help anyone and everyone (regardless of age, race, sex, religion, or political position). This is a human problem and will take years to recover from.\n\nWhat people need most right now is housing. There are tens of thousands of people displaced (even people who have homes to go back to need housing).\n\nThis is an open-source link to available leases in the LA area. Please share this. As you can imagine, it's constantly growing, shrinking, and evolving. I'll also add it in the comments section.\n\n\n\nThis is a link to an insane amount of resources because the uphill journey for many includes freezing mortgage payments, fighting with insurance companies, sorting out cleanup, or finding new schools. This is a great resource for free support.(link also in the comments)\n\nPlease, everyone, now is not the time to point fingers at politicians. This is a time to show up for each other.\n\nNote: survivors guilt is real, in fact, I sold my house a few months ago, so while I'm lucky, I feel so guilty and still devastated for the new owners and the entire PP community!",
      "reactions": {
        "likes": "598",
        "comments": "51 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "This is a link to free resources to help with the other things (insurance, cleanup, attorneys etc) https://drive.google.com/file/d/1J9EHTzx7wCAOOb-vhLOBYsyXAoz-UOoX/view",
          "userName": "Doug Landis",
          "userProfileURL": "https://www.linkedin.com/in/douglandis",
          "dataId": "urn:li:comment:(activity:7285372781821575168,7285373060822573057)"
        },
        {
          "commentText": "Doug Landis thank you for these resources very helpful. I'm heading down LA tomorrow to check on my property. The soil toxicity is a tough one also the inevitable atmospheric river. ",
          "userName": "Tina Tang",
          "userProfileURL": "https://www.linkedin.com/in/tangtina",
          "dataId": "urn:li:comment:(activity:7285372781821575168,7285425674562027522)"
        },
        {
          "commentText": "This is an open-source link to available leases in the LA area. Please share this.\n\nhttps://lnkd.in/gp5XjWXK",
          "userName": "Doug Landis",
          "userProfileURL": "https://www.linkedin.com/in/douglandis",
          "dataId": "urn:li:comment:(activity:7285372781821575168,7285372866223579136)"
        },
        {
          "commentText": "Doug Landis I have two properties in Palm Springs I can rent long term starting In April. I know this list is for Los Angeles area only but I’m curious if I can add my Palm Desert property here or please spread the word.",
          "userName": "Sydney Lai",
          "userProfileURL": "https://www.linkedin.com/in/sydneyelai",
          "dataId": "urn:li:comment:(activity:7285372781821575168,7285690751601025025)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7285682780317917184",
      "url": "https://www.linkedin.com/in/romimahajan?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAlYZuQBDEZNbNuEzy5tczl-rn6tmbfIonY",
      "name": "Romi Mahajan\nRomi Mahajan",
      "content": "My meditation on hypocrisy. Spoiler alert: I'll take hypocrisy that blunts your worst instincts over the venality that forces you to express them.",
      "reactions": {
        "likes": "0",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": []
    },
    {
      "postId": "urn:li:activity:7285725001004007425",
      "url": "https://www.linkedin.com/in/mkoesterer?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAJ9iiAB5bh6NL9kMz59hr5JCHi31nuQIM8",
      "name": "Mark R. Koesterer\nMark R. Koesterer",
      "content": "Education is evolving—are we listening?\n\nToday’s students aren’t just seeking knowledge—they want relevance. They’re asking “How does this apply to my life?” And as educators and leaders, we must adapt.\nAt The Players NIL, we’ve learned that traditional teaching methods aren’t enough anymore. Young people—and especially athletes—are looking for skills that matter now:\n Financial literacy to manage wealth\n Personal branding to stand out\n Leadership to build legacies\n\nThrough listening and adapting, we’ve reshaped NIL education to be:\n Agile and relevant to today’s challenges\n Delivered in formats students relate to\n Focused on empowering action and growth\n\nThis is about more than knowledge—it’s leadership in action. Together, we’re equipping the next generation to thrive on and off the field.\n\n Check out the video series and join us in shaping a brighter future:",
      "reactions": {
        "likes": "1",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": []
    },
    {
      "postId": "urn:li:activity:7285529964798468096",
      "url": "https://www.linkedin.com/company/sagarcasm/posts",
      "name": "Sagarcasm\nSagarcasm",
      "content": "Gautam Adani after Hindenburg Research shuts down",
      "reactions": {
        "likes": "855",
        "comments": "12 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Gautam Adani today",
          "userName": "Prashant Shah",
          "userProfileURL": "https://www.linkedin.com/in/shahreholder",
          "dataId": "urn:li:comment:(activity:7285529556063555585,7285539886198116352)"
        },
        {
          "commentText": "It looks like someone's having a quiet night! ️ \nhashtag\n#Adani",
          "userName": "Nimitt Bhatt",
          "userProfileURL": "https://www.linkedin.com/in/nimittbhatt",
          "dataId": "urn:li:comment:(activity:7285529556063555585,7285545424701022208)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7285723680536510465",
      "url": "https://www.linkedin.com/in/kddorsey3?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAArx_ecBCnvdgqDCS1YoxRfDjNMZ3nPmLLg",
      "name": "Kevin \"KD\" Dorsey\nKevin \"KD\" Dorsey",
      "content": "Ooooooooh been waiting to make this post! \n\nI. Am. Hiring. \n\nIt's go time ya'll.\n\nI am hiring for SDRs and for SDR managers.\n\nWhen: Right now.\n\nWhere: On site/In Office in Boca Raton, FL\n\nWhy Now: We are growing ya'll. And growing fast and I want to bring in my future AEs, Managers, Leaders NOW. We have big goals and it's time to go after them.\n\nWhy Us: You join thesales squad I can can promise you that you'll receive some of the best initial and on going sales and leadership training you've ever had.\n\nOur goal is not to turn you into a great finally sales person, it's to help turn you into a great sales person sales person. We promote from within, and this group of SDRs coming in will be our future AE's and Leaders.\n\nWe train weekly. We practice daily. We read together. We learn together. We laugh together.\n\nWhy Us Part II:\n\nFunded - Check.\nCulture - Check.\nRunway - Check.\nBig Market - Check.\nStrong Product Suite - Check\nSuper Cool CRO - Super Debatable.\nStrong Hat Game - Check\nCEO with a grand vision and master plan - Double Check.\n\nWhy You: You'll be a great fit for this role and team IF.\n\n- Can be onsite each day in Boca Raton, around your team, leaders, feeding of the energy, learning in the moment, doing cool yet hard things together. (This is an in office gig, not hiring remote at this time, open to relocation packages for the right candidates)\n\n- Coachable - Not just willing to learn but HUNGRY to learn. Willing to put in the work to practice, play, and work with focus and intensity.\n\n- Driven & Disciplined - You don't need motivation, you seek discipline. You get after it, plan your day, execute your plan, and strive for greatness.\n\n- High Positive Energy - You live and sell with enthusiasm, you can laugh off the rejection and mistakes, pick up your fellow seller, and bring a postive energy to the team and prospects.\n\n- Growth Minded - You have career aspirations to growth with in a fast growing company, never settling, but knowing it takes hard work, effort, and skill to keep on moving up.\n\n-------\n\nIf this sounds like you.\n\nIf it sounds like someone you know.\n\nApply today.\n\nTag someone/yourself.\n\nStand out.\n\nGet creative.\n\nWill it be easy? Nah.\n\nWill it be worth it? Hell yeah.\n\nLet the journey begin...",
      "reactions": {
        "likes": "142",
        "comments": "43 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "One of the best out there. Be crazy not to apply for these roles if in the market or wanting to upgrade from current job.",
          "userName": "Frank Morris",
          "userProfileURL": "https://www.linkedin.com/in/frank-lee-morris",
          "dataId": "urn:li:comment:(activity:7285721885193957377,7285724083642609665)"
        },
        {
          "commentText": "I love Boca but isn't everyone there over 50? ",
          "userName": "Dee Acosta 🤖",
          "userProfileURL": "https://www.linkedin.com/in/dee-rev",
          "dataId": "urn:li:comment:(activity:7285721885193957377,7285726765979693056)"
        },
        {
          "commentText": "Dee Acosta  I mean I didn't want to say it in the post but yes, I actually only recruit from the retirement communities, they're just sitting around and aren't afraid of the phones, so it's been great  ",
          "userName": "Kevin \"KD\" Dorsey",
          "userProfileURL": "https://www.linkedin.com/in/kddorsey3",
          "dataId": "urn:li:comment:(activity:7285721885193957377,7285727271405903873)"
        },
        {
          "commentText": "Kevin \"KD\" Dorsey you know, that's not a bad idea. Retiree who still wants to hustle might be great. ",
          "userName": "Dee Acosta 🤖",
          "userProfileURL": "https://www.linkedin.com/in/dee-rev",
          "dataId": "urn:li:comment:(activity:7285721885193957377,7285727914728255488)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7284846450427973633",
      "url": "https://www.linkedin.com/in/georgiastjohnsmith?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABluY8QBgCmzY1sZ0erIrjSoPhlJw2Dex2U",
      "name": "Georgia St John-Smith\nGeorgia St John-Smith",
      "content": "I’m Georgia St John-Smith, a Top 1% LinkedIn Creator in the UK.\n\nBut my personal brand blew up on LinkedIn against the odds!!\n\nI never did what everyone else was doing to grow on LinkedIn…\n\nI told the TRUTH.\n\n️‍ I have spoken about heartbreak on LinkedIn.\n️‍ I have spoken about anxiety and panic attacks on LinkedIn.\n\nAnd I’ve seamlessly curated an approach that allows you to balance the line that allows you to be vulnerable AND credible.\n\nMy approach to LinkedIn is incredibly unique.\n\nThere is no template for this.\n\nBecause you know you're iconic.\n\nAnd we all know icons do not follow templates\n\nIt’s about creating your own rules.\nYour own legacy.\nYour own lane.\n\nYou’ve already tasted success, but deep down, you’re craving an evolution.\n\nBecause you’re not here for just 'success' in your business\n\nYou’re here to create an iconic legacy that leaves an impact and inspires others.\n\nIt’s Phoenix Season.\n\nBecause by know you’ve created an incredible brand.\n\nBut you’re the kind of person where you’re constantly evolving!\n\nSo you know it’s time to tear certain elements of your business to the ground.\n\nSo that you can rise.\n\nAnd you know a big part of that, is you leveraging the power of LinkedIn MORE.\n\nIn the free Phoenix Season Challenge I'm showing you exactly how to:\n\n Claim your space on LinkedIn:\n\nSpot gaps in your industry no one else sees, and create your own iconic lane as a thought leader.\n\n Build a magnetic personal brand:\n\nShare your truth with bold vulnerability and undeniable credibility to attract dream clients, podcast invites, and the kind of opportunities that change everything.\n\n Rise like a Phoenix on Linkedin:\n\nUse the platform to spread your message, scale your business YOUR way, and step into the next evolution of your leadership.\n\nIt's time to claim your space on LinkedIn as a thought leader who’s magnetic, unstoppable, and iconic.\n\nWelcome... to Phoenix Season.\n\nYour legacy starts here \n\n‍",
      "reactions": {
        "likes": "246",
        "comments": "60 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Yayyyy Georgia St John-Smith \n\nPhoenix Season \n\nI'll rise like a Phoenix on Linkedin ",
          "userName": "Ikpia Blessing Isioma",
          "userProfileURL": "https://www.linkedin.com/in/ikpia-blessing-isioma-54b790244",
          "dataId": "urn:li:comment:(ugcPost:7284834261826756608,7284846403275681793)"
        },
        {
          "commentText": "Ikpia YES YOU WILL ‍",
          "userName": "Georgia St John-Smith",
          "userProfileURL": "https://www.linkedin.com/in/georgiastjohnsmith",
          "dataId": "urn:li:comment:(ugcPost:7284834261826756608,7284846707266248706)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7285628821100216322",
      "url": "https://www.linkedin.com/in/vincent-burruano?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABHi8YBbiYIbp8oTv7Z4PNB5MHlpe4CxVY",
      "name": "Vincent Burruano\nVincent Burruano",
      "content": null,
      "reactions": {
        "likes": "9",
        "comments": "2 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Greatful for your friendship and assistance",
          "userName": "Sean Dorman",
          "userProfileURL": "https://www.linkedin.com/in/sean-dorman-489695125",
          "dataId": "urn:li:comment:(activity:7285628821100216322,7285656609668612097)"
        },
        {
          "commentText": "Greatful for your mentorship!",
          "userName": "Stephen Seligson, CMC",
          "userProfileURL": "https://www.linkedin.com/in/sseligson",
          "dataId": "urn:li:comment:(activity:7285628821100216322,7285649895670099968)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7285566465167048705",
      "url": "https://www.linkedin.com/in/megha-chaudhary-0961561b1?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADFSWfIBsa2gZytKS4MP-diNDU4pE410cm8",
      "name": "Megha Chaudhary\nMegha Chaudhary",
      "content": "hashtag\n#LatePost \nDonor Engagement \nA huge thank you to Arwa Nadeem for this amazing opportunity! We had the chance to connect with theteam, share the impactful work we’re doing at Teach for India, and discuss how we’re addressing inequity in classrooms. Big shoutout toandfor their incredible work and daily inspiration!️",
      "reactions": {
        "likes": "23",
        "comments": "1 comment",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Congratulations!",
          "userName": "Nikhil Sharma",
          "userProfileURL": "https://www.linkedin.com/in/nikhil-sharma-4422a756",
          "dataId": "urn:li:comment:(ugcPost:7285110972585857024,7285630867186630657)"
        }
      ]
    }
  ],
  "errors": [
    {
      "postId": "urn:li:activity:7285678836703264769",
      "url": "https://www.linkedin.com/in/jondavidleslie?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABu-s4B50TpraNCLboiGWes3m1D2rP1sHk",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285725994404003841",
      "url": "https://www.linkedin.com/in/angelique-letizia?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAHWItwBIYuMcg7T-FUiFFG_XxcCeIjHA9o",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285372781821575168",
      "url": "https://www.linkedin.com/in/douglandis?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAANIaoB9byBBJUnD97_CwyPbZiTAcJWaf8",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285682780317917184",
      "url": "https://www.linkedin.com/in/romimahajan?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAlYZuQBDEZNbNuEzy5tczl-rn6tmbfIonY",
      "errors": [
        "Failed to fetch reactions.",
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285725001004007425",
      "url": "https://www.linkedin.com/in/mkoesterer?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAJ9iiAB5bh6NL9kMz59hr5JCHi31nuQIM8",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285529964798468096",
      "url": "https://www.linkedin.com/company/sagarcasm/posts",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285723680536510465",
      "url": "https://www.linkedin.com/in/kddorsey3?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAArx_ecBCnvdgqDCS1YoxRfDjNMZ3nPmLLg",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7284846450427973633",
      "url": "https://www.linkedin.com/in/georgiastjohnsmith?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABluY8QBgCmzY1sZ0erIrjSoPhlJw2Dex2U",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285628821100216322",
      "url": "https://www.linkedin.com/in/vincent-burruano?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABHi8YBbiYIbp8oTv7Z4PNB5MHlpe4CxVY",
      "errors": [
        "Failed to fetch content.",
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285566465167048705",
      "url": "https://www.linkedin.com/in/megha-chaudhary-0961561b1?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADFSWfIBsa2gZytKS4MP-diNDU4pE410cm8",
      "errors": [
        "Failed to fetch media URL."
      ]
    }
  ]
}