{
  "posts": [
    {
      "postId": "urn:li:activity:7286068547884138496",
      "url": "https://www.linkedin.com/in/walterlcrosby?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABnRy4BfAi04dsWOrVfiDq5Fz8C2uALVWA",
      "name": "Walter Crosby\nWalter Crosby",
      "content": "Everyone is looking for an edge in productivity. You can't work harder.\n\nI wrote a blog post about productivity. There was a little pushback. Stand behind the ideas.\n\nSee for yourself here.",
      "reactions": {
        "likes": "0",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": []
    },
    {
      "postId": "urn:li:activity:7286034016820969472",
      "url": "https://www.linkedin.com/in/bradfederman?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAPmj0BJTWPba7ngtdb-ptmeUtZ69ETJ-4",
      "name": "Brad Federman\nBrad Federman",
      "content": "\"I am not feeling confident. All of these employers are asking for years of experience, expertise, certifications, and more. I am getting out of what I am doing because technology and AI have reduced the amount of work available. I was hoping to transition to something else and I am not seeing that possibility. What am I going to do?\"\n\nShe woke up one morning, scrolling through job postings, and feeling that pit in her stomach. The requirements seem impossible: years of experience, endless certifications, and expertise you don’t have. Imagine realizing that the work you’ve built your life around is disappearing—replaced by technology and AI. What would you do?\n\nThat was the raw, emotional email I received from someone grappling with this very reality. They’re watching their opportunities vanish and feeling utterly stuck. And here’s the hard truth: they’re not alone.\n\nWe are living in a brave new world. Change isn’t just coming; it’s here, and it’s relentless. The numbers are staggering:\n\nGoldman Sachs estimates 300 million jobs will vanish because of AI.\nForbes predicts that 50% of jobs could be displaced within just three years.\nIn May alone, 4,000 people in tech lost their jobs to AI (Business Insider).\n\nSome may argue these numbers are exaggerated, but we can all agree: the landscape of work is shifting beneath our feet. As roles disappear, competition intensifies. Employers demand more—more skills, more adaptability, more innovation.\n\nSo, here’s the question: Are you ready?\n\nThis isn’t the time for comfort zones. We live in the age of growth, where success favors those willing to adapt, learn, and evolve. Every day is an opportunity to:\n\nMaster new skills. Stay curious and committed to growth.\nEmbrace technology. AI isn’t just a threat; it’s a tool—if you know how to use it.\nGet uncomfortable. Growth lives on the edge of discomfort.\n\nThe alternative? Waking up one day with no options, desperate for a lifeline.\n\nThat’s a reality none of us can afford.\n\nLet’s shift the narrative. Let’s prepare. Share your thoughts—what are you doing to stand out and stay ahead? If you’ve been impacted, how are you navigating this shift? Let’s talk about it, together.",
      "reactions": {
        "likes": "6",
        "comments": "4 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Mary McConner, Ph.D., CDE® Michael Bruno SHRM-Memphis SHRM-UofM Student Chapter CHRISTINE Heath ESSARY Would love to get your thoughts and insights. ",
          "userName": "Brad Federman",
          "userProfileURL": "https://www.linkedin.com/in/bradfederman",
          "dataId": "urn:li:comment:(activity:7286034016820969472,7286052835048189953)"
        },
        {
          "commentText": "Great post, Brad Federman. While many employers are helping their teams level up and stay relevant, many others do not. I think HR teams are overwhelmed and are not prioritizing AI competency, for example. To me, the lesson is crystal clear: it's up to each of us to make sure we are staying current and relevant.",
          "userName": "Michael Bruno",
          "userProfileURL": "https://www.linkedin.com/in/michaelgbruno",
          "dataId": "urn:li:comment:(activity:7286034016820969472,7286058961538023425)"
        },
        {
          "commentText": "Mike, I could not agree with you more. Level Up! Everyday!",
          "userName": "Brad Federman",
          "userProfileURL": "https://www.linkedin.com/in/bradfederman",
          "dataId": "urn:li:comment:(activity:7286034016820969472,7286062108289449985)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7286013860703059968",
      "url": "https://www.linkedin.com/in/neil-sarkar?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABKnLrYBWIfe92kUUbuVo2pyeF57kK5ZyMY",
      "name": "Neil Sarkar\nNeil Sarkar",
      "content": "Over 90% of manufacturers are investing in digital tools. If you’re not, let’s face it—you’re falling behind.\n\nAs a SaaS founder, here’s what I’ve learned: digital transformation isn’t a trend—it’s survival.\n\nI once had a client say, “We’ve done it this way for decades; why change?” Then their competitor launched a digital ordering system, cut turnaround times by 50%, and—well, you can guess who their customers called.\nWhat Does Digital Transformation Really Mean?\n\n1️⃣ Automating repetitive tasks – Focus on what truly matters.\n2️⃣ Integrating data systems – Say goodbye to silos and hello to real-time insights.\n3️⃣ Embracing predictive tools – AI can predict when machines will fail before they actually do.\n\n“But Neil, isn’t this expensive?” Doing nothing costs more. Downtime, inefficiencies, missed opportunities—they all drain your bottom line.\nStart small. Pick a pilot project. Involve your team. Bite-sized wins lead to big results.\n\nAt, I’ve seen clients cut manual reporting by 80% with just one shift. That’s not just helpful—it’s a game changer.\n\nTAKEAWAY:\nStanding still isn’t safe—it’s risky. So here’s your challenge: take one small step this week.\nIf this resonates, drop a comment or DM me. Let’s chat about your digital transformation journey—what’s working, what’s not, and where to start.\nDon’t wait for change to catch you—be the one leading it.",
      "reactions": {
        "likes": "4",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": []
    },
    {
      "postId": "urn:li:activity:7282237013775265792",
      "url": "https://www.linkedin.com/in/pulseiq?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAKtQQBTyDDpRxNvQB5uHPy8VZkb1b82Ug",
      "name": "Jerry Rassamni\nJerry Rassamni",
      "content": " The Magic of AI: What’s Next?\n\nAI continues to amaze us with its endless possibilities! From creating lifelike art to solving complex problems, it feels like we’re living in a world of magic brought to life by technology.\n\n𝗪𝗵𝗮𝘁 𝗠𝗮𝗸𝗲𝘀 𝗔𝗜 𝗠𝗮𝗴𝗶𝗰𝗮𝗹:\n???? Turns imagination into reality.\n???? Simplifies tasks that once felt impossible.\n???? Pushes the limits of creativity and innovation.\n\n𝗪𝗵𝗮𝘁’𝘀 𝗡𝗲𝘅𝘁?\nWill AI help us discover new galaxies?\nSolve the world’s toughest challenges?\nRedefine how we connect with each other?\nThe future is full of exciting unknowns, and AI is at the heart of it all!\n\n Your Thoughts:\nHow do you see AI shaping the world? What are you most excited to witness next? Share your ideas below!\n\nFollow me for more insights into the world of AI and innovation.\n\nCredit: X/mickmumpitz",
      "reactions": {
        "likes": "191",
        "comments": "33 comments",
        "shares": "0"
      },
      "mediaUrl": "blob:https://www.linkedin.com/6418c5e1-59a6-4f16-9b10-2752d0d8dcc2",
      "comments": [
        {
          "commentText": "The ability of Al to process and analyze data faster is transforming healthcare diagnoses",
          "userName": "Nitesh Kumar",
          "userProfileURL": "https://www.linkedin.com/in/nitesh-kumar-9a8005314",
          "dataId": "urn:li:comment:(ugcPost:7281425464731095040,7282326654243258368)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7286031368147415040",
      "url": "https://www.linkedin.com/in/kddorsey3?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAArx_ecBCnvdgqDCS1YoxRfDjNMZ3nPmLLg",
      "name": "Kevin \"KD\" Dorsey\nKevin \"KD\" Dorsey",
      "content": "You’d be shocked how much work you could get done at work if all you did at work was work…\n\nI say this often.\n\nNot only to myself but also my leaders and team.\n\nWe live in a DISTRACTED world.\n\n100s of emails per day.\n\n100s of slacks per day.\n\n100s of notifications per day.\n\nAlgorithms that literally know us better than ourselves and are fine tuned to keep us coming back.\n\nEliminate distractions to the best of your ability.\n\nI used an app called Opal for my phone to set limits on apps and it locks you out.\n\nI do not have push notifications for email on my phone.\n\nI routinely shut down slack during focused work times\n\nThe more you can ELIMINATE the distractions the better.\n\nTrying to avoid them requires will power.\n\nWe only have so much of that.\n\nGet your work done at work so you don’t have to work outside of work.\n\nUnless you want to live the life of the great philosopher Rhianna\n\nWork work work work work work….",
      "reactions": {
        "likes": "111",
        "comments": "49 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "You’ve nailed it here, less noise at work means more time for actual life outside of it Kevin \"KD\" Dorsey",
          "userName": "Aaron Norris",
          "userProfileURL": "https://www.linkedin.com/in/aaron-norris88",
          "dataId": "urn:li:comment:(activity:7286008434729058306,7286069733941018625)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7286064658996768769",
      "url": "https://www.linkedin.com/in/jeremyboerger?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAGY-OABdlR_aEAWwHbNhPw4Be5rUWOfCek",
      "name": "Jeremy Boerger\nJeremy Boerger",
      "content": "Stay Ahead of Software Audits: 3 Essential Steps You Need to Take Now! \n\nAre you ready for a software license audit? Ensure success by building a robust cross-functional team, crafting a detailed playbook, and verifying data in your CMDB. Be proactive to protect your organization from surprises. Let's get audit-ready!  Read more ⬇️",
      "reactions": {
        "likes": "0",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": []
    },
    {
      "postId": "urn:li:activity:7285930723331481603",
      "url": "https://www.linkedin.com/in/katiep3prmnt?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACfgKL0BtXlAzUJZbsQPvqV-b-S0b8BD5XI",
      "name": "Katie A.\nKatie A.",
      "content": "These are the BEST things I’ve GAINED from owning a startup: ‍\n\nAnd nope none of them have anything to do with money!!\n\nOver the past 4 years of running my business, I’ve come to realise how much I’ve grown—and I mean seriously GROWN. It’s been such a journey of self-improvement and skill-building, and I honestly wouldn’t trade it for anything. Here’s what I’ve learned:\n\n⏰ Time management\nThis one has been a game-changer. Figuring out how to manage my time well has helped me handle ALL the things without losing my mind. Every minute counts when you’re running the show, and I’ve learned how to make it WORK. Highly rate time blocking!! ‍️\n\n Self-confidence\nA HUGE one for me!!! I struggled so much with confidence when I was younger and it’s crazy how much my business has changed that for me!! Taking charge of a company, making decisions, and learning to trust myself—it’s forced me out of my comfort zone and forced to build self confidence\n\n Problem-solving skills\nSimply said if you’re running a startup, you’re going to make mistakes. So MANY mistakes. But honestly, that’s the job—solving problems nonstop. My company wouldn’t be here today if I hadn’t learned how to face challenges head-on all the time\n\n️ Communication skills\nThis one’s non-negotiable. If you can’t communicate clearly and effectively, your business is in trouble. I’ve had to get really intentional about how I communicate—especially since I love to chat (aka “waffle on” ). Learning to be concise has been a game-changer.\n\n Resilience\nThis one’s a MUST because running a business is NOT easy, and there have been so many moments where I felt like giving up. But building resilience has helped me push through the hard days and keep going. (Which is always worth it may I add) Sometimes, success is just about not quitting when it feels impossible.\n\nWhat about you? What lessons has your work or life journey taught you? Share them below—I’d love to hear! \n\nAnd make sure to REPOST this!! ️",
      "reactions": {
        "likes": "1,153",
        "comments": "315 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "As a self taught Marketer, I've learnt to believe in myself and my abilities Katie A. \n\nBut most importantly, I've learnt that challenges are a normal part of life.\n\nIf the door refuses to open you can either break it down or get the right key ",
          "userName": "Ikpia Blessing Isioma",
          "userProfileURL": "https://www.linkedin.com/in/ikpia-blessing-isioma-54b790244",
          "dataId": "urn:li:comment:(ugcPost:7285924295879380992,7285938115670667266)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7286024468374700033",
      "url": "https://www.linkedin.com/in/westmcdonaldco?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAEvxMQBQ77AN3_0OXUHuUpKcY6AMaxm8us",
      "name": "West McDonald\nWest McDonald",
      "content": "Didn't know I was in this list until a friend told me. Thanks to Scott Cullen and THE CANNATA REPORT for the honor. Fun!",
      "reactions": {
        "likes": "9",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": []
    },
    {
      "postId": "urn:li:activity:7286023852256636929",
      "url": "https://www.linkedin.com/in/stevelitzow?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAOjBwBP9nWnY_-6KWhJLV-EzTXeRDsxTg",
      "name": "Steve Litzow\nSteve Litzow",
      "content": "Big deal about to close... but it’s not the ICP?\n\nWhen I work on refining sales strategies for scale ups, I always include a validation step.\n\nIt comes after the proposal and negotiation.\n\nIt’s an internal step for:\n– The CEO or VP of Sales to review the deal.\n– The SDR or sales manager to self-analyze.\n– An item to discuss during weekly or monthly deal reviews.\n\nThe key focus of validation?\n\nDouble-check the customer still fits your ICP.\n\nIt’s overlooked because:\n– The SDR wants to hit quota.\n– The sales manager wants to hit quota.\n– Or simply, the revenue is too tempting to resist.\n\nBut if you’re serious about scaling to 8 or 9 figures, you must take this step.\n\nYou must reconsider going ahead if the ICP isn’t the right fit.\n\nHere’s why…\n\nI recently read a story from Jake Fuentes, co-founder of Cascade, about why he shut his startup down.\n\nHe admitted that “ICP fray” was a key factor.\n\nCascade initially defined their ICP as “nontechnical business analysts using Excel to crunch big data sets”.\n\nThe definition was too broad.\n\nThey ended up chasing customers with wildly different use cases:\n– A scooter company managing location data.\n– An HR team managing employee data.\n\nThey didn’t have a framework to accept or reject opportunities, so they tried to support them all.\n\nJake described this as “a slow death of a thousand cuts.”\n\nSupporting anyone and everyone pulled the company in a million directions, ultimately diluting their focus and stunting growth.\n\nIf you want to scale successfully, rejecting deals from prospects who don’t fit your ICP is the tough but necessary way forward.\n\nValidate every deal.\n\nStick to your guns.\n\nKeep closing.\n\nLike what you read? ️ Repost it to your network and follow Steve Litzow for more.\n\nWant to accelerate your sales? Join our community of CEOs & Sales Leaders subscribers today:",
      "reactions": {
        "likes": "16",
        "comments": "4 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Staying true to your ICP is crucial for growth. Misaligned deals might boost short-term revenue but often lead to inefficiencies and lost focus. Discipline here pays dividends!",
          "userName": "Neil Sarkar",
          "userProfileURL": "https://www.linkedin.com/in/neil-sarkar",
          "dataId": "urn:li:comment:(activity:7286008448524107776,7286023806983225345)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7286040863896436736",
      "url": "https://www.linkedin.com/in/nbstagge?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAATnuucByGwl32yGUrVxrwutwtfYfM6bNqk",
      "name": "nick stagge 💭\nnick stagge 💭",
      "content": "Looking back, I wouldn't have spent a single day in college. \nUnless you want to become a dr or a lawyer, it just doesn't add up.\n\n\nHad I ditched college, I would have avoided:\n- massive debt\n- learning theory without application\n- a lot of parking tickets\n- working part time jobs that paid little & gave my minimal experience\n\n\nInstead, I wish I would have secured an internship with a strong business leader, started my own business, traveled the world, or just enjoyed being young.\n\nHad I done that, I could have...\n- gained real-world work experience much faster\n- built my professional network earlier\n- made more money in the short (and long) term\n- experienced new things outside my bubble\n- figured out what I actually wanted to do with my career earlier\n\n\nIs this just me?\nDoubtful.",
      "reactions": {
        "likes": "33",
        "comments": "32 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "I think this is an feeling shared by a lot of people. However, just to play devils advocate a bit. \n\n- Without college, at least for designers in general, you miss out on learning the ins and outs of your craft surrounded by other designers who are learning with you guided by a professor actively working in the field.\n\n- You miss out on learning the history, while boring at times, is important when wanting to understand what will stand the test of time and what will appear dated, even though it might look cool to you.\n\n- looking back on my work before college, I had been designing for around 2-3 years. I was no good. Sure time would have allowed me to be better but I feel I experienced significant growth by rubbing shoulders with older students and alumni that in return pushed me to do more because I saw they could do it.\n\n- I also have been exposed to forums, books, professionals, and other resources because of my time in college.\n\nIf I didn’t go to college, here are my questions:\n\n- would I have really pushed myself to get better in a vacuum or was it the unspoken competition of class that helped me to grow?\n\n- would I have secured any kind of design job/internship? Or would I have lost out on those opportunities…",
          "userName": "Bryson King",
          "userProfileURL": "https://www.linkedin.com/in/bryson-king-806416248",
          "dataId": "urn:li:comment:(activity:7286040863896436736,7286047578960408576)"
        },
        {
          "commentText": "Bryson King SLC Design and Wine, Creative Mornings, Design Mob, SL Deaign Week — there are lots of places to meet up with other creatives, learn your craft, discuss the history, etc etc. \n\nNot to mention — YouTube.",
          "userName": "nick stagge 💭",
          "userProfileURL": "https://www.linkedin.com/in/nbstagge",
          "dataId": "urn:li:comment:(activity:7286040863896436736,7286066271631159296)"
        },
        {
          "commentText": "College is quite inexpensive for Utah residents. I believe it’s the cheapest in the nation. I went in state in Colorado and it was amazing. I still have professors I keep in touch with 23 years later. Friends with whom I share networking leads with. \n\nI got to play IM sports, lead Bible Studies, work a part time job, learn about failure, and still get in a lot of snowboarding.\n\nWe lack coming of age moments in our pluralistic society and I think the 4 year college experience is one of the few we have left.\n\nPew research did a study and 48% of college grads with debt make over $100k a year while on 14% of non college grads make over $100k. 64% of those without debt and a degree make over $100k.\n\nStill worth it from my perspective",
          "userName": "Adam Peek",
          "userProfileURL": "https://www.linkedin.com/in/adampeek",
          "dataId": "urn:li:comment:(activity:7286040863896436736,7286061407048028161)"
        },
        {
          "commentText": "Adam Peek my shot is uglier than Sam Cassel.",
          "userName": "nick stagge 💭",
          "userProfileURL": "https://www.linkedin.com/in/nbstagge",
          "dataId": "urn:li:comment:(activity:7286040863896436736,7286066558257315841)"
        }
      ]
    }
  ],
  "errors": [
    {
      "postId": "urn:li:activity:7286068547884138496",
      "url": "https://www.linkedin.com/in/walterlcrosby?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAABnRy4BfAi04dsWOrVfiDq5Fz8C2uALVWA",
      "errors": [
        "Failed to fetch reactions.",
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7286034016820969472",
      "url": "https://www.linkedin.com/in/bradfederman?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAPmj0BJTWPba7ngtdb-ptmeUtZ69ETJ-4",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7286013860703059968",
      "url": "https://www.linkedin.com/in/neil-sarkar?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABKnLrYBWIfe92kUUbuVo2pyeF57kK5ZyMY",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7286031368147415040",
      "url": "https://www.linkedin.com/in/kddorsey3?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAArx_ecBCnvdgqDCS1YoxRfDjNMZ3nPmLLg",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7286064658996768769",
      "url": "https://www.linkedin.com/in/jeremyboerger?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAGY-OABdlR_aEAWwHbNhPw4Be5rUWOfCek",
      "errors": [
        "Failed to fetch reactions.",
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285930723331481603",
      "url": "https://www.linkedin.com/in/katiep3prmnt?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACfgKL0BtXlAzUJZbsQPvqV-b-S0b8BD5XI",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7286024468374700033",
      "url": "https://www.linkedin.com/in/westmcdonaldco?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAEvxMQBQ77AN3_0OXUHuUpKcY6AMaxm8us",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7286023852256636929",
      "url": "https://www.linkedin.com/in/stevelitzow?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAOjBwBP9nWnY_-6KWhJLV-EzTXeRDsxTg",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7286040863896436736",
      "url": "https://www.linkedin.com/in/nbstagge?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAATnuucByGwl32yGUrVxrwutwtfYfM6bNqk",
      "errors": [
        "Failed to fetch media URL."
      ]
    }
  ]
}