{
  "posts": [
    {
      "postId": "urn:li:activity:7284985934415020032",
      "url": "https://www.linkedin.com/in/alexhormozi?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAUHE1IBE3DVpnF6zz3PljupLhC8chJWAXY",
      "name": "Alex Hormozi\nAlex Hormozi",
      "content": "Richer people won't judge you for saving your money. \nFitter people won't judge you for going to the gym every day. \nHigher-status people won't judge you for cutting bad friends.\n\nThe people who don't have ambitious goals have the most to say because they have nothing else to do. Please take advice from people who have achieved what you want in life.",
      "reactions": {
        "likes": "207",
        "comments": "29 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Spot on! It's like they say, 'Empty vessels make the most noise.' Surround yourself with achievers, not naysayers!",
          "userName": "Duncan Butters",
          "userProfileURL": "https://www.linkedin.com/in/duncan-butters-498b03aa",
          "dataId": "urn:li:comment:(activity:7284985135475634176,7284986898941411328)"
        },
        {
          "commentText": "Here’s what to remember the next time someone judges you:\n\n You’ll never get criticized by someone doing MORE than you. \n\nTheir insecurities are a reflection of their limitations, not yours.",
          "userName": "Natalie Vardabasso",
          "userProfileURL": "https://www.linkedin.com/in/nvardabasso",
          "dataId": "urn:li:comment:(activity:7284985135475634176,7284986618589954050)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7284978187351035906",
      "url": "https://www.linkedin.com/in/bryanthomas-guidingthewaytosuccess?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAHDpPcB4v645_LLNCnx0566Zm_ueB01pkc",
      "name": "Bryan Thomas\nBryan Thomas",
      "content": "Watching and helping my son with Legos is a favorite Sunday afternoon experience.\n\nSo, what ...\n\nLeadership is a lot like building with Legos. Stick with me:\n\n• Start with a Plan: You can’t build the Death Star without instructions. (Okay, some people can, but they’re wizards.) Great leaders make sure everyone knows the plan before they start snapping pieces together.\n\n• Every Piece Matters: Even the tiniest brick has a job to do. Same with your team—everyone plays a role in building something awesome.\n\n• Be Ready to Pivot: Sometimes you realize you’re missing a piece. Great leaders don’t panic; they get creative. (Or dig through the couch cushions.)\n\n• Celebrate the Build: When it all comes together, step back and admire it. Then get ready to build something even bigger.\n\nSo, next time you’re stepping on a Lego (ouch!), think of it as a reminder to lead with creativity, patience, and a good plan. What’s your favorite “Lego lesson”? ",
      "reactions": {
        "likes": "2",
        "comments": "1 comment",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "One block at a time! You know we are big Lego fans over here Bryan Thomas",
          "userName": "✒️Claire M. Davis🖋️",
          "userProfileURL": "https://www.linkedin.com/in/clairemdavis",
          "dataId": "urn:li:comment:(activity:7284977486289862656,7284978167943995392)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7284985834922004480",
      "url": "https://www.linkedin.com/in/louise-donadieu?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAemy8ABESFW6idA__7b9NBBAoCPZUuzh6c",
      "name": "Louise Donadieu\nLouise Donadieu",
      "content": "When one door closes another one really does bloody open. \n\nOne thing I’ve learnt in runningfor 5 years (how has it been that long?), is the power of not letting change phase you.\n\nI almost laugh it off now and move with the wave. From new clients to changes in technology and adapting to the ai wave. Creating a fluid and adaptable business is something I’ve really got down to an art now.\n\nIf you stay the same, your business will eventually cease to exist.\n\nSo if you’re thinking about adopting that new technology, pivoting your service offering, launching that new office … follow your instincts and surround yourself with good people who can move through it with you.\n\nBusiness processes need to bend and adapt, build your business around adaptability. It’s that simple.",
      "reactions": {
        "likes": "1",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": []
    },
    {
      "postId": "urn:li:activity:7284962653704237057",
      "url": "https://www.linkedin.com/in/drtheodoraziamou?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAH7xRcBC0VFQPl-2FXtuEy_5OATAjPm9qI",
      "name": "Dr. Theodora ZIAMOU\nDr. Theodora ZIAMOU",
      "content": "THIS SCIENCE-BACKED INSIGHT\nCAN TURN NOs INTO YESes, FASTER.\nDO YOU USE IT?\n\n\nThat action you want your customer to take…(register, pay, book, sign the contract, follow up, take the next step before next year, engage more, choose the option you want…)\n\n…research has shown it happens ONLY when a number of *conditions* are met.\n\n(Have you noticed all the above are actions/behaviours?)\n\n\nIf you want them to DO something (an action/a behaviour), you need to use tactics that specifically IMPACT THEIR DOING vs. their Thinking.\n\n\n\nIf the tactics you use are not action-specific, they CANNOT make them take the action you want. Simply because they don’t impact behaviour or action.\n\nThink of it like this - let’s say you want to take them from city A to city B:\n\n\nThere is no transportation means from A to B\n\nCity B is far, far away, and there are mountains to climb and rivers to cross between the two (in case you want them to go by foot)\n\nTeleportation has not been invented yet\n\nYou promise them (luxurious) travel to B by planting some trees…( = zero effect on travel, on bookings, on going places for them, zero money in you wallet for you).\n\n\nIt won’t happen.\n\n\n️ With this in mind, you need to know WHERE to look and what to TWEAK in your existing business processes, so your next customer finds easily their way to you. And they stay.\n\n️ Such tweaks are specific, research-based, small changes in what you are already doing - and they really make a difference in my clients work - and finances.\n\n(If you tweak, without knowing how they make decisions, it's simply...a tweak that doesn't bring change.)\n\n\n\n→ Sounds difficult?\n\n→ Don’t know where to start?\n\nThe links in the comments lead you to science-backed help, NO MATTER the stage you are currently in.\n\nLet’s go. ",
      "reactions": {
        "likes": "345",
        "comments": "8 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": " What about SUPERCHARGING your current or upcoming offer with the latest findings on customer psychology?\n\nMy science-backed, ULTIMATE OFFER OPTIMISATION is about specific psychology tweaks, strategically inserted in the RISKIER DIMENSIONS of your offering that drive your potential customer AWAY, without you realising it. I’ll help you trigger the response you want from your customer, easier. You’ll be relieved from that frustration you have been feeling lately, regarding your results and the direction you need to take.\n\nReal action takers, consultants and small business owners are loving it. DM me to check whether this is the right move for you. Two slots available per month.",
          "userName": "Dr. Theodora ZIAMOU",
          "userProfileURL": "https://www.linkedin.com/in/drtheodoraziamou",
          "dataId": "urn:li:comment:(activity:7284902690780790784,7284907521817890816)"
        },
        {
          "commentText": "Thanks for reading :) I appreciate it.\nFor the right focus, and for what to do, what NOT to do, and in what order, to make your customer take the action you want, faster, THE BLUEPRINT is for you : https://www.enlexis.com/help-for-small-businesses?commentstrategy. Research-backed advice for those who dare to ask.",
          "userName": "Dr. Theodora ZIAMOU",
          "userProfileURL": "https://www.linkedin.com/in/drtheodoraziamou",
          "dataId": "urn:li:comment:(activity:7284902690780790784,7284907195744288770)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7284986578014216192",
      "url": "https://www.linkedin.com/in/westmcdonaldco?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAEvxMQBQ77AN3_0OXUHuUpKcY6AMaxm8us",
      "name": "West McDonald\nWest McDonald",
      "content": "Greg Welchans , Sarah Custer , lead a killer panel including Karl Boissonneault , Laura Blackmer , Brian Murphy , Tim Renegar and Scott Stahl as they get Disty with it at\n! Embracing change in supply chain.",
      "reactions": {
        "likes": "1",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": []
    },
    {
      "postId": "urn:li:activity:7284940797492305923",
      "url": "https://www.linkedin.com/in/leslievenetz?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADPju4B9I-KSyVAlH2xAmiN72f5wsayOtM",
      "name": "Leslie Venetz\nLeslie Venetz",
      "content": "Email personalization is dead. \n\nOkay, it's not exactly dead, but pretending that openers like,\n\n\"Congrats on your Series A.\"\n\"I see that you went to [college].\"\n\"I see that you're the [title] at [company]\"\n\nare personalization is definitely dead in 2025.\n\n\n Watch this 53-second video to learn why generic or disingenuous email personalization will not work in 2025 and how to write RELEVANT email copy so you can\nto your prospect's attention.\n\n\n How are you personalizing at scale in 2025?",
      "reactions": {
        "likes": "40",
        "comments": "25 comments",
        "shares": "0"
      },
      "mediaUrl": "blob:https://www.linkedin.com/64adfd64-f4d9-46b5-b7a2-fef023c55d73",
      "comments": [
        {
          "commentText": "Amen! personalization without relevance is just noise",
          "userName": "Ronen R. Pessar",
          "userProfileURL": "https://www.linkedin.com/in/rpessar",
          "dataId": "urn:li:comment:(ugcPost:7281360340074799105,7284940779460968450)"
        },
        {
          "commentText": "Ronen R. Pessar THIS ",
          "userName": "Leslie Venetz",
          "userProfileURL": "https://www.linkedin.com/in/leslievenetz",
          "dataId": "urn:li:comment:(ugcPost:7281360340074799105,7284946116691771393)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7284986642535194625",
      "url": "https://www.linkedin.com/in/jeromekieffer?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAvy0oUBq00IG5blCln7Ylk-nHZHDyI9ntg",
      "name": "Jérôme Kieffer\nJérôme Kieffer",
      "content": "Avec 250 associés et nos 4500 collaborateurs nous avons décidé de lancer le premier cabinet de conseil aux entrepreneurs : RYDGE Conseil.\n\nPourquoi ce choix ?\n\nDans un monde où le changement est la seule constante, où les règles du jeu se réinventent sans cesse, entreprendre est un pari audacieux.\nC'est une source de développement individuel et d'épanouissement collectif.\n\nVous, entrepreneurs, vous devez penser et faire les choses différemment avec assurance, malgré l’incertitude. Chercher le succès non seulement par la performance, mais aussi par l’épanouissement de votre équipe et votre contribution à un monde meilleur.\n\nAprès plus d’un siècle aux côtés de dirigeants, nous savons que pour braver l’inconnu, il faut avoir confiance. En soi-même, en ceux qui nous accompagnent, et en l’avenir.\n\nNous savons combien la confiance libère le potentiel, forge la résilience, et donne la force de surmonter tout obstacle avec détermination pour aller au bout de ses ambitions.\n\nPartout en France, chaque jour, nous œuvrons en équipe aux côtés d’entrepreneurs tous très différents pour préserver et encourager leur audace. Nous savons comprendre, préciser leur projet et en mesurer les enjeux personnels et collectifs.\n\nNous éclairons vos décisions pour tracer le chemin vers la réussite, en mettant toutes les expertises du conseil et tout notre soutien opérationnel au service d'un engagement et de votre confiance.\n\nNous la construisons ensemble, en apprenant à :\nse parler sincèrement,\nse laisser inspirer,\nse mettre au défi,\ndébattre,\ndécider,\néchouer,\ndouter,\npersévérer,\nse dépasser,\nexceller\ns’engager.\n\nPlus que jamais, réussir c'est bien s’entourer. Avec nous, vous ne prendrez plus seulement des risques, mais des risques éclairés. Avec nous, vous ne verrez plus seulement des chiffres, mais des opportunités. Ensemble, nous oserons entreprendre.\n\nVoilà ce que je voulais vous partager au début de cette aventure entrepreneuriale,\n\navec vous,\n\npour vous.",
      "reactions": {
        "likes": "77",
        "comments": "3 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Quelle étape!\n\nAvoir rendu cela possible avec un tel élan collectif est extra-ordinaire... et ce possible ouvre tellement d'autres possibles . Tout le meilleur à Rydge, ses équipes, ses clients, ses partenaires \n\nBiiiiig congrats!",
          "userName": "Louis-Antoine Lauvergne",
          "userProfileURL": "https://www.linkedin.com/in/louisantoine-lauvergne",
          "dataId": "urn:li:comment:(activity:7284981360363012096,7284985830715064320)"
        },
        {
          "commentText": "Félicitations Jérôme !",
          "userName": "arnaud screve",
          "userProfileURL": "https://www.linkedin.com/in/arnaud-screve-71630460",
          "dataId": "urn:li:comment:(activity:7284981360363012096,7284987143276367875)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7284543460475387904",
      "url": "https://www.linkedin.com/in/shulinlee?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAF4NQwB69jXtpRE9juukQfitSX0kfLdSOg",
      "name": "Shulin Lee\nShulin Lee",
      "content": "7 WORST Things to Do When Exiting a Company  \n\n(and what to do instead!)\n\nPeople think once they’ve resigned,\nit’s game over.\n\nBut how you leave matters just as much\nas how you started.\n\nDon’t wreck your reputation!\n\nHere’s how NOT to exit,\n(and what to do instead:)\n\n1/ Burn Bridges. \n↳ That dramatic exit you're imagining? Forget it.\n↳ Instead, leave on good terms.\n\n2/ Slack Off in your Final Weeks. \n↳ Tempted to coast to the finish line? Don’t.\n↳ Show your integrity.\n\n3/ Drop a Resignation Bomb. \n↳ Surprising your manager with a sudden exit? Bad move.\n↳ Instead, communicate early and give them time.\n\n4/ Bash the Company On Your Way Out. \n↳ Frustrated? Venting might feel good in the moment.\n↳ Channel that energy into constructive feedback.\n\n5/ Neglect Proper Handover. \n↳ Leaving your work in a mess? Not cool.\n↳ Do detailed handover notes for a smooth transition.\n\n6/ Ghost your Colleagues. \n↳ Disappearing without a word? Big mistake.\n↳ Acknowledge the relationships you’ve built.\n\n7/ Forget your Exit is Part of Your Legacy. ‍️\n↳ This isn’t an ending—it’s a step in your journey.\n↳ Stay connected. Never know when you’ll cross paths again.\n\nIt’s a small world,\nand people remember how you made them feel.\n\nLeave the right way.\nYour reputation depends on it.\n\nP.S. Each one of these came from a\n\n\n---\n\nRepost this to help someone today!\n\n Followfor more.",
      "reactions": {
        "likes": "1,176",
        "comments": "545 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Shulin Lee one of the kindest exits I have seen happened years ago. On returning their equipment they took the time to package and wrap with extra care so the computers wouldn’t break but the best part of opening their returned equipment was a hand written note thanking us for the opportunity to work here and having gratitude. I let them know if on their journey they ever needed a reference I would be happy to give one. Years have passed since then and I received a kind text a month or so ago asking for help. I made sure to give them my email, calendar link, and cell for their references. Be kind you never know how your paths can cross again.",
          "userName": "Jennelle McGrath",
          "userProfileURL": "https://www.linkedin.com/in/jennellemcgrath",
          "dataId": "urn:li:comment:(ugcPost:7284422776340336640,7284549634780200960)"
        },
        {
          "commentText": "Jennelle McGrath such a great example of how small gestures can go a long way. You never know when that kindness comes back around. Thank you for sharing :)",
          "userName": "Shulin Lee",
          "userProfileURL": "https://www.linkedin.com/in/shulinlee",
          "dataId": "urn:li:comment:(ugcPost:7284422776340336640,7284550535544762368)"
        },
        {
          "commentText": "Shulin Lee  ",
          "userName": "Jennelle McGrath",
          "userProfileURL": "https://www.linkedin.com/in/jennellemcgrath",
          "dataId": "urn:li:comment:(ugcPost:7284422776340336640,7284560102571794432)"
        },
        {
          "commentText": "Twenty years ago, giving two weeks or more notice was the norm. Now, virtually every week. you read about someone giving notice and then being walked out immediately. \n\nCompanies rely on at-will employment across the US, laying off or separating their employees with no notice, locking them out of the computer with no notice.\n\nHonestly, I'd only recommend giving notice based on the track record of the company, not just because it's expected.",
          "userName": "Kevin Lewis, MA, CPP, STS",
          "userProfileURL": "https://www.linkedin.com/in/kevin-lewis-usaf-ret",
          "dataId": "urn:li:comment:(ugcPost:7284422776340336640,7284573210027638784)"
        },
        {
          "commentText": "Kevin Lewis, MA, CPP, STS But giving notice isn’t just about fulfilling expectations ~ it’s about staying true to your own professionalism and integrity.\n\nA thoughtful exit benefits you in the long run, especially in industries where reputations and relationships carry weight.\n\nHow YOU choose to leave can impact future opportunities, references, and connections. It’s not always easy, but staying above the fray ensures you leave on your terms.",
          "userName": "Shulin Lee",
          "userProfileURL": "https://www.linkedin.com/in/shulinlee",
          "dataId": "urn:li:comment:(ugcPost:7284422776340336640,7284887953904975872)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7284986390600183809",
      "url": "https://www.linkedin.com/in/romanfradin?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACspC_8BszPYVnmW91vp-rkyNPVA2lQwYgI",
      "name": "Roman Fradin\nRoman Fradin",
      "content": "La fausse bonne idée \n\n Tu veux développer ton business ou ton personal branding ? Tu te dis que, pour maximiser ta visibilité, tu dois être présent partout : LinkedIn, Instagram, TikTok, Twitter, Facebook…\n\n Erreur classique, mais coûteuse.\n\nMoi aussi, je suis passé par là. Je pensais que plus j’étais visible, plus je serais impactant. Résultat ?\n\nJ’ai perdu du temps, de l’énergie et, pire encore, ma stratégie était complètement diluée.\n\nAvant de te lancer, pose-toi ces questions essentielles :\n\n1️⃣ Qui est ta cible ?\n\nChaque réseau social a son propre public. Par exemple :\n\n Sur LinkedIn, tu touches principalement des professionnels (idéal pour le B2B).\n\n Sur TikTok, l’audience est jeune et adepte de contenus courts et créatifs.\nSi tu vends des produits pour des seniors, aller sur TikTok n’aura aucun sens, non ?\n\n2️⃣ As-tu une stratégie ?\n\nCréer du contenu juste pour poster, c’est comme parler dans le vide. Sans stratégie claire, tes efforts seront vains.\n\n3️⃣ As-tu le temps ?\n\nPublier du contenu de qualité régulièrement, échanger avec ta communauté et suivre les algorithmes, c’est un job à part entière. Si tu veux être partout sans aide, tu risques vite de t’essouffler.\n\nCe qu’il faut retenir :\n\n Choisis un ou deux réseaux sociaux maximum : ceux où se trouve TA cible.\n\n Mets l’accent sur la qualité et la régularité. Ce sont elles qui boostent ton engagement et ta visibilité.\n\n Ton audience (et les algorithmes !) apprécie des rendez-vous réguliers et du contenu à forte valeur ajoutée.\n\nEt toi, tu as déjà commis cette erreur ? \n\n Partage ton expérience en commentaire, ou dis-moi : quelles sont tes plus grandes difficultés pour gérer ta présence en ligne ?\n\n Je serais ravi d’échanger avec toi sur le sujet !",
      "reactions": {
        "likes": "1",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": []
    },
    {
      "postId": "urn:li:activity:7284950426968346624",
      "url": "https://www.linkedin.com/in/jennasalomons?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABfiaogBuGhGEEIWO-k26G8jPl7ckObvzdc",
      "name": "Jenna Salomons\nJenna Salomons",
      "content": "If you are in Medical Sales and you aren't following ️Claire M. Davis️, what ARE you doing?  ️Claire is amazing, gives great advice, and gets results - plus she's just an awesome person that makes any room she's in sparkle !",
      "reactions": {
        "likes": "2",
        "comments": "2 comments",
        "shares": "0"
      },
      "mediaUrl": "blob:https://www.linkedin.com/da06065a-604e-4586-99ab-29970a49b05b",
      "comments": [
        {
          "commentText": "Oh my goodness, I can hardly express how much this made my day, Jenna Salomons. Thank you. I’m honored to work with wonderful people like Mike Deckard, MBA. He’s ‘good people’ — as are you, Jenna Salomons ️",
          "userName": "✒️Claire M. Davis🖋️",
          "userProfileURL": "https://www.linkedin.com/in/clairemdavis",
          "dataId": "urn:li:comment:(ugcPost:7284945183073345537,7284950775850504192)"
        },
        {
          "commentText": "Clapping ️Claire M. Davis️ - beautiful!!",
          "userName": "Gina Riley",
          "userProfileURL": "https://www.linkedin.com/in/ginariley",
          "dataId": "urn:li:comment:(ugcPost:7284945183073345537,7284962346748276736)"
        }
      ]
    }
  ],
  "errors": [
    {
      "postId": "urn:li:activity:7284985934415020032",
      "url": "https://www.linkedin.com/in/alexhormozi?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAUHE1IBE3DVpnF6zz3PljupLhC8chJWAXY",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7284978187351035906",
      "url": "https://www.linkedin.com/in/bryanthomas-guidingthewaytosuccess?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAHDpPcB4v645_LLNCnx0566Zm_ueB01pkc",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7284985834922004480",
      "url": "https://www.linkedin.com/in/louise-donadieu?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAemy8ABESFW6idA__7b9NBBAoCPZUuzh6c",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7284962653704237057",
      "url": "https://www.linkedin.com/in/drtheodoraziamou?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAH7xRcBC0VFQPl-2FXtuEy_5OATAjPm9qI",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7284986578014216192",
      "url": "https://www.linkedin.com/in/westmcdonaldco?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAEvxMQBQ77AN3_0OXUHuUpKcY6AMaxm8us",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7284986642535194625",
      "url": "https://www.linkedin.com/in/jeromekieffer?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAvy0oUBq00IG5blCln7Ylk-nHZHDyI9ntg",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7284543460475387904",
      "url": "https://www.linkedin.com/in/shulinlee?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAF4NQwB69jXtpRE9juukQfitSX0kfLdSOg",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7284986390600183809",
      "url": "https://www.linkedin.com/in/romanfradin?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACspC_8BszPYVnmW91vp-rkyNPVA2lQwYgI",
      "errors": [
        "Failed to fetch media URL."
      ]
    }
  ]
}