{
  "posts": [
    {
      "postId": "urn:li:activity:7285350604158181376",
      "url": "https://www.linkedin.com/in/anna-mykheieva-371565182?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACsnJcUBoGwlaI3jd3I1iY2II41rAc7j9aQ",
      "name": "Anna Mykheieva\nAnna Mykheieva",
      "content": "My Team is Not My Family\n\nI recently read about how Netflix conducted an internal survey and let go of employees who considered their colleagues “family.” And—deep down—I agreed with this decision. I’d actually be concerned if my team felt like family to me.\n\nSounds harsh, right? But let’s break it down.\n\nI deeply value every member at my workplace. We joke around in internal chats and personal messages, check in on each other, have a blast at corporate events, and communicate openly. In every project I’ve led, I’ve always prioritized creating a great atmosphere, and it remains one of my main focuses ️\n\nThat being said, I don’t see my partners and employees as family. Instead, we’re more like a sports team striving for a common goal—like an Olympic squad.\nLet me explain from a psychological perspective. Relationships are often built around fulfilling certain needs.\nWhat kind of needs might someone who looks for “family” in their team be trying to fulfill?\n▫️ unconditional love and acceptance\n▫️ support\n▫️ safety\n▫️ stability and predictability (family is forever)\nLet’s ignore the obvious contradiction here—no one in a family owes anyone anything, yet a CEO is expected to pay salaries . Instead, let’s think—can I truly meet those needs?\n\nNo, because I’m building my brand.\nFor comparison, my needs as an entrepreneur and leader are entirely different—not family-oriented:\n high net profit\n satisfied clients\n efficient use of resources\nTo achieve this, I need results and the unique strengths of each team member. I have to set goals and tasks, require KPI fulfillment, enforce deadlines and agreements.\nThis brings us to another issue with seeing a team as family—the development of strong secondary emotional ties.\nIf person isn’t performing well, and I’m emotionally attached to them, it will be harder for me to explain what's wrong. But… this paradise wouldn’t last long anyway, because inefficient work leads to financial losses, and the business would eventually collapse.\n\nSo, what’s my approach?\nI advocate for a partnership-based and respectful attitude to team.\nWhat are your thoughts and feelings about this attitude toward a team?\n\n(P.S. Bruno is helping me to manage my work  )",
      "reactions": {
        "likes": "15",
        "comments": "5 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Not every work chat needs to feel like a Thanksgiving dinner Anna \nKeep it pro, \nkeep it moving. ",
          "userName": "Ali Haider",
          "userProfileURL": "https://www.linkedin.com/in/haider-ali292",
          "dataId": "urn:li:comment:(activity:7285343690519183361,7285344430054641664)"
        },
        {
          "commentText": "Ali Haider thank you a lot ",
          "userName": "Anna Mykheieva",
          "userProfileURL": "https://www.linkedin.com/in/anna-mykheieva-371565182",
          "dataId": "urn:li:comment:(activity:7285343690519183361,7285345049419087872)"
        },
        {
          "commentText": "Treating teams as partners ensures accountability, growth, and mutual respect, which is key to long-term success. \n\nBuilding a brand needs clarity in relationships—families are forever, but teams evolve with goals!",
          "userName": "Syed Irtaza Ali",
          "userProfileURL": "https://www.linkedin.com/in/syed-irtaza-ali-b3a634326",
          "dataId": "urn:li:comment:(activity:7285343690519183361,7285348615756111872)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7285344210801541121",
      "url": "https://www.linkedin.com/in/tomslocum?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAek5xkBRDVHoluAQhY5rWz-Itt8zOiZn_Q",
      "name": "🔥 Tom Slocum\n🔥 Tom Slocum",
      "content": "Cold email is broken. But here’s how you can fix it \n\nThe stats are brutal\n\n361 billion emails were sent in 2024 and a huge chunk of them went straight to spam\n\nReps are burning through their domains, writing novels no one reads and wondering why open rates are dead in the water\n\nI get it. Email deliverability feels overwhelming. DNS records, SPF, DKIM, DMARC, IP rotation... It’s a lot. And for most teams it’s a total blind spot\n\nThats wherecomes in\n\nIts email infrastructure built for cold outreach\n\nHeres why I set it up for my team and clients\n\n Separate domains without the headache. Maildoso lets you create lookalike domains to protect your main one. No more risking your entire company’s reputation because your reps are blasting emails from a single domain\n\n Automated technical setup. SPF, DKIM, DMARC, and MX records are automatically configured so you don’t need to be an IT expert to get started\n\n Mailbox rotation. Maildoso rotates between trusted IP addresses ensuring emails are sent from ones with the best reputation to maximize deliverability\n\n Streamlined scaling. Add 5–10 mailboxes per rep in minutes. Whether you’re a team of 5 or 50 Maildoso makes scaling cold email simple and manageable\n\nIf you’re sending cold emails at scale you need to be intentional about your setup\n\nStop letting bad infrastructure kill your deliverability\n\nIn 2025 its all about smarter email—not more email\n\nCheck out Maildoso and see how easy it is to fix your foundation\n\nP.S. I’ve been testing it with my team and two clients and the difference is night and day. Want to chat more? Drop a comment or DM me ",
      "reactions": {
        "likes": "17",
        "comments": "12 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Thanks for the mention  Tom, a misconfigured SPF can tank your campaigns for weeks\n\nSave yourself hours trying to configure SPF, DKIM, or MX records. \nInstead, join 2000 other customers to automate your mailboxes and domain setup\n\nSave time & effort here",
          "userName": "Maildoso",
          "userProfileURL": "https://www.linkedin.com/company/maildoso/posts",
          "dataId": "urn:li:comment:(activity:7285340163285659649,7285343390949347330)"
        },
        {
          "commentText": "Maildoso FACTS! SPF and all those things can do such destruction. And by the time you notice its to late. And for those who have manually had to set this stuff up, they know it's hard and takes a lot of time. Not with Maildoso ",
          "userName": "🔥 Tom Slocum",
          "userProfileURL": "https://www.linkedin.com/in/tomslocum",
          "dataId": "urn:li:comment:(activity:7285340163285659649,7285347998337761280)"
        },
        {
          "commentText": "No email strategy without a solid infra setup ",
          "userName": "Sendler.ai",
          "userProfileURL": "https://www.linkedin.com/company/sendler-ai/posts",
          "dataId": "urn:li:comment:(activity:7285340163285659649,7285343593177751553)"
        },
        {
          "commentText": "Sendler.ai NOPE! Aint doing you any favors ",
          "userName": "🔥 Tom Slocum",
          "userProfileURL": "https://www.linkedin.com/in/tomslocum",
          "dataId": "urn:li:comment:(activity:7285340163285659649,7285348074560864256)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7283556859033108480",
      "url": "https://www.linkedin.com/in/jeffgibsonsf?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAwIUWcBNxQCGzClX5TSU4wOSmbn0lT3OhU",
      "name": "Jeff Gibson\nJeff Gibson",
      "content": "This week, there have been lots of discussions about hiring fewer engineers because they are x% more effective (because of AI). That seems odd to me; shouldn't you hire more?\n\nEngineers should be able to generate a multiple of their salary in ARR; if they are 30% more effective, they can generate 30% more revenue, making it even easier to justify hiring more engineers.\n\nIf this isn't the case, problems are likely brewing.\n\nOf course, adding new features isn't the only way to generate revenue. However, sales and marketing can only effectively sell the product you actually have built.",
      "reactions": {
        "likes": "89",
        "comments": "42 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Does market cap increase simply because productivity increases? \n\nI'm going to oversimplify here:\n\nLet's pick say IT services, a company of 100 creates 1000 IT-support requests per a year or their staff is bottlenecked.\n\nIf I'm running a firm dedicated to serving my clients needs, and my tech professionals can solve 30 percent more, unless the rate of issues increase, I need less head count to deliver my services and collect.\n\nIn the case of tech support, if my clients are now running leaner, and able to self-serveve more often with LLMs, that market cap begins to collapse.\n\nNow if I did want to maintain my headcount, I could potentially pick up more clients with that surplus, but my competing firms are also acting more effective.(unless I have some proprietary system not generally available to break symmetry)\n\nThis is really where marketing comes into play if we want to avoid an economic spiral to the bottom.\n\nAs LLMs collapse existing markets, and I wanna keep my good people employed, I could now branch into other markets, for example data-backup services. However secondary existing markets are also likely collapsing by the same forces.\n\nThe best solution to the current situation would be to grow new markets.",
          "userName": "Eric C",
          "userProfileURL": "https://www.linkedin.com/in/eric-c-0612a783",
          "dataId": "urn:li:comment:(activity:7283556859033108480,7284053068197851136)"
        },
        {
          "commentText": "Eric C in the example of Salesforce who made news last week, it's a much better example of this trap because they are a product company.\n\nThe idea that no further investment in R&D is needed because of AI and all that's needed to make more money is hiring 1000 sales people to sell more AI is probably the best message that can be delivered to shareholders. Of course it's entirely short term as eventually the tech debt piles up and they already have a mountain of it to start!\n\nIn the case of a services based company you can charge more per hour given more output, charge per outcome and deliver more outcomes, or have more junior people ramp faster which of course means less time from seniors and higher billable rates. That being said, the services market in most segments is over saturated so you're right that they need to offer more or expand.",
          "userName": "Jeff Gibson",
          "userProfileURL": "https://www.linkedin.com/in/jeffgibsonsf",
          "dataId": "urn:li:comment:(activity:7283556859033108480,7284231094156042240)"
        },
        {
          "commentText": "Eric C In the long run, yes, market cap increases with productivity, but investors are rarely concerned with long-run economics, and most companies prioritize pandering to investors over all other practices.",
          "userName": "Harris Joseph",
          "userProfileURL": "https://www.linkedin.com/in/harris-joseph-422605104",
          "dataId": "urn:li:comment:(activity:7283556859033108480,7285003578249760768)"
        },
        {
          "commentText": "Fully agree. Most peoples' eyes glaze over when I ask them about profitability, ROI, and what part of an application is the most profitable, and what's losing money.\n\nWHY ARE YOUR EYES GLAZING OVER?!! THIS IS THE MOST CRUCIAL QUESTION FOR YOUR COMPANY!!! If you don't know the answer, whether you choose JavaScript over Ruby* is irrelevant!\n\n* (FYI, it's JavaScript...go with JavaScript)",
          "userName": "Jordan H.",
          "userProfileURL": "https://www.linkedin.com/in/jordan-h-a78122163",
          "dataId": "urn:li:comment:(activity:7283556859033108480,7284946296614891521)"
        },
        {
          "commentText": "Jordan H. 1000%! People (maybe not?) be surprised by how many companies make engineering decisions without thinking about ROI/profitability.",
          "userName": "Jeff Gibson",
          "userProfileURL": "https://www.linkedin.com/in/jeffgibsonsf",
          "dataId": "urn:li:comment:(activity:7283556859033108480,7284956797063303171)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7285221704858005504",
      "url": "https://www.linkedin.com/in/luckyabhi?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAPYgUBQRDVAO3T8b4mUMwEtxvg9Ye42A4",
      "name": "Abhijeet Kumar\nAbhijeet Kumar",
      "content": "I now tell all good Indian startups to try to sell in outside Indian markets. \n\nBecause India has only mass consumers but hardly any consumer loyalty and higher spend. No business can grow on such type of consumer base.\n\nIf your product is really good, then try to sell it outside India and see how good it really is.",
      "reactions": {
        "likes": "74",
        "comments": "15 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Come join our platform and launch your brand in the UK & EU",
          "userName": "SWADESHI TRADE FAIR",
          "userProfileURL": "https://www.linkedin.com/company/swadeshi-trade-fair/posts",
          "dataId": "urn:li:comment:(activity:7285215008043552769,7285245909339136000)"
        },
        {
          "commentText": "sai kishore yadav (sky) let's connect send me a connect request",
          "userName": "SWADESHI TRADE FAIR",
          "userProfileURL": "https://www.linkedin.com/company/swadeshi-trade-fair/posts",
          "dataId": "urn:li:comment:(activity:7285215008043552769,7285323998815514624)"
        },
        {
          "commentText": "Have sent you a connect request",
          "userName": "SWADESHI TRADE FAIR",
          "userProfileURL": "https://www.linkedin.com/company/swadeshi-trade-fair/posts",
          "dataId": "urn:li:comment:(activity:7285215008043552769,7285324206446194689)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7285279651873128450",
      "url": "https://www.linkedin.com/in/colbywegter?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABKlU-gB43StC0lTFt2eMY4ubjQvzVYSc9w",
      "name": "Colby Wegter\nColby Wegter",
      "content": "How we took our agency from $80K months to $208K months (without cold outreach or ads):\n\nYou have a lead problem, right?\n\nIt's a problem, sure. But it's not THE problem.\n\nSo what is it?\n\nYou're not taking advantage of your existing clients.\n\nWe weren't either. It took us over 5 years to get to $1M per year.\n\nThen we got to $2.5M per year in 12 months.\n\nHere's what we did:\n\n[1] The Website\n\nWe sold SEO but weren't using it ourselves.\n\n→ Gettable keywords\n→ Geo + Service pages\n→ Long-form blogs\n\nWe doubled our investment on our core service for ourselves and it worked.\n\n[2] Maximum Leverage Clients\n\nNot all clients are created equal. So we didn't treat them that way.\n\nOrganized clients into four categories:\n\n→ Low paying, Low maintenance\n→ Low paying, High maintenance\n→ High paying, High maintenance\n→ High paying, Low maintenance\n\nEach category got an action plan.\n\nMore efficiency for low-leverage clients. More upsells to high-leverage clients.\n\n[3] Beta Offers\n\nSpeaking of upsells, we wanted them to be painless and profitable.\n\nBeta Offers solved that.\n\n→ One call\n→ One slide deck\n→ Multiple clients upsold for 3X their original investment\n\nWhen:\n\n→ Your website is your #1 salesperson\n→ Each client has a clear action plan\n→ Your best clients invest more\n\nHow many leads do you need to hit 7 figures and beyond?\n\nJus' sayin'.\n\nStraightforward is sexy. I break all this down in detail in my newsletter:",
      "reactions": {
        "likes": "12",
        "comments": "3 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "When you take the time to craft smart BETA upsells. Your time prospecting or doing outreach shrinks. Much better to keep selling to people who already trust you over people who don't ",
          "userName": "Nick Anderson-Vines",
          "userProfileURL": "https://www.linkedin.com/in/founderghostwriter",
          "dataId": "urn:li:comment:(activity:7285279651873128450,7285295873717067776)"
        },
        {
          "commentText": "Great point maximizing clients is everything",
          "userName": "Braden Watt",
          "userProfileURL": "https://www.linkedin.com/in/braden-watt",
          "dataId": "urn:li:comment:(activity:7285279651873128450,7285316165755711488)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7285272467311382530",
      "url": "https://www.linkedin.com/in/jenblandos?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAT0RgB_odYBzsBRsYpypkNj_6DmBcdhYg",
      "name": "Jen Blandos\nJen Blandos",
      "content": "Netflix’s talent strategy: \n\nRevolutionary? Or a recipe for burnout?\n\nNetflix doesn’t see teams as families - it sees them as professional sports teams.\n\nHere’s how their approach works:\n\n1️⃣ The Keeper Test\nManagers ask themselves two simple questions:\n\n“If [X] wanted to leave, would I fight to keep them?”\n“Knowing what I know today, would I rehire them?”\nIf the answer is no, it’s “fairer to part ways quickly.”\n↳ But Netflix evaluates the whole record—short-term mistakes don’t cost someone their job.\n\n2️⃣ Teammates, Not Siblings\nFamilies are about unconditional love.\nSports teams? They’re built to win.\n↳ Netflix focuses on performance and accountability, even if it means replacing beloved team members.\n\n3️⃣ Radical Autonomy\nNo holiday policy.\nNo expense policy.\nNo micro-management.\n↳ Netflix trusts its staff to make decisions, rewarding self-motivation and responsibility.\n\nBut this approach isn’t for everyone.\nNetflix’s culture thrives on risk, experimentation, and resilience - but for those who need stability, it may feel too intense.\n\n⬇️ Could Netflix’s strategy work in your organisation?\nWould it push your team to perform at their best - or leave them feeling burnt out and demotivated?\n Follow me, Jen Blandos, for actionable tips on business, entrepreneurship, and workplace well-being.\n️ Think this could spark ideas for a team you know? Share this post to give others more inspiration.",
      "reactions": {
        "likes": "237",
        "comments": "208 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "I think it’s totally an individual’s preference and what they want. \n\nDefinitely a burnout for folks not cut for this game. Those who are passionate and love working in such high pressure environments it’s a paradise.\n\nWhich one is you? ;)",
          "userName": "Arun Narayan",
          "userProfileURL": "https://www.linkedin.com/in/arun-narayan-842b4aa",
          "dataId": "urn:li:comment:(activity:7285263202165178369,7285272447547805697)"
        },
        {
          "commentText": "Arun Narayan It really depends on personal resilience and passion for the challenge.",
          "userName": "Jen Blandos",
          "userProfileURL": "https://www.linkedin.com/in/jenblandos",
          "dataId": "urn:li:comment:(activity:7285263202165178369,7285313080215973891)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7285350658889728002",
      "url": "https://www.linkedin.com/in/kacie-gonzales-m-s-410a2a198?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAC5tH8wBSc5O2sa-cK9yQlpGZcKOIPdlXiI",
      "name": "Kacie Gonzales, M.S.\nKacie Gonzales, M.S.",
      "content": " Exciting Career Update! \n\nI'm thrilled to share that I've recently transitioned from recruiting in the healthcare sector to focusing on engineering roles! \nThis new chapter allows me to leverage my recruiting expertise in a dynamic and innovative field. I'm excited to connect with talented engineers and help them find their next great opportunity.\n\nWith that being said... we are hiring for a multitude of roles! Keep a lookout for upcoming postings, and if you or someone you know is on the market, feel free to reach out!",
      "reactions": {
        "likes": "4",
        "comments": "1 comment",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "I'm interested",
          "userName": "Ali Shan",
          "userProfileURL": "https://www.linkedin.com/in/alishan-gangani",
          "dataId": "urn:li:comment:(activity:7285348327880044544,7285348927552253952)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7285307050568359937",
      "url": "https://www.linkedin.com/in/tomaszboinski?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAT6i3EBTB8A6x-CZu_4t39xy5C77FfuZhM",
      "name": "Tomasz Boinski\nTomasz Boinski",
      "content": "#Meta plans to cut 5% of its workforce, focusing on the lowest performers... LinkedIn \nhashtag\n#layoffs posts wave will be crazy this time... or? We will not see it.\n\nThat \"lowest performers\" move was an interesting move to see (used narrative) from the marketing/crisis management perspective... will put ppl complaining publicly in a bad light.",
      "reactions": {
        "likes": "3",
        "comments": "3 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "There was another interesting corporate BS in that piece: \"The 5% workforce cut is a part of Meta's plan to achieve 10% “non-regrettable\" attrition by the end of the current performance cycle\"\n\nnon-regrettable attrition",
          "userName": "Marek Publicewicz",
          "userProfileURL": "https://www.linkedin.com/in/markpublicewicz",
          "dataId": "urn:li:comment:(activity:7285307050568359937,7285338625981001728)"
        },
        {
          "commentText": "OMG...",
          "userName": "Tomasz Boinski",
          "userProfileURL": "https://www.linkedin.com/in/tomaszboinski",
          "dataId": "urn:li:comment:(activity:7285307050568359937,7285339064038301697)"
        },
        {
          "commentText": "We’re living in a crazy time Tomasz Boinski !",
          "userName": "John Kraski",
          "userProfileURL": "https://www.linkedin.com/in/johnkraski",
          "dataId": "urn:li:comment:(activity:7285307050568359937,7285331726111768576)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7285279589801631744",
      "url": "https://www.linkedin.com/in/yuhelenyu?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADPqtcBN8ROzfTXJfYivUVJiimQhHSyo-U",
      "name": "Helen Yu\nHelen Yu",
      "content": "What if \nhashtag\n#education could change a life, and even the world? \n\nIn\n, where only 14% of girls attend high school,is making a remarkable difference. Thanks to their efforts, Jackline is now heading to! Her story is just one of many highlighted by the, which honors innovators around the globe who are driving real change.\n\nFrom AI-powered cervical cancer screenings in\nto clean water solutions reaching millions in\n, these 2025 winners are creating a sustainable future for all.\n\nMeet 2025 winners in this picture and learn more about these incredible stories:\n\n\n\nStay Ahead of the Curve:\n Subscribe to\nnewsletter for weekly updates on\nand\n:\n Subscribe to the\nYouTube channel and tune in for the upcoming episode on AI Factory.",
      "reactions": {
        "likes": "206",
        "comments": "29 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "The work being done by the Starehe Girls Centre in Kenya is a true testament to the power of education in transforming lives.",
          "userName": "Paul Storm",
          "userProfileURL": "https://www.linkedin.com/in/paul-storm",
          "dataId": "urn:li:comment:(activity:7285279589801631744,7285280049086275590)"
        },
        {
          "commentText": "Echo that Paul Storm. Kudos to Zayed Sustainability Prize.",
          "userName": "Helen Yu",
          "userProfileURL": "https://www.linkedin.com/in/yuhelenyu",
          "dataId": "urn:li:comment:(activity:7285279589801631744,7285284069179871232)"
        },
        {
          "commentText": "Jackline’s journey to Stanford University is a beacon of hope, and these global initiatives prove that innovation and education can create lasting change. ",
          "userName": "Dr. Joerg Storm",
          "userProfileURL": "https://www.linkedin.com/in/joergstorm",
          "dataId": "urn:li:comment:(activity:7285279589801631744,7285280099879247875)"
        },
        {
          "commentText": "Could not have agreed more Dr. Joerg Storm. Glad to see the impact Zayed Sustainability Prize has made on \n#education, \n#food, \n#energy and many other fields relevant to our daily lives.",
          "userName": "Helen Yu",
          "userProfileURL": "https://www.linkedin.com/in/yuhelenyu",
          "dataId": "urn:li:comment:(activity:7285279589801631744,7285285048516308993)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7285347734302113794",
      "url": "https://www.linkedin.com/in/sanghamitradhar?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAc1IpQB3RM8JvGHmzWa58a67FKfcPl1Eo8",
      "name": "Sanghamitra D.\nSanghamitra D.",
      "content": "Be very choosy when deciding on people with whom to share and what to share. You may give your weapon to them to hurt you.\n\nBe very careful.",
      "reactions": {
        "likes": "178",
        "comments": "27 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Your insight on the importance of discerning whom to trust resonates deeply. In our interconnected world, safeguarding our vulnerabilities is crucial to maintaining our well-being. Thank you for sharing such a powerful reminder.",
          "userName": "Priyank Ahuja",
          "userProfileURL": "https://www.linkedin.com/in/priyank-ahuja",
          "dataId": "urn:li:comment:(activity:7285334820254035970,7285347726450470913)"
        }
      ]
    }
  ],
  "errors": [
    {
      "postId": "urn:li:activity:7285350604158181376",
      "url": "https://www.linkedin.com/in/anna-mykheieva-371565182?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACsnJcUBoGwlaI3jd3I1iY2II41rAc7j9aQ",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285344210801541121",
      "url": "https://www.linkedin.com/in/tomslocum?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAek5xkBRDVHoluAQhY5rWz-Itt8zOiZn_Q",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7283556859033108480",
      "url": "https://www.linkedin.com/in/jeffgibsonsf?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAwIUWcBNxQCGzClX5TSU4wOSmbn0lT3OhU",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285221704858005504",
      "url": "https://www.linkedin.com/in/luckyabhi?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAPYgUBQRDVAO3T8b4mUMwEtxvg9Ye42A4",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285279651873128450",
      "url": "https://www.linkedin.com/in/colbywegter?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABKlU-gB43StC0lTFt2eMY4ubjQvzVYSc9w",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285272467311382530",
      "url": "https://www.linkedin.com/in/jenblandos?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAT0RgB_odYBzsBRsYpypkNj_6DmBcdhYg",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285350658889728002",
      "url": "https://www.linkedin.com/in/kacie-gonzales-m-s-410a2a198?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAC5tH8wBSc5O2sa-cK9yQlpGZcKOIPdlXiI",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285307050568359937",
      "url": "https://www.linkedin.com/in/tomaszboinski?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAT6i3EBTB8A6x-CZu_4t39xy5C77FfuZhM",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285279589801631744",
      "url": "https://www.linkedin.com/in/yuhelenyu?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAADPqtcBN8ROzfTXJfYivUVJiimQhHSyo-U",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285347734302113794",
      "url": "https://www.linkedin.com/in/sanghamitradhar?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAc1IpQB3RM8JvGHmzWa58a67FKfcPl1Eo8",
      "errors": [
        "Failed to fetch media URL."
      ]
    }
  ]
}