{
  "posts": [
    {
      "postId": "urn:li:activity:7284098025466003456",
      "url": "https://www.linkedin.com/in/sophiewardell?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAA8k3EBSBawgBQmNBWVFx9L18oZa1m8i6E",
      "name": "Sophie Wardell\nSophie Wardell",
      "content": "Anyone else feeling concerned right now? \n\nI have been reading about the recent decisions by companies likeandto scale back their Diversity, Equity and Inclusion (DEI) programmes.\n\nInclusion is something I view as vital not only in business, but in society.\n\nLooking ahead, surely this “scaling back” has the potential to lead to multiple harmful outcomes:\n\nReduced workforce diversity - which in turn may limit the variety of perspectives and ideas which are essential for innovation and problem-solving.\n\nDamage to company reputation - especially amongst consumers and business partners who prioritise DEI and social responsibility (perhaps these businesses are so big that it doesn’t matter…)\n\n Decreased employee morale and engagement - particularly from underrepresented groups and their allies.\n\n Legal and compliance risks - in relation to equality, which may leave businesses exposed to claims of discrimination.\n\n Increased turnover rates - a costly and time-consuming issue to remedy.\n\n’s full article can be found here \n\n\n\nI know I’m not the only person who feels uneasy about all of this.\n\nTo quote, author of “Unwavering” and a prominent DEI advocate:\n\n\"Diversity is a fact, but inclusion is a choice we make every day. As leaders, we have to put out the message that we embrace, and not just tolerate, diversity.\"\n\nLike many others, I will watch this space with trepidation.\n\nIn the meantime,will continue to champion change, raise awareness and keep building an inclusive culture.\n\n\n\n[ Image is taken from an article in The Guardian from 10 January. It shows a man in a blue t-shirt called Mark Zuckerberg with the headline “Meta terminates its DEI programs days before Trump inauguration.”]",
      "reactions": {
        "likes": "332",
        "comments": "267 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Absolutely, inclusion is crucial for innovation and morale. We must continue to advocate for DEI initiatives to foster diverse and thriving workplaces!",
          "userName": "Adamya Kumar",
          "userProfileURL": "https://www.linkedin.com/in/adamya-kumar-5947751ba",
          "dataId": "urn:li:comment:(activity:7284098025466003456,7285340734029733888)"
        },
        {
          "commentText": "I think we need to change the “charged” narrative around DEI. \n\nThose that consider it woke have jumped on it as a divisive, specific agenda-led initiative. \n\nHowever from where I sit - at its core - it is about taking the time to think about and understand humans from different backgrounds, heritages, communities. To enable us to attract, develop and grow the best talent. This leads to diversity of people and even more important - diversity of thought/ideas that will grow your business.\n\nWho wants to shut that down?",
          "userName": "Jonathan Worrell",
          "userProfileURL": "https://www.linkedin.com/in/jonathan-worrell-6836194",
          "dataId": "urn:li:comment:(activity:7284098025466003456,7284146313116438528)"
        },
        {
          "commentText": "Jonathan Worrell thank you so much for this measured and constructive comment, that is exactly how I feel and why I am concerned about the direction of travel. I really appreciate you sharing your perspective.",
          "userName": "Sophie Wardell",
          "userProfileURL": "https://www.linkedin.com/in/sophiewardell",
          "dataId": "urn:li:comment:(activity:7284098025466003456,7284149552616505344)"
        },
        {
          "commentText": "Sophie Wardell it’s reassuring to find others feeling the same! We need to keep showing the true value of DEI to business",
          "userName": "Jonathan Worrell",
          "userProfileURL": "https://www.linkedin.com/in/jonathan-worrell-6836194",
          "dataId": "urn:li:comment:(activity:7284098025466003456,7284151237560680448)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7285332012494733314",
      "url": "https://www.linkedin.com/in/carol-s-73a97115?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAMq_d4BjaszJIjKrtndTl44VpoXrOaODqQ",
      "name": "Carol S.\nCarol S.",
      "content": "Voices of Courage: Individuals Willing to Share Their Journeys\n\n\n\n\nRecently, I engaged with a member of the LinkedIn community who raised significant concerns regarding the current screening and interviewing methodologies employed by a percentage of today’s hiring managers.\n\nHe shared his experience, which initially seemed promising but devolved into a discouraging series of lengthy interviews followed by rejection due to an automated system. This scenario leads me to question whether this indicates a broader trend within the hiring landscape or merely an anomaly.\n\nI am curious how many Green Banners members have encountered similar challenges.\n\nThroughout my professional journey, I have navigated favorable and challenging interview situations (\n) with various organizations. At times, it has felt as though a preferred candidate was predetermined, a sentiment that became apparent after navigating a protracted interview process.\n\nThis recurring pattern leads me to wonder whether these experiences represent a widespread trend or are exceptions.\n\nI invite those who feel comfortable to contribute their experiences. I recognize that it may be daunting to speak out, but your willingness to share may contribute significantly to our understanding of this concern.",
      "reactions": {
        "likes": "1 comment",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "I'll be following along. Some important context to share for those who are \"struggling\" within the current system.\n\nInternal, corporate Recruiters are paid by their employer to fill empty seats. That's it. Their job is not to help job seekers secure roles at other companies, possibly a competitor.\n\nThere are 156.7 million working Americans. and millions of job seekers. Most companies have a 10% annual attrition rate. So, that's a minimum 15.6 million people looking for a new job...every single year. One company, Salesforce, receives 1 million applicants a year. I read that Amazon once received 1 million applications in a single day after a career fair.\n\nSo, any new system that is designed...must be SCALABLE and COST-EFFECTIVE.",
          "userName": "Richard King",
          "userProfileURL": "https://www.linkedin.com/in/richkingrecruiter",
          "dataId": "urn:li:comment:(activity:7285326163525148673,7285331998729023488)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7285299887607361536",
      "url": "https://www.linkedin.com/in/hunterdeskin?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABZoVYwBW84CpvTyTZ8fABPRG_hNO3d0YlI",
      "name": "Hunter Deskin\nHunter Deskin",
      "content": "The old way was to get an entry-level job, rise through the ranks as an SDR, then AE, then maybe lead a team of SDRs or AEs, and so on. \n\nThis is the entire career path.\n\nWhat ends up happening is you stay stuck in the employee trap.\n\nSlight increases to your base with the hope of a higher OTE. (if your employer keeps you around)\n\nSo that you can… what? Make $200k/yr as an AE? (avg OTE according to Bridge Group 2024 summary)\n\nWorking as someone else’s slave making them a fortune?\n\nThis is what you have to look forward to.\n\nA nice 'complacency creating' salary working for someone else, being taxed heavily, and likely having to travel often.\n\nOh, and it’ll likely take 5 years of slaving away as an SDR or entry-level rep being treated like pond scum to reach these figures.\n\nSo, I propose a new way.\n\nFirst off, being a salesperson is hardly anyone's dream.\n\nRunning around at the beck and call of prospects, doing live presentations constantly, travelling, etc. it’s really not all it’s cracked up to be.\n\nIn fact, where you get the most leverage is in marketing.\n\nAnd outbound prospecting, SDRing, appointment setting, whatever you want to call it… is in fact – marketing.\n\nIt’s TOP of funnel.\n\nIt’s the engine that makes the ship run and flys the plane.\n\nWithout TOF, companies are nothing.\n\nWith enough TOF, companies can’t be stopped.\n\nSo I propose you master marketing and TOF & not get sucked into the trap that is bottom of funnel.\n\nAnd the eaiest way to do that and start getting paid is to help companies on DFY basis with outbound prospecting.\n\nCompanies will pay you $5k-$10k/mo + rev shares to simply roll your sleeves up and do the dirty work.\n\nIn doing so you will become a master at top of funnel.\n\nYou’ll be invaluable to any business you come across.\n\nYou’ll be able to choose when & how much you work.\n\nYou will be able to start making $12-$15k/mo relatively simply working 3-4hrs/day.\n\nAnd much more than that – once you master the fundamentals and start to stack leverage on top of leverage.\n\n---\nJoin 416+ others learning how to leverage their SDR skills into becoming highly paid TOF experts ->",
      "reactions": {
        "likes": "11",
        "comments": "1 comment",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "i definitely dunk on people for not being more aspirational, but lets not forget that 200k is a small fortune, top 4% of earners in the US. \n\nbut yeah I agree being an employee has a lot of downsides :)",
          "userName": "🏍benyamin",
          "userProfileURL": "https://www.linkedin.com/in/benyaminholley",
          "dataId": "urn:li:comment:(activity:7285299887607361536,7285309294789427200)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7285279695456141312",
      "url": "https://www.linkedin.com/in/nupurjain28?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACl6Q7EB3VZosvoMaD31EnIUl_EaR6xibvU",
      "name": "Nuwpur Jain\nNuwpur Jain",
      "content": "AIR 2 is upset for not being AIR 1\n\nAIR 6 is upset about not being in the top 5\n\nAIR 10 is upset about not getting a single-digit rank.\n\nA person clearing both groups is upset about not getting a rank\n\nA person clearing a single group is upset about not clearing both\n\nAnd then some students didn't even clear the exam\n\n𝐌𝐨𝐫𝐚𝐥𝐞: Celebrate how far you've come, because there is someone else who would kill to be where you are right now\n\nValue your progress.\nPeriod.",
      "reactions": {
        "likes": "53\nNuwpur Jain and 52 others",
        "comments": "5 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "What do you think?",
          "userName": "Nuwpur Jain",
          "userProfileURL": "https://www.linkedin.com/in/nupurjain28",
          "dataId": "urn:li:comment:(ugcPost:7285279694579499008,7285279914189029376)"
        },
        {
          "commentText": "It’s not always about the competition ",
          "userName": "Nuwpur Jain",
          "userProfileURL": "https://www.linkedin.com/in/nupurjain28",
          "dataId": "urn:li:comment:(ugcPost:7285279694579499008,7285279819766857730)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7285331336737734656",
      "url": "https://www.linkedin.com/in/nequeacoleman?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACgYJnAB1Dhh456Tu2DFSJRLLlAh4OQDp8g",
      "name": "Nequea Coleman\nNequea Coleman",
      "content": "I don’t care if people like my story (and neither should you).\n\n→ My story\n→ My job\n→ My thoughts\n\nBut the truth?\n\n→ They don’t care about me.\n→ They care about themselves.\n→ They care about what helps them.\n\nAnd honestly? That’s fair.\n\nPeople are busy. They’re scrolling to find:\n\n→ Solutions to their problems\n→ Advice that makes their life easier\n→ Content that hits home for them\n\nIf you’re only writing to hear yourself talk...\n\n→ Your content won’t resonate.\n→ Your audience won’t stick around.\n→ Your growth will stall.\n\nThe key?\n\n→ Share your unique perspective.\n→ Solve problems your audience actually cares about.\n→ Create content that brings value.\n\nRemember:\n→ It’s not about you.\n→ It’s about them.\n→ Always.\n\nAre you writing to serve your audience—or yourself?\n—\n Repost to inspire your network\n Follow mefor more",
      "reactions": {
        "likes": "40",
        "comments": "30 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "True stuff, Nequea\n\nPeople care about themselves and what they're getting out of reading your stuff and not about the lesson a random chair in the corner taught you.\n\nSo whatever you create, make sure it hits home.\nFor that's all they're here for.",
          "userName": "Neha Mayekar",
          "userProfileURL": "https://www.linkedin.com/in/nehamayekar",
          "dataId": "urn:li:comment:(activity:7285320426572992514,7285331752162664448)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7285327370545180672",
      "url": "https://www.linkedin.com/in/manikk-gupta-65767070?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAA8MQqMB993UtOjBxSHIDGAFgkqyWmVDU6o",
      "name": "Manikk Gupta\nManikk Gupta",
      "content": "My screen froze 2 minutes before my first big client pitch. \n3 days of preparation was falling apart in front of my eyes.\n\nThis was my first major pitch as a content director.\nEverything was riding on this moment.\n\nI had 3 days preparing for this pitch.\nI perfected every slide and practiced every line.\n\nIt was an opportunity to shine in the company.\nIt was a chance to win over a major client.\n\nBut now, I was staring at a frozen screen.\nLeft wondering if I was about to blow it.\n\nI had two choices.\nPanic or adapt.\n\nI grabbed my phone.\nCalled the client directly and explained the situation.\n\nI apologized for the inconvenience.\nAnd I offered to walk them through the pitch verbally\nwhile my team emailed the deck to the client.\n\nTo my relief, he agreed.\n\nBy the end of the call, the client was laughing.\nThanking me for my transparency and quick thinking.\n\nI luckily got our client on board.\n\nThat day and incident taught me an important lesson.\n\nAdaptability is one of the most underrated skills in professional life.\n\nThings won’t always go as planned.\nHowever, how you respond in those moments can define you.\n\nNow, I make a point to prepare for the unexpected.\n\nWhen you prepare for everything.\nYou are startled by nothing.\n\nHave you ever had to think on your feet during a crisis?\nI’d love to hear how you handled it.",
      "reactions": {
        "likes": "23",
        "comments": "4 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Great example of adapting to the circumstance and thinking on your feet !",
          "userName": "Mansi Guptaa",
          "userProfileURL": "https://www.linkedin.com/in/mansi-guptaa-80687953",
          "dataId": "urn:li:comment:(activity:7285300966864699392,7285301448878256129)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7285282424031248384",
      "url": "https://www.linkedin.com/in/aditya-b-raghav-854020196?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAC3rxsABmoBo1W7fe7xXqFj1IhViTQ3h9kU",
      "name": "Aditya B. Raghav\nAditya B. Raghav",
      "content": "Very True, Jayant Mundhra, this is one of the hot insightful topics in India related to the unresolved issue of Tax systems. The reality in ground is as difference as Earth and Space., should at least do some research upon this.",
      "reactions": {
        "likes": "0",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": []
    },
    {
      "postId": "urn:li:activity:7284618822035132417",
      "url": "https://www.linkedin.com/in/gbrentbarkin?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAI5v54B8OquVDdHfjnHpuC9Ga3eD6YsXtk",
      "name": "G. Brent Barkin\nG. Brent Barkin",
      "content": "One thing I learned in 2024 is how dedicated my friend Robert Johnson is to Linked In. Posting nearly daily, interacting, bringing new ideas to light.\n\nI want to be like Robby.\n\nOk, so starting what I hope to be a 2025 pathway to success with post #4 of the year.\n\nAround 12 months ago, I took on a much more active roleand decided to dive headfirst into the world of NIL. Over that time I have tried to educate myself as much as possible on the legalities surrounding the landscape, with reading up on words fromand others. Assays, we are in the \"wild west\" of, marketing, sports, and the world of payments to athletes. But one question this whole time has started plaguing me, because I hear it from nearly everyone that I talk to:",
      "reactions": {
        "likes": "6",
        "comments": "4 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "For some reason I did not think one of these posts went through... apologies for the repeat performance.",
          "userName": "G. Brent Barkin",
          "userProfileURL": "https://www.linkedin.com/in/gbrentbarkin",
          "dataId": "urn:li:comment:(ugcPost:7284618820646768643,7284645136406327296)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7285311814626693121",
      "url": "https://www.linkedin.com/in/westmcdonaldco?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAEvxMQBQ77AN3_0OXUHuUpKcY6AMaxm8us",
      "name": "West McDonald\nWest McDonald",
      "content": "Time share some vision and some Rumors!!! OEM panel at \nhashtag\n#ECS25 ! Laura Blackmer , Mike Marusic , Karl Boissonneault , and Larry White",
      "reactions": {
        "likes": "4",
        "comments": "1 comment",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Awesome, authentic conversation. True industry trends, issues we face and growth opportunities, without the ‘positioning or hype’",
          "userName": "Dominic Pontrelli",
          "userProfileURL": "https://www.linkedin.com/in/dominicpontrelli",
          "dataId": "urn:li:comment:(activity:7285311814626693121,7285337231576186880)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7285306257069027328",
      "url": "https://www.linkedin.com/in/brianthemacman?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAJkUmsBakCXPTnhW2npe9YzwMtSR9cRz8s",
      "name": "Brian Burke\nBrian Burke",
      "content": "We all have incredible value \nMistakes we learn from increase our value! ",
      "reactions": {
        "likes": "356",
        "comments": "20 comments",
        "shares": "0"
      },
      "mediaUrl": "blob:https://www.linkedin.com/46eac0a8-4225-4f95-94d0-f410d69d2d9f",
      "comments": [
        {
          "commentText": "Thank you for sharing this video with us, Brian Burke.\n\nIt can be a wonderful morale booster whenever anyone needs it. ",
          "userName": "Lynn Hallbrooks",
          "userProfileURL": "https://www.linkedin.com/in/lynn-hallbrooks",
          "dataId": "urn:li:comment:(ugcPost:7285276675381051392,7285341204362207233)"
        },
        {
          "commentText": "Every mistake is a stepping stone to growth. Learning from them only adds to your incredible value. ",
          "userName": "Andrea Sampson",
          "userProfileURL": "https://www.linkedin.com/in/acsampson",
          "dataId": "urn:li:comment:(ugcPost:7285276675381051392,7285328955748806656)"
        }
      ]
    }
  ],
  "errors": [
    {
      "postId": "urn:li:activity:7284098025466003456",
      "url": "https://www.linkedin.com/in/sophiewardell?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAA8k3EBSBawgBQmNBWVFx9L18oZa1m8i6E",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285332012494733314",
      "url": "https://www.linkedin.com/in/carol-s-73a97115?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAMq_d4BjaszJIjKrtndTl44VpoXrOaODqQ",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285299887607361536",
      "url": "https://www.linkedin.com/in/hunterdeskin?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABZoVYwBW84CpvTyTZ8fABPRG_hNO3d0YlI",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285279695456141312",
      "url": "https://www.linkedin.com/in/nupurjain28?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACl6Q7EB3VZosvoMaD31EnIUl_EaR6xibvU",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285331336737734656",
      "url": "https://www.linkedin.com/in/nequeacoleman?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACgYJnAB1Dhh456Tu2DFSJRLLlAh4OQDp8g",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285327370545180672",
      "url": "https://www.linkedin.com/in/manikk-gupta-65767070?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAA8MQqMB993UtOjBxSHIDGAFgkqyWmVDU6o",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285282424031248384",
      "url": "https://www.linkedin.com/in/aditya-b-raghav-854020196?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAC3rxsABmoBo1W7fe7xXqFj1IhViTQ3h9kU",
      "errors": [
        "Failed to fetch reactions.",
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7284618822035132417",
      "url": "https://www.linkedin.com/in/gbrentbarkin?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAI5v54B8OquVDdHfjnHpuC9Ga3eD6YsXtk",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285311814626693121",
      "url": "https://www.linkedin.com/in/westmcdonaldco?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAEvxMQBQ77AN3_0OXUHuUpKcY6AMaxm8us",
      "errors": [
        "Failed to fetch media URL."
      ]
    }
  ]
}