{
  "posts": [
    {
      "postId": "urn:li:activity:7285672185988362241",
      "url": "https://www.linkedin.com/in/hwilson3?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABkQ4eQBVV61aa6L6wnZtFX7vckEmZjEXoI",
      "name": "Heather Wilson, CMP, CITI\nHeather Wilson, CMP, CITI",
      "content": "How did I earn shares in a FinTech startup, build two functions from the ground up, and then launch my consultancy—achieving six-figure profit in under six months, continuing to grow year over year?\n\nYears of learning, life-lessons and choosing a company with visionary leadership.\n\nThe kind of leadership that turns uncertainty and risk into opportunity. That keeps teams motivated when the stakes are high. That transforms employees into true stakeholders, fostering a shared sense of ownership and purpose. If employees have a stake in the company, they need leaders who are self-aware enough to understand that those employees should hold them accountable for their decisions.\n\nIn my case, this approach wasn’t just theoretical—it paid off in a very real way. I didn’t just earn shares; I realized them. Those shares became a tangible reward for the work I put into driving growth, navigating challenges and delivering results in a high-stakes startup environment.\n\nThat payout was more than a financial milestone—it was proof that everyone wins when leaders inspire collective accountability and empower their teams to invest in a shared vision. It was also a lesson that I could build for myself *and* others at the same time.\n\nI learned from the best (and the worst, but that's a story for another day). This mindset has fueled my career and shaped my journey.\n\nSo, here’s my challenge to you: If you're at a startup and/or you have shares in your company, don’t just hold them—own them. Ask questions. Expect answers. Advocate for yourself. Flourish in the shared success that true accountability can bring.",
      "reactions": {
        "likes": "4",
        "comments": "1 comment",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Your approach to owning your role and shares in the company is empowering The emphasis you've shown on accountability and active participation is truly motivating Heather Wilson, CMP, CITI ️ ",
          "userName": "Annamaria Berek 👠 THE RED HEEL BOSS",
          "userProfileURL": "https://www.linkedin.com/in/theredheelboss",
          "dataId": "urn:li:comment:(activity:7285672185988362241,7285697418338193408)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7285531636396343298",
      "url": "https://www.linkedin.com/in/nupurjain28?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACl6Q7EB3VZosvoMaD31EnIUl_EaR6xibvU",
      "name": "Nuwpur Jain\nNuwpur Jain",
      "content": "Haan bhai sab thik hoga..!!\n\n\n\n\n1. You’ll finish your college smoothly.\n\n2. Your interviews will go well, and HR won’t ghost you with a “We’ll get back to you” this time.\n\n3. You’ll land a job at the company you want.\n\n4. Your move to the new city will be smooth.\n\n5. You’ll find a flat/PG you really like.\n\n6. You’ll go on that trip and have a great time.\n\n7. Your performance review meeting will go well.\n\n8. You’ll buy that car you’ve been manifesting for years.\n\n9. You’ll have your dream house with interiors of your choice.\n\n10. Mom and Dad will stay healthy.\n\n11. You’ll meet the life partner you’ve been wishing for.\n\n\n\nBas tumhe sabr rakhna hai.\n\nWoh kehte hain na ki kisi ki qismat ka likha koi dusra nahin chheen sakta :)",
      "reactions": {
        "likes": "76\nNuwpur Jain and 75 others",
        "comments": "10 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Morning affirmations ️",
          "userName": "Nuwpur Jain",
          "userProfileURL": "https://www.linkedin.com/in/nupurjain28",
          "dataId": "urn:li:comment:(ugcPost:7285531635519836160,7285531707259203585)"
        },
        {
          "commentText": "It’s life. Miracles do happen ",
          "userName": "Nuwpur Jain",
          "userProfileURL": "https://www.linkedin.com/in/nupurjain28",
          "dataId": "urn:li:comment:(ugcPost:7285531635519836160,7285531941712404481)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7285657084258320384",
      "url": "https://www.linkedin.com/in/alex-turnbull-1ab9992?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAACAYtMB_ahNSSaY_yym6KikVRWc-UeBn6s",
      "name": "Alex Turnbull\nAlex Turnbull",
      "content": "\"AI isn't just replacing us–it's watching us first.”\n\nLast week I was in a side room at a tech meet up with the VP of Engineering of a $200M ARR SaaS platform. They were showing me something on their laptop. Here's what they shared:\n\n\"AI isn't just replacing us–it's watching us first. 30% productivity gains at Salesforce?\n\nThat's from AI studying every workflow, every pattern, and every process.\n\nBenioff just announced: zero engineering hires in 2025, but 2,000 new salespeople instead?\n\nJanuary layoffs aren't random; they're evolutionary.\n\nThey need humans to sell what AI helps build.\n\nEverything feels like we're at an inflection point. Nothing about this feels optional. Nothing about this path seems reversible.\"\n\nWe're in the most transformative tech shift that any of us have experienced.\n\nYou weren't a genius when AI was just hype.\n\nYou weren't ready when AI was just watching.\n\nAnd you're not obsolete now that it's learning.\n\nWe're all part of this transition. Part of this evolution.\n\nYes, there are things we can do to adapt and thrive.\n\nBut also, remember to understand what's really happening:\n\nWhen AI can handle 80% of routine work by learning from our patterns, when Salesforce completely freezes engineering hiring but adds 2,000 salespeople, we're not just entering a new era.\n\nWe're entering the next phase of human-AI collaboration.\n\nThe question isn't if AI will change engineering.\n\nIt's how we'll evolve with it.\n\nLike every technological revolution, those who adapt first will shape what comes next.",
      "reactions": {
        "likes": "9",
        "comments": "4 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Things will move very quickly once someone creates an AI that can actually think for itself and grow beyond a language or generative model (and one that isn't prohibitively expensive)",
          "userName": "Chris Chambers🌲",
          "userProfileURL": "https://www.linkedin.com/in/chrisbersppc",
          "dataId": "urn:li:comment:(activity:7285657084258320384,7285660933060714496)"
        },
        {
          "commentText": "Chris Chambers All of which seems very close at hand. ",
          "userName": "Alex Turnbull",
          "userProfileURL": "https://www.linkedin.com/in/alex-turnbull-1ab9992",
          "dataId": "urn:li:comment:(activity:7285657084258320384,7285664770442035200)"
        },
        {
          "commentText": "This revolution is the tech version of advancing from steam power to gas to electric... all in less than a decade. Wild (exciting) times",
          "userName": "Isaac Wood",
          "userProfileURL": "https://www.linkedin.com/in/isaac-wood1",
          "dataId": "urn:li:comment:(activity:7285657084258320384,7285704368975212544)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7285713671853416449",
      "url": "https://www.linkedin.com/in/katiepatterson?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAEhSzwBrUkcuncbmDuA0LXZuhHsZHvMiQ0",
      "name": "Katie Patterson\nKatie Patterson",
      "content": "If it's not a hell yes, it's a no! The art of saying no, quite possibly one of the most important things you can do to have your best year yet, read more here:",
      "reactions": {
        "likes": "1",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": []
    },
    {
      "postId": "urn:li:activity:7285698769025683457",
      "url": "https://www.linkedin.com/in/joshuamatthews?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAcFTsB_FYyaS0AKDHvHplgYpfml29Ugc8",
      "name": "Josh Matthews\nJosh Matthews",
      "content": "2025 Salesforce Predictions: Are You Ready?\n\n2024 was a transformative year for the Salesforce ecosystem, with AI taking center stage. Tools like AgentForce and Data Cloud revolutionized how businesses operate, automating repetitive tasks and streamlining operations. But with this innovation came challenges, from navigating AI implementation to the ripple effects on job dynamics.\n\nLooking ahead, 2025 is set to bring more opportunities for professionals who adapt. Multi-cloud expertise will become essential as businesses integrate tools like Revenue Cloud, Marketing Cloud, and Service Cloud to drive results. Business analysts will be in high demand to ensure smooth processes and strategic alignment, while hiring managers will focus on candidates with a mix of technical skills and interpersonal abilities.\n\nThe human element will remain irreplaceable. Communication, empathy, and problem-solving will define top performers in an AI-enhanced world. To thrive, professionals must not only stay current with certifications but also build strong networks and document their achievements.\n\nDive into the full article below to explore the key trends from 2024 and actionable insights to succeed in 2025.",
      "reactions": {
        "likes": "9",
        "comments": "0",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": []
    },
    {
      "postId": "urn:li:activity:7285649871062151168",
      "url": "https://www.linkedin.com/in/jasondbay?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAALMmvEB8ydb7nIx2qecEofDJaaKftLOivA",
      "name": "Jason Bay\nJason Bay",
      "content": "7 hard truths about outbound in 2025:\n\n️ 1) Mass blast is destroying your TAM\n\nYou can never email a prospect who unsubscribes. You can never call a prospect on your do not call list. And you can never email ANYONE in a target account that blocks your company's entire domain.\n\nStop doing this to your buyers.\n\n\n️ 2) Buyers want way more from you before committing to a meeting\n\nWe've squeezed all of the juice out of: \"All we need is 15 min...\" Then it was 10 min. Then 5 min.\n\nThe ask for time can't get any shorter.\n\nThe value in return for time has to increase:\n\n- Site audits\n- Experiencing the brand\n- Sharing insights\n- Mystery shopping the brand\n- Surfacing insights from ICs/managers on their team\netc.\n\n\n️ 3) Well-written, customized, relevant, etc. cold emails aren't enough anymore\n\nThey just aren't. You could get 15-20%+ reply rates from okay cold emails that were personalized.\n\nInboxes are too cluttered. World-class cold emails aren't making it through as much anymore.\n\nYou have to be multi-channel: email, phone, social, physical mail, dropping by in-person, etc.\n\n\n️ 4) Your reps don't outbound because your front-line leaders don't know how\n\nMany front-line leaders crushed it from ~2010-2020. The economy was at an all-time HIGH. Everything was great.\n\nThey didn't have to outbound as much. They worked on teams that were over-hired with SDRs. And inbound was poppin'.\n\nThey never learned how to do outbound. And THAT is why your reps don't outbound.\n\n\n️ 5) Many reps are afraid to call cell phones\n\nI see this every week in training calls with large sales orgs.\n\nReps are asking: \"But isn't it weird to call someone's cell phone? Feels like I'm violating their privacy.\"\n\nSo what do they end up doing? Call general office lines. Talking all day to gatekeepers.\n\nOr worse, ditching the phone altogether.\n\n\n️ 6) It's hard to make cold calling work without a dialer\n\nPick-up rates are <5-6% for most sales teams right now.\n\nThat math just ain't mathin' for Account Executives.\n\n- 25 calls per day (takes about an hour) x 5 days per week = 125 calls\n- 125 calls x 5% pick-up rate = ~6 conversations\n- ~6 converations x 10-15% avg. conversion rate = 1 meeting\n\nYou'll get 3-5x+ that with a dialer.\n\n\n️ 7) The ceiling of outbound success is your marketing engine\n\nMarketing can't take credit for a sales-sourced meeting. It's too hard to track.\n\nBut I've never seen a great outbound org that didn't have world-class marketing.\n\nCold calling for a well-known brand like Shopify hits different than a startup no one's heard about before.\n\n\n~~~\n\n\nWhat would you add to the list?",
      "reactions": {
        "likes": "117",
        "comments": "43 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "I see no lies, especially 5 & 6. \nI’d add - you need to max how you use each channel. \n\nEG. Don’t just make cold calls, explore how you can use text and voice notes and ABSOLUTELY make sure you are scripting your voicemails so can they can be easily listened to or read and use those VMs to point to other touches on different channels!",
          "userName": "Leslie Venetz",
          "userProfileURL": "https://www.linkedin.com/in/leslievenetz",
          "dataId": "urn:li:comment:(activity:7285643206145245184,7285649865034936321)"
        },
        {
          "commentText": "Leslie Venetz great tactic",
          "userName": "Jason Bay",
          "userProfileURL": "https://www.linkedin.com/in/jasondbay",
          "dataId": "urn:li:comment:(activity:7285643206145245184,7285673248850075648)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7285604213710086144",
      "url": "https://www.linkedin.com/in/beerbiceps?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABRvDGgBUDKf31KasHdmgvySw4Pen6ybAes",
      "name": "Ranveer Allahbadia\nRanveer Allahbadia",
      "content": "Hindu - A word used by ancient people of the Gulf and Central Asia. A word that represented the entire collection of people on the OTHER side of the Indu (Indus) River. “Those people are the Hindus”\n\nHinduism is a collection of philosophies, teachings and thought processes from the countless texts that were written in the Indian subcontinent (Gita, Vedas, Upanishads, Puranas)\n\nA very interesting aspect of Indian philosophy is the “Left Hand Of God” - The alternate, faster, but more dangerous path.",
      "reactions": {
        "likes": "1,746",
        "comments": "61 comments",
        "shares": "0"
      },
      "mediaUrl": "blob:https://www.linkedin.com/71021b14-5a6e-4ea0-a4b1-f8c5da728c5a",
      "comments": [
        {
          "commentText": "It’s always enlightening to dive deeper into Hinduism's rich philosophies and teachings.",
          "userName": "Dr. Deepankar Das",
          "userProfileURL": "https://www.linkedin.com/in/deepankardass",
          "dataId": "urn:li:comment:(ugcPost:7284893076861390849,7285714262461759488)"
        },
        {
          "commentText": "Gosh, what a fascinating perspective on the term \"Hindu\"! It’s amazing how language shapes our understanding of culture. \n\nThe depth of Indian philosophy is truly a treasure trove. Would love to hear more!",
          "userName": "AI PlanetX",
          "userProfileURL": "https://www.linkedin.com/company/ai-planetx/posts",
          "dataId": "urn:li:comment:(ugcPost:7284893076861390849,7285638837521805313)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7285710564587106304",
      "url": "https://www.linkedin.com/in/jamiezetz?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAzgtd4BudeKhe5j9XMBQDlwzkpHRuUufss",
      "name": "Jamie Dimond\nJamie Dimond",
      "content": "Ideal pricelist. \n\nYou know what I mean, right?\n\nYour sanity is worth more lol",
      "reactions": {
        "likes": "113",
        "comments": "26 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Best pricelist I’ve seen",
          "userName": "Jamie Dimond",
          "userProfileURL": "https://www.linkedin.com/in/jamiezetz",
          "dataId": "urn:li:comment:(activity:7285706559240777728,7285707085843984385)"
        },
        {
          "commentText": "YOU DESIGN, WE ADVISE' price point seems like the sweet spot for me right now, LOL",
          "userName": "Email Marketing Tips",
          "userProfileURL": "https://www.linkedin.com/company/email-of-the-day/posts",
          "dataId": "urn:li:comment:(activity:7285706559240777728,7285709279435616256)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7285674801615020033",
      "url": "https://www.linkedin.com/groups/1850284?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A1850284-7285674800608387074",
      "name": "Business Development - The Missing Link Between Marketing & Sales - 540,000 Members Strong\nBusiness Development - The Missing Link Between Marketing & Sales - 540,000 Members Strong",
      "content": "Million Dollars Advice ️",
      "reactions": {
        "likes": "50",
        "comments": "1 comment",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "Very insitfull",
          "userName": "Samantha Palmer",
          "userProfileURL": "https://www.linkedin.com/in/samantha-palmer-23196718a",
          "dataId": "urn:li:comment:(groupPost:1850284-7285674800608387074,7285706008163667971)"
        }
      ]
    },
    {
      "postId": "urn:li:activity:7285660337557716993",
      "url": "https://www.linkedin.com/in/remingtonrawlings?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABkCHTcB4rFFwOBWcyblqU_AbeuW6G84uYw",
      "name": "Remington Rawlings\nRemington Rawlings",
      "content": "Meet the team.\n\nExtraordinary people solving extraordinary problems means doing extraordinary things.\n\nWe are built to last because ofas CTO andas Founding Engineer, together leading our engineering efforts.\n\nWe are positioned for a uniquely special product market fit withand her team as she leads product.\n\nBehind the scenes working closely with me is, my Chief of Staff and administrative wizard.\n\nAnd just this week after advising us the last year,has officially hiredas Head of Sales full-time, helping us grow.\n\nTogether as a team, we have some big announcements you'll start to see over the next few weeks as we execute on our rollout plans.\n\nBut I want to say 2 things before this snowball of progress truly takes off.\n\n1. You won't regret living your values\n\nWe won't win because we are the smartest or the most advanced, or the most well funded, or the most connected.\n\nWe are going to impact things because we have cared about actually solving a real problem since Day 1.\n\nLast year after Unleash, we had over $1.5 million in sales pipeline, much of it progressing to close quickly. And as I was about to close deals, I found egregious errors that led me to realize, \"We gotta pull the plug.\"\n\nWe didn't sell software, on purpose.\n\nThis last year was a year of rebuilding following that. We made personnel changes. We redid the entire code base from end to end. We revamped our calculations.\n\nAnd now, we are bulletproof.\n\nThat delay brought stress.\n\nWe still sold services.\n\nBut we demonstrated we don't trade integrity for anything at OneView.\n\nWe make impact through data-driven analysis.\n\nThat starts with our willingness to be patient and make sound decisions, or else how can we help our customers do that?\n\n2nd point: You won't regret deeply creative thinking\n\nAs a consultancy turned productized bootstrapped startup, we have gotten \"around\" many norms and stipulations startups face.\n\nWe avoided big funding rounds, inflated valuations, unneeded dilution, and constant scrutiny of the plans we have been making before we \"knew it cold.\"\n\nNow we do, and the path has never been clearer.\n\nWe must always demand of ourselves the type of innovation we never thought was possible.\n\nWe have used every flavor of AI and technology imaginable, without yet needing certain full-time hires for unneeded things.\n\nAnd already we have analysis capabilities that quite literally don't exist anywhere else in the entire market (prove me wrong, I'll show you).\n\nWhat we sell next will change markets.\n\nBut the quality in that process is not just the outcome, it's the process itself.\n\nPeople say the destination is the journey, which can sound like excusing failure.\n\nFor my part, I believe living our values and thinking creatively are a journey that must be taken if the ultimate destination is to be achieved.\n\nWho is ready to come and see what we have been cooking up?",
      "reactions": {
        "likes": "22",
        "comments": "2 comments",
        "shares": "0"
      },
      "mediaUrl": null,
      "comments": [
        {
          "commentText": "I’ve done a lot of things in my career that I’m proud of, and I’ve worked with some amazing teams. Don’t think I’ve ever been more excited, or more confident about the impact we can make. Looking forward to introducing the world the!",
          "userName": "💡Dave Breshears",
          "userProfileURL": "https://www.linkedin.com/in/davidbreshears",
          "dataId": "urn:li:comment:(activity:7285660337557716993,7285670817122631680)"
        }
      ]
    }
  ],
  "errors": [
    {
      "postId": "urn:li:activity:7285672185988362241",
      "url": "https://www.linkedin.com/in/hwilson3?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABkQ4eQBVV61aa6L6wnZtFX7vckEmZjEXoI",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285531636396343298",
      "url": "https://www.linkedin.com/in/nupurjain28?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACl6Q7EB3VZosvoMaD31EnIUl_EaR6xibvU",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285657084258320384",
      "url": "https://www.linkedin.com/in/alex-turnbull-1ab9992?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAACAYtMB_ahNSSaY_yym6KikVRWc-UeBn6s",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285713671853416449",
      "url": "https://www.linkedin.com/in/katiepatterson?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAEhSzwBrUkcuncbmDuA0LXZuhHsZHvMiQ0",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285698769025683457",
      "url": "https://www.linkedin.com/in/joshuamatthews?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAcFTsB_FYyaS0AKDHvHplgYpfml29Ugc8",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285649871062151168",
      "url": "https://www.linkedin.com/in/jasondbay?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAALMmvEB8ydb7nIx2qecEofDJaaKftLOivA",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285710564587106304",
      "url": "https://www.linkedin.com/in/jamiezetz?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAzgtd4BudeKhe5j9XMBQDlwzkpHRuUufss",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285674801615020033",
      "url": "https://www.linkedin.com/groups/1850284?q=highlightedFeedForGroups&highlightedUpdateUrn=urn%3Ali%3AgroupPost%3A1850284-7285674800608387074",
      "errors": [
        "Failed to fetch media URL."
      ]
    },
    {
      "postId": "urn:li:activity:7285660337557716993",
      "url": "https://www.linkedin.com/in/remingtonrawlings?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABkCHTcB4rFFwOBWcyblqU_AbeuW6G84uYw",
      "errors": [
        "Failed to fetch media URL."
      ]
    }
  ]
}